//BP13D103 JOB (BP13P),'BP13D103',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*================================================================== *         
//* DAILY JOB DBSS FLAT                                                         
//*================================================================== *         
//* BP132772 020506 LSB DBSS JOB                                                
//* BP133051 120507 LSB MOVE GIRO POSTING TO BP13M700                           
//* BP133184 141107 LSB OUTPUT CASH PAYMENT FOR 2ND GIRO DEDUCTION              
//* BP133480 030209 LSB ADD F140.DBSKIV IN STEP14A                              
//* BP133545 230209 JB8 READ KD03 IF KD00 NOT FND IN BP13CCAA                   
//* BP133639 250909 JB8 TO CATER FOR END OF FILE                                
//* BP133973 100921 CCC UPDATE B004 DATASETS TO AB02 DATASETS                   
//* BP134033 281010 LSB ADD BP13KD92 TO BP13CC19                                
//* BP133907 050111 LSB BP13CCAA BP13.F140.DBSKIV,DISP=OLD                      
//* BP134093 120214 LSB1 CHG B004 TO AB02,F056-F556,F003-F503,F041-F541         
//* BP137325 021018 LJL1  TO CATER FOR NEW FILE FROM CASH PAYMENT KIOSK         
//*                       AC28.F569.SOC                                         
//*-------------------------------------------------------------------*         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                          *         
//*-------------------------------------------------------------------*         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KD00.DBSMAST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                   *         
//* PRT02 : 1 COPY                           (MA&B TEAM)              *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*================================================================== *         
//* SORT SOC MASTER HISTORY FILE IN REGN ORDER FOR DBSS TOP CASES               
//*-------------------------------------------------------------------*         
//STEP1A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=13')                                                     
//SORTOUT  DD DSN=&&F800HIST,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                                 
//         DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                                  
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=(1,1,CH,NE,C'C',AND,924,3,CH,EQ,C'DBS')                       
     OUTREC FIELDS=(1,1992,C'DBSS-TOP')                                         
//*-------------------------------------------------------------------*         
//* SORT SOC OCCUPIER HISTORY FILE IN REGN+NRIC ORDER                           
//*-------------------------------------------------------------------*         
//STEP1B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=13')                                                     
//SORTOUT  DD DSN=&&F895HIST,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(250,30),RLSE),                             
//            DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
     INCLUDE COND=(1,1,CH,EQ,C'5')                                              
     OUTREC FIELDS=(1,400)                                                      
//*-------------------------------------------------------------------*         
//* MATCH F800 WITH F820 ,OUTPUT F820                                           
//*-------------------------------------------------------------------*         
//STEP1C   EXEC PGM=BP13CD59,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800HIST,DISP=(OLD,PASS)                                    
//BP13F820 DD DSN=&&F895HIST,DISP=(OLD,DELETE)                                  
//P13F820A DD DSN=&&F820HIST,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT SOC MASTER FILE IN SCH-ACCNT SEQUENCE                        *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=13')                                                     
//SORTOUT  DD DSN=&&F800MAST,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                                 
//         DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                                  
//SYSIN    DD *                                                                 
     SORT FIELDS=(155,11,A),FORMAT=CH                                           
     INCLUDE COND=(924,3,CH,EQ,C'DBS')                                          
//*-------------------------------------------------------------------*         
//STEP2A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800MAST,DISP=(OLD,PASS)                                    
//         DD DSN=&&F800HIST,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F800SCHT,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                                 
//         DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                                  
//SYSIN    DD *                                                                 
     SORT FIELDS=(155,11,A),FORMAT=CH                                           
     INCLUDE COND=(924,3,CH,EQ,C'DBS')                                          
//*-------------------------------------------------------------------*         
//* SORT CPF FILE IN SCH-ACCNT SEQUENCE                               *         
//* AB02.F556.PYMNT.DBSS.BP13 = FOR NON-DBSS FLAT                               
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AB02.F556.PYMNT.DBSS.BP13,DISP=SHR                            
//         DD DSN=BP13.F056.CPFDBSS,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F101,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=23400,LRECL=100,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(2,9,A),FORMAT=CH                                              
//*-------------------------------------------------------------------*         
//* SORT SOC OCCUPIER FILE IN CPF-NO ORDER                            *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=13')                                                     
//SORTOUT  DD DSN=&&F820OCCP,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(250,30),RLSE),                             
//            DCB=(BLKSIZE=27600,LRECL=400,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(19,9,A),FORMAT=CH                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//STEP4A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F820OCCP,DISP=(OLD,PASS)                                    
//         DD DSN=&&F820HIST,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F820,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(250,30),RLSE),                             
//            DCB=(BLKSIZE=27600,LRECL=400,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(19,9,A),FORMAT=CH                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* MATCH CPF FROM SOC-OCCUP WITH NCN FILE, IF MATCH GET NRIC FOR     *         
//* UPDATE THE CPF AMOUNT TO SOC MASTER                               *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13C111,COND=(0,NE)                                        
//BP13F820 DD DSN=&&BP13F820,DISP=(OLD,DELETE)                                  
//AB02F556 DD DSN=&&BP13F101,DISP=(OLD,PASS)                                    
//BP13F103 DD DSN=&&BP13F103,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT CPF FILE IN SCH-ACCNT SEQUENCE                                         
//*-------------------------------------------------------------------*         
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F103,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F103SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(90,11,A),FORMAT=CH                                            
     INCLUDE COND=(90,1,CH,NE,C'R')                                             
/*                                                                              
//*---------------------------------------------------------------------        
//* VALIDATE CPF PAYMENT(PP-LUMPSUM & INSTALMENT) FROM PCPF SYSTEM              
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13CC15,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800SCHT,DISP=(OLD,PASS)                                    
//BP13F103 DD DSN=&&F103SORT,DISP=(OLD,PASS)                                    
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                    
//BP13F125 DD DSN=BP13.F125.DBSCPF,DISP=OLD                                     
//BP13LC15 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT CASH PAYMENT IN SCH-ACC-NO ORDER (PP LUMPSUM)                          
//* AC28.F526.SOC = BACKUP IN BP13D100/D101                                     
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//*SORTIN   DD DSN=AC28.F526.SOC,DISP=SHR                                       
//SORTIN   DD DSN=BP13.AC28.F526.SOCCASH,DISP=SHR                               
//         DD DSN=BP13.AC28.F569.SOCCASH,DISP=SHR                               
//SORTOUT  DD DSN=&&AC28F526,DISP=(NEW,PASS),                                   
//         DCB=(RECFM=FB,LRECL=130,BLKSIZE=0),                                  
//         SPACE=(CYL,(10,2),RLSE)                                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
   INCLUDE COND=(91,5,CH,EQ,C'6003D')                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* VALIDATE CASH PAYMENT( PP LUMPSUM) FROM COLLECTION SYSTEM                   
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13CC17,COND=(0,NE)                                        
//AC28F526 DD DSN=&&AC28F526,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=&&F800SCHT,DISP=(OLD,PASS)                                    
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                    
//BP13F125 DD DSN=BP13.F125.DBSCASH.PP,DISP=OLD                                 
//BP13LC17 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT CASH PAYMENT IN SCH-ACC-NO ORDER (STAMP/CONVEY)                        
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.AC28.F544.SOC,DISP=SHR                                   
//         DD DSN=BP13.AC28.F569.SOCCASH,DISP=SHR                               
//SORTOUT  DD DSN=&&AC28F544,DISP=(NEW,PASS),                                   
//         DCB=(RECFM=FB,LRECL=130,BLKSIZE=0),                                  
//         SPACE=(CYL,(10,2),RLSE)                                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
   INCLUDE COND=(91,5,CH,EQ,C'6250G',OR,                                        
                 91,5,CH,EQ,C'0933D')                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* VALIDATE CASH PAYMENT(STAMP/CONVEY) FROM COLLECTION SYSTEM                  
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13CC18,COND=(0,NE)                                        
//AC28F544 DD DSN=&&AC28F544,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=&&F800SCHT,DISP=(OLD,PASS)                                    
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                    
//BP13F125 DD DSN=BP13.F125.DBSCASH.FEE,DISP=OLD                                
//BP13LC18 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT CASH PAYMENT IN SCH-ACC-NO ORDER (INSTALMENT)                          
//* IMPLEMENT LATER IN FEB 2007                                                 
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AC28.F552.SOC.DBSS,DISP=SHR                                   
//SORTOUT  DD DSN=&&AC28F552,DISP=(NEW,PASS),                                   
//          DCB=(RECFM=FB,LRECL=130,BLKSIZE=0),                                 
//          SPACE=(CYL,(10,2),RLSE)                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* VALIDATE CASH PAYMENT(INSTALMENT) FROM COLLECTION SYSTEM                    
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13CC19,COND=(0,NE)                                        
//AC28F552 DD DSN=&&AC28F552,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=&&F800SCHT,DISP=(OLD,PASS)                                    
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD92 DD DSN=BP13.KD92.UPDLOAN,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                    
//BP13F125 DD DSN=BP13.F125.DBSCASH.INS,DISP=OLD                                
//BP13LC19 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------*        
//* VALIDATE KIV RECORD                                                         
//*--------------------------------------------------------------------*        
//STEP13A  EXEC PGM=BP13CCAA,COND=(0,NE)                                        
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F125 DD DSN=BP13.F140.DBSKIV,DISP=OLD                                     
//BP13F140 DD DSN=BP13.F140.DELETE.ACCUM,DISP=MOD                               
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* 1. MERGE ALL THE VALIDATED PAYEMENT FILES TO BACKUP FILE          *         
//* 2. SORT BY TRANS-TY, ORIG-REGN, POST DATE                         *         
//*-------------------------------------- ----------------------------*         
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DBSCPF,DISP=SHR                                     
//*        DD DSN=BP13.F125.DBSCPF.FEE,DISP=SHR                                 
//         DD DSN=BP13.F125.DBSCASH.PP,DISP=SHR                                 
//         DD DSN=BP13.F125.DBSCASH.FEE,DISP=SHR                                
//         DD DSN=BP13.F125.DBSCASH.INS,DISP=SHR                                
//         DD DSN=BP13.F140.DBSKIV,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F125.DBSPAYMT,DISP=MOD                                   
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,2,A,5,19,A),FORMAT=CH                                        
/*                                                                              
//*-------------------------------------------------------------------*         
//* ACCUM PAYEMENT TO DEVELOPER TO DBSS MONTH FILE                              
//* WHEN TO CLEAR                                                               
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.F125.DBSPAYMT,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F125.DBSACCUM,DISP=MOD                                   
//*                                                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     REPRO IFILE(INPUT1) OFILE(OUTPUT1)                                         
//*-------------------------------------------------------------------*         
//* CHECK CLOSING FOR THE PREVIOUS MONTH                                        
//* IF HAVE NOT CLOSE LAST MONTH POSTING, KIV CASH/CPF/VR COLLECTION            
//* NO POSTING FOR 1ST 3 DAYS UNTIL MONTH-END JOB BP13M710/M711                 
//* IMPLEMENT IN FEB 2007                                                       
//*-------------------------------------------------------------------*         
//*STEP16   EXEC PGM=BP13CC25,COND=(0,NE)                                       
//*SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                      
//*BP13KD65 DD DSN=BP13.KD65.PDATE,DISP=SHR,                                    
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM PAYMENT TO DEVELOPER TO DBSS MONTH FILE                               
//*-------------------------------------------------------------------*         
//STEP17   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F128.CPFDBSS,DISP=OLD                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM CPF PAYMENT                                                           
//*-------------------------------------------------------------------*         
//STEP18   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AB02.F556.PYMNT.DBSS.BP13,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.B004.F056.CPF,DISP=MOD                                   
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM CPF PAYMENT                                                           
//*-------------------------------------------------------------------*         
//STEP19   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2    DD DSN=BP13.F056.CPFDBSS,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.B004.F056.CPF,DISP=MOD                                   
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY CPF PAYMENT FILE                                            *         
//*-------------------------------------------------------------------*         
//STEP20   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR100,DISP=SHR                                   
//OUTPUT1  DD DSN=AB02.F556.PYMNT.DBSS.BP13,DISP=OLD                            
//INPUT2   DD DSN=BP13.EMPTY.CHAR100,DISP=SHR                                   
//OUTPUT2   DD DSN=BP13.F056.CPFDBSS,DISP=OLD                                   
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
        REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM CASH PAYMENT FOR DBSS INSTALMENT                                      
//*-------------------------------------------------------------------*         
//STEP21   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AC28.F552.SOC.DBSS,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.AC28.F552.SOC,DISP=MOD                                   
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY COLL PAYMENT FILE FOR DBSS INSTALMENT                                 
//*-------------------------------------------------------------------*         
//STEP22   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AC28.F552.SOC.DBSS,DISP=OLD                                   
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13F136                                                               
//*-------------------------------------------------------------------*         
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DBSCASH.INS,DISP=SHR                                
//SORTOUT  DD DSN=&&F136GIRO,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,150,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
   INCLUDE COND=(1,2,CH,EQ,C'11',AND,99,3,CH,EQ,C'INS')                         
//*-----------------------------------------------------------------            
//* CREATE AC08F660 TO GIRO SYSTEM                                              
//*-----------------------------------------------------------------            
//STEP24   EXEC PGM=BP13CC95,COND=(0,NE)                                        
//BP13F136 DD DSN=&&F136GIRO,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//AC08F660 DD DSN=AC08.F660.COLL.DBSS.POSTED,DISP=MOD                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
