//BP13A588  JOB (BP13P),'BP13A588',CLASS=I,MSGCLASS=N,                  00010000
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                 00020000
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030000
//*---------------------------------------------------------------------00040000
//* FT  CD SBF  DATASET           STATUS QUEUE-RANGE                    00050000
//*-------------------------------------------------------------------  00060000
//* SA                                                                  00070000
//* --------------                                                      00080000
//* 1A  S1 T1   BP13.F23A.EMAIL.F100  S  =< START                       00090000
//*             BP13.F23A.EMAIL.SA.F100                                 00100000
//* 1A  S2 T2   BP13.F23A.EMAIL.F200  R  > MID =< END                   00110000
//*             BP13.F23A.EMAIL.SA.F200                                 00120000
//* 1A  S3 T3   BP13.F23A.EMAIL.F300  W  > END                          00130000
//*             BP13.F23A.EMAIL.SA.F300                                 00140000
//* 1A  S4 T4   BP13.F23A.EMAIL.F400  U  CANCEL, NO QUEUE-NO            00150000
//*             BP13.F23A.EMAIL.SA.F400                                 00160000
//* 1A  S5      BP13.F23A.EMAIL.F450  S  > START =< MID                 00170000
//*             BP13.F23A.EMAIL.SA.F150                                 00180000
//*-------------------------------------------------------------------  00190000
//* SA            AND NUM-WARD NE SPACES (GRO)                          00200000
//* -----------------------------------------                           00210000
//* 1A  G5 J5   BP13.F23A.EMAIL.F110  S  =< START                       00220000
//*             BP13.F23A.EMAIL.SAGRO.F100                              00230000
//* 1A  H1      BP13.F23A.EMAIL.F120  R  > MID =< END                   00240000
//*             BP13.F23A.EMAIL.SAGRO.F200                              00250000
//* 1A  G7 J7   BP13.F23A.EMAIL.F130  W  > END                          00260000
//*             BP13.F23A.EMAIL.SAGRO.F300                              00270000
//* 1A  G8 J8   BP13.F23A.EMAIL.F140  U  CANCEL, NO QUEUE-NO            00280000
//*             BP13.F23A.EMAIL.SAGRO.F400                              00290000
//* 1A  G6 J6   BP13.F23A.EMAIL.F145  S  > START =< MID                 00300000
//*             BP13.F23A.EMAIL.SAGRO.F150                              00310000
//*-------------------------------------------------------------------  00320000
//* SA AND NOT 'M' AND NUM-MGP NE SPACES (MGPS)                         00330000
//* -----------------------------------------                           00340000
//* 1A  M5      BP13.F23A.EMAIL.F210  S  =< START                       00350000
//*             BP13.F23A.EMAIL.SAMGP.F100                              00360000
//* 1A  M6      BP13.F23A.EMAIL.F220  R  > MID =< END                   00370000
//*             BP13.F23A.EMAIL.SAMGP.F200                              00380000
//* 1A  M7      BP13.F23A.EMAIL.F230  W  > END                          00390000
//*             BP13.F23A.EMAIL.SAMGP.F300                              00400000
//* 1A  M8      BP13.F23A.EMAIL.F240  U  CANCEL, NO QUEUE-NO            00410000
//*             BP13.F23A.EMAIL.SAMGP.F400                              00420000
//* 1A  N1      BP13.F23A.EMAIL.F245  S  > START =< MID                 00430000
//*             BP13.F23A.EMAIL.SAMGP.F150                              00440000
//*===================================================================  00450000
//*-------------------------------------------------------------------  00460000
//* FTS                                                                 00470000
//* ------------------                                                  00480000
//* FT  I1      BP13.F23A.EMAIL.F310 S   =< START                       00490000
//*             BP13.F23A.EMAIL.PAFTS.F100                              00500000
//* FT  I3      BP13.F23A.EMAIL.F320  R  > MID =< END                   00510000
//*             BP13.F23A.EMAIL.PAFTS.F200                              00520000
//* FT  I4      BP13.F23A.EMAIL.F330  W  > END                          00530000
//*             BP13.F23A.EMAIL.PAFTS.F300                              00540000
//* FT  I5      BP13.F23A.EMAIL.F340  U  CANCEL, NO QUEUE-NO            00550000
//*             BP13.F23A.EMAIL.PAFTS.F400                              00560000
//* FT  I2      BP13.F23A.EMAIL.F350  S  > START =< MID                 00570000
//*             BP13.F23A.EMAIL.PAFTS.F150                              00580000
//*-------------------------------------------------------------------  00590000
//* PA                                                                  00600000
//* ------------------                                                  00610000
//* PA  B1 C1   BP13.F23A.EMAIL.F500  S  =< START                       00620000
//*             BP13.F23A.EMAIL.PA.F100                                 00630000
//* PA  B2 C2   BP13.F23A.EMAIL.F600  R  > MID =< END                   00640000
//*             BP13.F23A.EMAIL.PA.F200                                 00650000
//* PA  B3 C3   BP13.F23A.EMAIL.F700  W  > END                          00660000
//*             BP13.F23A.EMAIL.PA.F300                                 00670000
//* PA  B4 C4   BP13.F23A.EMAIL.F800  U  CANCEL, NO QUEUE-NO            00680000
//*             BP13.F23A.EMAIL.PA.F400                                 00690000
//* PA  B5      BP13.F23A.EMAIL.F850  S  > START =< MID                 00700000
//*             BP13.F23A.EMAIL.PA.F150                                 00710000
//* PA  B6 C5   BP13.F23A.EMAIL.F855  K  GEN3 >300%                     00720000
//*             BP13.F23A.EMAIL.GEN3.F300                               00730000
//*-------------------------------------------------------------------  00740000
//* NOT SA NOT 2T AND NUM-WARD NE SPACES (GRO)                          00750000
//* -----------------------------------------                           00760000
//* FTGRO  G1 J1   BP13.F23A.EMAIL.F150  S  =< START                    00770000
//*                BP13.F23A.EMAIL.PAGRO.F100                           00780000
//* FTGRO  G2 J2   BP13.F23A.EMAIL.F160  R  > MID =< END                00790000
//*                BP13.F23A.EMAIL.PAGRO.F200                           00800000
//* FTGRO  G3 J3   BP13.F23A.EMAIL.F170  W  > END                       00810000
//*                BP13.F23A.EMAIL.PAGRO.F300                           00820000
//* FTGRO  G4 J4   BP13.F23A.EMAIL.F180  U  CANCEL, NO QUEUE-NO         00830000
//*                BP13.F23A.EMAIL.PAGRO.F400                           00840000
//* FTGRO  G9      BP13.F23A.EMAIL.F190  S  > START =< MID              00850000
//*                BP13.F23A.EMAIL.PAGRO.F150                           00860000
//*-------------------------------------------------------------------  00870000
//* NOT SA AND NOT 'M' AND NUM-MGP NE SPACES (MGPS)                     00880000
//* -----------------------------------------                           00890000
//* FT  M1      BP13.F23A.EMAIL.F250  S  =< START                       00900000
//*             BP13.F23A.EMAIL.PAMGP.F100                              00910000
//* FT  M2      BP13.F23A.EMAIL.F260  R  > MID =< END                   00920000
//*             BP13.F23A.EMAIL.PAMGP.F200                              00930000
//* FT  M3      BP13.F23A.EMAIL.F270  W  > END                          00940000
//*             BP13.F23A.EMAIL.PAMGP.F300                              00950000
//* FT  M4      BP13.F23A.EMAIL.F280  U  CANCEL, NO QUEUE-NO            00960000
//*             BP13.F23A.EMAIL.PAMGP.F400                              00970000
//* FT  M9      BP13.F23A.EMAIL.F290  S  > START =< MID                 00980000
//*             BP13.F23A.EMAIL.PAMGP.F150                              00990000
//* ------------------                                                  01000000
//* EIP EMAIL                                                           01010000
//* ------------------                                                  01020000
//* 1RM E2      BP13.F23A.EMAIL.F950                                    01030000
//*             BP13.F23A.EMAIL.EIP.SA                                  01040000
//* FTS E3      BP13.F23A.EMAIL.F960                                    01050000
//*             BP13.F23A.EMAIL.EIP.FTS                                 01060000
//* PA  E1      BP13.F23A.EMAIL.F900                                    01070000
//*             BP13.F23A.EMAIL.EIP.PA                                  01080000
//*=================================================================    01090000
//* SORT BY NT/FT/QUEUE/REGN                                            01100000
//*-----------------------------------------------------------------    01110000
//STEP01  EXEC SORT,COND=(0,NE)                                         01120000
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                           01130000
//           AMP=('BUFND=4','BUFNI=8')                                  01140000
//SORTOUT DD DSN=&&F740MAIL,DISP=(NEW,PASS),                            01150000
//           UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                       01160000
//           SPACE=(CYL,(120,10),RLSE)                                  01170000
//SYSIN   DD *                                                          01180000
    SORT FIELDS=(123,8,A),FORMAT=CH                                     01190000
//*-----------------------------------------------------------------*   01200000
//*  TO SEPARATE CASES WITH EMAIL ADDRESS                           *   01210002
//*-----------------------------------------------------------------*   01220000
//STEP02   EXEC PGM=BP13CF10,COND=(0,NE)                                01230000
//BP13F740 DD DSN=&&F740MAIL,DISP=(OLD,DELETE)                          01240000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              01250000
//BP13K825 DD DSN=BP13.K825.REQOCCP.PREV,DISP=SHR,                      01260000
//            AMP=('BUFND=4','BUFNI=8')                                 01270000
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                              01280000
//            AMP=('BUFND=4','BUFNI=8')                                 01290000
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                        01300000
//            AMP=('BUFND=4','BUFNI=8')                                 01310000
//P13F740A DD DSN=&&F740WO,DISP=(NEW,PASS),                             01320000
//            UNIT=SYSDA,SPACE=(CYL,(30,15),RLSE),                      01330000
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                    01340000
//P13F740B DD DSN=&&F740WITH,DISP=(NEW,PASS),                           01350000
//            UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                     01360000
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                    01370000
//P13LCF10 DD DUMMY                                                     01380000
//SYSOUT   DD DSN=BP13.F23A.EMAIL.BP13CF10,DISP=OLD                     01390000
//*                                                                     01400000
//*-----------------------------------------------------------------    01410000
//* OMIT GRO, MPGS, SMALLEST MGPS RECORDS                               01420000
//*-----------------------------------------------------------------    01430000
//STEP03   EXEC SORT,COND=(0,NE)                                        01440000
//SORTIN   DD DSN=&&F740WITH,DISP=(OLD,PASS)                            01450000
//SORTOUT  DD DSN=&&F740CD30,DISP=(,PASS),                              01460000
//            UNIT=SYSDA,                                               01470000
//            DCB=(RECFM=FB,LRECL=500),                                 01480000
//            SPACE=(CYL,(120,10),RLSE)                                 01490000
//SYSIN   DD  *                                                         01500000
  SORT FIELDS=(123,8,A),FORMAT=CH                                       01510000
  OMIT COND=(28,1,CH,EQ,C'G',OR,                                        01520000
            245,1,CH,EQ,C'P',OR,                                        01530000
            245,1,CH,EQ,C'C')                                           01540000
//*-----------------------------------------------------------------*   01550000
//*  TO BYPASS RECORD THAT FOUND ON BP13K76D - BLOCK LIST           *   01560000
//*-----------------------------------------------------------------*   01570000
//STEP04   EXEC PGM=BP13CF18,COND=(0,NE)                                01580000
//BP13F740 DD DSN=&&F740CD30,DISP=(OLD,PASS)                            01590000
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR,                   01600000
//           AMP=('BUFND=4','BUFNI=8')                                  01610000
//P13F740A DD DSN=&&F740CF18,DISP=(NEW,PASS),                           01620000
//             UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                    01630000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   01640000
//SYSOUT   DD SYSOUT=*                                                  01650000
//*                                                                     01660000
//*---------------------------------------------------------------------01670000
//* OUTREC EIP BLOCK FILE                                               01680000
//*---------------------------------------------------------------------01690000
//STEP05   EXEC SORT,COND=(0,NE)                                        01700000
//SORTIN   DD DSN=BP13.F740.ETHNIC.A633.EMAIL,DISP=SHR                  01710000
//SORTOUT  DD DSN=&&F740K76D,DISP=(,PASS),                              01720000
//        DCB=(RECFM=FB,LRECL=100),                                     01730000
//        SPACE=(CYL,(30,10),RLSE)                                      01740000
//SYSIN    DD  *                                                        01750000
  SORT FIELDS=(123,8,A),FORMAT=CH                                       01760000
  OUTREC FIELDS=(376,3,334,6,123,8,83X)                                 01770000
//*---------------------------------------------------------------------01780000
//* SORT BY BP13K76D PRDER                                              01790000
//*---------------------------------------------------------------------01800000
//STEP5A   EXEC SORT,COND=(0,NE)                                        01810000
//SORTIN   DD DSN=BP13.BLANK.CHAR100,DISP=SHR                           01820000
//         DD DSN=&&F740K76D,DISP=(OLD,PASS)                            01830000
//SORTOUT  DD DSN=&&K76DKEY,DISP=(,PASS),                               01840000
//        DCB=(RECFM=FB,LRECL=100),                                     01850000
//        SPACE=(CYL,(30,10),RLSE)                                      01860000
//SYSIN    DD  *                                                        01870000
  SORT FIELDS=(1,17,A),FORMAT=CH                                        01880000
  SUM FIELDS=NONE                                                       01890000
//*---------------------------------------------------------------------01900000
//* DEFINE 'BP13.K76D.BLOCKEIP'                                         01910000
//*---------------------------------------------------------------------01920000
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                  01930000
//SYSPRINT DD SYSOUT=*                                                  01940000
//INPUT1   DD DSN=&&K76DKEY,DISP=(OLD,PASS)                             01950000
//SYSIN    DD  *                                                        01960000
          DEL 'BP13.K76D.BLOCKEIP' CL PURGE                             01970000
          DEF CLUSTER                                -                  01980000
              (NAME(BP13.K76D.BLOCKEIP)              -                  01990000
              CYL(10 8)                             -                   02000000
              DATACLAS(MULTIVOL)                     -                  02010000
              UNIQUE                                 -                  02020000
              STORCLAS(PRODRLS)                      -                  02030000
              LOG(NONE)                              -                  02040000
              SHR(2 3))                              -                  02050000
              DATA                                   -                  02060000
              (NAME(BP13.K76D.BLOCKEIP.DATA)         -                  02070000
              KEYS(17 0)                              -                 02080000
              RECSZ(100 100)                       -                    02090000
              CISZ(4096)                             -                  02100000
              FSPC(10 10))                           -                  02110000
              INDEX                                  -                  02120000
              (NAME(BP13.K76D.BLOCKEIP.INDEX)        -                  02130000
              CISZ(4096))                                               02140000
      IF MAXCC = 0  THEN                             -                  02150000
         REPRO IFILE(INPUT1)                         -                  02160000
              ODS(BP13.K76D.BLOCKEIP)                                   02170000
//*-----------------------------------------------------------------*   02180000
//*  TO BYPASS RECORD THAT FOUND IN BP13K76D - EIP LOST             *   02190000
//*-----------------------------------------------------------------*   02200000
//STEP07   EXEC PGM=BP13CF18,COND=(0,NE)                                02210000
//BP13F740 DD DSN=&&F740CF18,DISP=(OLD,PASS)                            02220000
//BP13K76D DD DSN=BP13.K76D.BLOCKEIP,DISP=SHR,                          02230000
//           AMP=('BUFND=4','BUFNI=8')                                  02240000
//P13F740A DD DSN=&&BP13F740,DISP=(NEW,PASS),                           02250000
//             UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                    02260000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   02270000
//SYSOUT   DD SYSOUT=*                                                  02280000
//*                                                                     02290000
//*-------------------------------------------------------------------  02300000
//* OUTPUT EMAIL FILE BY ALLOC-SCHEME/FT/QUEUE-RANGE                    02310000
//*--------------------------------------------------------------------*02320000
//STEP08   EXEC PGM=BP13CD30,COND=(0,NE)                                02330000
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,PASS)                            02340000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR,                             02350000
//            AMP=('BUFND=4','BUFNI=8')                                 02360000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             02370000
//            AMP=('BUFND=4','BUFNI=8')                                 02380000
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                             02390000
//            AMP=('BUFND=4','BUFNI=8')                                 02400000
//DSAF203A DD DSN=BP13.F23A.EMAIL.SA.F100,DISP=OLD                      02410000
//DSAF203B DD DSN=BP13.F23A.EMAIL.SA.F200,DISP=OLD                      02420000
//DSAF203C DD DSN=BP13.F23A.EMAIL.SA.F300,DISP=OLD                      02430000
//DSAF203D DD DSN=BP13.F23A.EMAIL.SA.F400,DISP=OLD                      02440000
//DSAF203E DD DSN=BP13.F23A.EMAIL.SA.F150,DISP=OLD                      02450000
//DSAF203F DD DUMMY                                                     02460000
//DPAF203G DD DSN=BP13.F23A.EMAIL.PA.F100,DISP=OLD                      02470000
//DPAF203H DD DSN=BP13.F23A.EMAIL.PA.F200,DISP=OLD                      02480000
//DPAF203I DD DSN=BP13.F23A.EMAIL.PA.F300,DISP=OLD                      02490000
//DPAF203J DD DSN=BP13.F23A.EMAIL.PA.F400,DISP=OLD                      02500000
//DPAF203K DD DSN=BP13.F23A.EMAIL.PA.F150,DISP=OLD                      02510000
//DPAF203L DD DSN=BP13.F23A.EMAIL.GEN3.F300,DISP=OLD                    02520000
//FTSF203A DD DSN=BP13.F23A.EMAIL.PAFTS.F100,DISP=OLD                   02530000
//FTSF203B DD DSN=BP13.F23A.EMAIL.PAFTS.F200,DISP=OLD                   02540000
//FTSF203C DD DSN=BP13.F23A.EMAIL.PAFTS.F300,DISP=OLD                   02550000
//FTSF203D DD DSN=BP13.F23A.EMAIL.PAFTS.F400,DISP=OLD                   02560000
//FTSF203E DD DSN=BP13.F23A.EMAIL.PAFTS.F150,DISP=OLD                   02570000
//MGSF203A DD DSN=BP13.F23A.EMAIL.SAMGP.F100,DISP=OLD                   02580000
//MGSF203B DD DSN=BP13.F23A.EMAIL.SAMGP.F200,DISP=OLD                   02590000
//MGSF203C DD DSN=BP13.F23A.EMAIL.SAMGP.F300,DISP=OLD                   02600000
//MGSF203D DD DSN=BP13.F23A.EMAIL.SAMGP.F400,DISP=OLD                   02610000
//MGSF203E DD DSN=BP13.F23A.EMAIL.SAMGP.F150,DISP=OLD                   02620000
//MGPF203F DD DSN=BP13.F23A.EMAIL.PAMGP.F100,DISP=OLD                   02630000
//MGPF203G DD DSN=BP13.F23A.EMAIL.PAMGP.F200,DISP=OLD                   02640000
//MGPF203H DD DSN=BP13.F23A.EMAIL.PAMGP.F300,DISP=OLD                   02650000
//MGPF203I DD DSN=BP13.F23A.EMAIL.PAMGP.F400,DISP=OLD                   02660000
//MGPF203J DD DSN=BP13.F23A.EMAIL.PAMGP.F150,DISP=OLD                   02670000
//MGSF203K DD DSN=BP13.F23A.EMAIL.USSAMGP.F100,DISP=OLD                 02671000
//MGSF203L DD DSN=BP13.F23A.EMAIL.USSAMGP.F200,DISP=OLD                 02672000
//MGSF203M DD DSN=BP13.F23A.EMAIL.USSAMGP.F300,DISP=OLD                 02673000
//MGSF203N DD DSN=BP13.F23A.EMAIL.USSAMGP.F400,DISP=OLD                 02674000
//MGSF203O DD DSN=BP13.F23A.EMAIL.USSAMGP.F150,DISP=OLD                 02675000
//MGPF203P DD DSN=BP13.F23A.EMAIL.USPAMGP.F100,DISP=OLD                 02676000
//MGPF203Q DD DSN=BP13.F23A.EMAIL.USPAMGP.F200,DISP=OLD                 02677000
//MGPF203R DD DSN=BP13.F23A.EMAIL.USPAMGP.F300,DISP=OLD                 02678000
//MGPF203S DD DSN=BP13.F23A.EMAIL.USPAMGP.F400,DISP=OLD                 02679000
//MGPF203T DD DSN=BP13.F23A.EMAIL.USPAMGP.F150,DISP=OLD                 02679100
//GRSF203A DD DSN=BP13.F23A.EMAIL.SAGRO.F100,DISP=OLD                   02680000
//GRSF203B DD DSN=BP13.F23A.EMAIL.SAGRO.F200,DISP=OLD                   02690000
//GRSF203C DD DSN=BP13.F23A.EMAIL.SAGRO.F300,DISP=OLD                   02700000
//GRSF203D DD DSN=BP13.F23A.EMAIL.SAGRO.F400,DISP=OLD                   02710000
//GRSF203E DD DSN=BP13.F23A.EMAIL.SAGRO.F150,DISP=OLD                   02720000
//GRPF203F DD DSN=BP13.F23A.EMAIL.PAGRO.F100,DISP=OLD                   02730000
//GRPF203G DD DSN=BP13.F23A.EMAIL.PAGRO.F200,DISP=OLD                   02740000
//GRPF203H DD DSN=BP13.F23A.EMAIL.PAGRO.F300,DISP=OLD                   02750000
//GRPF203I DD DSN=BP13.F23A.EMAIL.PAGRO.F400,DISP=OLD                   02760000
//GRPF203J DD DSN=BP13.F23A.EMAIL.PAGRO.F150,DISP=OLD                   02770000
//EIPF203A DD DUMMY                                                     02780000
//EIPF203B DD DUMMY                                                     02790000
//EIPF203C DD DUMMY                                                     02800000
//SYSOUT   DD DSN=BP13.F23A.EMAIL.BP13CD30,DISP=OLD                     02810000
//SYSTSPRT DD SYSOUT=*                                                  02820000
//SYSPRINT DD SYSOUT=*                                                  02830000
//SYSDBG   DD SYSOUT=*                                                  02840000
//SYSDBOUT DD SYSOUT=*                                                  02850000
//SYSTSIN  DD *                                                         02860000
//*-----------------------------------------------------------------*   02870000
//*  TO BYPASS RECORD THAT FOUND ON BP13K76D - BLOCK LIST           *   02880000
//*-----------------------------------------------------------------*   02890000
//STEP8A   EXEC PGM=BP13CF18,COND=(0,NE)                                02900000
//BP13F740 DD DSN=BP13.F740.ETHNIC.A633.EMAIL,DISP=SHR                  02910000
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR,                   02920000
//           AMP=('BUFND=4','BUFNI=8')                                  02930000
//P13F740A DD DSN=&&F740EIPA,DISP=(NEW,PASS),                           02940000
//             UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                    02950000
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   02960000
//SYSOUT   DD SYSOUT=*                                                  02970000
//*                                                                     02980000
//*---------------------------------------------------------------------02990000
//* PROCESS EMAIL FOR EIP                                               03000000
//*---------------------------------------------------------------------03010000
//STEP09   EXEC SORT,COND=(0,NE)                                        03020000
//SORTIN   DD DSN=&&F740EIPA,DISP=(OLD,PASS)                            03030000
//SORTOUT  DD DSN=&&F740EIPS,DISP=(,PASS),                              03040000
//        DCB=(RECFM=FB,LRECL=500),                                     03050000
//        SPACE=(CYL,(50,10),RLSE)                                      03060000
//SYSIN    DD  *                                                        03070000
  SORT FIELDS=(123,8,A),FORMAT=CH                                       03080000
  OUTREC FIELDS=(C'EIP',4,497)                                          03090000
//*--------------------------------------------------------------------*03100000
//* OUTPUT EIP EMAIL FILE FOR SA                                        03110000
//*--------------------------------------------------------------------*03120000
//STEP10   EXEC PGM=BP13CD30,COND=(0,NE)                                03130000
//BP13F740 DD DSN=&&F740EIPS,DISP=(OLD,PASS)                            03140000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR,                             03150000
//            AMP=('BUFND=4','BUFNI=8')                                 03160000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             03170000
//            AMP=('BUFND=4','BUFNI=8')                                 03180000
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                             03190000
//            AMP=('BUFND=4','BUFNI=8')                                 03200000
//DSAF203A DD DUMMY                                                     03210000
//DSAF203B DD DUMMY                                                     03220000
//DSAF203C DD DUMMY                                                     03230000
//DSAF203D DD DUMMY                                                     03240000
//DSAF203E DD DUMMY                                                     03250000
//DSAF203F DD DUMMY                                                     03260000
//DPAF203G DD DUMMY                                                     03270000
//DPAF203H DD DUMMY                                                     03280000
//DPAF203I DD DUMMY                                                     03290000
//DPAF203J DD DUMMY                                                     03300000
//DPAF203K DD DUMMY                                                     03310000
//DPAF203L DD DUMMY                                                     03320000
//FTSF203A DD DUMMY                                                     03330000
//FTSF203B DD DUMMY                                                     03340000
//FTSF203C DD DUMMY                                                     03350000
//FTSF203D DD DUMMY                                                     03360000
//FTSF203E DD DUMMY                                                     03370000
//MGSF203A DD DUMMY                                                     03380000
//MGSF203B DD DUMMY                                                     03390000
//MGSF203C DD DUMMY                                                     03400000
//MGSF203D DD DUMMY                                                     03410000
//MGSF203E DD DUMMY                                                     03420000
//MGPF203F DD DUMMY                                                     03430000
//MGPF203G DD DUMMY                                                     03440000
//MGPF203H DD DUMMY                                                     03450000
//MGPF203I DD DUMMY                                                     03460000
//MGPF203J DD DUMMY                                                     03470000
//MGSF203K DD DUMMY                                                     03471001
//MGSF203L DD DUMMY                                                     03472001
//MGSF203M DD DUMMY                                                     03473001
//MGSF203N DD DUMMY                                                     03474001
//MGSF203O DD DUMMY                                                     03475001
//MGPF203P DD DUMMY                                                     03476001
//MGPF203Q DD DUMMY                                                     03477001
//MGPF203R DD DUMMY                                                     03478001
//MGPF203S DD DUMMY                                                     03479001
//MGPF203T DD DUMMY                                                     03479101
//GROF203A DD DUMMY                                                     03480000
//GROF203B DD DUMMY                                                     03490000
//GROF203C DD DUMMY                                                     03500000
//GROF203D DD DUMMY                                                     03510000
//GROF203E DD DUMMY                                                     03520000
//GRPF203F DD DUMMY                                                     03530000
//GRPF203G DD DUMMY                                                     03540000
//GRPF203H DD DUMMY                                                     03550000
//GRPF203I DD DUMMY                                                     03560000
//GRPF203J DD DUMMY                                                     03570000
//GRSF203A DD DUMMY                                                     03580000
//GRSF203B DD DUMMY                                                     03590000
//GRSF203C DD DUMMY                                                     03600000
//GRSF203D DD DUMMY                                                     03610000
//GRSF203E DD DUMMY                                                     03620000
//GRSF203F DD DUMMY                                                     03630000
//GRSF203G DD DUMMY                                                     03640000
//GRSF203H DD DUMMY                                                     03650000
//GRSF203I DD DUMMY                                                     03660000
//GRSF203J DD DUMMY                                                     03670000
//EIPF203A DD DSN=BP13.F23A.EMAIL.EIP.PA,DISP=OLD                       03680000
//EIPF203B DD DSN=BP13.F23A.EMAIL.EIP.SA,DISP=OLD                       03690000
//EIPF203C DD DSN=BP13.F23A.EMAIL.EIP.FTS,DISP=OLD                      03700000
//SYSOUT   DD DSN=BP13.F23A.EMAIL.BP13CD30,DISP=MOD                     03710000
//SYSTSPRT DD SYSOUT=*                                                  03720000
//SYSPRINT DD SYSOUT=*                                                  03730000
//SYSDBG   DD SYSOUT=*                                                  03740000
//SYSDBOUT DD SYSOUT=*                                                  03750000
//SYSTSIN  DD *                                                         03760000
//*---------------------------------------------------------------------03770000
//* SORT ALL EMAIL FILES                                                03780000
//*---------------------------------------------------------------------03790000
//STEP11   EXEC SORT,COND=(0,NE)                                        03800000
//SORTIN   DD DSN=BP13.F23A.EMAIL.SA.F100,DISP=SHR                      03810000
//         DD DSN=BP13.F23A.EMAIL.SA.F150,DISP=SHR                      03820000
//         DD DSN=BP13.F23A.EMAIL.SA.F200,DISP=SHR                      03830000
//SORTOUT  DD DSN=&&F23ABKUP,DISP=(,PASS),                              03840000
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                          03850000
//         SPACE=(CYL,(150,10),RLSE)                                    03860000
//SYSIN    DD  *                                                        03870000
  SORT FIELDS=(1,19,A),FORMAT=CH                                        03880000
//*-------------------------------------------------------------------* 03890000
//*  BACKUP EMAIL FILES                                                 03900000
//*-------------------------------------------------------------------* 03910000
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                  03920000
//SYSPRINT DD SYSOUT=*                                                  03930000
//INPUT1   DD DSN=&&F23ABKUP,DISP=(OLD,PASS)                            03940000
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.BACKUP(+1),DISP=(NEW,CATLG),          03950000
//            SPACE=(CYL,(50,10)),                                      03960000
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)               03970000
//*                                                                     03980000
//SYSIN    DD  *                                                        03990000
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                               04000000
//*--------------------------------------------------------------------*04010000
//*  SORT K76D BLOCK FILE                                               04020000
//*--------------------------------------------------------------------*04030000
//STEP13  EXEC SORT,COND=(0,NE)                                         04040000
//SORTIN  DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                     04050000
//SORTOUT DD DSN=&&F76DTOT,DISP=(,PASS),                                04060000
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=100),                          04070000
//        SPACE=(CYL,(10,10),RLSE)                                      04080000
//SYSIN   DD  *                                                         04090000
   SORT FIELDS=(1,17,A),FORMAT=CH                                       04100000
   OMIT COND=(1,3,CH,EQ,C'   ')                                         04110000
   SUM FIELDS=NONE                                                      04120000
//*--------------------------------------------------------------------*04130000
//*  SORT K76D EIP FILE                                                 04140000
//*--------------------------------------------------------------------*04150000
//STEP14  EXEC SORT,COND=(0,NE)                                         04160000
//SORTIN  DD DSN=BP13.K76D.BLOCKEIP,DISP=SHR                            04170000
//SORTOUT DD DSN=&&F76DTOT,DISP=(MOD,PASS),                             04180000
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=100),                          04190000
//        SPACE=(CYL,(10,10),RLSE)                                      04200000
//SYSIN   DD  *                                                         04210000
   SORT FIELDS=(1,17,A),FORMAT=CH                                       04220000
   OMIT COND=(1,3,CH,EQ,C'   ')                                         04230000
   SUM FIELDS=NONE                                                      04240000
//*--------------------------------------------------------------------*04250000
//* CHECK FOR DUPLICATE RECORD IN BLOCK FILE AND EIP FILE               04260000
//*--------------------------------------------------------------------*04270000
//STEP15   EXEC PGM=ICETOOL                                             04280000
//TOOLMSG  DD  SYSOUT=*                                                 04290000
//DFSMSG   DD  SYSOUT=*                                                 04300000
//INPUT1   DD  DSN=&&F76DTOT,DISP=(OLD,DELETE)                          04310000
//OUT1     DD  SYSOUT=*                                                 04320000
//DUPLIC   DD  SYSOUT=*                                                 04330000
//TOOLIN   DD *                                                         04340000
 SELECT FROM(INPUT1) TO(OUT1) ON(1,17,CH) ALLDUPS                       04350000
//*-------------------------------------------------------------------* 04350107
//* EMPTY EMAIL FILES for L3/L4                                       * 04350207
//*-------------------------------------------------------------------* 04350307
//STEP16   EXEC PGM=IDCAMS,COND=(0,NE)                                  04350407
//SYSPRINT DD SYSOUT=*                                                  04350507
//INPUT1   DD DSN=BP13.EMPTY.CHAR200,DISP=OLD                           04350607
//OUTPUT01 DD DSN=BP13.F23A.EMAIL.L3L4.F01,DISP=OLD                     04350707
//OUTPUT02 DD DSN=BP13.F23A.EMAIL.L3L4.F02,DISP=OLD                     04350807
//OUTPUT03 DD DSN=BP13.F23A.EMAIL.L3L4.F03,DISP=OLD                     04350907
//OUTPUT04 DD DSN=BP13.F23A.EMAIL.L3L4.F04,DISP=OLD                     04351007
//OUTPUT05 DD DSN=BP13.F23A.EMAIL.L3L4.F05,DISP=OLD                     04351107
//OUTPUT06 DD DSN=BP13.F23A.EMAIL.L3L4.F06,DISP=OLD                     04351207
//OUTPUT07 DD DSN=BP13.F23A.EMAIL.L3L4.F07,DISP=OLD                     04351307
//OUTPUT08 DD DSN=BP13.F23A.EMAIL.L3L4.F08,DISP=OLD                     04351407
//OUTPUT09 DD DSN=BP13.F23A.EMAIL.L3L4.F09,DISP=OLD                     04351507
//OUTPUT10 DD DSN=BP13.F23A.EMAIL.L3L4.F10,DISP=OLD                     04351607
//OUTPUT11 DD DSN=BP13.F23A.EMAIL.L3L4.F11,DISP=OLD                     04351707
//OUTPUT12 DD DSN=BP13.F23A.EMAIL.L3L4.F12,DISP=OLD                     04351807
//OUTPUT13 DD DSN=BP13.F23A.EMAIL.L3L4.F13,DISP=OLD                     04351907
//OUTPUT14 DD DSN=BP13.F23A.EMAIL.L3L4.F14,DISP=OLD                     04352007
//OUTPUT15 DD DSN=BP13.F23A.EMAIL.L3L4.F15,DISP=OLD                     04352107
//OUTPUT16 DD DSN=BP13.F23A.EMAIL.L3L4.F16,DISP=OLD                     04352207
//OUTPUT17 DD DSN=BP13.F23A.EMAIL.L3L4.F17,DISP=OLD                     04352307
//OUTPUT18 DD DSN=BP13.F23A.EMAIL.L3L4.F18,DISP=OLD                     04352407
//OUTPUT19 DD DSN=BP13.F23A.EMAIL.L3L4.F19,DISP=OLD                     04352507
//OUTPUT20 DD DSN=BP13.F23A.EMAIL.L3L4.F20,DISP=OLD                     04352607
//SYSIN    DD *                                                         04352707
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT01)                         04352807
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT02)                         04352907
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT03)                         04353007
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT04)                         04353107
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT05)                         04353207
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT06)                         04353307
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT07)                         04353407
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT08)                         04353507
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT09)                         04353607
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT10)                         04353707
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT11)                         04353807
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT12)                         04353907
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT13)                         04354007
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT14)                         04354107
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT15)                         04354207
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT16)                         04354307
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT17)                         04354407
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT18)                         04354507
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT19)                         04354607
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT20)                         04354707
//*--------------------------------------------------------------------*04354807
//*  TO PROCESS BP13F740                                                04354907
//*  AND OUTPUT TO BP13F23A FORMAT FOR L3 (BTO) AND L4 (SBF)            04355007
//*--------------------------------------------------------------------*04355107
//STEP17   EXEC PGM=BP13CD3B,COND=(0,NE)                                04355207
//BP13F740 DD DSN=&&F740CF18,DISP=(OLD,PASS)                            04355310
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR,                             04355407
//            AMP=('BUFND=4','BUFNI=8')                                 04355507
//BP13F23A DD DSN=BP13.F23A.EMAIL.L3L4,DISP=OLD                         04355607
//SYSDBG   DD SYSOUT=*                                                  04355707
//SYSDBOUT DD SYSOUT=*                                                  04355807
//SYSOUT   DD SYSOUT=*                                                  04355907
//*--------------------------------------------------------------------*04356007
//*  SORT IN KEY FIELD                                                  04356107
//*--------------------------------------------------------------------*04356207
//STEP18   EXEC SORT,COND=(0,NE)                                        04356307
//SORTIN   DD DSN=BP13.F23A.EMAIL.L3L4,DISP=SHR                         04356407
//SORTOUT  DD DSN=&&BP13F23A,DISP=(NEW,PASS),                           04356507
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         04356607
//         SPACE=(CYL,(120,10),RLSE)                                    04356707
//SYSIN    DD  *                                                        04356807
   SORT FIELDS=(1,8,A),FORMAT=CH                                        04356907
/*                                                                      04357007
//*--------------------------------------------------------------------*04357107
//*  SPLIT BY 2000 RECORDS FOR EMAIL                                   *04357207
//*--------------------------------------------------------------------*04357307
//STEP19   EXEC PGM=SORT                                                04357407
//SYSPRINT DD SYSOUT=*                                                  04357507
//SYSOUT   DD SYSOUT=*                                                  04357607
//SORTIN   DD DSN=&&BP13F23A,DISP=(SHR,PASS)                            04357707
//O1       DD DSN=BP13.F23A.EMAIL.L3L4.F01,DISP=SHR                     04357807
//O2       DD DSN=BP13.F23A.EMAIL.L3L4.F02,DISP=SHR                     04357907
//O3       DD DSN=BP13.F23A.EMAIL.L3L4.F03,DISP=SHR                     04358007
//O4       DD DSN=BP13.F23A.EMAIL.L3L4.F04,DISP=SHR                     04358107
//O5       DD DSN=BP13.F23A.EMAIL.L3L4.F05,DISP=SHR                     04358207
//O6       DD DSN=BP13.F23A.EMAIL.L3L4.F06,DISP=SHR                     04358307
//O7       DD DSN=BP13.F23A.EMAIL.L3L4.F07,DISP=SHR                     04358407
//O8       DD DSN=BP13.F23A.EMAIL.L3L4.F08,DISP=SHR                     04358507
//O9       DD DSN=BP13.F23A.EMAIL.L3L4.F09,DISP=SHR                     04358607
//O10      DD DSN=BP13.F23A.EMAIL.L3L4.F10,DISP=SHR                     04358707
//O11      DD DSN=BP13.F23A.EMAIL.L3L4.F11,DISP=SHR                     04358807
//O12      DD DSN=BP13.F23A.EMAIL.L3L4.F12,DISP=SHR                     04358907
//O13      DD DSN=BP13.F23A.EMAIL.L3L4.F13,DISP=SHR                     04359007
//O14      DD DSN=BP13.F23A.EMAIL.L3L4.F14,DISP=SHR                     04359107
//O15      DD DSN=BP13.F23A.EMAIL.L3L4.F15,DISP=SHR                     04359207
//O16      DD DSN=BP13.F23A.EMAIL.L3L4.F16,DISP=SHR                     04359307
//O17      DD DSN=BP13.F23A.EMAIL.L3L4.F17,DISP=SHR                     04359407
//O18      DD DSN=BP13.F23A.EMAIL.L3L4.F18,DISP=SHR                     04359507
//O19      DD DSN=BP13.F23A.EMAIL.L3L4.F19,DISP=SHR                     04359607
//O20      DD DSN=BP13.F23A.EMAIL.L3L4.F20,DISP=SHR                     04359707
//SYSIN    DD  *                                                        04359807
   OPTION COPY                                                          04359907
   OUTFIL FNAMES=(O1,O2,O3,O4,O5,O6,O7,O8,O9,O10,O11,O12,O13,O14,O15,   04360007
                  O16,O17,O18,O19,O20),SPLIT1R=2000                     04360107
//*-------------------------------------------------------------------* 04360207
//* EMPTY SMS FILES FOR M2                                            * 04360307
//*-------------------------------------------------------------------* 04360407
//STEP20   EXEC PGM=IDCAMS,COND=(0,NE)                                  04360507
//SYSPRINT DD SYSOUT=*                                                  04360607
//INPUT1   DD DSN=BP13.BLANK.CHAR2000,DISP=OLD                          04360709
//OUTPUT01 DD DSN=BP13.F203.SMS.M2.XML01,DISP=OLD                       04360807
//OUTPUT02 DD DSN=BP13.F203.SMS.M2.XML02,DISP=OLD                       04360907
//OUTPUT03 DD DSN=BP13.F203.SMS.M2.XML03,DISP=OLD                       04361007
//OUTPUT04 DD DSN=BP13.F203.SMS.M2.XML04,DISP=OLD                       04361107
//OUTPUT05 DD DSN=BP13.F203.SMS.M2.XML05,DISP=OLD                       04361207
//OUTPUT06 DD DSN=BP13.F203.SMS.M2.XML06,DISP=OLD                       04361307
//OUTPUT07 DD DSN=BP13.F203.SMS.M2.XML07,DISP=OLD                       04361407
//OUTPUT08 DD DSN=BP13.F203.SMS.M2.XML08,DISP=OLD                       04361507
//OUTPUT09 DD DSN=BP13.F203.SMS.M2.XML09,DISP=OLD                       04361607
//OUTPUT10 DD DSN=BP13.F203.SMS.M2.XML10,DISP=OLD                       04361707
//OUTPUT11 DD DSN=BP13.F203.SMS.M2.XML11,DISP=OLD                       04361807
//OUTPUT12 DD DSN=BP13.F203.SMS.M2.XML12,DISP=OLD                       04361907
//OUTPUT13 DD DSN=BP13.F203.SMS.M2.XML13,DISP=OLD                       04362007
//OUTPUT14 DD DSN=BP13.F203.SMS.M2.XML14,DISP=OLD                       04362107
//OUTPUT15 DD DSN=BP13.F203.SMS.M2.XML15,DISP=OLD                       04362207
//OUTPUT16 DD DSN=BP13.F203.SMS.M2.XML16,DISP=OLD                       04362307
//OUTPUT17 DD DSN=BP13.F203.SMS.M2.XML17,DISP=OLD                       04362407
//OUTPUT18 DD DSN=BP13.F203.SMS.M2.XML18,DISP=OLD                       04362507
//OUTPUT19 DD DSN=BP13.F203.SMS.M2.XML19,DISP=OLD                       04362607
//OUTPUT20 DD DSN=BP13.F203.SMS.M2.XML20,DISP=OLD                       04362707
//SYSIN    DD *                                                         04362807
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT01)                         04362907
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT02)                         04363007
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT03)                         04363107
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT04)                         04363207
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT05)                         04363307
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT06)                         04363407
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT07)                         04363507
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT08)                         04363607
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT09)                         04363707
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT10)                         04363807
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT11)                         04363907
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT12)                         04364007
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT13)                         04364107
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT14)                         04364207
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT15)                         04364307
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT16)                         04364407
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT17)                         04364507
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT18)                         04364607
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT19)                         04364707
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT20)                         04364807
//*-----------------------------------------------------------------    04378203
//* OMIT GRO, MPGS, SMALLEST MGPS RECORDS - FOR SMS                     04378303
//* use input F740 with and without email address                       04379005
//*-----------------------------------------------------------------    04380003
//STEP21   EXEC SORT,COND=(0,NE)                                        04390007
//SORTIN   DD DSN=&&F740WO,DISP=(OLD,PASS)                              04400003
//         DD DSN=&&F740WITH,DISP=(OLD,PASS)                            04401003
//SORTOUT  DD DSN=&&F740SMS,DISP=(,PASS),                               04410003
//            UNIT=SYSDA,                                               04420003
//            DCB=(RECFM=FB,LRECL=500),                                 04430003
//            SPACE=(CYL,(120,10),RLSE)                                 04440003
//SYSIN   DD  *                                                         04450003
  SORT FIELDS=(123,8,A),FORMAT=CH                                       04460003
  OMIT COND=(28,1,CH,EQ,C'G',OR,                                        04470003
            245,1,CH,EQ,C'P',OR,                                        04480003
            245,1,CH,EQ,C'C')                                           04490003
//*-----------------------------------------------------------------*   04500003
//*  TO BYPASS RECORD THAT FOUND ON BP13K76D - BLOCK LIST - FOR SMS *   04510003
//*-----------------------------------------------------------------*   04520003
//STEP22   EXEC PGM=BP13CF18,COND=(0,NE)                                04530007
//BP13F740 DD DSN=&&F740SMS,DISP=(OLD,PASS)                             04540003
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR,                   04550003
//           AMP=('BUFND=4','BUFNI=8')                                  04560003
//P13F740A DD DSN=&&F740SMS1,DISP=(NEW,PASS),                           04570003
//             UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                    04580003
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                   04590003
//SYSOUT   DD SYSOUT=*                                                  04600003
//*                                                                     04610003
//*--------------------------------------------------------------------*04620003
//*  TO PROCESS BP13F740                                                04630003
//*  AND OUTPUT TO BP13F203 FORMAT - FOR SMS (appt type M2)             04640005
//*--------------------------------------------------------------------*04650003
//STEP23   EXEC PGM=BP13CS0C,COND=(0,NE)                                04660007
//BP13F740 DD DSN=&&F740SMS1,DISP=(OLD,PASS)                            04670003
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                              04680003
//BP13F203 DD DSN=BP13.F203.SMS.M2,DISP=OLD                             04690003
//SYSDBG   DD SYSOUT=*                                                  04700003
//SYSDBOUT DD SYSOUT=*                                                  04710003
//SYSOUT   DD SYSOUT=*                                                  04720003
//*--------------------------------------------------------------------*04730003
//*  SORT IN KEY FIELD                                                  04740003
//*--------------------------------------------------------------------*04750003
//STEP24   EXEC SORT,COND=(0,NE)                                        04760007
//SORTIN   DD DSN=BP13.F203.SMS.M2,DISP=SHR                             04770003
//SORTOUT  DD DSN=&&F203,DISP=(NEW,PASS),                               04780003
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         04790003
//         SPACE=(CYL,(8,5),RLSE)                                       04800003
//SYSIN    DD  *                                                        04810003
   SORT FIELDS=(1,19,A),FORMAT=CH                                       04820003
/*                                                                      04830003
//*=====================================================================05010004
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                    05020004
//* up to 20 xml files                                                  05030008
//*=====================================================================05040004
//STEP25    EXEC PGM=BP13CFB7,COND=(0,NE)                               05050007
//BP13F203  DD DSN=&&F203,DISP=(SHR,PASS)                               05060004
//BP13K209  DD DSN=BP13.K209.SMS.MSG,DISP=SHR                           05070004
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                              05080004
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                           05090004
//B13F203A  DD DSN=BP13.F203.SMS.M2.XML01,DISP=SHR                      05100005
//B13F203B  DD DSN=BP13.F203.SMS.M2.XML02,DISP=SHR                      05110005
//B13F203C  DD DSN=BP13.F203.SMS.M2.XML03,DISP=SHR                      05120004
//B13F203D  DD DSN=BP13.F203.SMS.M2.XML04,DISP=SHR                      05130004
//B13F203E  DD DSN=BP13.F203.SMS.M2.XML05,DISP=SHR                      05140004
//B13F203F  DD DSN=BP13.F203.SMS.M2.XML06,DISP=SHR                      05150004
//B13F203G  DD DSN=BP13.F203.SMS.M2.XML07,DISP=SHR                      05160004
//B13F203H  DD DSN=BP13.F203.SMS.M2.XML08,DISP=SHR                      05170004
//B13F203I  DD DSN=BP13.F203.SMS.M2.XML09,DISP=SHR                      05180004
//B13F203J  DD DSN=BP13.F203.SMS.M2.XML10,DISP=SHR                      05190004
//B13F203K  DD DSN=BP13.F203.SMS.M2.XML11,DISP=SHR                      05191006
//B13F203L  DD DSN=BP13.F203.SMS.M2.XML12,DISP=SHR                      05192006
//B13F203M  DD DSN=BP13.F203.SMS.M2.XML13,DISP=SHR                      05193006
//B13F203N  DD DSN=BP13.F203.SMS.M2.XML14,DISP=SHR                      05194006
//B13F203O  DD DSN=BP13.F203.SMS.M2.XML15,DISP=SHR                      05195006
//B13F203P  DD DSN=BP13.F203.SMS.M2.XML16,DISP=SHR                      05196006
//B13F203Q  DD DSN=BP13.F203.SMS.M2.XML17,DISP=SHR                      05197006
//B13F203R  DD DSN=BP13.F203.SMS.M2.XML18,DISP=SHR                      05198006
//B13F203S  DD DSN=BP13.F203.SMS.M2.XML19,DISP=SHR                      05199006
//B13F203T  DD DSN=BP13.F203.SMS.M2.XML20,DISP=SHR                      05199106
//SYSPRINT  DD SYSOUT=*                                                 05200004
//SYSOUT    DD SYSOUT=*                                                 05210004
//SYSIN     DD *                                                        05220004
