//BP13D406 JOB (BP13P),'BP13D406',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             REGION=4096K                                                     
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* CHG REF  DATE      BY   DESCRIPTION                                         
//* -------- ----      ---  -----------                                         
//* BP130652 19991016  SRA  EXPAND F520,F740 & K740 RECL FROM 300               
//*                         TO 500                                              
//* BP130883 20001027  CLT  REMOVE CALLING OF BP13C904                          
//* BP130938 20010131  SSS  CHG GROUPID                                         
//* BP132289 20030205  MTD  ADD BP13C501                                        
//* BP132317 20030324  JF4  BTO CHANGES FOR BP13C512                            
//* BP132352 20030625  SK   ADD BP13C145                                        
//* BP132432 20031021  MJ16 REMOVE PROCESSING OF NON BANK LOAN CASES            
//* BP132501 20040325  SSS2 STOP PRINT BP13L512                                 
//* BP132862 20060615  CKK7 INCLUDE BP13K648 IN BP13C528                        
//* BP133416 20090219  LMS1 TO ASSIGN POST CSM                                  
//* BP133527 20090331 YCH2 INCLUDE UPDATE OF RESALE LEVY 'LN' OR 'LNS'          
//* BP133639 20090708 ZDD1 INCLUDE BP13K595 ON BP13C145                         
//*                        INCLUDE OTHER ALTERNATE FILES OF BP13K595            
//*          20090908 ZDD1 INCLUDE BP13K730 ON BP13C145                         
//* BP134024 20100930 ZDD1 INCLUDE BP13K813 ON BP13C528                         
//* BP135171 20140211 RJE1 TO CATER FOR DB2 UPGRADE                             
//* BP135404 20140312 ESA1 TO REMOVE BP13C001                                   
//* BP137007 20171031 IL5  CEASE PRINTING P13L145A                              
//*=================================================================            
//* ----------------------------------------------------------------            
//* ¦ IF JOB ABENDS, REMEMBER TO RUN A ACJOB TO DEL THE TEMP FILES ¦            
//* ----------------------------------------------------------------            
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                            
//*  PRT02 : CLASS = 2             ** (RENTAL HOUSING MGT UNIT)                 
//*-----------------------------------------------------------------            
//PRT02  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-HARHRM1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=HARHRM1A                                   
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID),DEST=IOM2                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*=================================================================            
//* SORT BALLOT FILE                                                            
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BB22.F740.STFSPGN,                                           
//             DISP=SHR                                                         
//         DD  DSN=BP13.BLANK.CHAR500,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&F740,                                                      
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(8,2),RLSE),                                          
//             DCB=(LRECL=500,RECFM=FB)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,28,A),FORMAT=CH                                             
     SUM FIELDS=NONE                                                            
//*-----------------------------------------------------------------            
//* DEFINE TEMPORARY BALLOT FILE                                                
//*-----------------------------------------------------------------            
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT    DD  DSN=&&F740,                                                      
//             DISP=(OLD,PASS)                                                  
//SYSIN    DD  *                                                                
         DEF CL (NAME(BP13.K740.TEMPSST)               -                        
                 CYL(8 2)                              -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 IMBED                                 -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K740.TEMPSST.DATA)         -                        
                 KEYS(28 0)                            -                        
                 RECSZ(500 500)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K740.TEMPSST)                                         
//******************************************************************            
//*  SORT OCCUPIER FILE                                                         
//*-----------------------------------------------------------------            
//STEP03 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BB22.F825.STFSREQ,                                           
//             DISP=SHR                                                         
//         DD  DSN=BP13.BLANK.CHAR200,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&F825,                                                      
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(LRECL=200,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
     SUM FIELDS=NONE                                                            
//*-----------------------------------------------------------------            
//* DEFINE SOC OCCUP FILE BP13K825                                              
//*-----------------------------------------------------------------            
//STEP04 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT    DD  DSN=&&F825,                                                      
//             DISP=(OLD,PASS)                                                  
//SYSIN    DD  *                                                                
  DEF CLUSTER                                          -                        
        (NAME(BP13.K825.TEMPSST)                       -                        
        SHR(2,3)                                       -                        
        KEYS(17 0)                                     -                        
        CYL(5  2)                                      -                        
        RECSZ(200 200)                                 -                        
        FREESPACE(30 30)                               -                        
        CISZ(4096)                                     -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K825.TEMPSST.DATA))                 -                        
      INDEX                                            -                        
        (NAME(BP13.K825.TEMPSST.INDEX))                                         
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K825.TEMPSST)                                            
//*-----------------------------------------------------------------            
//*  SORT ADDR FILE                                                             
//*-----------------------------------------------------------------            
//STEP05 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BB22.F830.STFSADR,                                           
//             DISP=SHR                                                         
//         DD  DSN=BP13.BLANK.CHAR250,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&F830,                                                      
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(LRECL=250,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,9,A),FORMAT=CH                                              
     SUM FIELDS=NONE                                                            
//*-----------------------------------------------------------------            
//* DEFINE SOC ADDRESS FILES                                                    
//*-----------------------------------------------------------------            
//STEP06 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT    DD  DSN=&&F830,                                                      
//             DISP=(OLD,PASS)                                                  
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
         DEF CL (NAME(BP13.K830.TEMPSST)               -                        
                 CYL(5 2)                              -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 IMBED                                 -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K830.TEMPSST.DATA)         -                        
                 KEYS(9 0)                             -                        
                 RECSZ(250 250)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K830.TEMPSST)                                         
           DEF AIX (NAME(BP13.K830.TEMPSST.ALTX1)      -                        
               REL(BP13.K830.TEMPSST)                  -                        
               CYL(2 1)                                -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K830.TEMPSST.ALTX1.DATA)     -                        
               KEYS(8 19)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 3000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K830.TEMPSST.PATH1)      -                        
               PENT(BP13.K830.TEMPSST.ALTX1))                                   
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K830.TEMPSST)                  -                        
               ODS(BP13.K830.TEMPSST.ALTX1)                                     
//*=================================================================            
//* ASSIGN REGN NUMBER TO SUCCESSFUL CASES AFTER BALLOTING                      
//*-----------------------------------------------------------------            
//STEP07 EXEC    PGM=BP13C512,COND=(0,NE)                                       
//BP13F740 DD  DSN=&&F740,                                                      
//             DISP=(OLD,DELETE)                                                
//BP13K530 DD  DSN=BP13.K530.ISSUENO,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K740 DD  DSN=BP13.K740.TEMPSST,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K825 DD  DSN=BP13.K825.TEMPSST,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830 DD  DSN=BP13.K830.TEMPSST,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K520 DD  DSN=BP13.K520.BALLOT,                                            
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13L512 DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT REGN NO ORDER                                                          
//*-----------------------------------------------------------------            
//STEP08 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K740.TEMPSST,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F740,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(8,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=500)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(226,3,CH,EQ,C'   ')                                               
//*-----------------------------------------------------------------            
//* TO EXTRACT THE SUCCESSFUL BALLOTED APPLICANT'S & OCCUPIER INFOR             
//* TO UPDATE THE SOC MASTER AND SOC OCCUPIER FILE                              
//* TO PASS RECORDS TO CFS FOR PRE-ELIGIBILITY CHECK                            
//*-----------------------------------------------------------------            
//STEP09 EXEC    PGM=BP13C528,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&BP13F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(40,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//BP13F520 DD  DSN=&&BP13F740,                                                  
//             DISP=(OLD,PASS)                                                  
//BP13K530 DD  DSN=BP13.K530.ISSUENO,                                           
//             DISP=SHR                                                         
//BP13K825 DD  DSN=BP13.K825.TEMPSST,                                           
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K840 DD  DSN=BP13.K840.APPLHIST,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K648 DD  DSN=BP13.K648.BANKLOAN,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13F310 DD  DSN=BP13.F310.APPOINT,                                           
//             DISP=MOD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&        
//* TO UPDATE RESALE STATUS = 'LN' OR 'LNS' TO MASTER                           
//* AFTER DETAIL UPDATED TO MASTER                                              
//*---------------------------------------------------------------------        
//STEP09A   EXEC PGM=BP13C71N,COND=(0,NE)                                       
//BP13F520  DD DSN=&&BP13F740,DISP=(OLD,PASS)                                   
//BP13K825  DD DSN=BP13.K825.TEMPSST,DISP=SHR                                   
//BB24K510  DD DSN=BB24.K510.UINHIST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BB24K500  DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* TO ASSIGN PRE-BOOKING CSM                                                   
//*-----------------------------------------------------------------            
//STEP09A  EXEC PGM=BP13C145,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                                 
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR                           
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR                           
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR                           
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR                           
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                             
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                             
//P13L145A DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BB22 FILE BY NUM-NRIC, INCLUDE RECS WITH SPOUSE IC                     
//*-----------------------------------------------------------------            
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BB22.K070.OCCUPIER,DISP=SHR                                   
//SORTOUT  DD DSN=&&B22F070,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                       
//         SPACE=(CYL,(50,50),RLSE)                                             
//SYSIN    DD *                                                                 
    SORT FIELDS=(16,9,A),FORMAT=CH                                              
    INCLUDE COND=(32,9,CH,NE,C'         ')                                      
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT REQ OCCUP FILE BY NRIC, INCLUDE RECS WITH SPOUSE IC                    
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.TEMPSST,DISP=SHR                                    
//SORTOUT  DD DSN=&&P13F825,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                       
//         SPACE=(CYL,(50,50),RLSE)                                             
//SYSIN    DD *                                                                 
    SORT FIELDS=(9,9,A),FORMAT=CH                                               
    INCLUDE COND=(160,9,CH,NE,C'         ')                                     
/*                                                                              
//*-----------------------------------------------------------------            
//* UPDATE SPOUSE NAME FROM BB22 FILE INTO OCCUP FILE                           
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=BP13C501,COND=(0,NE)                                        
//BP13F825 DD DSN=&&P13F825,DISP=(OLD,DELETE)                                   
//BB22F070 DD DSN=&&B22F070,DISP=(OLD,DELETE)                                   
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=13')                                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*==================================================================           
//* SORT BP13F740 BY UIN                                                        
//*------------------------------------------------------------------           
//STEP13 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K740.TEMPSST,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&ACCEPT,                                                    
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(8,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=500)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A),FORMAT=CH                                                
//*------------------------------------------------------------------           
//* SORT BP13IN BY UIN                                                          
//*------------------------------------------------------------------           
//STEP14 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BB22.F090.FWD,                                               
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13IN,                                                    
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(LRECL=100,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(23,9,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* UPDATE ACCEPTANCE OF SST                                                    
//*-----------------------------------------------------------------            
//STEP15 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BB22F090 DD  DSN=&&BP13IN,                                                    
//             DISP=(SHR,PASS)                                                  
//BP13F740 DD  DSN=&&ACCEPT,                                                    
//             DISP=(OLD,DELETE)                                                
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13K640 DD  DSN=BP13.K640.CA.ACTION,                                         
//             DISP=SHR                                                         
//BP13K840 DD  DSN=BP13.K840.APPLHIST,                                          
//             DISP=SHR                                                         
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,                                          
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K190 DD  DSN=BM06.K190.LOG,                                               
//             DISP=SHR                                                         
//BP13L623 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT02.FORMID),DEST=IOM2                                
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C623) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//*  SORT ADDR FILE                                                             
//*-----------------------------------------------------------------            
//STEP16 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K830.TEMPSST,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&F830REGN,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(TRK,(50,5),RLSE),                                         
//             DCB=(LRECL=250,RECFM=FB)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(20,8,A),FORMAT=CH                                             
     OMIT    COND=(1,9,CH,EQ,C'         ')                                      
     OUTREC FIELDS=(20,8,X,10,241)                                              
//*-----------------------------------------------------------------            
//* REPRO UPDATED REGN TO ADDR FILE                                             
//*-----------------------------------------------------------------            
//STEP17 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&F830REGN,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1) REPLACE                              
//*=================================================================            
//* DELETE ALL TEMPORARY FILES                                                  
//*-----------------------------------------------------------------            
//STEP18 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
     DEL (BP13.K740.TEMPSST)    CL PURGE                                        
     DEL (BP13.K825.TEMPSST)    CL PURGE                                        
     DEL (BP13.K830.TEMPSST)    CL PURGE                                        
//*------------------------------------------------------------------           
//*  CLEAR INTERFACE FILES                                                      
//*------------------------------------------------------------------           
//STEP19 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             DCB=BB22.F740.STFSPGN                                            
//SYSUT2   DD  DSN=BB22.F740.STFSPGN,                                           
//             DISP=OLD                                                         
//SYSIN    DD  DUMMY                                                            
//*------------------------------------------------------------------           
//*  CLEAR INTERFACE FILES                                                      
//*------------------------------------------------------------------           
//STEP20 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             DCB=BB22.F825.STFSREQ                                            
//SYSUT2   DD  DSN=BB22.F825.STFSREQ,                                           
//             DISP=OLD                                                         
//SYSIN    DD  DUMMY                                                            
//*------------------------------------------------------------------           
//*  CLEAR INTERFACE FILES                                                      
//*------------------------------------------------------------------           
//STEP21 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             DCB=BB22.F830.STFSADR                                            
//SYSUT2   DD  DSN=BB22.F830.STFSADR,                                           
//             DISP=OLD                                                         
//SYSIN    DD  DUMMY                                                            
//*=====================================================================        
//* END BP13D406                                                                
//*=====================================================================        
