//BP13A215 JOB (BP13P),'BP13A215',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//* ====================================================================        
//* CHG-NO   BY    ON        DESCRIPTION                                        
//* ======== === ==========  ===========                                        
//* BP130418 LSB 15-10-1998  Y2K  CHANGES                                       
//* BP130956 AKT 23-11-2000  CHGE BP13F230 LRECL TO 250                         
//* BP132111 MTD 02-07-2002  CHGE STARTEND LRECL FROM 250 TO 130                
//* BP132278 JF4 28-03-2003  CHGE BP13F230/F240 LRECL TO 450.                   
//* BP132560 LMS 28-07-2004  CATER FOR PINNACLE@DUXTON.                         
//* BP132634 LMS 02-12-2004  TO REMOVE BP13C20G (FOR PINNACLE@DUXTON).          
//* BP133610 ESA102-06-2009  TO REPLACE BP13K767 WITH BP13K816                  
//* BP133724 DW5 06-11-2009  CATER FOR EQMS                                     
//* BP133851 ESA112-03-2010  TO ADD READING OF BP13KQ30 IN BP13C227             
//* BP134086 ESD1 30-12-2010 CATER TO STOP SENDING TXT TO MEDIACORP             
//*                          PERMANENTLY.                                       
//* BP134521 ESA1 04-05-2012 TO ADD READING OF BM06K100 IN BP13C227             
//* BP134587 ESA1 02-07-2012 TO ADD BP13KQ50 IN BP13C227                        
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 1 IN BP13B289 - SEND FLAT LIST TO MEDIACORP             
//*--------------------------------------------------------------------         
//STEP00   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.INTVREC,DISP=OLD                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'IF')                                              
//*---------------------------------------------------------------------        
//* REFORMAT THE FLATLIST FILE TO INTV FILE FORMAT                              
//*---------------------------------------------------------------------        
//STEP01 EXEC    PGM=BP13C27B,COND=(0,NE)                                       
//BM06F800 DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=SHR                                                         
//BP13F205 DD  DSN=BP13.F205.INTVREC,                                           
//             DISP=SHR                                                         
//M06F800A DD  DSN=&&BM06F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=800,RECFM=FB)                               
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                           
//*---------------------------------------------------------------------        
//STEP02A EXEC    SORT,COND=(0,NE)                                              
//SORTIN   DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BM06.F800.ALLOUNIT.ADHC1,                                    
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(559,2,A,546,2,A,291,8,A,23,5,A,1,11,A),                       
     FORMAT=CH                                                                  
     SUM FIELDS=NONE                                                            
     INCLUDE COND=(619,1,CH,EQ,C'Y')                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                           
//*---------------------------------------------------------------------        
//STEP02B EXEC    SORT,COND=(0,NE)                                              
//SORTIN   DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BM06.F800.ALLOUNIT.ADHC1,                                    
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(559,2,A,546,2,A,291,8,A,544,2,A,23,5,A,1,11,A),               
     FORMAT=CH                                                                  
     SUM FIELDS=NONE                                                            
     INCLUDE COND=(619,1,CH,NE,C'Y')                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* REFORMAT THE FLATLIST FILE TO INTV FILE FORMAT                              
//*---------------------------------------------------------------------        
//STEP02 EXEC    PGM=BP13C227,COND=(0,NE)                                       
//BM06F800 DD  DSN=BM06.F800.ALLOUNIT.ADHC1,                                    
//             DISP=SHR                                                         
//BP13F205 DD  DSN=BP13.F205.INTVREC,                                           
//             DISP=SHR                                                         
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                            
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//BP13KQ30 DD  DSN=BP13.KQ30.PAIR,                                              
//             DISP=SHR                                                         
//BP13KQ31 DD  DSN=BP13.KQ30.PAIR.PATH1,                                        
//             DISP=SHR                                                         
//BP13KQ50 DD  DSN=BP13.KQ50.GROUNIT,                                           
//             DISP=SHR                                                         
//BP13F230 DD  DSN=&&P13F230A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//P13F230B DD  DSN=&&P13F230B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*   REPRO FROM BP13F230 TO SEQUENTIAL BACKUP FILE                             
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT    DD  DSN=BP13.F230.FLATLIST.ADHOC,                                    
//             DISP=SHR                                                         
//OUTPUT   DD  DSN=BP13.F230.FLATLIST.ADHOC.BACKUP(+1),                         
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=130,RECFM=FB)                      
//INPUT1   DD  DSN=BP13.F230.STARTEND.ADHOC,                                    
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F230.STARTEND.ADHOC.BACKUP(+1),                         
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=130,RECFM=FB)                      
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                       
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER (INCLUDE INTV05 ONLY)                     
//*---------------------------------------------------------------------        
//STEP04 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F230B,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F230D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(7,3,A,10,10,A,20,20,A,40,2,A),FORMAT=CH                       
     INCLUDE COND=(5,2,CH,EQ,C'05')                                             
     SUM FIELDS=NONE                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* EDIT RECORDS WITH NUM-SELECTION = '3R ' (FOR RECID = '01' '02' '03')        
//*---------------------------------------------------------------------        
//STEP05 EXEC    PGM=BP13C279,COND=(0,NE)                                       
//BP13F230 DD  DSN=&&P13F230D,                                                  
//             DISP=(SHR,PASS)                                                  
//P13F230O DD  DSN=BP13.F230.STARTEND.ADHOC,                                    
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                           
//*---------------------------------------------------------------------        
//STEP06 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F230A,                                                  
//             DISP=(SHR,DELETE)                                                
//SORTOUT  DD  DSN=&&P13F230C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(7,8,A,97,10,A,30,27,A,5,2,A,59,5,A,57,2,A),FORMAT=CH          
/*                                                                              
//*---------------------------------------------------------------------        
//* EDIT RECORDS WITH NUM-SELECTION = '3R ' (FOR RECID = '05')                  
//*---------------------------------------------------------------------        
//STEP07 EXEC    PGM=BP13C279,COND=(0,NE)                                       
//BP13F230 DD  DSN=&&P13F230C,                                                  
//             DISP=(SHR,PASS)                                                  
//P13F230O DD  DSN=BP13.F230.FLATLIST.ADHOC,                                    
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO REPLACE RECORDS IN FILE                                                 
//*--------------------------------------------------------------------         
//STEP10 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F230.FLATLIST.ADHOC,                                    
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F230.FLATLIST.START,                                    
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*     TO CLEAR FILE                                                           
//*---------------------------------------------------------------------        
//STEP11 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             DCB=BP13.F230.FLATLIST.SENDALL                                   
//SYSUT2   DD  DSN=BP13.F230.FLATLIST.SENDALL,                                  
//             DISP=OLD                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//IFTEST IF (STEP07.RC = 0) THEN                                                
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP14   EXEC  PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.INTVREC,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//ENDTEST  ENDIF                                                                
//*--------------------------------------------------------------------         
//*   END OF BP13A215                                                           
//*--------------------------------------------------------------------         
