//BP13A233 JOB (BP13P),'BP13A233',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//*-----------------------------------------------------------------    00000050
//* CHG-NO   BY    ON    - DESCRIPTION                                  00000060
//* ---------------------------------                                   00000070
//* BP132201 LMS  020830 - NEW JCL                                      00000080
//* BP132627 GAN1 091104 - CHG F800.APPLN.KEYISSUE TO BP13K893          00000080
//* BP135171 RJE1 140210 - TO CATER FOR DB2 UPGRADE                             
//*-----------------------------------------------------------------    00000090
//* SORT OUT THE CONTROL REC FOR THIS OPTION                            00000100
//*-----------------------------------------------------------------    00000110
//STEP00 EXEC    SORT,COND=(0,NE)                                       00000120
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                    00000130
//             DISP=SHR                                                 00000140
//SORTOUT  DD  DSN=BP13.F205.SUBWSREC,                                  00000150
//             DISP=OLD                                                 00000160
//SYSIN    DD  *                                                        00000170
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'SW')                                              
/*                                                                      00000180
//*---------------------------------------------------------------------00000190
//* TO SORT BP13K800                                                    00000200
//*---------------------------------------------------------------------00000210
//STEP01 EXEC    SORT,COND=(0,NE)                                       00000220
//SYSOUT   DD  SYSOUT=*                                                 00000230
//SORTIN   DD  DSN=BP13.K800.APPLN,                                     00000240
//             DISP=SHR                                                 00000250
//SORTOUT  DD  DSN=&&P13F800A,                                          00000260
//             DISP=(NEW,PASS),                                         00000270
//             UNIT=SYSDA,                                              00000280
//             SPACE=(CYL,(30,30),RLSE),                                00000290
//             DCB=(LRECL=2000,RECFM=FB),                               00000300
//             DSORG=PS                                                 00000310
//SYSIN    DD  *                                                        00000320
  SORT FIELDS=(51,3,A,30,1,A),FORMAT=CH                                         
  INCLUDE COND=(924,3,CH,EQ,C'WIS')                                             
/*                                                                      00000330
//*---------------------------------------------------------------------00000340
//* TO SORT BP13K893 - K800 HISTORY FILES                               00000350
//*---------------------------------------------------------------------00000360
//STEP02 EXEC    SORT,COND=(0,NE)                                       00000370
//SYSOUT   DD  SYSOUT=*                                                 00000380
//SORTIN   DD  DSN=BP13.K893.APPLN.HISTORY,                             00000390
//             DISP=SHR,                                                00000400
//             AMP=('BUFND=8','BUFNI=4')                                00000720
//SORTOUT  DD  DSN=&&P13F800A,                                          00000410
//             DISP=(MOD,PASS)                                          00000420
//SYSIN    DD  *                                                        00000430
  SORT FIELDS=(51,3,A,30,1,A),FORMAT=CH                                         
  INCLUDE COND=(924,3,CH,EQ,C'WIS')                                             
  OUTREC FIELDS=(1,2000)                                                        
/*                                                                      00000440
//*---------------------------------------------------------------------00000450
//* TO SORT BP13F800                                                    00000460
//*---------------------------------------------------------------------00000470
//STEP03 EXEC    SORT,COND=(0,NE)                                       00000480
//SYSOUT   DD  SYSOUT=*                                                 00000490
//SORTIN   DD  DSN=&&P13F800A,                                          00000500
//             DISP=(SHR,PASS)                                          00000510
//SORTOUT  DD  DSN=&&P13F800B,                                          00000520
//             DISP=(NEW,PASS),                                         00000530
//             UNIT=SYSDA,                                              00000540
//             SPACE=(CYL,(30,30),RLSE),                                00000550
//             DCB=(LRECL=2000,RECFM=FB),                               00000560
//             DSORG=PS                                                 00000570
//SYSIN    DD  *                                                        00000580
  SORT FIELDS=(51,3,A,30,1,A,785,6,A),FORMAT=CH                                 
/*                                                                      00000590
//*---------------------------------------------------------------------00000600
//* TO EXTRACT INFO FOR PRINTING                                        00000610
//*---------------------------------------------------------------------00000620
//STEP04 EXEC    PGM=IKJEFT01,COND=(0,NE),                              00000630
//             REGION=4096K,                                            00000640
//             DYNAMNBR=20                                              00000650
//BP13F205 DD  DSN=BP13.F205.SUBWSREC,                                  00000660
//             DISP=SHR                                                 00000670
//BP13F800 DD  DSN=&&P13F800B,                                          00000680
//             DISP=(OLD,PASS)                                          00000690
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                   00000700
//             DISP=SHR,                                                00000710
//             AMP=('BUFND=8','BUFNI=4')                                00000720
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH1,                             00000730
//             DISP=SHR,                                                00000740
//             AMP=('BUFND=8','BUFNI=4')                                00000750
//P13F800A DD  DSN=&&P13F800C,                                          00000760
//             DISP=(NEW,PASS),                                         00000770
//             UNIT=SYSDA,                                              00000780
//             SPACE=(CYL,(5,5),RLSE),                                  00000790
//             DCB=(RECFM=FB,LRECL=2000)                                00000800
//SYSOUT   DD  SYSOUT=*                                                 00000810
//SYSTSPRT DD  SYSOUT=*                                                 00000820
//SYSPRINT DD  SYSOUT=*                                                 00000830
//SYSDBG   DD  SYSOUT=*                                                 00000840
//SYSDBOUT DD  SYSOUT=*                                                 00000850
//SYSTSIN  DD  *                                                        00000860
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C290) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                      00000870
//*---------------------------------------------------------------------00000880
//* TO SORT SOC MASTER                                                  00000890
//*---------------------------------------------------------------------00000900
//STEP05 EXEC    SORT,COND=(0,NE)                                       00000910
//SYSOUT   DD  SYSOUT=*                                                 00000920
//SORTIN   DD  DSN=&&P13F800C,                                          00000930
//             DISP=(SHR,PASS)                                          00000940
//SORTOUT  DD  DSN=&&P13F800D,                                          00000950
//             DISP=(NEW,PASS),                                         00000960
//             UNIT=SYSDA,                                              00000970
//             SPACE=(CYL,(30,30),RLSE),                                00000980
//             DCB=(LRECL=2000,RECFM=FB),                               00000990
//             DSORG=PS                                                 00001000
//SYSIN    DD  *                                                        00001010
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
/*                                                                      00001020
//*---------------------------------------------------------------------00001030
//* TO PRINT SUBMISSION REPORT                                          00001040
//*---------------------------------------------------------------------00001050
//STEP06 EXEC    PGM=BP13C288,COND=(0,NE),                              00001060
//             REGION=4096K                                             00001070
//BP13F800 DD  DSN=&&P13F800D,                                          00001080
//             DISP=(OLD,PASS)                                          00001090
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00001100
//             DISP=SHR,                                                00001110
//             AMP=('BUFND=8','BUFNI=4')                                00001120
//BP13L288 DD  DSN=BP13.L288.SUBMISS.WIS,                               00001130
//             DISP=SHR                                                 00001140
//SYSOUT   DD  SYSOUT=*                                                 00001150
//SYSTSPRT DD  SYSOUT=*                                                 00001160
//SYSPRINT DD  SYSOUT=*                                                 00001170
//SYSDBG   DD  SYSOUT=*                                                 00001180
//*-----------------------------------------------------------------            
//* ACCUM CONTROL REC                                                           
//*-----------------------------------------------------------------            
//STEP07 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.SUBWSREC,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*-----------------------------------------------------------------    00001190
//* END OF BP13A233                                                     00001200
//*=================================================================    00001210
