//BP13M125 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),         00010000
//       NOTIFY=CSD0071                                                 00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//*--------------------------------------------------------------------*00040000
//* CHG REF  BY   ON       DESCRIPTION                                  00050000
//* -------- ---- -------- -----------                                  00060000
//* BP138252 PP11 15052020 MONTHLY REPORT FOR CPF HOUSING GRANT FOR DP *00070000
//*                        FLATS                                       *00080000
//* BP139018 PP11 05012022 TO INCLUDE LHG GRANT IN CPF HOUSING GRANT   *00090000
//*                                                                    *00100000
//* BP138926 PP11 04102022 TO INCLUDE BP13K736 FILE IN STEP04          *00101000
//*                                                                    *00102000
//*--------------------------------------------------------------------*00110000
//*                                                                     00120000
//* SORT BP13K130 BY REGNO AND NRIC INCLUDE ONLY AHG/SHG/SUG/EHG/REG    00130000
//*---------------------------------------------------------------------00140000
//STEP02   EXEC SORT,CYL=30,COND=(0,NE)                                 00150000
//SORTIN   DD DSN=BP13.K130.SOCHIST,DISP=SHR                            00160000
//SORTOUT  DD DSN=&&SORTF136,DISP=(NEW,PASS),                           00170000
//            UNIT=SYSDA,SPACE=(TRK,(80,50),RLSE),                      00180000
//            DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                    00190000
//SYSIN    DD  *                                                        00200000
  SORT FIELDS=(5,8,A,25,9,A),FORMAT=CH                                  00210000
  INCLUDE COND=((1,2,CH,EQ,C'60',OR,1,2,CH,EQ,C'97'),AND,               00220000
                (99,3,CH,EQ,C'AHG',OR,99,3,CH,EQ,C'SHG',OR,             00230000
                 99,3,CH,EQ,C'SUG',OR,99,3,CH,EQ,C'EHG',OR,             00240000
                 99,3,CH,EQ,C'REG',OR,99,3,CH,EQ,C'LHG'))               00250000
//*---------------------------------------------------------------------00260000
//* GET THE REGNO + NRIC + PAYMENT TYPE WITH LATEST DATE POST           00270000
//*---------------------------------------------------------------------00280000
//STEP03   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K            00290000
//BP13F136 DD DSN=&&SORTF136,DISP=(OLD,PASS)                            00300000
//OUTPF136 DD DSN=&&BP13F136,DISP=(NEW,PASS),                           00310000
//            UNIT=SYSDA,SPACE=(TRK,(80,50),RLSE),                      00320000
//            DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                    00330000
//SYSIN    DD *                                                         00340000
                                                                        00350000
 DATA BP13F136;                                                         00360000
     INFILE BP13F136;                                                   00370000
     INPUT @5   REGNO          $CHAR8.                                  00380000
           @13  DTE_POST       $CHAR8.                                  00390000
           @25  NUM_NRIC       $CHAR9.                                  00400000
           @99  NUM_PAY_TYPE   $CHAR3.                                  00410000
           @1   F136_REC       $CHAR150.                                00420000
           ;                                                            00430000
                                                                        00440000
 PROC SORT; BY REGNO NUM_PAY_TYPE NUM_NRIC DTE_POST;                    00450000
                                                                        00460000
 DATA OUTPF136;                                                         00470000
   SET BP13F136 END = EOF;                                              00480000
   BY REGNO NUM_PAY_TYPE NUM_NRIC DTE_POST;                             00490000
   OPTIONS PAGESIZE = 80 LS=148;                                        00500000
   FILE OUTPF136 NOTITLES;                                              00510000
   OPTION NODATE;                                                       00520000
                                                                        00530000
   IF LAST.NUM_NRIC AND LAST.DTE_POST THEN                              00540000
      DO;                                                               00550000
        PUT @1 F136_REC 150.;                                           00560000
      END;                                                              00570000
 RETURN;                                                                00580000
//*---------------------------------------------------------------------00590000
//* MATCH FILES TO CREATE REPORT BASE FILES 1, 2, 3, 5A, 5B             00600000
//*---------------------------------------------------------------------00610000
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00620000
//BP13F136 DD DSN=&&BP13F136,DISP=(OLD,PASS)                            00630000
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     00640000
//         AMP=('BUFND=4','BUFNI=8')                                    00650000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00660000
//         AMP=('BUFND=4','BUFNI=8')                                    00670000
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                          00680000
//         AMP=('BUFND=4','BUFNI=8')                                    00690000
//BP13K736 DD DSN=BP13.K736.CPFENQ,DISP=SHR,                            00691000
//         AMP=('BUFND=4','BUFNI=8')                                    00692000
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                           00700000
//         AMP=('BUFND=4','BUFNI=8')                                    00710000
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR                            00720000
//BP13RPT1 DD DSN=BP13.REPORT1.BP13CB0Q,DISP=OLD                        00730000
//BP13RPT2 DD DSN=BP13.REPORT2.BP13CB0Q,DISP=OLD                        00740000
//BP13RPT3 DD DSN=BP13.REPORT3.BP13CB0Q,DISP=OLD                        00750000
//BP13RP5A DD DSN=BP13.REPORT5A.BP13CB0Q,DISP=OLD                       00760000
//BP13RP5B DD DSN=BP13.REPORT5B.BP13CB0Q,DISP=OLD                       00770000
//SYSOUT   DD SYSOUT=*                                                  00780000
//SYSTSPRT DD SYSOUT=*                                                  00790000
//SYSPRINT DD SYSOUT=*                                                  00800000
//SYSDBG   DD SYSOUT=*                                                  00810000
//SYSDBOUT DD SYSOUT=*                                                  00820000
//SYSTSIN  DD *                                                         00830000
  DSN SYSTEM(DSN)                                                       00840000
  RUN PROGRAM(BP13CB0Q) PLAN(BP13PCC) -                                 00850000
      LIB('BP13.BATCH.LOADCOB')                                         00860000
  END                                                                   00870000
//*---------------------------------------------------------------------00880000
//* BRING TOGETHER ALL REPORT BASE FILES IN ONE FILE TO BE USED BY CB0R 00890000
//* SORT BY REPORT TYPE, REGNO, NRIC                                    00900000
//*---------------------------------------------------------------------00910000
//STEP05   EXEC SORT,CYL=30,COND=(0,NE)                                 00920000
//SORTIN   DD DSN=BP13.REPORT1.BP13CB0Q,DISP=SHR                        00930000
//         DD DSN=BP13.REPORT2.BP13CB0Q,DISP=SHR                        00940000
//         DD DSN=BP13.REPORT3.BP13CB0Q,DISP=SHR                        00950000
//         DD DSN=BP13.REPORT5A.BP13CB0Q,DISP=SHR                       00960000
//         DD DSN=BP13.REPORT5B.BP13CB0Q,DISP=SHR                       00970000
//SORTOUT  DD DSN=BP13.REPORT.BASE.AHG.SHG.SUG,DISP=OLD                 00980000
//SYSIN    DD  *                                                        00990000
  SORT FIELDS=(1,2,A,4,8,A,12,9,A),FORMAT=CH                            01000000
//* ============================================================== *    01010000
//* SORT AHG FROM BP13.REPORT.BASE.AHG.SHG.SUG                          01020000
//*---------------------------------------------------------------------01030000
//STEP06   EXEC SORT,CYL=30,COND=(0,NE)                                 01040000
//SORTIN   DD DSN=BP13.REPORT.BASE.AHG.SHG.SUG,DISP=SHR                 01050000
//SORTOUT  DD DSN=&&BP13FAHG,DISP=(NEW,PASS),                           01060000
//            UNIT=SYSDA,SPACE=(TRK,(20,10),RLSE),                      01070000
//            DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB)                    01080000
//SYSIN    DD  *                                                        01090000
  SORT FIELDS=(1,2,A,4,8,A,12,9,A),FORMAT=CH                            01100000
  INCLUDE COND=(21,3,CH,EQ,C'AHG')                                      01110000
//* ============================================================== *    01120000
//* SORT SHG FROM BP13.REPORT.BASE.AHG.SHG.SUG                          01130000
//*---------------------------------------------------------------------01140000
//STEP07   EXEC SORT,CYL=30,COND=(0,NE)                                 01150000
//SORTIN   DD DSN=BP13.REPORT.BASE.AHG.SHG.SUG,DISP=SHR                 01160000
//SORTOUT  DD DSN=&&BP13FSHG,DISP=(NEW,PASS),                           01170000
//            UNIT=SYSDA,SPACE=(TRK,(20,10),RLSE),                      01180000
//            DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB)                    01190000
//SYSIN    DD  *                                                        01200000
  SORT FIELDS=(1,2,A,4,8,A,12,9,A),FORMAT=CH                            01210000
  INCLUDE COND=(21,3,CH,EQ,C'SHG')                                      01220000
//* ============================================================== *    01230000
//* SORT SUG FROM BP13.REPORT.BASE.AHG.SHG.SUG                          01240000
//*---------------------------------------------------------------------01250000
//STEP08   EXEC SORT,CYL=30,COND=(0,NE)                                 01260000
//SORTIN   DD DSN=BP13.REPORT.BASE.AHG.SHG.SUG,DISP=SHR                 01270000
//SORTOUT  DD DSN=&&BP13FSUG,DISP=(NEW,PASS),                           01280000
//            UNIT=SYSDA,SPACE=(TRK,(20,10),RLSE),                      01290000
//            DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB)                    01300000
//SYSIN    DD  *                                                        01310000
  SORT FIELDS=(1,2,A,4,8,A,12,9,A),FORMAT=CH                            01320000
  INCLUDE COND=(21,3,CH,EQ,C'SUG')                                      01330000
//*---------------------------------------------------------------------01340000
//* SORT EHG FROM BP13.REPORT.BASE.AHG.SHG.SUG                          01350000
//*---------------------------------------------------------------------01360000
//STEP09   EXEC SORT,CYL=30,COND=(0,NE)                                 01370000
//SORTIN   DD DSN=BP13.REPORT.BASE.AHG.SHG.SUG,DISP=SHR                 01380000
//SORTOUT  DD DSN=&&BP13FEHG,DISP=(NEW,PASS),                           01390000
//            UNIT=SYSDA,SPACE=(TRK,(20,10),RLSE),                      01400000
//            DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB)                    01410000
//SYSIN    DD  *                                                        01420000
  SORT FIELDS=(1,2,A,4,8,A,12,9,A),FORMAT=CH                            01430000
  INCLUDE COND=(21,3,CH,EQ,C'EHG')                                      01440000
//*---------------------------------------------------------------------01450000
//* SORT REG FROM BP13.REPORT.BASE.AHG.SHG.SUG                          01460000
//*---------------------------------------------------------------------01470000
//STEP10   EXEC SORT,CYL=30,COND=(0,NE)                                 01480000
//SORTIN   DD DSN=BP13.REPORT.BASE.AHG.SHG.SUG,DISP=SHR                 01490000
//SORTOUT  DD DSN=&&BP13FREG,DISP=(NEW,PASS),                           01500000
//            UNIT=SYSDA,SPACE=(TRK,(20,10),RLSE),                      01510000
//            DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB)                    01520000
//SYSIN    DD  *                                                        01530000
  SORT FIELDS=(1,2,A,4,8,A,12,9,A),FORMAT=CH                            01540000
  INCLUDE COND=(21,3,CH,EQ,C'REG')                                      01550000
//*---------------------------------------------------------------------01560000
//* CREATE REPORT FOR AHG                                               01570000
//*---------------------------------------------------------------------01580000
//STEP11   EXEC PGM=BP13CB0R,COND=(0,NE)                                01590000
//BP13REPT DD DSN=&&BP13FAHG,DISP=(OLD,PASS)                            01600000
//BP13OUTP DD DSN=BP13.LB0R.REPORT.AHG,DISP=SHR                         01610000
//SYSUDUMP DD SYSOUT=*                                                  01620000
//SYSOUT   DD SYSOUT=*                                                  01630000
//SYSDBOUT DD SYSOUT=*                                                  01640000
//*---------------------------------------------------------------------01650000
//* CREATE REPORT FOR SHG                                               01660000
//*---------------------------------------------------------------------01670000
//STEP12   EXEC PGM=BP13CB0R,COND=(0,NE)                                01680000
//BP13REPT DD DSN=&&BP13FSHG,DISP=(OLD,PASS)                            01690000
//BP13OUTP DD DSN=BP13.LB0R.REPORT.SHG,DISP=SHR                         01700000
//SYSUDUMP DD SYSOUT=*                                                  01710000
//SYSOUT   DD SYSOUT=*                                                  01720000
//SYSDBOUT DD SYSOUT=*                                                  01730000
//*---------------------------------------------------------------------01740000
//* CREATE REPORT FOR SUG                                               01750000
//*---------------------------------------------------------------------01760000
//STEP13   EXEC PGM=BP13CB0R,COND=(0,NE)                                01770000
//BP13REPT DD DSN=&&BP13FSUG,DISP=(OLD,PASS)                            01780000
//BP13OUTP DD DSN=BP13.LB0R.REPORT.SUG,DISP=SHR                         01790000
//SYSUDUMP DD SYSOUT=*                                                  01800000
//SYSOUT   DD SYSOUT=*                                                  01810000
//SYSDBOUT DD SYSOUT=*                                                  01820000
//*----------------------------------------------------------------     01830000
//* CREATE REPORT FOR EHG                                               01840000
//*---------------------------------------------------------------------01850000
//STEP14   EXEC PGM=BP13CB0R,COND=(0,NE)                                01860000
//BP13REPT DD DSN=&&BP13FEHG,DISP=(OLD,PASS)                            01870000
//BP13OUTP DD DSN=BP13.LB0R.REPORT.EHG,DISP=SHR                         01880000
//SYSUDUMP DD SYSOUT=*                                                  01890000
//SYSOUT   DD SYSOUT=*                                                  01900000
//SYSDBOUT DD SYSOUT=*                                                  01910000
//*----------------------------------------------------------------     01920000
//* CREATE REPORT FOR REG                                               01930000
//*---------------------------------------------------------------------01940000
//STEP15   EXEC PGM=BP13CB0R,COND=(0,NE)                                01950000
//BP13REPT DD DSN=&&BP13FREG,DISP=(OLD,PASS)                            01960000
//BP13OUTP DD DSN=BP13.LB0R.REPORT.REG,DISP=SHR                         01970000
//SYSUDUMP DD SYSOUT=*                                                  01980000
//SYSOUT   DD SYSOUT=*                                                  01990000
//SYSDBOUT DD SYSOUT=*                                                  02000000
//*                                                                     02010000
//*---------------------------------------------------------------------02020000
//* SORT LHG FROM BP13.REPORT.BASE.AHG.SHG.SUG                          02030000
//*---------------------------------------------------------------------02040000
//STEP16   EXEC SORT,CYL=30,COND=(0,NE)                                 02050000
//SORTIN   DD DSN=BP13.REPORT.BASE.AHG.SHG.SUG,DISP=SHR                 02060000
//SORTOUT  DD DSN=&&BP13FLHG,DISP=(NEW,PASS),                           02070000
//            UNIT=SYSDA,SPACE=(TRK,(20,10),RLSE),                      02080000
//            DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB)                    02090000
//SYSIN    DD  *                                                        02100000
  SORT FIELDS=(1,2,A,4,8,A,12,9,A),FORMAT=CH                            02110000
  INCLUDE COND=(21,3,CH,EQ,C'LHG')                                      02120000
//*---------------------------------------------------------------------02130000
//* CREATE REPORT FOR LHG                                               02140000
//*---------------------------------------------------------------------02150000
//STEP17   EXEC PGM=BP13CB0R,COND=(0,NE)                                02160000
//BP13REPT DD DSN=&&BP13FLHG,DISP=(OLD,PASS)                            02170000
//BP13OUTP DD DSN=BP13.LB0R.REPORT.LHG,DISP=SHR                         02180000
//SYSUDUMP DD SYSOUT=*                                                  02190000
//SYSOUT   DD SYSOUT=*                                                  02200000
//SYSDBOUT DD SYSOUT=*                                                  02210000
//*---------------------------------------------------------------------02220000
