//BP13D602 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//        NOTIFY=CSD0071                                                        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*--------------------------------------------------------------------         
//*  CHG-NO   BY  ON      DESCRIPTION                                           
//*--------------------------------------------------------------------         
//* BP134645 LSB 130912 - C614, C615 MOVE FROM BP13D701 TO D602 JOB             
//* BP135420 ESD1 201014  CATER FOR PROCESSING 2ND CA NET LOAN.                 
//* BP135420 ESD1 231214  CATER TO ADD BP13L909 IN STEP0A.                      
//* BP135619 ESD1 150115  CATER TO ADD BP13C26B FOR CPF BALANCE APPT            
//* BP135682 ESD1 020315  ADD K410 AND ERROR RPT IN BP13C26B                    
//* BP135901 LJL1 080915  CATER FOR CPF BALANCE BACKUP FILE                     
//* BP135959 LJL1 150915  BACKUP AB02 CPF RETURN FILE AND F680 FILE             
//* BP135959 KSJ3 160915  INCLUDE BP13C3A4 AND COPY BP13L606 TO CDROM           
//* BP135959 LJL1 080116  TO DO AWAY WITH CD ROM FOR CPF BACKUP                 
//* BP136372 KSJ3 010816  INCLUDE BP27K800 IN BP13C909                          
//*                       EXPAND STEP11 SPACE FROM CYL 20 TO 100                
//* BP136460 KSJ3 100317  EXPAND BP13K680/F680/F875 TO 1600                     
//*                       COMMENT OUT STEP02/03/04 (NOT USED ANYMORE)           
//* BP137480 LJL1 030619  TO CATER FOR CPF OA API.                              
//* BP137713 DN8  260819  TO CATER NEW PROGRAM BP13C90H.                        
//* BP137713 KV6  230919  TO CATER NEW PROGRAM BP13CH2C                         
//* BP138020 LJL1 071019  TO REMOVE BP13C615 THAT UPDATES BP13K50A              
//*                       TO REMOVE BP13K50A                                    
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1    DD DSN=BP13.K680.CPFBAL,DISP=OLD                                    
//INPUT2    DD DSN=BP13.K50A.CPF.ACKGRANT,DISP=OLD                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*********************************************************************         
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS  (SIMPLEX)     *         
//*    PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGREEMENT TEAM)      *         
//*********************************************************************         
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG CP-1',END;                                      
1$DJDE$ JDE=BP13S,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* UPDATE SECONDCA MAX-LOAN TO BP13K640 FOR LOW RISK CASE                      
//*-----------------------------------------------------------------            
//STEP0A  EXEC PGM=BP13C909,COND=(0,NE)                                         
//AB02F875 DD DSN=AB02.F875.SOC,DISP=SHR                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP27K860 DD DSN=BP27.K860.HDBPRTY,DISP=SHR                                    
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13KC00 DD DSN=BP13.KC00.SECONDCA,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K80A DD DSN=BP13.K800.SECONDCA,DISP=SHR                                   
//BP13F875 DD DSN=&&NEWF875,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(30,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=1500,BLKSIZE=0)                               
//OUTF800  DD DSN=BP13.BP27.F800.SECOND.CA.LOWRISK.OLD,DISP=SHR                 
//BP13L909 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*UPDATE SECONDCA MAX-LOAN TO BP13K640 FOR LOW RISK CASE - F683-INPUT          
//*--------------------------------------------------------------------         
//STEPA1  EXEC PGM=BP13C90H,COND=(0,NE)                                         
//BP13F683 DD DSN=BP13.F683.CPF.BALANCE.A2NDCA.LOWRISK,DISP=SHR                 
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP27K860 DD DSN=BP27.K860.HDBPRTY,DISP=SHR                                    
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13KC00 DD DSN=BP13.KC00.SECONDCA,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K80A DD DSN=BP13.K800.SECONDCA,DISP=SHR                                   
//BP13F875 DD DSN=BP13.F683.CPFBAL.NOTFND.K80A,DISP=MOD                         
//OUTF800  DD DSN=BP13.BP27.F800.SECOND.CA.LOWRISK,DISP=SHR                     
//BP13L909 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*DELETE SECOND CA LOWRISK CASES FROM BP13K683                                 
//*--------------------------------------------------------------------         
//STEPA2  EXEC PGM=BP13CH2C,COND=(0,NE)                                         
//BP13F683 DD DSN=BP13.F683.CPF.BALANCE.A2NDCA.LOWRISK,DISP=SHR                 
//BP13K683 DD DSN=BP13.K683.CPF.SECONDCA,DISP=SHR,                              
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  UPDATE SOC FILES FOR LOW RISK CASE                                         
//*-----------------------------------------------------------------            
//STEP0B   EXEC PGM=BP13C3A1,COND=(0,NE)                                        
//BP13F800 DD DSN=BP13.BP27.F800.SECOND.CA.LOWRISK,DISP=SHR                     
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR,                                 
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13KC00 DD DSN=BP13.KC00.SECONDCA,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* BACKUP BP13F800 TO ACCUM FILE                                               
//*-----------------------------------------------------------------*           
//STEP0C   EXEC SORT                                                            
//SORTIN   DD DSN=BP13.BP27.F800.SECOND.CA.LOWRISK,DISP=SHR                     
//SORTOUT  DD DSN=BP13.F800.SECONDCA.LOWRISK,DISP=MOD                           
//SYSIN    DD *                                                                 
      SORT FIELDS=COPY                                                          
//*-----------------------------------------------------------------            
//* UPDATE CPF BALANCE APPOINTMENT                                              
//*-----------------------------------------------------------------            
//STEP0D  EXEC PGM=BP13C26B,COND=(0,NE)                                         
//AB02F875 DD DSN=&&NEWF875,DISP=(OLD,PASS)                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K410  DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K68A DD DSN=BP13.K68A.CPFBAL.APPT,DISP=SHR                                
//BP13F875 DD DSN=&&STEP0D,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(30,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=1500,BLKSIZE=0)                               
//BP13L26B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//**********************************************************************        
//* BKUP AB02F875 FILE WITHOUT 2ND CA                                           
//**********************************************************************        
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=&&STEP0D,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=BP13.F875.SOC,DISP=SHR                                        
//SYSIN    DD *                                                                 
  SORT FIELDS=(15,8,CH,A)                                                       
//*---------------------------------------------------------------------        
//* SORT BP13K454 FILE BY REGN-NO                                               
//*---------------------------------------------------------------------        
//STEP1A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F454,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=100)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(15,8,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SORT AB02F875 FILE BY REGN-NO                                               
//*---------------------------------------------------------------------        
//STEP1B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AB02.F875.SOC,DISP=SHR                                        
//SORTOUT  DD DSN=&&AB02F875,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=1500)                                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(15,8,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//* BP13C90G - MATCHING PROGRAM OF BP13F454 & AB02F875 BY REGN NO               
//*--------------------------------------------------------------------         
//STEP1C EXEC    PGM=BP13C90G,COND=(0,NE)                                       
//BP13F454 DD  DSN=&&BP13F454,DISP=(OLD,PASS)                                   
//AB02F875 DD  DSN=&&AB02F875,DISP=(OLD,PASS)                                   
//P13F875A DD  DSN=BP13.F875.SOC,DISP=MOD                                       
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//**********************************************************************        
//* CONVERT BP13F875 TO BP13F680 (NEW FORMAT)                                   
//**********************************************************************        
//STEP05  EXEC PGM=BP13C689,COND=(0,NE)                                         
//AB02F875 DD DSN=BP13.F875.SOC,DISP=SHR                                        
//BP13F680 DD DSN=&&BP13F68A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                               
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//**********************************************************************        
//* SORT BP13F680 FILE BY REGN-NO                                               
//**********************************************************************        
//STEP06  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=&&BP13F68A,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&BP13F68B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=(15,8,CH,A)                                                       
  SUM  FIELDS=NONE                                                              
//*                                                                             
//*********************************************************************         
//* CREATE BP13.K680.CPFBAL                                                     
//*********************************************************************         
//STEP07  EXEC PGM=IDCAMS                                                       
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1  DD DSN=&&BP13F68B,DISP=(OLD,PASS)                                     
//OUTPUT1 DD DSN=BP13.K680.CPFBAL,DISP=SHR                                      
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-------------------------------------------------------------------*         
//* BACKUP AB02.F875.SOC                                              *         
//*-------------------------------------------------------------------*         
//STEP07A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=AB02.F875.SOC,DISP=SHR                                        
//OUTPUT5  DD DSN=BP13.AB02.F875.SOC.NEW,DISP=SHR                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP AB02.F875.SOC, FILE RETURN FROM CPFB        - GDG(15)      *         
//*-------------------------------------------------------------------*         
//STEP07B  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=AB02.F875.SOC,DISP=SHR                                        
//OUTPUT5  DD DSN=BP13.AB02.F875.SOC.BKUP(+1),DISP=(NEW,CATLG),                 
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27000,LRECL=1500,RECFM=FB)                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F875.SOC, FILE TO CREATE CPF BACKUP FILE - GDG(15)    *         
//*-------------------------------------------------------------------*         
//STEP07C  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.F875.SOC,DISP=SHR                                        
//OUTPUT5  DD DSN=BP13.F875.SOC.BKUP(+1),DISP=(NEW,CATLG),                      
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27000,LRECL=1500,RECFM=FB)                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                     
//*                                                                             
//*********************************************************************         
//*EMPTY FILE                                                                   
//*********************************************************************         
//STEP08  EXEC PGM=IDCAMS                                                       
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AB02.F875.SOC,DISP=SHR                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-------------------------------------------------------------------*         
//* SORT CPF BALANCE FILE IN REGN NO SEQUENCE                         *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,5),RLSE),UNIT=SYSDA,                               
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(1499,8,CH,NE,C'00000000',AND,                                 
                  1499,8,CH,NE,C'        ',AND,                                 
                  1507,1,CH,NE,C'Y')                                            
//*------------------------------------------------------------------*          
//* UPDATE GRANT CREDIT TAG                                                     
//*------------------------------------------------------------------*          
//STEP10   EXEC PGM=BP13C615,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(SHR,PASS)                                    
//BP13K680 DD DSN=BP13.K680.CPFBAL,DISP=SHR                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K50A DD DSN=BP13.K50A.CPF.ACKGRANT,DISP=SHR                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORT CPF BALANCE FILE IN REGN NO SEQUENCE                         *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K680.CPFBAL,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F680,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(100,20),RLSE),UNIT=SYSDA,                             
//            DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(15,8,A),FORMAT=CH                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* DELETE CPF BALANCE ENQUIRY FILE FOR CASES ALREADY TP OR NOT       *         
//* FOUND IN APPOINTMENT FILE (SA CASES)                              *         
//* CLOSE FILE : BP13K680                                             *         
//*-------------------------------------------------------------------*         
//STEP12    EXEC PGM=BP13C614,COND=(0,NE)                                       
//BP13F680  DD DSN=&&BP13F680,DISP=(OLD,DELETE)                                 
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13F68A  DD DSN=BP13.F680.CPFBAL.BACKUP,DISP=MOD                             
//BP13K680  DD DSN=BP13.K680.CPFBAL,DISP=SHR                                    
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR                                     
//BP13KD00  DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                   
//BP13K410  DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K454  DD DSN=BP13.K454.APPTABLE,DISP=SHR                                  
//BP13K451  DD DSN=BP13.K454.APPTABLE.PATH1,DISP=SHR                            
//SYSOUT    DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSABOUT  DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP27 LOW RISK RECORD 2ND CA PROCESSING                                 
//*-----------------------------------------------------------------            
//STEP13A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP27.BP13.F800.CA2ND.LOWRISK,DISP=SHR                         
//SORTOUT  DD  DSN=&&STEP13A,                                                   
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD *                                                                 
      SORT FIELDS=(04,08,A),FORMAT=CH                                           
//*-----------------------------------------------------------------            
//*  UPDATE SOC FILES FOR LOW RISK CASE                                         
//*-----------------------------------------------------------------            
//STEP14   EXEC PGM=BP13C3A1,COND=(0,NE)                                        
//BP13F800 DD DSN=&&STEP13A,DISP=(OLD,PASS)                                     
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR                                  
//BP13KC00 DD DSN=BP13.KC00.SECONDCA,DISP=SHR                                   
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//STEP15 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DUMMY                                                            
//OUTPUT1  DD  DSN=BP27.BP13.F800.CA2ND.LOWRISK,                                
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K683.CPF.BALANCE,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.F683.CPF.BALANCE.MONTH,DISP=MOD                          
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*--------------------------------------------------------------------         
//*--------------------------------------------------------------------------   
//STEP17  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.BLANK.CHAR2000,DISP=SHR                                  
//SYSIN    DD *                                                                 
         DEL 'BP13.K683.CPF.BALANCE' CL PURGE                                   
         DEF CL (NAME(BP13.K683.CPF.BALANCE) -                                  
                 CYL(50 20)                       -                             
                 UNIQUE                          -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K683.CPF.BALANCE.DATA) -                            
                 KEYS(8 0)                       -                              
                 RECSZ(2000 2000)                -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096)) -                                                  
                 INDEX                           -                              
                 (NAME(BP13.K683.CPF.BALANCE.INDEX) -                           
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K683.CPF.BALANCE)                                     
//*=================================================================            
//*-------------------------------------------------------------------*         
//*  SORT NEW BP13KK454 FILE                                                    
//*-------------------------------------------------------------------*         
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F45A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=100)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(15,8,A),FORMAT=CH                                                
//*                                                                             
//*-------------------------------------------------------------------*         
//*  RUN BP13C3A4 TO GENERATE EXCEPTION REPORT                                  
//*-------------------------------------------------------------------*         
//STEP19   EXEC PGM=BP13C3A4,COND=(0,NE)                                        
//BP13F454 DD DSN=&&BP13F45A,DISP=(OLD,DELETE)                                  
//BP13K680 DD DSN=BP13.K680.CPFBAL,DISP=SHR                                     
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//MAILC3A4 DD DSN=&&MAILC3A4,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,50),RLSE),                              
//            DCB=(RECFM=FB,LRECL=100)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SENDMAIL - MAILC3A4                                                        
//*-------------------------------------------------------------------*         
//STEP20   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&MAILC3A4,DISP=(OLD,DELETE)                                  
//*                                                                             
