//BP13A614 JOB (BP13P),'BP13A614',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//*THIS JCL WAS RUN AT LEAST ONE WEEK BEFORE BALLOTING STARTS                   
//* PRINTS REPORT FOR AUDITOR                                                   
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP133246 IL5 070308 - NEW.                                                  
//* BP133511 IL5 090130 - INCLUDE PROGRAM BP13CH14                              
//* BP133610 ESA1090603 - TO REPLACE BP13K767 WITH BP13K816                     
//* BP134036 IL5 121010 - ADD INPUT DD FOR BP13CH14                             
//* BP133847 ZDD 180310 - ADD BP13K825 TO BP13CH14                              
//* BP135254 SMR 210414 - TO REPLACE BP13K816 WITH BP13K813                     
//* BP135392 IL5 040714 - CATER FOR FLAT TYPE 3P BY                             
//*                       REMOVING STEPS CHECKING FOR FT WITH 'P'               
//*                       REMOVE PROGRAM BP13CB86                               
//* BP135708 SMR 310315 - CHANGE CLASS=2 TO CLASS=J                             
//* BP137102 AM2 191218 - SORT OUT NUM-OPTION S6 FOR BP13C54D                   
//* BP138164 AM2 160120 - NEW OUTPUT FILE P13FH14A FOR BP13CH14                 
//* BP138301 AM2 040620 - HARDCOPY REPORTS CONVERSION                           
//**************************************************************                
//*---------------------------------------------------------------------        
//* SORT OUT NUM-OPTION 'S6'                                                    
//*---------------------------------------------------------------------        
//STEPA    EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K205,DISP=(NEW,PASS),                                    
//            SPACE=(TRK,(1,1),RLSE),UNIT=SYSDA,                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'S6')                                               
//*                                                                             
//*-----------------------------------------------------------------            
//* PROGRAM TRIGGER VIA ONLINE BP13B555                                         
//* EXTRACT RELEVANT EXERCISE CASES                                             
//*------------------------------------------------------------------           
//STEP1A   EXEC PGM=BP13C54D,COND=(0,NE)                                        
//BP13F205 DD DSN=&&P13K205,DISP=(OLD,DELETE)                                   
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                                 
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F500 DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE)                               
//BP13L54D DD SYSOUT=*                                                          
//BP13L54E DD SYSOUT=*                                                          
//BP13L54F DD SYSOUT=*                                                          
//BP13L54G DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT BTO MATURE REQUESTS TO SEQUENTIAL FILE                                 
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(187,3,A,211,2,A,123,8,A),FORMAT=CH                            
//*-------------------------------------------------------------------*         
//* UPDATE BALLOT HOUSEHOLD TO 'G' IF 'H' APPLICATIONS HAVE 2 NON-              
//* SELECTION RECORDS                                                           
//* INPUT - BP13F730 BP13KH10 BP13K816                                          
//* OUTPUT - P13F730A P13LH14A                                                  
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=BP13CH14,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//BP13KH12 DD DSN=BP13.KH12.NOTBKCNT.HISTORY,DISP=SHR,                          
//         AMP=('BUFND=23')                                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//BP13K826 DD DSN=BP13.K825.REQOCCP.PATH1,DISP=SHR,                             
//         AMP=('BUFND=23')                                                     
//BP13K730 DD DUMMY                                                             
//P13F730A DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13LH14A DD SYSOUT=*                                                          
//P13FH14A DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SEPARATE PRINTING FOR APPL MADE BEFORE 200710                               
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//SORTOUT1 DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE)                                
//SORTOUT2 DD DSN=&&F7304P,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE)                                
//SORTOUT3 DD DSN=&&F730SP,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,2,CH,NE,C'4P',AND,                       
                                   211,2,CH,NE,C'5P',AND,                       
                                   211,2,CH,NE,C'SP')                           
   OUTFIL FNAMES=SORTOUT2,INCLUDE=(211,2,CH,EQ,C'4P',OR,                        
                                   211,2,CH,EQ,C'5P')                           
   OUTFIL FNAMES=SORTOUT3,INCLUDE=(211,2,CH,EQ,C'SP')                           
//*-------------------------------------------------------------------*         
//* DUPLICATE RECORDS FOR ADDITIONAL RANDOM NUMBERS ASSIGNMENT                  
//* FT MCPS - TOTAL 4 RECORDS                                                   
//* UG MCPS - TOTAL 2 RECORDS                                                   
//* FT PA   - TOTAL 2 RECORDS                                                   
//* UG PA   - TOTAL 1 RECORD                                                    
//*                                                                             
//* FOR APPLICANTS WITH > 4 UNSUCC ATTEMPTS                                     
//* + 4 ATTEMPTS - 1 ADDITIONAL RECORD                                          
//* + 5 ATTEMPTS - 2 ADDITIONAL RECORDS ETC.                                    
//* OUTPUT:                                                                     
//* BP13LB18 - FOR SOU (CONTAINS ALL APPLICATIONS FOR SALES EX)                 
//* P13LB18B - FOR IAD (CONTAINS APPLICATIONS WITH >= 3 BALLOT CHANCE)          
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=BP13CB18,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//BP13K593 DD DSN=BP13.K593.UNSUCCNT,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13F740 DD DUMMY                                                             
//BP13LB18 DD SYSOUT=*                                                          
//P13LB18B DD DSN=&&P13LB18B,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                               
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* TO COMPUTE FOR NUMBER OF CHANCES                                            
//*------------------------------------------------------------------           
//*STEP05   EXEC PGM=BP13CB86,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&F7304P,DISP=(OLD,DELETE)                                   
//*BP13F500 DD DSN=&&F730SP,DISP=(OLD,DELETE)                                   
//*BP13F740 DD DSN=&&BP13F500,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                             
//*            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//*BP13LB86 DD SYSOUT=*                                                         
//*P13LB86B DD DSN=&&P13LB18B,DISP=(MOD,PASS),                                  
//*            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                              
//*            SPACE=(CYL,(5,3),RLSE)                                           
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT BY REGN                                                                
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&P13LB18B,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&LB18SORT,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                               
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT THE REQUEST BEFORE PIGEONHOLING                        
//* REPORT FOR IA TO CHECK BALLOT CHANCES GIVEN TO APPLICANT                    
//*---------------------------------------------------------------------        
//STEP04   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                   
//BP13LB18 DD  DSN=&&LB18SORT,DISP=(OLD,PASS)                                   
//BP13L513 DD  SYSOUT=8,DEST=IOM8                                               
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S513),DISP=SHR                            
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A614                                                                
//*---------------------------------------------------------------------        
