//BP13A819 JOB (BP13P),'BP13A519',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//*                                                                             
//*  THIS JOB IS TO PRINT EXCEPTIONAL REPORT FOR SERS CASES                     
//*  AFTER DETERMINE HOUSEHOLD TYPE                                             
//*                                                                             
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP133201 YCH2 20112007 NEW JCL FOR SERS EXCEPTIONAL REPORT                  
//* BP137724 YCH2 30092019 CHANGE TO IOM2                                       
//*==================================================================           
//* TO SEND DJDE AHEAD OF THE PRINT DATASET                                     
//* PRT01 : FOR CONTROL LISTING                                                 
//*------------------------------------------------------------------           
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//*-DEFINE NEW DATASET                                                          
//*--------------------------------------------------------------------         
//STEP010  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F730.REPORT.SERS,DISP=OLD                                
//SYSIN DD *                                                                    
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*  SORT THE UNMATCHED REQUEST RECORD IN REG-NO ORDER                          
//*---------------------------------------------------------------------        
//STEP020  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR                              
//SORTOUT  DD DSN=&&BP13F730,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(30,20),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH,FILSZ=E50000                                 
   OUTREC FIELDS=(32X,123,8,41,460)                                             
//*---------------------------------------------------------------------        
//*  DELETE AND DEFINE BP13K730 - MATURE REQUEST FILE                           
//*---------------------------------------------------------------------        
//STEP030  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K730.MATURERQ.SERS)  CL PURGE                                
         DEF CL (NAME(BP13.K730.MATURERQ.SERS)             -                    
                 CYL(48 10)                            -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K730.MATURERQ.SERS.DATA)       -                    
                 KEYS(8 122)                           -                        
                 RECSZ(500 500)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K730.MATURERQ.SERS)                                   
//*******************************************************************           
//* SORT IN REGNO AND NRIC ORDER AND OUTREC                                     
//*------------------------------------------------------------------           
//STEP100  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.SERS,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13F824,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    OUTREC FIELDS=(1,17,233X)                                                   
//*******************************************************************           
//* SORT IN NRIC ORDER                                                          
//*------------------------------------------------------------------           
//STEP110  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F824,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F824SORT,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(9,9,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* MATCH DEBARMENT MASTER TO EXTRACT ONLY VALID REASON CODE                    
//*------------------------------------------------------------------           
//STEP120  EXEC PGM=BP13C919,COND=(0,NE)                                        
//BP13F824 DD DSN=&&F824SORT,DISP=(OLD,DELETE)                                  
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//OUTF824  DD DSN=&&F824DEBR,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* ACCUM FILE FOR BACKUP - ONLINE PRINTING                                     
//*--------------------------------------------------------------------         
//STEP130  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=BP13.F824.DEBAR.SERS,DISP=OLD                                 
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*******************************************************************           
//* SORT OUT DEBARMENT CODE 33, 71 AND 77 CASES                                 
//*------------------------------------------------------------------           
//STEP140  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F824DEB3,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A,221,2,A),FORMAT=CH                                       
    INCLUDE COND=(221,2,CH,EQ,C'33',OR,                                         
                  221,2,CH,EQ,C'71',OR,                                         
                  221,2,CH,EQ,C'77')                                            
    SUM FIELDS=NONE                                                             
//*******************************************************************           
//* SORT OUT DEBARMENT CODE 33 TO F730 FORMAT                                   
//*------------------------------------------------------------------           
//STEP150  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEB3,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F824DEB1,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'33')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*******************************************************************           
//* SORT OUT DEBARMENT BY REGNO                                                 
//*------------------------------------------------------------------           
//STEP160  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEB1,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 33 CASES FROM VSAM FILE                        
//*------------------------------------------------------------------           
//STEP170  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ.SERS,DISP=SHR                              
//BP13F730 DD DSN=&&F730C33,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 33 CASES FOR DAILY REPORT                           
//* DEBARMENT CODE 33 = Y - COL 7                                               
//*------------------------------------------------------------------           
//STEP180  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730C33,DISP=(SHR,DELETE)                                   
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,6,C'Y',8,493)                                              
//*******************************************************************           
//* SORT OUT DEBARMENT CODE 71 TO F730 FORMAT                                   
//*------------------------------------------------------------------           
//STEP190  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEB3,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'71')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 71 CASES FROM VSAM FILE                        
//*------------------------------------------------------------------           
//STEP200  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ.SERS,DISP=SHR                              
//BP13F730 DD DSN=&&F730C71,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 71 CASES FOR DAILY REPORT                           
//* DEBARMENT CODE 71 = Y - COL 8                                               
//*------------------------------------------------------------------           
//STEP210  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730C71,DISP=(SHR,DELETE)                                   
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,7,C'Y',9,492)                                              
//*******************************************************************           
//* SORT OUT DEBARMENT CODE 77 TO F730 FORMAT                                   
//*------------------------------------------------------------------           
//STEP220  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEB3,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'77')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 77 CASES FROM VSAM FILE                        
//*------------------------------------------------------------------           
//STEP230  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ.SERS,DISP=SHR                              
//BP13F730 DD DSN=&&F730C77,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 77 CASES FOR DAILY REPORT                           
//* DEBARMENT CODE 77 = Y - COL 9                                               
//*------------------------------------------------------------------           
//STEP240  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730C77,DISP=(SHR,DELETE)                                   
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,8,C'Y',10,491)                                             
//*****************************************************************             
//* SORT OCCUPIERS IN NRIC SEQUENCE TO MATCH PPO                                
//*****************************************************************             
//STEP250  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.K825.REQOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP17F825,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(30,20),RLSE),UNIT=SYSDA                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(9,9,A),FORMAT=CH                                              
     INCLUDE COND=(131,1,CH,EQ,C'Y')                                            
//*---------------------------------------------------------------------        
//* MATCH ALL RECORDS WITH PPO FILES                                            
//*       WILL UPDATE PPO TAG INTO BP13K740                                     
//*---------------------------------------------------------------------        
//STEP260  EXEC PGM=BP13C177,COND=(0,NE)                                        
//BP13F825 DD DSN=&&BP17F825,DISP=(SHR,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ.SERS,DISP=SHR                              
//BR10K010 DD DSN=BR10.K010.PTEPPTY,DISP=SHR                                    
//BR10K080 DD DSN=BR10.K080.PTEPPTY.HIST,DISP=SHR                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* COMPARE DAILY FILE WITH ACCUMULATED VSAM FILE.                              
//* SORT OUT ONLY CASES IN THE DAILY FILE                                       
//*------------------------------------------------------------------           
//STEP280  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K730 DD DSN=BP13.K730.MATURERQ.SERS,DISP=SHR                              
//BP13F730 DD DSN=&&F730PPO,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT PPO CASES AND                                                      
//* PPO TAG = Y - COL 3                                                         
//*------------------------------------------------------------------           
//STEP290  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730PPO,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(347,1,CH,EQ,C'Y')                                             
    OUTREC FIELDS=(1,2,C'Y',4,497)                                              
//*****************************************************************             
//* SORT OUT BTO CASES FROM F558.UPGOCCP.PARENT                                 
//* OUTPUT PARENT CHILD FROM BP13A812                                           
//*****************************************************************             
//STEP300  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.PARENT.SERS,DISP=SHR                        
//SORTOUT  DD DSN=&&F558PC,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     OUTREC FIELDS=(1,313,C'PC',316,285)                                        
//*****************************************************************             
//* TO MATCH AND OUTPUT 'Y' IF P/C RELATIONSHIP IS FOUND                        
//* COL 13 = 'Y' IF P/C IS FOUND                                                
//*****************************************************************             
//STEP310  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558PC,DISP=(OLD,DELETE)                                    
//P13F730A DD DSN=&&F730PC,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT PC CASES FOR DAILY REPORT                                          
//* PC NOT = SPACE - COL 13                                                     
//*------------------------------------------------------------------           
//STEP320  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730PC,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(13,1,CH,EQ,C'Y')                                              
//*****************************************************************             
//* SORT OUT BP13.F558.UPGOCCP.SERS                                             
//* OUTPUT WHEN SMS HDBREF NOT SPACES AND SALES TYPE = ' '                      
//*****************************************************************             
//STEP330  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.SERS,DISP=SHR                               
//SORTOUT  DD DSN=&&F558SB,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(61,1,CH,EQ,C' ',AND,                                         
                  101,11,CH,NE,C' ')                                            
     OUTREC FIELDS=(1,313,C'SB',316,285)                                        
//*----------------------------------------------------------------             
//* COL 14 = 'Y' IF SMS SALE TYPE = BLANK                                       
//*----------------------------------------------------------------             
//STEP340  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558SB,DISP=(SHR,PASS)                                      
//P13F730A DD DSN=&&F730SB,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT SALE TYPE = BLANK CASES FOR DAILY REPORT                           
//* SMS SALE TYPE = BLANK - COL 14                                              
//*------------------------------------------------------------------           
//STEP350  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730SB,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(14,1,CH,EQ,C'Y')                                              
//*****************************************************************             
//* SORT OUT BP13.F558.UPGOCCP.SERS                                             
//* OUTPUT WHEN SALES TYPE = '7' AND LESSEE CODE='01'                           
//*****************************************************************             
//STEP360  EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F558.UPGOCCP.SERS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558S7,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(61,1,CH,EQ,C'7',AND,110,2,CH,EQ,C'01')                         
   OUTREC FIELDS=(1,313,C'S7',316,285)                                          
//*****************************************************************             
//* TO MATCH AND OUTPUT 'Y' SMS SALE TYPE = 7 AND LESSEE CODE = 01 FND          
//* COL 15 = 'Y' IF SMS SALE TYPE = 7 AND LESSEE CODE = 01                      
//*****************************************************************             
//STEP370  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558S7,DISP=(OLD,DELETE)                                    
//P13F730A DD DSN=&&F730S7,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT SALE TYPE = 7, LESSEE CODE = 01 CASES FOR DAILY REPORT             
//* SMS SALE TYPE = 7 AND LESSEE CODE = 01 - COL 15                             
//*------------------------------------------------------------------           
//STEP380  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730S7,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(15,1,CH,EQ,C'Y')                                              
//*---------------------------------------------------------------------        
//* SORT OUT WITH HH=H AND DEBAR = Z*                                           
//* FROM BP13A812                                                               
//*---------------------------------------------------------------------        
//STEP390  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.LONA.SERS,DISP=SHR                          
//SORTOUT  DD DSN=&&F558HZ,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   OUTREC FIELDS=(1,313,C'HZ',316,285)                                          
//*****************************************************************             
//* TO MATCH AND OUTPUT 'Y' HH=H AND DEBAR = Z* FND                             
//* COL 17 = 'Y' IF HH=H AND DEBAR = Z*                                         
//*****************************************************************             
//STEP400  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558HZ,DISP=(OLD,DELETE)                                    
//P13F730A DD DSN=&&F730HZ,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT HH=H AND DEBAR = Z* FOR DAILY REPORT                               
//* HH=H AND DEBAR = Z* - COL 17                                                
//*------------------------------------------------------------------           
//STEP410  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730HZ,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(17,1,CH,EQ,C'Y')                                              
//*****************************************************************             
//* SORT OUT BP13.F716.A534Q748.SERS                                            
//* OUTPUT WHEN SCHEME ACCOUNT IS SOLD FLAT                                     
//*  CHECK FOR ADMINSTRATOR SPOUSE                                              
//*****************************************************************             
//STEP420  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.A534Q748.SERS,DISP=OLD                              
//SORTOUT  DD DSN=&&F716DIVR,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(150,30),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(51,9,CH,GE,C'700000000')                                       
//*---------------------------------------------------------------------        
//* SORT OUT ONLY SALES FLATS IN NRIC/SCH-ACC-NO SEQUENCE                       
//* 2= OCCUP                                                                    
//* 4= TRUST                                                                    
//* 5= O-TRUST                                                                  
//* RELATIONSHIP = 20(SPUSE), 02(FATHER), 12(MOTHER), 16(PARENT)                
//*---------------------------------------------------------------------        
//STEP430  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716DIVR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558WIDO,DISP=(,PASS),                                      
//            DCB=(LRECL=600,RECFM=FB),                                         
//            SPACE=(CYL,(150,30),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=((89,1,CH,EQ,C'4',OR,                                           
                  89,1,CH,EQ,C'5'),AND,                                         
                 (99,2,CH,EQ,C'20',OR,99,2,CH,EQ,C'02',OR,                      
                  99,2,CH,EQ,C'12',OR,99,2,CH,EQ,C'16'))                        
   OUTREC FIELDS=(1,17,296X,C'AS',284X)                                         
//*****************************************************************             
//* TO MATCH AND OUTPUT 'Y' ADMINSTRATOR SPOUSE FND                             
//* COL 17 = 'Y' IF ADMINSTRATOR SPOUSE                                         
//*****************************************************************             
//STEP440  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558WIDO,DISP=(OLD,DELETE)                                  
//P13F730A DD DSN=&&F730AS,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT ADMINSTRATOR SPOUSE FOR DAILY REPORT                               
//* SORT OUT ONLY HHTY = 'H' OR 'T'                                             
//* ADMINSTRATOR SPOUSE - COL 16                                                
//*------------------------------------------------------------------           
//STEP450  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730AS,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(16,1,CH,EQ,C'Y',AND,                                          
                  116,1,CH,NE,C'G')                                             
//*****************************************************************             
//* SORT OUT BTO CASES FROM F558                                                
//*****************************************************************             
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.SERS,DISP=SHR                               
//SORTOUT  DD DSN=&&F558,DISP=(NEW,PASS),                                       
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     OUTREC FIELDS=(1,313,C'DB',316,285)                                        
//*****************************************************************             
//* TO MATCH AND OUTPUT 'Y' IF SLS, MAMS OR TRSF FOUND                          
//* COL 10 = 'Y' IF TRSF HDB-REF FOUND                                          
//* COL 11 = 'Y' IF SLS HDB-REF FOUND                                           
//* COL 12 = 'Y' IF MAMS HDB-REF FOUND                                          
//*****************************************************************             
//STEP31   EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558,DISP=(OLD,DELETE)                                      
//P13F730A DD DSN=&&P13F730S,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT TRF CASES FOR DAILY REPORT                                         
//* TRF HDB-REF NOT = SPACE - COL 10                                            
//* SLS HDB-REF NOT = SPACE - COL 11                                            
//* MAMS HDB-REF NOT = SPACE - COL 12                                           
//*------------------------------------------------------------------           
//STEP32   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F730S,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(10,1,CH,EQ,C'Y',OR,                                           
                  11,1,CH,EQ,C'Y',OR,                                           
                  12,1,CH,EQ,C'Y')                                              
//*******************************************************************           
//* SORT OUT 10-YR = N CASES FOR DAILY REPORT                                   
//* 10-YR = N - COL 1                                                           
//*------------------------------------------------------------------           
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(175,1,CH,EQ,C'N')                                             
    OUTREC FIELDS=(C'N',2,499)                                                  
//*******************************************************************           
//* SORT OUT PREMIUM CASES                                                      
//*------------------------------------------------------------------           
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.REPORT.SERS,DISP=MOD                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(389,2,CH,NE,C'  ')                                            
    OUTREC FIELDS=(1,3,389,2,6,495)                                             
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES ACCORDING TO REGN NO                           
//*------------------------------------------------------------------           
//STEP460  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.REPORT.SERS,DISP=SHR                                
//SORTOUT  DD DSN=&&F730FULL,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*------------------------------------------------------------------           
//* MERGE SIMILAR REF NO TOGETHER                                               
//*------------------------------------------------------------------           
//STEP470  EXEC PGM=BP13C165,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730FULL,DISP=(OLD,DELETE)                                  
//P13F730A DD DSN=BP13.F730.REPORT.SERS.ALL,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//******************************************************************            
//* PRINT DAILY REPORT FOR BTO - INTERNET CASES                                 
//******************************************************************            
//STEP480  EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//BP13F730  DD DSN=BP13.F730.REPORT.SERS.ALL,DISP=SHR                           
//BP13L166  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S166),DISP=SHR                            
//SYSOUT    DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
