//BP13D206 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*--------------------------------------------------------------------         
//* CHG NO   BY   ON     - DESCRIPTION                                          
//* ----------------------------------                                          
//* BP132278 JF4  030328 - CHGE BP13F230/F240 LRECL TO 450.                     
//* BP132546 YCH  110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                
//* BP133392 LMS  280708 - ADD JOBS BP13A270 AND BP13A271                       
//* BP134253 DW5  050711 - REMOVE READING OF BP13F222 FROM BP13A202 AND         
//*                       BP13A211                                              
//* BP134411 DW5  250112 - ADD VERIFY TO BP13KH30 AND BP13KH40                  
//* BP134621 ESA1 150912 - CATER FOR NEW BP13K247 LAYOUT                        
//* BP134751 EL27 171212 - EXPAND S14 BACKUP FILES SIZE                         
//* BP134769 SMR2 040313 - REMOVE BP13A202 AND BP13A211                         
//* BP134853 ESA1 150513 - ADD BP13K255 & BM06K510 TO BP13C21N                  
//* BP135135 ESA1 141113 - CATER FOR NEW BP13K240 LAYOUT WITH BONUS             
//* BP13**** EL27 251113 - INCREASE SIZE FOR K230 TAPE BACKUP                   
//* BP135281 ESA1 070414 - CATER FOR BONUS TAG                                  
//* BP13XXXX EL27 140514 - MOVE K230 K240 K249 BACKUP STEPS                     
//*                        .DAILY FILES - BEFORE D206                           
//*                        .BACKUP FILES - AFTER D206                           
//*                      - REMOVE CREATION OF K249 FROM K762 AND K769           
//* BP13XXXX EL27 270614 - ADD VFY FOR BP13.K255.START.END                      
//* BP135363 ESA1 120814 - REPLACE BP13K062 WITH BP13K813                       
//* BP13XXXX EL27 280716 - FIX K200 TEMP DATA SIZE WITH UNIT=(SYSDA,10)         
//* BP138734 MRR5 070721 - EXPAND OUTPUT SIZE FOR STEP201                       
//*--------------------------------------------------------------------         
//*********************************************************************         
//*BATCH UPDATE/DELETE FOR VSAM FILES BP13K222, BP13K230, BP13K240              
//*USING TRANSACTION FILES CREATED FROM PREVIOUS JOBS                           
//*********************************************************************         
//* JOBS     PROGRAM  TRANSACTION FILE     MODE       PROGRAM TO                
//*                                                (UPDATE/DELETE)              
//*********************************************************************         
//*BP13A203  BP13C244 BP13.F222.BP13A203         DELETE      BP13C204           
//*          BP13C234 BP13.F230.BP13A203         DELETE      BP13C211           
//*             "     BP13.F240.BP13A203         DELETE      BP13C216           
//*BP13A204  BP13C247 BP13.F230.BP13A204         UPDATE      IDCAMS             
//*             "     BP13.F222.BP13A204.DELETE  DELETE      BP13C204           
//*             "     BP13.F222.BP13A204.WRITE   WRITE       IDCAMS             
//*             "     BP13.F240.BP13A204.DELETE  DELETE      BP13C216           
//*             "     BP13.F240.BP13A204.WRITE   WRITE       IDCAMS             
//*BP13A221  BP13C234 BP13.F230.BP13A221         DELETE      BP13C211           
//*             "     BP13.F240.BP13A221         DELETE      BP13C216           
//*BP13A224  BP13C227 BP13.F230.BP13A224         UPDATE      IDCAMS             
//*BP13A216  BP13C296 BP13.F222.BP13A216         UPDATE      IDCAMS             
//*          BP13C227 BP13.F230.BP13A216         UPDATE      IDCAMS             
//*          BP13C227 BP13.F230.BP13D216         UPDATE      IDCAMS             
//*BP13A227  BP13C248 BP13.F222.BP13A227         UPDATE      IDCAMS             
//*          BP13C227 BP13.F230.BP13A227         UPDATE      IDCAMS             
//*BP13A230  BP13C244 BP13.F222.BP13A230         DELETE      BP13C204           
//*          BP13C234 BP13.F230.BP13A230         DELETE      BP13C211           
//*             "     BP13.F240.BP13A230         DELETE      BP13C216           
//*BP13A232  BP13C244 BP13.F222.BP13A232         DELETE      BP13C204           
//*          BP13C234 BP13.F230.BP13A232         DELETE      BP13C211           
//*             "     BP13.F240.BP13A232         DELETE      BP13C216           
//*BP13A240  BP13C227 BP13.F230.BP13A240         UPDATE      IDCAMS             
//*BP13A270  BP13C248 BP13.F222.BP13A270         UPDATE      IDCAMS             
//*BP13A271  BP13C248 BP13.F222.BP13A271         UPDATE      IDCAMS             
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K205.CTLREC,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K222.SUMALLOC,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K230.FLATLIST,DISP=OLD                                   
//INPUT4   DD DSN=BP13.K240.HEADFLAT,DISP=OLD                                   
//INPUT5   DD DSN=BP13.K247.SUMMARY,DISP=OLD                                    
//INPUT6   DD DSN=BP13.K295.FLATLOG,DISP=OLD                                    
//INPUT7   DD DSN=BP13.K24A.HEADFLAT,DISP=OLD                                   
//INPUT8   DD DSN=BP13.KH30.SUPPLY,DISP=OLD                                     
//INPUT9   DD DSN=BP13.KH40.ESUPPLY,DISP=OLD                                    
//INPUT10  DD DSN=BP13.K255.START.END,DISP=OLD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
          VFY FILE(INPUT10)                                                     
          IF LASTCC=12 THEN                                                     
             DO                                                                 
                SET MAXCC=0                                                     
                VFY FILE(INPUT1)                                                
                VFY FILE(INPUT2)                                                
                VFY FILE(INPUT3)                                                
                VFY FILE(INPUT4)                                                
                VFY FILE(INPUT5)                                                
                VFY FILE(INPUT6)                                                
                VFY FILE(INPUT7)                                                
                VFY FILE(INPUT8)                                                
                VFY FILE(INPUT9)                                                
                VFY FILE(INPUT10)                                               
             END                                                                
/*                                                                              
//*----------------------------------------------------------------*            
//*         TO CREATE VSAM FILE BP13K205 CONTROL REC               *            
//*----------------------------------------------------------------*            
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE),REGION=4096K                             
//SYSPRINT DD   SYSOUT=*                                                        
//INPUT    DD   DSN=BP13.BLANK.CHAR80,DISP=SHR                                  
//SYSIN    DD   *                                                               
           DEL (BP13.K205.CTLREC) CL PURGE                                      
           DEF CLUSTER                                     -                    
               (NAME(BP13.K205.CTLREC)                     -                    
                TRK(1 1)                                   -                    
                STORCLAS(PRODRLS)                          -                    
                LOG(NONE)                                  -                    
                UNIQUE                                     -                    
                SHR(2 3))                                  -                    
               DATA                                        -                    
               (NAME(BP13.K205.CTLREC.DATA)                -                    
                KEYS(15 0)                                 -                    
                RECSZ(80 80)                               -                    
                CISZ(4096)                                 -                    
                FSPC(10 10))                               -                    
               INDEX                                       -                    
               (NAME(BP13.K205.CTLREC.INDEX)               -                    
                CISZ(4096))                                                     
           IF MAXCC = 0  THEN                              -                    
              REPRO IFILE(INPUT)                           -                    
              ODS(BP13.K205.CTLREC)                                             
         IF MAXCC = 0 THEN                        -                             
           DEF AIX (NAME(BP13.K205.CTLREC.ALTX1)  -                             
               REL(BP13.K205.CTLREC)              -                             
               TRK(1 1)                           -                             
               UNIQUE                             -                             
               SHR(2 3))                          -                             
               DATA                               -                             
               (NAME(BP13.K205.CTLREC.ALTX1.DATA) -                             
               KEYS(2 13)                         -                             
               CISZ(4096)                         -                             
               RECSZ(157 2260)                    -                             
               NUNQK)                                                           
         IF MAXCC = 0 THEN                        -                             
           DEF PATH(NAME(BP13.K205.CTLREC.PATH1)  -                             
               PENT(BP13.K205.CTLREC.ALTX1))                                    
         IF MAXCC = 0 THEN                        -                             
           BIX IDS(BP13.K205.CTLREC)              -                             
               ODS(BP13.K205.CTLREC.ALTX1)                                      
//*-----------------------------------------------------------------            
//* SORT BKAPPMT SEQ FILE BY NT, FT, REGN-NO AND DTE-BKAPPMT                    
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(TRK,(150,20),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=300,BLKSIZE=23400)                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(9,5,A,1,8,A,38,8,A),FORMAT=CH                                    
  OMIT COND=(1,21,CH,EQ,C'                     ')                               
/*                                                                              
//*-----------------------------------------------------------------            
//* UPDATE SUMMARY ALLOCATION RESULT                                            
//*-----------------------------------------------------------------            
//STEP02 EXEC    PGM=BP13C243,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S2     EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F222.BP13A203) ALL                                            
   LISTC ENT(BP13.F230.BP13A203) ALL                                            
   LISTC ENT(BP13.F240.BP13A203) ALL                                            
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S4     EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F230.BP13A221) ALL                                            
   LISTC ENT(BP13.F240.BP13A221) ALL                                            
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S5     EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F230.BP13A224) ALL                                            
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S6     EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F222.BP13A204.DELETE) ALL                                     
   LISTC ENT(BP13.F222.BP13A204.WRITE) ALL                                      
   LISTC ENT(BP13.F230.BP13A204) ALL                                            
   LISTC ENT(BP13.F240.BP13A204.DELETE) ALL                                     
   LISTC ENT(BP13.F240.BP13A204.WRITE) ALL                                      
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S7     EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F222.BP13A216) ALL                                            
   LISTC ENT(BP13.F230.BP13A216) ALL                                            
   LISTC ENT(BP13.F230.BP13D216) ALL                                            
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S8     EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F222.BP13A227) ALL                                            
   LISTC ENT(BP13.F230.BP13A227) ALL                                            
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S9     EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F222.BP13A230) ALL                                            
   LISTC ENT(BP13.F230.BP13A230) ALL                                            
   LISTC ENT(BP13.F240.BP13A230) ALL                                            
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S10    EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F222.BP13A232) ALL                                            
   LISTC ENT(BP13.F230.BP13A232) ALL                                            
   LISTC ENT(BP13.F240.BP13A232) ALL                                            
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S11    EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F230.BP13A240) ALL                                            
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S12    EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F222.BP13A270) ALL                                            
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S13    EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F222.BP13A271) ALL                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* BACKUP FILE BEFORE UPDATE (K230 K240 K249, DONE IN BP13DBK3)                
//*---------------------------------------------------------------------        
//S14    EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT1  DD  DSN=BP13.F222.SUMALLOC.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             SPACE=(TRK,(20,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                  
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//IFTEST2 IF (S2.RC = 0) THEN                                                   
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K222 BASED FROM OUTPUT OF BP13C244                      
//*---------------------------------------------------------------------        
//A203S1 EXEC    PGM=BP13C204                                                   
//BP13F222 DD  DSN=BP13.F222.BP13A203,                                          
//             DISP=SHR                                                         
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=23')                                                 
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K230 BASED ON F230                                      
//*---------------------------------------------------------------------        
//A203S2 EXEC    PGM=BP13C211                                                   
//BP13F230 DD  DSN=BP13.F230.BP13A203,                                          
//             DISP=SHR                                                         
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* MOD RECORDS TO BP13F249                                                     
//*---------------------------------------------------------------------        
//A202S2A EXEC    SORT                                                          
//SORTIN   DD  DSN=BP13.F240.BP13A203,                                          
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BP13.F240.BP13K249.DEL,                                      
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    INCLUDE COND=(5,2,CH,EQ,C'01')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K240 BASED ON F240                                      
//*---------------------------------------------------------------------        
//A203S3 EXEC    PGM=BP13C216                                                   
//BP13F240 DD  DSN=BP13.F240.BP13A203,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K24A BASED ON F240                                      
//*---------------------------------------------------------------------        
//A203S3A EXEC    PGM=BP13C216                                                  
//BP13F240 DD  DSN=BP13.F240.BP13A203,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K24A.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//ENDTEST2  ENDIF                                                               
/*                                                                              
//IFTEST4 IF (S4.RC = 0) THEN                                                   
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K230 BASED ON F230                                      
//*---------------------------------------------------------------------        
//A221S1 EXEC    PGM=BP13C211                                                   
//BP13F230 DD  DSN=BP13.F230.BP13A221,                                          
//             DISP=SHR                                                         
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* MOD RECORDS TO BP13F249                                                     
//*---------------------------------------------------------------------        
//A221S1A EXEC    SORT                                                          
//SORTIN   DD  DSN=BP13.F240.BP13A221,                                          
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BP13.F240.BP13K249.DEL,                                      
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    INCLUDE COND=(5,2,CH,EQ,C'01')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K240 BASED ON F240                                      
//*---------------------------------------------------------------------        
//A221S2 EXEC    PGM=BP13C216                                                   
//BP13F240 DD  DSN=BP13.F240.BP13A221,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K24A BASED ON F240                                      
//*---------------------------------------------------------------------        
//A221S2A EXEC    PGM=BP13C216                                                  
//BP13F240 DD  DSN=BP13.F240.BP13A221,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K24A.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//ENDTEST4  ENDIF                                                               
/*                                                                              
//IFTEST5 IF (S5.RC = 0) THEN                                                   
//*---------------------------------------------------------------------        
//* TO SORT OUT DETAIL RECORDS                                                  
//*---------------------------------------------------------------------        
//A224S1 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F230.BP13A224,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F230D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(64,11,A),FORMAT=CH                                             
    INCLUDE COND=(5,2,CH,EQ,C'02')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE DETAIL RECORDS TO BP13.K230.FLATLIST                         
//*---------------------------------------------------------------------        
//A224S2 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&P13F230D,                                                  
//             DISP=(SHR,DELETE)                                                
//OUTPUT1  DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT FLATLIST IN SCH-ACC-NO ORDER                                           
//* BP13F230 - THIS ROUND FLAT LIST                                             
//* BP13K240 - ACCUMULATED HEAD FLAT                                            
//*---------------------------------------------------------------------        
//A224S3 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F230.BP13A224,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F240D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    OMIT COND=(5,2,CH,EQ,C'02',OR,5,10,CH,EQ,C'          ')                     
/*                                                                              
//*---------------------------------------------------------------------        
//* MOD RECORDS TO BP13F249                                                     
//*---------------------------------------------------------------------        
//A224S3A EXEC    SORT                                                          
//SORTIN   DD  DSN=&&P13F240D,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BP13.F240.BP13K249.ADD,                                      
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    INCLUDE COND=(5,2,CH,EQ,C'01')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE HEADER RECORDS TO BP13.K240.HEADFLAT                         
//*---------------------------------------------------------------------        
//A224S4 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&P13F240D,                                                  
//             DISP=(SHR,DELETE)                                                
//OUTPUT1  DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//ENDTEST5  ENDIF                                                               
/*                                                                              
//IFTEST6 IF (S6.RC = 0) THEN                                                   
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K222 BASED FROM OUTPUT OF BP13C247                      
//*---------------------------------------------------------------------        
//A204S1 EXEC    PGM=BP13C204                                                   
//BP13F222 DD  DSN=BP13.F222.BP13A204.DELETE,                                   
//             DISP=SHR                                                         
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=23')                                                 
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT SUMALLOC IN KEY FLD ORDER                                              
//*---------------------------------------------------------------------        
//A204S2 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F222.BP13A204.WRITE,                                    
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&A204F222,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,13,A),FORMAT=CH                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE SUMMARY ALLOCATION FILE                                              
//*---------------------------------------------------------------------        
//A204S3 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A204F222,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* MOD RECORDS TO BP13F249                                                     
//*---------------------------------------------------------------------        
//A204S3A EXEC    SORT                                                          
//SORTIN   DD  DSN=BP13.F240.BP13A204.DELETE,                                   
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BP13.F240.BP13K249.DEL,                                      
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    INCLUDE COND=(5,2,CH,EQ,C'01')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* DELETE BP13K240 FROM OUTPUT OF BP13C247                                     
//*---------------------------------------------------------------------        
//A204S4 EXEC    PGM=BP13C216                                                   
//BP13F240 DD  DSN=BP13.F240.BP13A204.DELETE,                                   
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=23')                                                 
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* DELETE BP13K24A FROM OUTPUT OF BP13C247                                     
//*---------------------------------------------------------------------        
//A204S4A EXEC    PGM=BP13C216                                                  
//BP13F240 DD  DSN=BP13.F240.BP13A204.DELETE,                                   
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K24A.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=23')                                                 
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT HEADFLAT IN KEY FLD ORDER                                              
//*---------------------------------------------------------------------        
//A204S5 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F240.BP13A204.WRITE,                                    
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&A204F240,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* MOD RECORDS TO BP13F249                                                     
//*---------------------------------------------------------------------        
//A204S5A EXEC    SORT                                                          
//SORTIN   DD  DSN=&&A204F240,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BP13.F240.BP13K249.ADD,                                      
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    INCLUDE COND=(5,2,CH,EQ,C'01')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE BP13K240 FILE                                                        
//*---------------------------------------------------------------------        
//A204S6 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A204F240,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE BP13K24A FILE                                                        
//*---------------------------------------------------------------------        
//A204S6A EXEC    PGM=IDCAMS                                                    
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A204F240,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K24A.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT HEADFLAT IN KEY FLD ORDER                                              
//*---------------------------------------------------------------------        
//A204S7 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F230.BP13A204,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&A204F230,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(64,11,A),FORMAT=CH                                             
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE BP13K230 FILE                                                        
//*---------------------------------------------------------------------        
//A204S8 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A204F230,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//ENDTEST6  ENDIF                                                               
/*                                                                              
//IFTEST7 IF (S7.RC = 0) THEN                                                   
//*---------------------------------------------------------------------        
//* TO SORT OUT DETAIL RECORDS                                                  
//*---------------------------------------------------------------------        
//A216S1 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F230.BP13A216,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F230E,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(64,11,A),FORMAT=CH                                             
    INCLUDE COND=(5,2,CH,EQ,C'02')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE DETAIL RECORDS TO BP13.K230.FLATLIST                         
//*---------------------------------------------------------------------        
//A216S2 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&P13F230E,                                                  
//             DISP=(SHR,DELETE)                                                
//OUTPUT1  DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT FLATLIST IN SCH-ACC-NO ORDER                                           
//* BP13F230 - THIS ROUND FLAT LIST                                             
//* BP13K240 - ACCUMULATED HEAD FLAT                                            
//*---------------------------------------------------------------------        
//A216S3 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F230.BP13A216,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F240E,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    OMIT COND=(5,2,CH,EQ,C'02',OR,5,10,CH,EQ,C'          ')                     
/*                                                                              
//*---------------------------------------------------------------------        
//* MOD RECORDS TO BP13F249                                                     
//*---------------------------------------------------------------------        
//A216S3A EXEC    SORT                                                          
//SORTIN   DD  DSN=&&P13F240E,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BP13.F240.BP13K249.ADD,                                      
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    INCLUDE COND=(5,2,CH,EQ,C'01')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE HEADER RECORDS TO BP13.K240.HEADFLAT                         
//*---------------------------------------------------------------------        
//A216S4 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&P13F240E,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE HEADER RECORDS TO BP13.K24A.HEADFLAT                         
//*---------------------------------------------------------------------        
//A216S4A EXEC    PGM=IDCAMS                                                    
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&P13F240E,                                                  
//             DISP=(SHR,DELETE)                                                
//OUTPUT1  DD  DSN=BP13.K24A.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT SUMALLOC IN KEY FLD ORDER                                              
//*---------------------------------------------------------------------        
//A216S5 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F222.BP13A216,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&A216F222,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,13,A),FORMAT=CH                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE SUMMARY ALLOCATION FILE                                              
//*---------------------------------------------------------------------        
//A216S6 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A216F222,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//ENDTEST7  ENDIF                                                               
/*                                                                              
//IFTEST8 IF (S8.RC = 0) THEN                                                   
//*---------------------------------------------------------------------        
//* TO SORT OUT DETAIL RECORDS                                                  
//*---------------------------------------------------------------------        
//A227S1 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F230.BP13A227,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&A227F230,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(64,11,A),FORMAT=CH                                             
    INCLUDE COND=(5,2,CH,EQ,C'02')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE DETAIL RECORDS TO BP13.K230.FLATLIST                         
//*---------------------------------------------------------------------        
//A227S2 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A227F230,                                                  
//             DISP=(SHR,DELETE)                                                
//OUTPUT1  DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT FLATLIST IN SCH-ACC-NO ORDER                                           
//* BP13F230 - THIS ROUND FLAT LIST                                             
//* BP13K240 - ACCUMULATED HEAD FLAT                                            
//*---------------------------------------------------------------------        
//A227S3 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F230.BP13A227,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&A227F240,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    OMIT COND=(5,2,CH,EQ,C'02',OR,5,10,CH,EQ,C'          ')                     
/*                                                                              
//*---------------------------------------------------------------------        
//* MOD RECORDS TO BP13F249                                                     
//*---------------------------------------------------------------------        
//A227S3A EXEC    SORT                                                          
//SORTIN   DD  DSN=&&A227F240,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BP13.F240.BP13K249.ADD,                                      
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    INCLUDE COND=(5,2,CH,EQ,C'01')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE HEADER RECORDS TO BP13.K240.HEADFLAT                         
//*---------------------------------------------------------------------        
//A227S4 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A227F240,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE HEADER RECORDS TO BP13.K24A.HEADFLAT                         
//*---------------------------------------------------------------------        
//A227S4A EXEC    PGM=IDCAMS                                                    
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A227F240,                                                  
//             DISP=(SHR,DELETE)                                                
//OUTPUT1  DD  DSN=BP13.K24A.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT SUMALLOC IN KEY FLD ORDER                                              
//*---------------------------------------------------------------------        
//A227S5 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F222.BP13A227,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&A227F222,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,13,A),FORMAT=CH                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE SUMMARY ALLOCATION FILE                                              
//*---------------------------------------------------------------------        
//A227S6 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A227F222,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//ENDTEST8  ENDIF                                                               
/*                                                                              
//IFTEST9 IF (S9.RC = 0) THEN                                                   
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K222 BASED FROM OUTPUT OF BP13C244                      
//*---------------------------------------------------------------------        
//A230S1 EXEC    PGM=BP13C204                                                   
//BP13F222 DD  DSN=BP13.F222.BP13A230,                                          
//             DISP=SHR                                                         
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=23')                                                 
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K230 BASED ON F230                                      
//*---------------------------------------------------------------------        
//A230S2 EXEC    PGM=BP13C211                                                   
//BP13F230 DD  DSN=BP13.F230.BP13A230,                                          
//             DISP=SHR                                                         
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* MOD RECORDS TO BP13F249                                                     
//*---------------------------------------------------------------------        
//A230S2A EXEC    SORT                                                          
//SORTIN   DD  DSN=BP13.F240.BP13A230,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F240.BP13K249.DEL,                                      
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    INCLUDE COND=(5,2,CH,EQ,C'01')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K240 BASED ON F240                                      
//*---------------------------------------------------------------------        
//A230S3 EXEC    PGM=BP13C216                                                   
//BP13F240 DD  DSN=BP13.F240.BP13A230,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K24A BASED ON F240                                      
//*---------------------------------------------------------------------        
//A230S3A EXEC    PGM=BP13C216                                                  
//BP13F240 DD  DSN=BP13.F240.BP13A230,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K24A.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//ENDTEST9  ENDIF                                                               
/*                                                                              
//IFTESTA IF (S10.RC = 0) THEN                                                  
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K222 BASED FROM OUTPUT OF BP13C244                      
//*---------------------------------------------------------------------        
//A232S1 EXEC    PGM=BP13C204                                                   
//BP13F222 DD  DSN=BP13.F222.BP13A232,                                          
//             DISP=SHR                                                         
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=23')                                                 
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K230 BASED ON F230                                      
//*---------------------------------------------------------------------        
//A232S2 EXEC    PGM=BP13C211                                                   
//BP13F230 DD  DSN=BP13.F230.BP13A232,                                          
//             DISP=SHR                                                         
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* MOD RECORDS TO BP13F249                                                     
//*---------------------------------------------------------------------        
//A232S2A EXEC    SORT                                                          
//SORTIN   DD  DSN=BP13.F240.BP13A232,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F240.BP13K249.DEL,                                      
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    INCLUDE COND=(5,2,CH,EQ,C'01')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K240 BASED ON F240                                      
//*---------------------------------------------------------------------        
//A232S3 EXEC    PGM=BP13C216                                                   
//BP13F240 DD  DSN=BP13.F240.BP13A232,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE RECS FROM K24A BASED ON F240                                      
//*---------------------------------------------------------------------        
//A232S3A EXEC    PGM=BP13C216                                                  
//BP13F240 DD  DSN=BP13.F240.BP13A232,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K24A.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//ENDTESTA  ENDIF                                                               
/*                                                                              
//IFTESTB IF (S11.RC = 0) THEN                                                  
//*---------------------------------------------------------------------        
//* TO SORT OUT DETAIL RECORDS                                                  
//*---------------------------------------------------------------------        
//A240S1 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F230.BP13A240,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F230F,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(64,11,A),FORMAT=CH                                             
    INCLUDE COND=(5,2,CH,EQ,C'02')                                              
    SUM FIELDS=NONE                                                             
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE DETAIL RECORDS TO BP13.K230.FLATLIST                         
//*---------------------------------------------------------------------        
//A240S2 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&P13F230F,                                                  
//             DISP=(SHR,DELETE)                                                
//OUTPUT1  DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT FLATLIST IN SCH-ACC-NO ORDER                                           
//* BP13F230 - THIS ROUND FLAT LIST                                             
//* BP13K240 - ACCUMULATED HEAD FLAT                                            
//*---------------------------------------------------------------------        
//A240S3 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F230.BP13A240,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F240F,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    OMIT COND=(5,2,CH,EQ,C'02',OR,5,10,CH,EQ,C'          ')                     
    SUM FIELDS=NONE                                                             
/*                                                                              
//*---------------------------------------------------------------------        
//* MOD RECORDS TO BP13F249                                                     
//*---------------------------------------------------------------------        
//A240S3A EXEC    SORT                                                          
//SORTIN   DD  DSN=&&P13F240F,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BP13.F240.BP13K249.ADD,                                      
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    INCLUDE COND=(5,2,CH,EQ,C'01')                                              
    SUM FIELDS=NONE                                                             
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE HEADER RECORDS TO BP13.K240.HEADFLAT                         
//*---------------------------------------------------------------------        
//A240S4 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&P13F240F,                                                  
//             DISP=(SHR,DELETE)                                                
//OUTPUT1  DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//ENDTESTB  ENDIF                                                               
/*                                                                              
//IFTESTC IF (S12.RC = 0) THEN                                                  
//*---------------------------------------------------------------------        
//* SORT SUMALLOC IN KEY FLD ORDER                                              
//*---------------------------------------------------------------------        
//A270S1 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F222.BP13A270,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&A270F222,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,13,A),FORMAT=CH                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE SUMMARY ALLOCATION FILE                                              
//*---------------------------------------------------------------------        
//A270S2 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A270F222,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//ENDTESTC  ENDIF                                                               
/*                                                                              
//IFTESTD IF (S13.RC = 0) THEN                                                  
//*---------------------------------------------------------------------        
//* SORT SUMALLOC IN KEY FLD ORDER                                              
//*---------------------------------------------------------------------        
//A271S1 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F222.BP13A271,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&A271F222,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,13,A),FORMAT=CH                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE SUMMARY ALLOCATION FILE                                              
//*---------------------------------------------------------------------        
//A271S2 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A271F222,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//ENDTESTD  ENDIF                                                               
/*                                                                              
//IFTESTE IF (S14.RC = 0) THEN                                                  
//*--------------------------------------------------------------------         
//* BACKUP FIS LOG FILE                                                         
//*--------------------------------------------------------------------         
//STEP96   EXEC SORT                                                            
//SORTIN   DD DSN=BP13.K240.HEADFLAT,DISP=SHR                                   
//SORTOUT  DD  DSN=&&BP13F247,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(131,42,A,7,8,A),FORMAT=CH                                        
  INCLUDE COND=(5,2,CH,EQ,C'01')                                                
  OUTREC FIELDS=(131,42,7,8,117,6,229,1,356,1,42X)                              
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* DEFINE LMS VSAM FILE                                                        
//*---------------------------------------------------------------------        
//STEP97 EXEC    PGM=IDCAMS                                                     
//INPUT1   DD  DSN=&&BP13F247,DISP=(SHR,PASS)                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL 'BP13.K247.SUMMARY' CLUSTER PURGE                                 
          DEF CLUSTER                                -                          
              (NAME(BP13.K247.SUMMARY)               -                          
              TRK(10 5)                              -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K247.SUMMARY.DATA) -                                   
              KEYS(57 0)                             -                          
              RECSZ(100 100)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K247.SUMMARY.INDEX) -                                  
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K247.SUMMARY)                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT FILE FOR DELETION                                                      
//*---------------------------------------------------------------------        
//STEP98  EXEC SORT                                                             
//SORTIN  DD DSN=BP13.F240.BP13K249.DEL,DISP=SHR                                
//SORTOUT DD DSN=&&P13F249D,                                                    
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=450,BLKSIZE=0)                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  SORT FIELDS=(357,39,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* DELETE RECORDS FROM K249                                                    
//*---------------------------------------------------------------------        
//STEP99  EXEC PGM=BP13C21G                                                     
//BP13F240  DD DSN=&&P13F249D,DISP=(SHR,PASS)                                   
//BP13K249  DD DSN=BP13.K249.NT.FT,DISP=OLD                                     
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* CREATE TEMP F249 FLAT FILE                                                  
//*--------------------------------------------------------------------         
//STEP100  EXEC SORT                                                            
//SORTIN   DD DSN=BP13.F240.BP13K249.ADD,DISP=SHR                               
//SORTOUT  DD  DSN=&&P13F249E,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=450,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(357,39,A),FORMAT=CH                                              
  INCLUDE COND=(5,2,CH,EQ,C'01')                                                
//*--------------------------------------------------------------------         
//* ADD RECORDS TO BP13K249                                                     
//*--------------------------------------------------------------------         
//STEP101  EXEC PGM=BP13C21N                                                    
//BP13F240 DD DSN=&&P13F249E,DISP=(SHR,DELETE)                                  
//BP13K249 DD DSN=BP13.K249.NT.FT,DISP=SHR                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K255 DD DSN=BP13.K255.START.END,DISP=SHR                                  
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BM06K511 DD DSN=BM06.K510.ESTCDE.PATH2,DISP=SHR                               
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------         
//* CREATE TEMP F249 FLAT FILE                                                  
//*--------------------------------------------------------------------         
//STEP100A EXEC SORT                                                            
//SORTIN   DD DSN=BP13.F240.BP13K249.ADD,DISP=SHR                               
//SORTOUT  DD  DSN=&&P13F249G,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=450,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(357,39,A),FORMAT=CH                                              
  INCLUDE COND=(5,2,CH,EQ,C'01',AND,108,3,CH,EQ,C'SBF',AND,                     
                (50,2,CH,EQ,C'05',OR,50,2,CH,EQ,C'06',OR,                       
                 50,1,CH,EQ,C'5',OR,50,1,CH,EQ,C'6'))                           
//*--------------------------------------------------------------------         
//* UPDATE RECORDS IN BP13K249                                                  
//*--------------------------------------------------------------------         
//STEP101A EXEC PGM=BP13C21O                                                    
//BP13F240 DD DSN=&&P13F249G,DISP=(SHR,DELETE)                                  
//BP13K246 DD DSN=BP13.K246.SBF.LOOKUP,DISP=SHR                                 
//BP13K249 DD DSN=BP13.K249.NT.FT,DISP=SHR                                      
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------         
//* CREATE TEMP F249 FLAT FILE                                                  
//*--------------------------------------------------------------------         
//STEP100B EXEC SORT                                                            
//SORTIN   DD DSN=BP13.F240.BP13K249.ADD,DISP=SHR                               
//SORTOUT  DD  DSN=&&P13F249H,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=450,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(357,39,A),FORMAT=CH                                              
  INCLUDE COND=(5,2,CH,EQ,C'01',AND,108,3,CH,EQ,C'SBF',AND,                     
                50,2,CH,NE,C'05',AND,50,2,CH,NE,C'06',AND,                      
                50,1,CH,NE,C'5',AND,50,1,CH,NE,C'6')                            
//*--------------------------------------------------------------------         
//* UPDATE RECORDS IN BP13K249                                                  
//*--------------------------------------------------------------------         
//STEP101B EXEC PGM=BP13C21O                                                    
//BP13F240 DD DSN=&&P13F249H,DISP=(SHR,DELETE)                                  
//BP13K246 DD DSN=BP13.K246.SBF.LOOKUP,DISP=SHR                                 
//BP13K249 DD DSN=BP13.K249.NT.FT,DISP=SHR                                      
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------         
//* CREATE TEMP F249 FLAT FILE                                                  
//*--------------------------------------------------------------------         
//STEP103  EXEC SORT                                                            
//SORTIN   DD DSN=BP13.F240.BP13K249.ADD,DISP=SHR                               
//SORTOUT  DD  DSN=&&P13F249F,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=450,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(357,39,A),FORMAT=CH                                              
  INCLUDE COND=(5,2,CH,EQ,C'01')                                                
//*-------------------------------------------------------------------*         
//* WRITE RECORDS TO BP13KH30                                                   
//*-------------------------------------------------------------------*         
//STEP104  EXEC PGM=BP13C21R                                                    
//BP13F240 DD DSN=&&P13F249F,DISP=(SHR,PASS)                                    
//BP13K222 DD DSN=BP13.K222.SUMALLOC,DISP=SHR                                   
//BP13KH30 DD DSN=BP13.KH30.SUPPLY,DISP=SHR                                     
//BP13KH40 DD DSN=BP13.KH40.ESUPPLY,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* BACKUP FILES BEFORE UPDATE                                                  
//*---------------------------------------------------------------------        
//STEP105 EXEC    PGM=IDCAMS                                                    
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K295.FLATLOG,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT1  DD  DSN=BP13.F295.FLATLOG.DAILY(+1),                                 
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(1000,100),RLSE),                                     
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=4000,RECFM=FB)                     
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*---------------------------------------------------------------------        
//* DEFINE FLATLOG VSAM FILE BP13K295                                           
//*---------------------------------------------------------------------        
//STEP106 EXEC    PGM=IDCAMS                                                    
//INPUT1   DD  DSN=BP13.BLANK.CHAR4000,                                         
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL 'BP13.K295.FLATLOG' CLUSTER PURGE                                 
          DEF CLUSTER                                -                          
              (NAME(BP13.K295.FLATLOG)               -                          
              CYL(200 50)                            -                          
              DATACLAS(VSAMEXTA)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K295.FLATLOG.DATA)          -                          
              KEYS(16 0)                             -                          
              RECSZ(4000 4000)                       -                          
              CISZ(12288)                            -                          
              FSPC(0 0))                             -                          
              INDEX                                  -                          
              (NAME(BP13.K295.FLATLOG.INDEX))                                   
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K295.FLATLOG)                                              
//*--------------------------------------------------------------------         
//* TO SORT BP13FP00                                                            
//*--------------------------------------------------------------------         
//STEP107  EXEC SORT                                                            
//SORTIN   DD DSN=BP13.FP00.DOC,DISP=SHR                                        
//SORTOUT  DD  DSN=&&BP13FP00,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=3800,BLKSIZE=0)                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* TO MOVE BP13FP00 TO BP13KP00                                                
//*---------------------------------------------------------------------        
//STEP108 EXEC    PGM=IDCAMS                                                    
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13FP00,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.KP00.DOC,                                               
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*-----------------------------------------------------------------            
//* EMPTY FP00 DOC FILE                                                         
//*-----------------------------------------------------------------            
//STEP109  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.FP00.DOC,DISP=OLD                                        
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*--------------------------------------------------------------------         
//* TO SORT BP13FQ10                                                            
//*--------------------------------------------------------------------         
//STEP110  EXEC SORT                                                            
//SORTIN   DD DSN=BP13.FQ10.DOC.TBL,DISP=SHR                                    
//SORTOUT  DD  DSN=&&BP13FQ10,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* TO MOVE BP13FQ10 TO BP13KQ10                                                
//*---------------------------------------------------------------------        
//STEP111 EXEC    PGM=IDCAMS                                                    
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13FQ10,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.KQ10.DOC.TBL,                                           
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*-----------------------------------------------------------------            
//* EMPTY DOC TBL FILE                                                          
//*-----------------------------------------------------------------            
//STEP112  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.FQ10.DOC.TBL,DISP=OLD                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//ENDTESTE  ENDIF                                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* BACKUP FILES AFTER UPDATE (BACKUP B4 UPDATE, IS DONE IN BP13DBK3)           
//*---------------------------------------------------------------------        
//STEP201  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT1  DD  DSN=BP13.F230.FLATLIST.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(100,20),RLSE),                                       
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=450,RECFM=FB)                      
//INPUT2   DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT2  DD  DSN=BP13.F240.HEADFLAT.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(100,20),RLSE),                                       
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=450,RECFM=FB)                      
//INPUT3   DD  DSN=BP13.K249.NT.FT,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT3  DD  DSN=BP13.F249.NT.FT.BACKUP(+1),                                  
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(100,20),RLSE),                                       
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=450,RECFM=FB)                      
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
/*                                                                              
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP202  EXEC WTOG                                                            
   ----> ############################################                           
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13D206                             
   ---->    PLEASE GROUP OPEN BP13E.                                            
   ----> ############################################                           
//*--------------------------------------------------------------------         
//*    END OF JOB BP13D206                                                      
//*--------------------------------------------------------------------         
