//BP13Y202 JOB (BP13P),'BP13YF02',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//*====================================================================*        
//*                         JCL PROFILE                                         
//*--------------------------------------------------------------------*        
//* JOB DESCRIPTION: COMPRESS BP13Y201 FILE & FTP FROM MAINFRAME TO             
//*                  SGNETSTAGE                                                 
//*--------------------------------------------------------------------*        
//* MODIFICATION LOG                                                            
//*----------------------------------------------                               
//* CHG-NO   BY   ON    - CHANGE                                                
//*----------------------------------------------                               
//* BP134990 HH  130813 - NEW JCL to put report to SGNETSTAGE server.           
//* BP135678 HH  130515 - REMOVE /MF/ FOLDER FROM SGNETSTAGE PATH               
//*====================================================================*        
//*--------------------------------------------------------------------*        
//* STEP 01 : DEL ZIP FILE                                                      
//*--------------------------------------------------------------------*        
//YF02S001 EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL BP13.FD99.DOS.ZIP                                                      
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*--------------------------------------------------------------------*        
//* STEP 02 : COMPRESS FILE                                                     
//*--------------------------------------------------------------------*        
//YF02S002 EXEC PKZIP,COND=(0,NE)                                               
-ARCHIVE(BP13.FD99.DOS.ZIP)                                                     
-ARCHVOL(DUMMY)                                                                 
-METHOD(FAST)                                                                   
-ZIPPED_DSN(BP13.FD99.DOS,hrdn_hdb_new_applicant_flat_tmp.dat)                  
-FILE_TERMINATOR()                                                              
   BP13.FD99.DOS                                                                
/*                                                                              
//*--------------------------------------------------------------------*        
//* STEP 03 : FTP COMPRESSED FILE TO SGNETSTAGE SERVER                          
//*           PATH --> E:\FTP\PROD\APPN\DATA\BP13\FROM-HDB\DOS                  
//*--------------------------------------------------------------------*        
//YF02S003 EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
    CD /PROD/APPN/DATA/BP13/FROM-HDB/DOS                                        
    BINARY                                                                      
    PUT 'BP13.FD99.DOS.ZIP' +                                                   
    hrdn_hdb_new_applicant_flat_tmp.dat.zip                                     
    LS                                                                          
    QUIT                                                                        
/*                                                                              
