//BP13D118 JOB (BP13P),'BP13D118',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//* ============================================================== *            
//*                                                                *            
//*             D A I L Y    F I N A N C I A L    J O B            *            
//*                                                                *            
//* -------------------------------------------------------------- *            
//*                                                                *            
//* ============================================================== *            
//* BP135833 010416 KSJ3 TO OMIT LEVY CASES IN STEP13G                          
//* BP136367 020916 KSJ3 TO TRANSFER BP13C36S TO BP13D100                       
//* BP136401 220916 MRN1 NEW RCPT CODES 6041J(AHG),6021Z(SHG),6254D(INT)        
//* BP136622 280417 MRN1 NEW STEPS TO SYNCHRONIZE PREJULY/DBSS TO DB2           
//* BP136696 220817 MRN1 TO SORT OUT INPUT FOR CB0E BY REGNO AND RCPTCDE        
//* BP137044 231117 RJB1 TO INCLUDE BM06K115 FOR BP13C36B                       
//* BP137100 061217 RJB1 TO INCLUDE BP13K893 FOR BP13C36B                       
//* BP137325 021018 LJL1 TO CATER FOR NEW FILE FROM CASH PAYMENT KIOSK          
//*                      AC28.F569.SOC                                          
//* BP138668 240321 LJL1 TO CATER FOR NEW RECEIPTING CODE                       
//*                      6095I FOR CASES UNDER ALLOCATION SCHEME "SHS"          
//*===================================================================          
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K130.SOCHIST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*                                                                             
//*=================================================================            
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                                
//* PRT01 : 1 COPY                           (AGREEMENT TEAM)                   
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                                
//* PRT02 : 1 COPY                           (APPLICATION TEAM)                 
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                                
//* PRT03 : 1 COPY                           (FINANCE DEPARTMENT)               
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-FI1 CP-1',END;                                         
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=FI1                                        
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET, SINGLE COPY       *         
//*-------------------------------------------------------------------*         
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//*-----------------------------------------------------------------            
//* SORT BB24 COLLECTION LEVY FILE BY HDB REF                                   
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BB24.F590.COLLLEVY,DISP=SHR                                   
//SORTOUT  DD DSN=&&BB24F590,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=350,RECFM=FB)                                
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,11,A,89,9,A),FORMAT=CH                                      
     INCLUDE COND=(98,5,CH,EQ,C'0518C',OR,                                      
                   98,5,CH,EQ,C'0900E',OR,                                      
                   98,5,CH,EQ,C'0901G',OR,                                      
                   98,5,CH,EQ,C'0905D',OR,                                      
                   98,5,CH,EQ,C'0910Z',OR,                                      
                   98,5,CH,EQ,C'0915I',OR,                                      
                   98,5,CH,EQ,C'0920D')                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT LEVY TAG FILE IN SCH-ACCNT SEQUENCE                                    
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K162.LVYTAG,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F162,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=600,RECFM=FB)                                
//SYSIN    DD *                                                                 
     SORT FIELDS=(120,11,A,9,9,A),FORMAT=CH                                     
     INCLUDE COND=(120,11,CH,NE,C'           ',AND,                             
                   120,11,CH,NE,C'00000000000',AND,                             
                   120,11,BI,NE,X'00')                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE LEVY STATUS FILE BASED ON COLLECTION FILE                            
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13C11G,COND=(0,NE)                                        
//BB24F590 DD DSN=&&BB24F590,DISP=(OLD,DELETE)                                  
//BP13F162 DD DSN=&&BP13F162,DISP=(OLD,DELETE)                                  
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR                                   
//BP13K162 DD DSN=BP13.K162.LVYTAG,DISP=OLD                                     
//BP13KH80 DD DSN=BP13.KH80.LVYSTAT,DISP=OLD                                    
//BP13F120 DD DSN=BP13.F120.SATRAN.LEVY,DISP=OLD                                
//BP13F140 DD DSN=BP13.F140.KIVTRAN.LEVY,DISP=OLD                               
//P13L11GA DD SYSOUT=8,DEST=IOM8                                                
//P13L11GB DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* MERGE DAILY FINANCIAL TRANS WITH SALES AGRMT TRANS                          
//* SORT BY PAYMENT TYPE                                                        
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F120.SATRAN.LEVY,DISP=SHR                                
//SORTOUT  DD DSN=BP13.F125.ACCUM,DISP=MOD                                      
//SYSIN    DD *                                                                 
     SORT FIELDS=(99,3,A),FORMAT=CH                                             
/*                                                                              
//*--------------------------------------------------------------------         
//* BACKUP BB24.F590.COLLLEVY                                                   
//* EMPTY  BB24.F590.COLLLEVY                                                   
//*--------------------------------------------------------------------         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BB24.F590.COLLLEVY,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.BB24.F590.COLLLEVY.ACCUM,DISP=MOD                        
//INPUT2   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT2  DD DSN=BB24.F590.COLLLEVY,DISP=OLD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
/*                                                                              
//* ==================================================================          
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                 
//* PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGM TEAM)                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-2',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=2,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                 
//* PRT02 : CLASS = 2, COPIES = 1 ** (ALLOCATION SECTION - RST)                 
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL2A CP-2',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=2,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL2A                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*===================================================================          
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                 
//* PRT05 : CLASS = 2, COPIES = 1 ** (SALES - AGM TEAM)                         
//*-----------------------------------------------------------------            
//PRT05    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2 CP-2',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=2,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//*-----------------------------------------------------------------            
//* SORT COLL PAYMENT FILE IN SCH-ACCNT SEQUENCE                                
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//*SORTIN   DD DSN=AC28.F526.SOC,DISP=OLD                                       
//SORTIN   DD DSN=BP13.AC28.F526.SOCCASH,DISP=SHR                               
//         DD DSN=BP13.AC28.F569.SOCCASH,DISP=SHR                               
//SORTOUT  DD DSN=&&AC28F527,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     INCLUDE COND=(91,5,CH,EQ,C'6088Z',OR,                                      
                   91,5,CH,EQ,C'6095I',OR,                                      
                   91,5,CH,EQ,C'6154A',OR,                                      
                   91,5,CH,EQ,C'1279J',OR,                                      
                   91,5,CH,EQ,C'1277G',OR,                                      
                   91,5,CH,EQ,C'1224I',OR,                                      
                   91,5,CH,EQ,C'6011E',OR,                                      
                   91,5,CH,EQ,C'6020H',OR,                                      
                   91,5,CH,EQ,C'6015B',OR,                                      
                   91,5,CH,EQ,C'0520C',OR,                                      
                   91,5,CH,EQ,C'6014J',OR,                                      
                   91,5,CH,EQ,C'6021Z',OR,                                      
                   91,5,CH,EQ,C'6254D')                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE HISTORY TRANSACTIONS FOR AMR CASES                                   
//*-----------------------------------------------------------------            
//STEP05  EXEC PGM=BP13C36A,COND=(0,NE)                                         
//AC28F526 DD DSN=&&AC28F527,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K350 DD DSN=BP13.K350.STDAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K352 DD DSN=BP13.K352.AMRAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR,                                  
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F52A DD DSN=BP13.AC28.F52A.MISMATCH,DISP=SHR                              
//BP13L36A DD DSN=&&BP13L36A,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE AMR   PAYMENT ON HARDCOPY                                          
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L36A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT05.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT "AMR"  ACCEPTED VOUCHER TRANSACTIONS                               
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F630.AMR,DISP=SHR                                        
//SORTOUT  DD DSN=&&AG07AMR,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
    INCLUDE COND=(20,4,CH,EQ,C'AMRT',OR,                                        
                  20,4,CH,EQ,C'ADPS')                                           
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE VOUCHER TRANSACTIONS (PAYMENT SYSTEM) FOR AMR CASES                
//*-------------------------------------- --------------------------            
//STEP08  EXEC PGM=BP13C36B,COND=(0,NE)                                         
//AG07F630 DD DSN=&&AG07AMR,DISP=(OLD,DELETE)                                   
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K115 DD DSN=BM06.K115.DELFIS,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K350 DD DSN=BP13.K350.STDAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K352 DD DSN=BP13.K352.AMRAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F360 DD DSN=BP13.F360.PREPVRCH,DISP=MOD                                   
//BP13L36B DD DSN=&&BP13L36B,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE AMR  VOUCHER  PAYMENT ON HARDCOPY                                  
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L36B,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT05.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*--------------------------------------------------------------------         
//*-DEFINE NEW BP13F365 DATASET                                                 
//*=================================================================            
//* SORT OUT "AMR"  REJECTED VOUCHER TRANSACTIONS                               
//*-----------------------------------------------------------------            
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F640.AMR,DISP=SHR                                        
//SORTOUT  DD DSN=&&AG07F640,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27900,LRECL=100,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(20,8,A),FORMAT=CH                                             
    INCLUDE COND=(43,3,CH,EQ,C'AMR',OR,                                         
                  43,3,CH,EQ,C'ADP')                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE VOUCHER TRANSACTIONS (PAYMENT SYSTEM) FOR AMR CASES(REJ)           
//*-------------------------------------- --------------------------            
//STEP11  EXEC PGM=BP13C36C,COND=(0,NE)                                         
//AG07F640 DD DSN=&&AG07F640,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K350 DD DSN=BP13.K350.STDAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K352 DD DSN=BP13.K352.AMRAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F365 DD DSN=BP13.F365.PREPVRCH,DISP=MOD                                   
//BP13L36C DD DSN=&&BP13L36C,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE AMR  VOUCHER  PAYMENT (REJECTED) ON HARDCOPY                       
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L36C,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT05.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*=================================================================            
//* SORT OUT "AMR"  DELETED  VOUCHER TRANSACTIONS                               
//*-----------------------------------------------------------------            
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F225.EVCHR.RETURN.AMR,DISP=SHR                           
//SORTOUT  DD DSN=&&AG07F225,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(3,2),RLSE),                                
//            DCB=(BLKSIZE=6000,LRECL=600,RECFM=FB)                             
//SYSIN    DD *                                                                 
     SORT FIELDS=(87,8,A),FORMAT=CH                                             
    INCLUDE COND=(18,3,CH,EQ,C'AMR',OR,                                         
                  18,3,CH,EQ,C'ADP')                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE VOUCHER TRANSACTIONS (PAYMENT SYSTEM) FOR AMR CASES(DEL)           
//*-------------------------------------- --------------------------            
//STEP14  EXEC PGM=BP13C36D,COND=(0,NE)                                         
//AG07F225 DD DSN=&&AG07F225,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K350 DD DSN=BP13.K350.STDAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K352 DD DSN=BP13.K352.AMRAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F365 DD DSN=BP13.F365.PREPVRCH,DISP=MOD                                   
//BP13L36D DD DSN=&&BP13L36D,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE AMR  VOUCHER  PAYMENT (DELETED) ON HARDCOPY                        
//*-----------------------------------------------------------------            
//STEP16   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L36D,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT05.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*=================================================================            
//* SORT BP13F365  WITH OUTSTANDING AMR VOUCHER TRANSACTIONS                    
//*-----------------------------------------------------------------            
//SORT17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F365.PREPVRCH,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F365,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=160),                                         
//            SPACE=(CYL,(5,4),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(12,8,A,97,2,A),FORMAT=CH                                         
//*-----------------------------------------------------------------            
//* CREATE AMR VOUCHER TRANSACTIONS OUTSTANDING CASES.                          
//*-----------------------------------------------------------------            
//STEP18   EXEC  PGM=IKJEFT01,COND=(0,NE),REGION=4096K,                         
//             DYNAMNBR=20                                                      
//BP13F365 DD DSN=&&BP13F365,DISP=(OLD,DELETE)                                  
//BP13L36E DD DSN=&&BP13L36E,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//BP13L36I DD DSN=&&BP13L36I,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13C36E) PLAN(BP13PCC) -                                      
         LIB    ('BP13.BATCH.LOADCOB')                                          
     END                                                                        
/*                                                                              
//*-----------------------------------------------------------------            
//* VALIDATE AMR  VOUCHER  PAYMENT (DELETED) ON HARDCOPY(2R/3R CASE)            
//*-----------------------------------------------------------------            
//STEP19   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L36E,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT05.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* VALIDATE AMR  VOUCHER  PAYMENT (DELETED) ON HARDCOPY (STUDIO)               
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L36I,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT05.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*=====================================================================        
//*    DELETE DATASET WHEN JOB COMPLETED                                        
//*--------------------------------------------------------------------         
//STEP21   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.F365.PREPVRCH,DISP=OLD                                   
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-------------------------------------------------------------------*         
//* ACCUM CPF PAYMENT & VOUCHER FILE FOR BACKUP PURPOSE               *         
//*-------------------------------------------------------------------*         
//STEP22   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AG07.F630.AMR,DISP=SHR                                        
//OUTPUT1  DD DSN=BP13.AG07.F630.AMR,DISP=MOD                                   
//INPUT2   DD DSN=AG07.F640.AMR,DISP=SHR                                        
//OUTPUT2  DD DSN=BP13.AG07.F640.AMR,DISP=MOD                                   
//INPUT3   DD DSN=AG07.F225.EVCHR.RETURN.AMR,DISP=SHR                           
//OUTPUT3  DD DSN=BP13.AG07.F225.EVCHR.RETURN.AMR,DISP=MOD                      
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
        REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                  
        REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY COLL VOUCHER FILE FOR F630                                  *         
//*-------------------------------------------------------------------*         
//STEP23   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AG07.F630.AMR,DISP=OLD                                        
//OUTPUT2  DD DSN=AG07.F640.AMR,DISP=OLD                                        
//OUTPUT3  DD DSN=AG07.F225.EVCHR.RETURN.AMR,DISP=OLD                           
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                  
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT3)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* CASH PAYMENT FROM COLLECTION SYSTEM FOR SRG, SUG, AHG/SHG RECOVERY*         
//*-------------------------------------------------------------------*         
//STEP24   EXEC SORT,COND=(0,NE)                                                
//*SORTIN   DD DSN=AC28.F526.SOC,DISP=SHR                                       
//SORTIN   DD DSN=BP13.AC28.F526.SOCCASH,DISP=SHR                               
//         DD DSN=BP13.AC28.F569.SOCCASH,DISP=SHR                               
//SORTOUT  DD DSN=BP13.AC28.F526.SRG.RECOVERY,DISP=OLD                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(113,8,A,91,5,A,27,14,A),FORMAT=CH                                
  INCLUDE COND=(91,5,CH,EQ,C'6019Z',OR,                                         
                91,5,CH,EQ,C'6013I',OR,                                         
                91,5,CH,EQ,C'0520C',OR,                                         
                91,5,CH,EQ,C'6023C',OR,                                         
                91,5,CH,EQ,C'6015B',OR,                                         
                91,5,CH,EQ,C'6020H',OR,                                         
                91,5,CH,EQ,C'6011E',OR,                                         
                91,5,CH,EQ,C'6014J',OR,                                         
                91,5,CH,EQ,C'6021Z',OR,                                         
                91,5,CH,EQ,C'6254D')                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//* PROCESS RECOVERY FROM COLLECTION SYSTEM                           *         
//*-------------------------------------------------------------------*         
//STEP25   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//AC28F526 DD DSN=BP13.AC28.F526.SRG.RECOVERY,DISP=SHR                          
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR                                    
//BP13F52A DD DSN=BP13.AC28.F52A.MISMATCH.SRG,DISP=OLD                          
//BP13LB0E DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CB0E) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*=================================================================            
//* EMAIL JOB                                                                   
//*=================================================================            
//* SORT OUT MIS-MATCH CASES FROM COLLECTION                                    
//*-----------------------------------------------------------------            
//STEP97   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.AC28.F52A.MISMATCH,DISP=SHR                              
//SORTOUT  DD DSN=&&BP13F52A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(1,30),RLSE),                               
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     INCLUDE COND=(91,5,CH,EQ,C'6088Z',OR,                                      
                   91,5,CH,EQ,C'6095I',OR,                                      
                   91,5,CH,EQ,C'6154A')                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE MAILOUT FILE WITH MIS-MATCHED CASES                                  
//*-------------------------------------- --------------------------            
//STEP98  EXEC PGM=BP13C36R,COND=(0,NE)                                         
//BP13F52A DD DSN=&&BP13F52A,DISP=(OLD,DELETE)                                  
//BP13MAIL DD DSN=BP13.MAILOUT.BP13C36R,DISP=SHR                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//STEP99   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.BP13C36R,DISP=SHR                                
//*                                                                             
//*---------------------------------------------------------------------        
//* GET PRE JULY CASES FROM BP13K800, EXCLUDE 2822064B                          
//* GET ONLY THOSE WITH STATUS A, W, R                                          
//*---------------------------------------------------------------------        
//STEP26   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,150),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=((785,6,CH,LT,C'201307'),AND,                                    
                (4,8,CH,NE,C'2822064B'),AND,                                    
                ((1248,1,CH,EQ,C'A',OR,                                         
                  1248,1,CH,EQ,C'W',OR,                                         
                  1248,1,CH,EQ,C'R'),OR,                                        
                 (1535,1,CH,EQ,C'A',OR,                                         
                  1535,1,CH,EQ,C'W',OR,                                         
                  1535,1,CH,EQ,C'R')))                                          
//*---------------------------------------------------------------------        
//* GET PRE JULY CASES FROM BP13K893, EXCLUDE 2822064B                          
//* GET ONLY THOSE WITH STATUS A, W, R                                          
//*---------------------------------------------------------------------        
//STEP27   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                              
//SORTOUT  DD DSN=&&BP13F893,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2050,RECFM=FB)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(2027,8,A),FORMAT=CH                                              
  INCLUDE COND=((785,6,CH,LT,C'201307',AND,                                     
                 2027,8,CH,NE,C'2822064B'),AND,                                 
                ((1248,1,CH,EQ,C'A',OR,                                         
                  1248,1,CH,EQ,C'W',OR,                                         
                  1248,1,CH,EQ,C'R'),OR,                                        
                 (1535,1,CH,EQ,C'A',OR,                                         
                  1535,1,CH,EQ,C'W',OR,                                         
                  1535,1,CH,EQ,C'R')))                                          
//*---------------------------------------------------------------------        
//* REMOVE DUPLICATES FROM &&BP13F893                                           
//*---------------------------------------------------------------------        
//STEP28   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&BP13F893,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&P13F893A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2050,RECFM=FB)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(2027,8,A),FORMAT=CH                                              
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* OUTPUT PROCESS DATE = CURRENT DATE - FOR PREJULY                            
//*-----------------------------------------------------------------            
//STEP29 EXEC PGM=BP13CB0M,COND=(0,NE)                                          
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13F893 DD DSN=&&P13F893A,DISP=(OLD,PASS)                                    
//BP13FD00 DD DUMMY                                                             
//P13F800A DD DSN=&&CURRF800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                               
//P13F893A DD DSN=&&CURRF893,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2050,RECFM=FB)                               
//P13FD00A DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* REFORMAT &&CURRF893 TO F800 FORMAT                                          
//*---------------------------------------------------------------------        
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&CURRF893,DISP=(OLD,DELETE)                                  
//OUTPUT1  DD DSN=&&CURRF800,DISP=(MOD,PASS)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,CH,A)                                                        
  OUTFIL FNAMES=OUTPUT1,                                                        
                OUTREC=(1,2000)                                                 
//*---------------------------------------------------------------------        
//* SORT F800/F893 PREJULY                                                      
//*---------------------------------------------------------------------        
//STEP31   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&CURRF800,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&P800P893,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* JOINKEYS K800K893 WITH BP13KD07 TO GET PREJULY CASES - &&BP13FD07           
//* AND IF NOT IN BP13KD07, WILL BE IN &&PREJF800                               
//*---------------------------------------------------------------------        
//STEP32   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&P800P893,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=BP13.KD07.GRANTMAS,DISP=SHR                                   
//MATCH    DD DSN=&&BP13FD07,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=700,RECFM=FB)                                
//UNMATCH  DD DSN=&&PREJF800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                               
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(4,8,A)                                              
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   JOIN UNPAIRED,F1,F2                                                          
   REFORMAT FIELDS=(F1:1,2000,F2:1,700,?)                                       
   SORT FIELDS=COPY                                                             
   OUTFIL FNAMES=MATCH,INCLUDE(2701,1,CH,EQ,C'B'),BUILD=(2001,700)              
   OUTFIL FNAMES=UNMATCH,INCLUDE(2701,1,CH,EQ,C'1'),BUILD=(1,2000)              
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT FD07 PREJULY                                                           
//*---------------------------------------------------------------------        
//STEP33   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&BP13FD07,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&PREJFD07,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=700,RECFM=FB)                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* GET DBSS CASES FROM BP13K800                                                
//* GET ONLY THOSE WITH STATUS A, W, R                                          
//*---------------------------------------------------------------------        
//STEP34   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F800A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=((4,1,CH,EQ,C'5'),AND,                                           
                ((1248,1,CH,EQ,C'A',OR,                                         
                  1248,1,CH,EQ,C'W',OR,                                         
                  1248,1,CH,EQ,C'R'),OR,                                        
                 (1535,1,CH,EQ,C'A',OR,                                         
                  1535,1,CH,EQ,C'W',OR,                                         
                  1535,1,CH,EQ,C'R')))                                          
//*---------------------------------------------------------------------        
//* GET DBSS CASES FROM BP13K893                                                
//* GET ONLY THOSE WITH STATUS A, W, R                                          
//*---------------------------------------------------------------------        
//STEP35   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                              
//SORTOUT  DD DSN=&&P13F893B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2050,RECFM=FB)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(2027,8,A),FORMAT=CH                                              
  INCLUDE COND=((2027,1,CH,EQ,C'5'),AND,                                        
                ((1248,1,CH,EQ,C'A',OR,                                         
                  1248,1,CH,EQ,C'W',OR,                                         
                  1248,1,CH,EQ,C'R'),OR,                                        
                 (1535,1,CH,EQ,C'A',OR,                                         
                  1535,1,CH,EQ,C'W',OR,                                         
                  1535,1,CH,EQ,C'R')))                                          
//*---------------------------------------------------------------------        
//* REMOVE DUPLICATES FROM &&P13F893B                                           
//*---------------------------------------------------------------------        
//STEP36   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&P13F893B,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&P13F893C,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2050,RECFM=FB)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(2027,8,A),FORMAT=CH                                              
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* GET DBSS CASES FROM BP13KD00 (HGT/TUG/PHG)                                  
//* GET ONLY THOSE WITH STATUS A, W, R                                          
//*---------------------------------------------------------------------        
//STEP37   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FD00,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=1600,RECFM=FB)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=((132,1,CH,EQ,C'A',OR,                                           
                 132,1,CH,EQ,C'W',OR,                                           
                 132,1,CH,EQ,C'R'),OR,                                          
                (197,1,CH,EQ,C'A',OR,                                           
                 197,1,CH,EQ,C'W',OR,                                           
                 197,1,CH,EQ,C'R'),OR,                                          
                (1574,1,CH,EQ,C'A',OR,                                          
                 1574,1,CH,EQ,C'W',OR,                                          
                 1574,1,CH,EQ,C'R'))                                            
//*-----------------------------------------------------------------            
//* OUTPUT PROCESS DATE = CURRENT DATE - FOR DBSS                               
//*-----------------------------------------------------------------            
//STEP38 EXEC PGM=BP13CB0M,COND=(0,NE)                                          
//BP13F800 DD DSN=&&P13F800A,DISP=(OLD,PASS)                                    
//BP13F893 DD DSN=&&P13F893C,DISP=(OLD,DELETE)                                  
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,DELETE)                                  
//P13F800A DD DSN=&&DBSSF800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                               
//P13F893A DD DSN=&&DBSSF893,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2050,RECFM=FB)                               
//P13FD00A DD DSN=&&DBSSFD00,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=1600,RECFM=FB)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* REFORMAT &&DBSSF893 TO F800 FORMAT                                          
//*---------------------------------------------------------------------        
//STEP39   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&DBSSF893,DISP=(OLD,DELETE)                                  
//OUTPUT1  DD DSN=&&DBSSF800,DISP=(MOD,PASS)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,CH,A)                                                        
  OUTFIL FNAMES=OUTPUT1,                                                        
                OUTREC=(1,2000)                                                 
//*---------------------------------------------------------------------        
//* SORT F800/F893 DBSS                                                         
//*---------------------------------------------------------------------        
//STEP40   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&DBSSF800,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F800F893,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* DROP/DELETE CASES AND WRITE TO OUTPUT TO CREATE CASES                       
//*-----------------------------------------------------------------            
//STEP41   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13FD07 DD DSN=&&PREJFD07,DISP=(OLD,DELETE)                                  
//PREJF800 DD DSN=&&PREJF800,DISP=(OLD,DELETE)                                  
//BP13FD00 DD DSN=&&DBSSFD00,DISP=(OLD,DELETE)                                  
//BP13F800 DD DSN=&&F800F893,DISP=(OLD,DELETE)                                  
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                                   
//P13FD07A DD DSN=BP13.FD07.PREJULY.CREATE,DISP=OLD                             
//P13F800B DD DSN=BP13.F800.PREJULY.CREATE,DISP=OLD                             
//P13F800A DD DSN=BP13.F800.DBSS.CREATE,DISP=OLD                                
//P13FD00A DD DSN=BP13.FD00.DBSMAST.CREATE,DISP=OLD                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
    DSN SYSTEM(DSN)                                                             
    RUN PROGRAM(BP13CB0I) PLAN(BP13PCC) -                                       
        LIB('BP13.BATCH.LOADCOB')                                               
    END                                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* JOINKEYS F800 WITH BP13KD05 TO GET PREJULY CASES IN BP13FD05                
//*---------------------------------------------------------------------        
//STEP42   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.F800.PREJULY.CREATE,DISP=SHR                             
//SORTJNF2 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                                   
//MATCH    DD DSN=&&BP13FD05,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN DD *                                                                    
   SORT FIELDS=COPY                                                             
   JOINKEYS FILE=F1,FIELDS=(4,8,A)                                              
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   REFORMAT FIELDS=(F2:1,500)                                                   
   OUTFILE FNAMES=MATCH                                                         
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* JOINKEYS FD07 WITH BP13KD05 TO GET PREJULY CASES IN BP13FD05                
//*---------------------------------------------------------------------        
//STEP43   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.FD07.PREJULY.CREATE,DISP=SHR                             
//SORTJNF2 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                                   
//MATCH    DD DSN=&&BP13FD05,DISP=(MOD,PASS)                                    
//SYSIN DD *                                                                    
   SORT FIELDS=COPY                                                             
   JOINKEYS FILE=F1,FIELDS=(1,8,A)                                              
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   REFORMAT FIELDS=(F2:1,500)                                                   
   OUTFILE FNAMES=MATCH                                                         
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* REMOVE DUPLICATES FOR FD05 PREJULY                                          
//*---------------------------------------------------------------------        
//STEP44   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&BP13FD05,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&FD05PREJ,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* JOINKEYS BP13.F800.DBSS.CREATE WITH KD05 FOR DBSS                           
//*---------------------------------------------------------------------        
//STEP45   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.F800.DBSS.CREATE,DISP=SHR                                
//SORTJNF2 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                                   
//MATCH    DD DSN=&&P13FD05A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN DD *                                                                    
   SORT FIELDS=COPY                                                             
   JOINKEYS FILE=F1,FIELDS=(4,8,A)                                              
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   REFORMAT FIELDS=(F2:1,500)                                                   
   OUTFILE FNAMES=MATCH                                                         
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* JOINKEYS BP13.FD00.DBSMAST.CREATE WITH KD05 FOR DBSS                        
//*---------------------------------------------------------------------        
//STEP46   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.FD00.DBSMAST.CREATE,DISP=SHR                             
//SORTJNF2 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                                   
//MATCH    DD DSN=&&P13FD05A,DISP=(MOD,PASS)                                    
//SYSIN DD *                                                                    
   SORT FIELDS=COPY                                                             
   JOINKEYS FILE=F1,FIELDS=(1,8,A)                                              
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   REFORMAT FIELDS=(F2:1,500)                                                   
   OUTFILE FNAMES=MATCH                                                         
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* REMOVE DUPLICATES FROM BP13FD05 DBSS                                        
//*---------------------------------------------------------------------        
//STEP47   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&P13FD05A,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&FD05DBSS,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* SYNCHRONIZE KD05/KD07/K800 DATA WITH DB2 TABLE - FOR PREJULY                
//*-----------------------------------------------------------------            
//STEP48 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                 
//BP13FD07 DD DSN=BP13.FD07.PREJULY.CREATE,DISP=SHR                             
//BP13FD05 DD DSN=&&FD05PREJ,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13FD05A DD DSN=&&FD05NFND,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                            
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CB0J) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
     END                                                                        
/*                                                                              
//*-----------------------------------------------------------------            
//* SYNCHRONIZE K800/K893/KD05 DATA WITH DB2 TABLE - FOR PREJULY                
//*-----------------------------------------------------------------            
//STEP49 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                 
//BP13FD05 DD DSN=&&FD05NFND,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CB0K) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
     END                                                                        
/*                                                                              
//*-----------------------------------------------------------------            
//* SYNCHRONIZE K800/K893/KD05 DATA WITH DB2 TABLE - FOR DBSS AHG               
//*-----------------------------------------------------------------            
//STEP50 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                 
//BP13FD05 DD DSN=&&FD05DBSS,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CB0K) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
     END                                                                        
/*                                                                              
//*-----------------------------------------------------------------            
//* SYNCHRONIZE K800/KD00/KD05 DATA WITH DB2 TABLE - HGT/TUG/PHG                
//*-----------------------------------------------------------------            
//STEP51 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                 
//BP13FD05 DD DSN=&&FD05DBSS,DISP=(OLD,DELETE)                                  
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CB0L) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
     END                                                                        
/*                                                                              
//*=================================================================            
//*          E N D      O F     J O B                                           
//*=================================================================            
