//BP13H202  JOB (BP13P),'BP13H202',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//* DATA TO MAS                                                                 
//* SALES LAUNCH AND BOOKED FLAT                                                
//* RUN TIME : 1/1/YYY TO 31/6/YYYY, RUN ON 01/7                                
//* RUN TIME : 1/7/YYY TO 31/12/YYYY, RUN ON 01/01                              
//*---------------------------------------------------------------------        
//* CHG-NO   BY  ON                                                             
//* --------------------------------------                                      
//* BP137387 LSB 21022019 - NEW JOB TO MHA                                      
//*---------------------------------------------------------------------        
//* SORT BTO FLAT                                                               
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F120,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=700,BLKSIZE=27300),                              
//         SPACE=(CYL,(180,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(410,6,A,12,16,A,606,2,A),FORMAT=CH                               
  INCLUDE COND=(356,3,CH,EQ,C'BTO',AND,                                         
                410,4,CH,GE,C'2018')                                            
//*-----------------------------------------------------------------            
//* SALES LAUNCH AND BOOKED FLAT                                                
//*-----------------------------------------------------------------            
//STEP02  EXEC PGM=BP13CZ39,COND=(0,NE)                                         
//BM06F120 DD DSN=&&BM06F120,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//         AMP=('BUFNI=4','BUFND=8')                                            
//BM06K130 DD DSN=BM06.K130.BLOCK.PIDB,DISP=SHR,                                
//         AMP=('BUFNI=4','BUFND=8')                                            
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR,                                    
//         AMP=('BUFNI=4','BUFND=8')                                            
//BP13F81A DD DSN=BP13.F81A.MASDATA,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
