//BP13AGRO JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//*    PIGEONHOLING OF GRO FOR  NON-MATURE  NT                     *            
//*                             --------------                     *            
//*    NOTE THE DIFFERENCE                                         *            
//*    - TENDER PROGRAM ONLY HAVE NEW FLAT SUPPLY                  *            
//*    - SORT OUT ONLY GRO      CASES FOR PIGEONHOLING             *            
//*================================================================*            
//* CHG-NO  BY   ON      DESCRIPTION                                            
//* --------------------------------                                            
//*BP130341 LSB 970828 - GRO NOT SUBJECT TO NHHUPG CHECK                        
//*                      REN SUBJECT TO NHHUPG FOR RH QUOTA                     
//*BP130652 SRA 991012 - EXPAND F520 RECL FROM 300 TO 500                       
//*BP130871 SSS 000608 - LISTING TO EAALSS                                      
//*BP132596 PGS 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E             
//*BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                                
//******************************************************************            
//* STEP 00 - 01 = LASER PRINTER JCL                                            
//* STEP 02 - 03 = BACKUP TENDER AND BALLOT FILE                                
//* STEP 05 - 08 = PRINT FLAT SYPPLY REPORT BF PIGEONHOLING                     
//* STEP 09 - 10 = PROCESS PIGEONHOLING(BP13U720 PRIORITY ONLY)                 
//* STEP 11 - 14 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING                     
//* STEP 15      = MATCH RELEVANT REQUEST TO GET SUCC & UNSUCC                  
//*                BALLOT RESULT FOR PRINT REPORT                               
//* STEP 16      = PRINT SUCC/UNSUCC REQUEST REPOR BP13L522                     
//* STEP 17      = PRINT FLATNHUG REPORT BP13L752                               
//* STEP 18      = ACCUM BP13F525                                               
//*                                                                             
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN                                            
//*-----------------------------------------------------------------            
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K520.BALLOT,DISP=OLD                                     
//INPUT3   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT02 : COPIES = 2                                                         
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.GRO,DISP=OLD                                 
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.GRO,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F520.BALLOT,DISP=OLD                                     
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010N,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010N,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                 
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* REPRO BALLOT FILE TO SEQUENCE FILE, OMIT SUCC CASES                         
//*-----------------------------------------------------------------            
//STEP8A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520REQ,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(226,3,CH,NE,C'   ')                                               
//*-----------------------------------------------------------------            
//* OUTPUT GRO CASES FROM BALLOT FILE                                           
//*-----------------------------------------------------------------            
//STEP8B   EXEC PGM=BP13C741,COND=(0,NE),ADDRSPC=VIRT,REGION=4096K              
//BP13F520 DD DSN=&&F520REQ,DISP=(OLD,PASS)                                     
//BP13MGP  DD DUMMY                                                             
//BP13PR   DD DSN=&&BP13PRIO,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(50,5),RLSE)                                           
//BP13GRO  DD DSN=BP13.F520.BALLOT.GRO,DISP=OLD                                 
//BP13PUB  DD DSN=&&BP13PUB,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(50,5),RLSE)                                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*-----------------------------------------------------------------            
//* INCLUDE GRO CASES WITH RANKING, SORT BY RANK/CUR-REGN/REGN-NO               
//*-----------------------------------------------------------------            
//STEP9A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.BALLOT.GRO,DISP=SHR                                 
//SORTOUT  DD DSN=&&F520GRO,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(163,1,A,139,8,A,123,8,A),FORMAT=CH                             
    INCLUDE COND=(163,1,CH,NE,C' ')                                             
//*-----------------------------------------------------------------            
//* INCLUDE GRO CASES WITHOUT RANKING, SORT BY CUR-REGN/REGN-NO                 
//*-----------------------------------------------------------------            
//STEP9B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.BALLOT.GRO,DISP=SHR                                 
//SORTOUT  DD DSN=&&F520GRO,DISP=(MOD,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(139,8,A,123,8,A),FORMAT=CH                                     
    INCLUDE COND=(163,1,CH,EQ,C' ')                                             
//*-----------------------------------------------------------------            
//* TO PROCESS PIGEON-HOLDING FOR PRIORITY CASES, THE PROGRAM WILL              
//* ONLY ALLOCATE THE GRO SUPPLY QUOTA, BYPASS HHTY CHECK                       
//*-----------------------------------------------------------------            
//STEP9C   EXEC PGM=BP13U721,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                 
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F520 DD DSN=&&F520GRO,DISP=(OLD,PASS)                                     
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=OLD,                                    
//            AMP=('BUFND=23')                                                  
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L721 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L721A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* INCLUDE GRO CASES WITHOUT RANKING, SORT BY CUR-REGN/REGN-NO                 
//* INCLUDE REN CASES TO TAKE RH QUOTA                                          
//*-----------------------------------------------------------------            
//STEP10A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.BALLOT.RENGRO,DISP=SHR                              
//SORTOUT  DD DSN=&&F520REN,DISP=(MOD,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(139,8,A,123,8,A),FORMAT=CH                                     
//*-----------------------------------------------------------------            
//* TO PROCESS PIGEON-HOLDING FOR PRIORITY CASES, THE PROGRAM WILL              
//* ONLY ALLOCATE THE REN TO GET RF QIOTA                                       
//*-----------------------------------------------------------------            
//STEP10B  EXEC PGM=BP13U720,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                 
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F520 DD DSN=&&F520REN,DISP=(OLD,PASS)                                     
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=OLD,                                    
//            AMP=('BUFND=23')                                                  
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L720 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L720A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&K010AFN,DISP=(OLD,PASS)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                 
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* REPRO BALLOT VSAM FILE TO SEQUENTIAL FILES FOR MATCHING BP13C817            
//*-----------------------------------------------------------------            
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT5  DD DSN=&&F520BALT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(130,20),RLSE),                             
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
//*-----------------------------------------------------------------            
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*-----------------------------------------------------------------            
//STEP16   EXEC PGM=BP13C817,COND=(0,NE)                                        
//BP13F510 DD DSN=&&F520GRO,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,PASS)                                    
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT SUMMARY BALLOT RESULT BY ZONE/FT/CAT                                  
//*-----------------------------------------------------------------            
//STEP17   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//P13FSUCC DD DSN=&&P13SUCC,DISP=(OLD,PASS)                                     
//P13FUNSC DD DSN=&&P13UNSUC,DISP=(OLD,PASS)                                    
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//FT42F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                             
//*-----------------------------------------------------------------            
//* PRINT REPORTS ON FLAT ALLOCATED/REGISTERED FOR NHH/UPG                      
//*-----------------------------------------------------------------            
//STEP18   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13F713 DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                 
//BP13L552 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*-----------------------------------------------------------------            
//STEP19   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//OUTPUT1  DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT LAST SUCC REGN-NO IN NT/FT ORDER                                       
//*-----------------------------------------------------------------            
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F525,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=20000)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,4,2,A,53,3,A,11,1,A),FORMAT=CH                            
//*-----------------------------------------------------------------            
//* PRINT REPORT TO SHOW LAST SUCC REGN-NO HIT MAX ZONE/ALLOC/CAT               
//*-----------------------------------------------------------------            
//STEP21   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13K525 DD DSN=&&BP13F525,DISP=(OLD,PASS)                                    
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S502),DISP=SHR                             
