//BP13A955  JOB (BP13P),'BP13A955',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//        DD DSN=BR12.BATCH.LOADCOB,DISP=SHR                                    
//*--------------------------------------------------------------------         
//* 5-YEAR CHECK FOR EC OPEN CATEGORY                                           
//*--------------------------------------------------------------------         
//* QUARTERLY REPORT FOR 10-YEAR/5-YR CHECK                                     
//*--------------------------------------------------------------------         
//* JOB RUN : BP13A730 - CHECK SMS, SUBLET, RESALE HISTORY                      
//*         :          - CHECK RELATIONSHIP  TO RE-UPDATE 10-YR TAG             
//*         : BP13A736 - CHECK TRANSFER HISTORY                                 
//* WEEKLY    REPORT FOR 10-YEAR CHECK                                          
//* JOB RUN : BP13A535 - CHECK SMS, SUBLET, RESALE HISTORY                      
//*         :          - CHECK RELATIONSHIP  TO RE-UPDATE 10-YR TAG             
//*         : BP13A737 - CHECK TRANSFER HISTORY                                 
//* EXEC CONDO COMPUTE FOR 5-YEAR CHECK                                         
//* JOB RUN : BP13A955 - CHECK SMS, SUBLET, RESALE HISTORY                      
//*         :          - CHECK RELATIONSHIP  TO RE-UPDATE 10-YR TAG             
//*         : BP13A956   CHECK TRANSFER HISTORY                                 
//*--------------------------------------------------------------------         
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP130630 YCH 990703   READ RDB2 AND CHGE F715 TO F716                       
//* BP130630 LSB 990727   CHG Q748 TO Q747 READ MOBILITY TABLE                  
//* BP130652 SRA 991012   EXPAND F500, F520 RECL FROM 300 TO 500                
//* BP130789 AKT 000216   SORT BP13.F558.UPGOCCP.CONDO(STEP0D).                 
//* BP130871 SSS 000609   LISTING FOR EAALSS                                    
//* BP130897 AKT 000807   EXPAND F558 RECL FROM 400 TO 600                      
//* BP132589 SK  040914   INCLUDE DB2 ROUTINE IN BP13C669                       
//* BP135171 RJE 140210   TO CATER FOR DB2 UPGRADE                              
//* BP135370 YCH2 100614  ADD BR12 LOAD DUE TO BR12C902 MODULE NOT FOUND        
//*--------------------------------------------------------------------         
//* FOR CUTOVER CASES, USE 9409 TO COMPUTE 5YR                                  
//*     OCT 94  CASES, USE 9410 TO COMPUTE 5YR                                  
//*     NOV ONWARDS  , USE DTE-REGN TO COMPUTE 5YR                              
//*     FOR EC       , USE DTE-CLOSE-LAUNCH (IN DTE-BALLOT FIELD)               
//*--------------------------------------------------------------------         
//*      5 YEARS RESIDENT PRIORITY SCHEME                                       
//*      CURRENT HA'S + TAG OCCUPIERS AS LESSEE/CO-LESSEE IN RDB                
//*      AND RESALE HUDC FLAT                                                   
//*      DETERMINE THE LENGTH OF OCCUPATION                                     
//*=====================================================================        
//* STEP 00-01   LASER PRINT                                                    
//*      10-20   CHK CURRENT LSE OR RESALE HUDC FLAT                            
//*      30-80   CHK LENGTH OF OCCUPATION IF IT IS CURRENT LESSEE               
//*      90-120  UPDATE 5YR ELIG TAG TO MASTER FILE                             
//*********************************************************************         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : 1 COPY                                                             
//*--------------------------------------------------------------------         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALEC1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//*  REPRO BALLOT FILE TO CARTRIDGE                                             
//*---------------------------------------------------------------------        
//STEP0A EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                              
//OUTPUT1   DD DSN=BP13.F500.SEQUENCE.BKUP.ECS(+1),DISP=(,PASS),                
//             UNIT=CART,LABEL=(1,SL),                                          
//             DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                  
//INPUT2    DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                               
//OUTPUT2   DD DSN=BP13.F558.UPGOCCP.BKUP.ECS(+1),DISP=(,PASS),                 
//             UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)                  
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*---------------------------------------------------------------------        
//*  CATALOG GDG                                                                
//*---------------------------------------------------------------------        
//STEP0B    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT1    DD DSN=BP13.F500.SEQUENCE.BKUP.ECS(+1),DISP=(OLD,CATLG),            
//             UNIT=(,,DEFER)                                                   
//INPUT2    DD DSN=BP13.F558.UPGOCCP.BKUP.ECS(+1),DISP=(OLD,CATLG),             
//             UNIT=(,,DEFER)                                                   
//*---------------------------------------------------------------------        
//*  REPRO BALLOT FILE TO SEQUENTIAL FILE                                       
//*---------------------------------------------------------------------        
//STEP0C EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                              
//OUTPUT1   DD DSN=BP13.F500.SEQUENCE.CONDO,DISP=OLD                            
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*---------------------------------------------------------------------        
//* SORT BP13F558 IN REGN/NRIC ORDER                                            
//*---------------------------------------------------------------------        
//STEP0D   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                                
//SORTOUT  DD DSN=BP13.F558.UPGOCCP.CONDO,DISP=SHR                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//*---------------------------------------------------------------------        
//* PROGRAM TO MATCH SMS SUBLET HISTORY TO GET                                  
//* SUBLET-SMS - SUBLET UNDER CURRENT, SMS HDBREF-NO                            
//* SUBLET-RSL - SUBLET UNDER EX-ACCOUNT, RSL HDBREF-NO                         
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F558 DD DSN=BP13.F558.UPGOCCP.CONDO,DISP=SHR                              
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F558  DD DSN=BP13.F558.UPGOCCP.ECS,DISP=OLD                                
//P13L669  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C669) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BP13F558 IN REGN/NRIC ORDER                                            
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558MTH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(140,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//* INITIALISE 10-YR INFOR BEFORE PROCESS                                       
//* OUTREC MTH-RESIDE, MTH-RES-JB-IND, 5YR-OCCUPN = ZEROS                       
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                               
//SORTOUT  DD DSN=&&F520BLAN,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                                
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      OUTREC FIELDS=(1,67,C'000',71,104,C' ',176,41,C'000',220,281)             
//*---------------------------------------------------------------------        
//* SORT UPGRADER REQUEST RECORD BY REF-NO,                                     
//* INCLUDE UPGRADER 'G' OR '3'                                                 
//* EXIST-FLAT-TYE = '2B' FOR SMS-SALES TYPE = 2B CASES                         
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                               
//SORTOUT  DD DSN=&&F500UPG,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                                
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      INCLUDE COND=(116,1,CH,EQ,C'G',OR,116,1,CH,EQ,C'3',OR,                    
                    185,2,CH,EQ,C'2B')                                          
//*---------------------------------------------------------------------        
//* INITIALISE 10-YR INFOR BEFORE PROCESS                                       
//* OUTREC MTH-RESIDE, MTH-RES-JB-IND, 5YR-OCCUPN = ZEROS                       
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F500UPG,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F500ZERO,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                                
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      OUTREC FIELDS=(1,67,C'000',71,104,C' ',176,41,C'000',220,281)             
//*---------------------------------------------------------------------        
//* BASED ON THE REF-NO IN REQUEST MATCH SOC-OCCUPIER FILE                      
//* EXTRACT UPGRADER RECORD IN SOC-OCCUPIER FILE                                
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=BP13C809,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500ZERO,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558MTH,DISP=(OLD,PASS)                                     
//P13F558O DD DSN=&&F558UPG,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(120,20),RLSE)                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*---------------------------------------------------------------------        
//* CHECK SMS ^= 'OM' & FT ^= ' ' OUTPUT P13F558A FOR OCCUPATION CHECK          
//* CHECK RSL  = 'OM' & FT  = 'H' PRINT A REPORT FOR SALES                      
//* OTHERS WILL BE TAG AS ELIGIBLE FOR 5YR OCCUPATION OUTPUT P13F558B           
//*        ELIGIBLE CASES WILL BE UPDATED AFTER BP13U734                        
//* PRINT REPORT FOR HUDC CASES WITH RESALE STATUS = 'H1'                       
//*--------------------------------------------------------------------         
//STEP07   EXEC PGM=BP13C808,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558UPG,DISP=(OLD,PASS)                                     
//P13F558A DD DSN=&&F558EXLS,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(140,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//BP13F716 DD DSN=&&P13F716,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,50),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//P13F716A DD DSN=BP13.F716.SMS5YR.CONDO,DISP=OLD                               
//BP13L808 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MATCH RDB MOVE-IN-DATE FOR SALE-TYPE 2A & 8                                 
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F716,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,50),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=BP13.F716.A955Q747,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q747) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO/NRIC/SCH-ACC(X9)/MOVE-IN(DESCENDING)/MOVE-OUT               
//* FOR SALES TYPE 8                                                            
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.A955Q747,DISP=OLD                                   
//SORTOUT  DD DSN=&&F716TYP8,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,50),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A,51,9,A,115,8,D,123,8,A),FORMAT=CH                        
   INCLUDE COND=(133,2,CH,NE,C'2A')                                             
//*---------------------------------------------------------------------        
//* MATCH BY REGN-NO/NRIC IN BP13F716 TO BP13F558, THE F716-SCHE-ACC            
//* MUST BE = F558-HDBREF-SMS                                                   
//* TO GET THE DIRECT PURCHASE FLAT REC IN BP13F716                             
//* SELECT EARLIER MOVE-IN-DATE FROM MOBILITY TABEL, COUNTLAPSE 3 MONTH         
//*--------------------------------------------------------------------         
//STEP10A  EXEC PGM=BP13C626,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716TYP8,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558MTH,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=&&F716MRES,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,90),RLSE),                             
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO/NRIC/SCH-ACC(X9)/MOVE-IN(DESCENDING)/MOVE-OUT               
//* FOR SALES TYPE 2A, DO NOT CONSIDER LAPSE                                    
//*---------------------------------------------------------------------        
//STEP10A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.A955Q747,DISP=OLD                                   
//SORTOUT  DD DSN=&&F716TY2A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,50),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A,51,9,A,115,8,D,123,8,A),FORMAT=CH                        
   INCLUDE COND=(133,2,CH,EQ,C'2A')                                             
//*---------------------------------------------------------------------        
//* MATCH BY REGN-NO/NRIC IN BP13F716 TO BP13F558, THE F716-SCHE-ACC            
//* MUST BE = F558-HDBREF-SMS                                                   
//* TO GET THE DIRECT PURCHASE FLAT REC IN BP13F716                             
//* SELECT EARLIER MOVE-IN-DATE FROM MOBILITY TABEL, DO NOT COUNT LAPSE         
//*--------------------------------------------------------------------         
//STEP10B  EXEC PGM=BP13C050,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716TY2A,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558MTH,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=&&F716MRES,DISP=(MOD,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,90),RLSE),                             
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//* SORT OUT ONLY SALES FLATS IN NRIC/SCH-ACC-NO SEQUENCE                       
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716MRES,DISP=(OLD,PASS)                                    
//         DD DSN=BP13.F716.SMS5YR.CONDO,DISP=SHR                               
//SORTOUT  DD DSN=&&F716STAY,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(130,30),RLSE),                                
//         DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(51,9,CH,GE,C'700000000')                                       
//*---------------------------------------------------------------------        
//* COMPUTE THE LENGTH OF OCCUPATION BASE ON MOVING-IN-DATE AND 10/94           
//* FOR DUPLICATE HH TAKE IN LSE/CO-LSE OR LATEST DATE ACCEPTED                 
//* IF RECORD NOT MATCH IN RDB, UPDATE 9999 TO MTH-RESIDE                       
//*--------------------------------------------------------------------         
//* FOR NEW APPLN, USE DTE-REGN TO COMPUTE 10-YR OCCP = BP13C805(DEL)           
//* FOR OLD APPLN, USE DTE-BALLOT TO COMPUTE 10-YR OCCP = BP13U726              
//*--------------------------------------------------------------------         
//STEP15   EXEC PGM=BP13U726,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.ECOPEN,DISP=SHR                              
//BP13F716 DD DSN=&&F716STAY,DISP=(OLD,PASS)                                    
//P13F716A DD DSN=BP13.F716.RDB5YR.CONDO,DISP=OLD                               
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* MATCH BY REGN-NO/NRIC                                                       
//* WRITE F716-MTH-RESIDE TO F558-MTH-RESIDE                                    
//*--------------------------------------------------------------------         
//STEP16   EXEC PGM=BP13C625,COND=(0,NE)                                        
//BP13F716 DD DSN=BP13.F716.RDB5YR.CONDO,DISP=SHR                               
//BP13F558 DD DSN=&&F558MTH,DISP=(OLD,PASS)                                     
//P13F558A DD DSN=BP13.F558.UPGOCCP.ECS,DISP=OLD                                
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* BROWSE SOC OCCUPIER BP13K558, SO LONG AS ONE HA WITH MTH-RES < 119          
//* UPDATE THE CASE AS 'N' INELIGIBLE FOR 10-YR CHECK                           
//* BP13U722 - COMPUTE 5-YR/10-YR IN JCL BP13A736 BASED ON                      
//* F713-CDE-COHORT = OP - COMPUTE 5-YR                                         
//* F713-CDE-COHORT = QT,WK  - COMPUTE 10-YR                                    
//* BP13U734 (DELETE)                                                           
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=BP13U722,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.ECOPEN,DISP=SHR                              
//BP13F558 DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                                
//BP13F500 DD DSN=&&F520BLAN,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=BP13.F500.SEQUENCE.ECS,DISP=OLD                               
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* INCLUDE 10YR=NO CASES                                                       
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558ADST,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(34,3,CH,LT,C'060',AND,                                          
                34,3,CH,NE,C'000',AND,                                          
                34,3,CH,NE,C'   ')                                              
  SUM FIELDS=NONE                                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO ORDER                                                       
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13F520,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(240,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* TO CONFIRM WITH BP13F520 THE 10YR=NO                                        
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=BP13C638,COND=(0,NE)                                        
//BP13F520 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558ADST,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558YR10,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(150,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------                
//* SORT BY REGN/NRIC ORDER                                                     
//*-------------------------------------------------------------                
//STEP22   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558LONG,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
/*                                                                              
//*---------------------------------------------------------------------        
//* MATCH TO EXTRACT FULL BP13F558 RECORDS                                      
//*---------------------------------------------------------------------        
//STEP23   EXEC PGM=BP13C637,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558LONG,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558YR10,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558CHK,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(150,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------          
//* PRINT REPORT TO VERIFY PARENT/CHILD OR HUSBAND/WIFE CASES ON 10YR           
//* FOR 1 "YES"  AND 1 "NO", MTH-RESIDE DIFFERENT BUT SAME FLAT,                
//* TAKE THE LONGER MTH-RESIDE, OUTPUT FILE SO AS TO FORCE AS 'YES'             
//*-------------------------------------------------------------------          
//STEP24   EXEC PGM=BP13C639,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.ECOPEN,DISP=SHR                              
//BP13F558 DD DSN=&&F558CHK,DISP=(OLD,PASS)                                     
//BP13F500 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13F558A DD DSN=&&F558SON,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13F558B DD DSN=&&F558PART,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13L639A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L639B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L639C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------                
//* SORT BY REGN ORDER, MTH-RESIDE IN DECENDING ORDER                           
//*-------------------------------------------------------------                
//STEP25   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F558SON,DISP=(OLD,PASS)                                     
//         DD DSN=&&F558PART,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558MTF,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(150,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A,34,3,D),FORMAT=CH                                          
  OMIT COND=(34,3,CH,EQ,C'   ')                                                 
/*                                                                              
//*-------------------------------------------------------------------          
//* UPDATE 10-YR FROM NO TO YES, UPDATE WITH THE BIGGEST MTH-RESIDE             
//*-------------------------------------------------------------------          
//STEP26   EXEC PGM=BP13C698,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.ECOPEN,DISP=SHR                              
//BP13F500 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558MTF,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=BP13.F500.SEQUENCE.ECS,DISP=OLD                               
//BP13F510 DD DSN=&&F500AYES,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(50,15),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO ORDER INCLUDE CASES RE-UPDATE AS 10YR=YES                   
//*---------------------------------------------------------------------        
//STEP27   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                               
//SORTOUT  DD DSN=&&F520YES,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(240,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* TO CONFIRM WITH BP13F520 THE 10YR=NO                                        
//*---------------------------------------------------------------------        
//STEP28   EXEC PGM=BP13C638,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F520YES,DISP=(OLD,PASS)                                     
//BP13F558 DD DSN=&&F558ADST,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558NO,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* MATCH TO EXTRACT FULL BP13F558 RECORDS                                      
//*---------------------------------------------------------------------        
//STEP29   EXEC PGM=BP13C637,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558LONG,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558NO,DISP=(OLD,PASS)                                      
//P13F558O DD DSN=&&F558REC,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------          
//* FOR 10-YR=NO CASES, TO FURTHER CHECK,                                       
//* FOR TWO "NO" , MTH-RESIDE DIFFERENT BUT SAME FLAT, TAKE LONGER              
//* MTH-RESIDE                                                                  
//*-------------------------------------------------------------------          
//STEP30   EXEC PGM=BP13C640,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.ECOPEN,DISP=SHR                              
//BP13F558 DD DSN=&&F558REC,DISP=(OLD,PASS)                                     
//BP13F500 DD DSN=&&F520YES,DISP=(OLD,PASS)                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13F558A DD DSN=&&F558NO1,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13F558B DD DSN=&&F558NO2,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13L640A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L640B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------                
//* SORT BY REGN ORDER, MTH-RESIDE IN DECENDING ORDER                           
//*-------------------------------------------------------------                
//STEP31   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F558NO2,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F558REST,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A,34,3,D),FORMAT=CH                                          
  OMIT COND=(34,3,CH,EQ,C'   ')                                                 
/*                                                                              
//*-------------------------------------------------------------------          
//* UPDATE 10-YR FROM NO TO YES, UPDATE WITH THE BIGGEST MTH-RESIDE             
//*-------------------------------------------------------------------          
//STEP32   EXEC PGM=BP13C677,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.ECOPEN,DISP=SHR                              
//BP13F500 DD DSN=&&F520YES,DISP=(OLD,PASS)                                     
//BP13F558 DD DSN=&&F558REST,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=BP13.F500.SEQUENCE.ECS,DISP=OLD                               
//BP13F510 DD DSN=&&F500ANO,DISP=(,PASS),                                       
//         UNIT=SYSDA,SPACE=(CYL,(50,15),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*--------------------------------------------------------------------         
//* SORT REC UPDATE THRU BP13C698, BP13C677                                     
//*--------------------------------------------------------------------         
//STEP33   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F500AYES,DISP=(OLD,PASS)                                    
//         DD DSN=&&F500ANO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F520UPD,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//**--------------------------------------------------------------------        
//* UPDATE LONGER MTH-RESIDE AFTER ADJUSTMENT FROM BP13C639, C640               
//* TO BP13F558                                                                 
//*---------------------------------------------------------------------        
//STEP34   EXEC PGM=BP13C693,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F520UPD,DISP=(OLD,PASS)                                     
//BP13F558 DD DSN=&&F558LONG,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=BP13.F558.UPGOCCP.ECS,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT ELIGIBLE SOC OCCUPIER RECORD IN UNIQUE REFNO                           
//*---------------------------------------------------------------------        
//STEP35  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=&&F558EXLS,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=&&P13F558E,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,SPACE=(CYL,(100,5),RLSE),                               
//           DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* FOR EX-LESSEE -TCP/HUDC, MATCH RESALE HISTORY, COMPUTE THE 5 YR             
//* BASED ON DATE-SOLD-TO-SELLER                                                
//*---------------------------------------------------------------------        
//STEP36   EXEC PGM=BP13C810,COND=(0,NE)                                        
//BP13F558 DD DSN=&&P13F558E,DISP=(OLD,PASS)                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=&&TCPHUDC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(100,5),RLSE),                              
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*---------------------------------------------------------------------        
//* SORT TCPHUDC CASES BY REF-NO ORDER                                          
//*---------------------------------------------------------------------        
//STEP37   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&TCPHUDC,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F558TCP,DISP=(,PASS),                                       
//         UNIT=SYSDA,SPACE=(CYL,(100,10),RLSE),                                
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                               
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* SORT REQUEST FILE IN REFNO  ORDER                                           
//*---------------------------------------------------------------------        
//STEP38   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                               
//SORTOUT  DD DSN=&&F500ELIG,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(80,3),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* UPDATE 5YR-OCCUPN TAG TO SOC REQUEST AS EILIGIBLE CASE (Y)                  
//*        - FOR NEW HOUSEHOLD                                                  
//*              UPGRADER CASE BUT OPEN MARKET IN SMS                           
//* UPDATE 5YR-OCCUPN TAG TO SOC REQUEST AS INEILIGIBLE CASE (N)                
//*        - FOR EX-LESSEE OF HUDC/TCP IF OCCUP < 5 YR                          
//*---------------------------------------------------------------------        
//STEP39   EXEC PGM=BP13U711,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F500 DD DSN=&&F500ELIG,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558TCP,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=BP13.F500.SEQUENCE.ECS,DISP=OLD                               
//BP13L711 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
