//BP13A283 JOB (BP13P),'BP13A283',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR CANCELLING DBSS CASES                                       
//******************************************************************            
//*CHG REF  OIC   DATE    DESCRIPTION                                           
//*-------- ---- -------- -----------                                           
//*BP134210 ESA1 11082011 NEW JCL FOR CANCELLATION OF DBSS CASES                
//*BP137200 LSB1 04042018 ADD F915, K820 TO BP13C20M                            
//*****************************************************************             
//*   SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                    
//*          DATASET, SINGLE COPY                                               
//******************************************************************            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K800.APPLN,DISP=OLD                                     
//INPUT2   DD  DSN=BP13.K848.BKIMAGE,DISP=OLD                                   
//INPUT3   DD  DSN=BP13.K313.TRANS.HLE,DISP=OLD                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
/*                                                                              
//*****************************************************************             
//* SORT OUT DBSS CASES THAT HAS NOT BOOKED A FLAT (BP13K800)                   
//*****************************************************************             
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                            
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN    DD  *                                                                
        SORT FIELDS=(4,8,A),FORMAT=CH                                           
        INCLUDE COND=(1,1,CH,NE,C'C',AND,                                       
                      155,11,CH,EQ,C'           ',AND,                          
                      924,3,CH,EQ,C'DBS')                                       
//**********************************************************************        
//* CTRL REC FOR OPTION S8 - CANCELLATION OF DBSS APPLICATION                   
//**********************************************************************        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&F205,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=80),                                             
//        SPACE=(CYL,(5,2),RLSE)                                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'S8')                                              
//*****************************************************************             
//* SORTING OF BP13F800 WITH THAT HAS PASSED THE CRITERIA FOR F205              
//*****************************************************************             
//STEP04   EXEC PGM=BP13C20K,COND=(0,NE)                                        
//BP13F205 DD DSN=&&F205,DISP=(MOD,PASS)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(MOD,PASS)                                    
//P13F800A DD DSN=&&P13F800A,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                            
//             SPACE=(CYL,(50,30),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*****************************************************************             
//*         TO CANCEL DBSS APPLICATION                                          
//*****************************************************************             
//STEP05   EXEC PGM=BP13C20M,COND=(0,NE)                                        
//P13F800C DD DSN=&&P13F800A,DISP=(OLD,DELETE)                                  
//P13F800D DD DSN=BP13.F800.CANCEL,DISP=SHR                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F915  DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                  
//BP13L20M DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*****************************************************************             
//* CREATE BP13F313 FOR HLE UNDER CODE '04'                                     
//*****************************************************************             
//STEP5A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F800.CANCEL,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F313,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                               
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   OMIT COND=(785,6,CH,LT,C'201502')                                            
   OUTREC FIELDS=(C'04',4,8,90X)                                                
//*****************************************************************             
//* REPRO TO BP13K313                                                           
//*****************************************************************             
//STEP5B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&BP13F313,DISP=(OLD,DELETE)                                  
//OUTPUT   DD DSN=BP13.K313.TRANS.HLE,DISP=SHR                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT) OUTFILE(OUTPUT) REPLACE                                  
/*                                                                              
//*****************************************************************             
//* SORT F800D ACCDG TO QUEUE/REGN NO                                           
//*****************************************************************             
//STEP09   EXEC SORT                                                            
//SORTIN   DD DSN=BP13.F800.CANCEL,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13F800D,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                            
//             SPACE=(CYL,(50,30),RLSE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
    SORT FIELDS=(49,2,A,51,3,A,526,5,A,4,8,A),FORMAT=CH                         
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP06 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&F205,DISP=(OLD,PASS)                                       
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,DISP=MOD                                     
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A283                                                                
//*---------------------------------------------------------------------        
