//BP13A595 JOB (BP13P),'BP13A595',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//         NOTIFY=CSD0071,TYPRUN=HOLD                                   00020000
//*=================================================================*   00030000
//* CHGE REQ  DATE        BY   DESCRIPTION                          *   00040000
//* --------  ----        ---  -----------                          *   00050000
//* BP130418  22/09/1998  CLT1 Y2K COMPLIANCE CHANGES               *   00060000
//* BP130652  26/08/1999  NOR  EXPAND F520,F740 RECL 300 TO 500     *   00070000
//* BP130778  15/12/1999  YCH  INCLUDE BP13F713 IN BP13C579         *   00080000
//* BP132283  22/01/2003  ANC1 ADD STEPS TO DETERMINE LOAN TAG      *   00090000
//*                            & PREM CDE                           *   00100000
//* BP132352  25/06/2003  SK   ADD BP13C145,BP13C144                *   00110000
//* BP132384  02/08/2003  ANC1 ADD STEPS TO CAPTURE EXISTING/EX-DP  *   00120000
//*                            FLAT TYPE                            *   00130000
//* BP132432  20031021    MJ16 REMOVE PROCESSING OF NON BANK        *   00140000
//*                                                LOAN CASES       *   00150000
//* BP132451  02/12/2003  SK   ADD BP13L520 FOR BP13C520            *   00160000
//* BP132618  04/01/2005  ROM1 READ BP04.K010 INSTEAD OF BP04.F010  *   00170000
//* BP132862  15/06/2006  CKK7 INCLUDE BP13K648 IN BP13C528         *   00180000
//* BP133527 20090331 YCH2 INCLUDE UPDATE OF RESALE LEVY 'LN' OR 'LNS'  00190000
//* BP133639 20090708 ZDD1 INCLUDE BP13K595 ON BP13C145              '  00200000
//*                        INCLUDE OTHER ALTERNATE FILES OF BP13K595 '  00210000
//*          20090908 ZDD1 INCLUDE BP13K730 ON BP13C145                 00211000
//* BP134024 20100930 ZDD1 INCLUDE BP13K813 ON BP13C528                 00212000
//* BP135171 20140210 RJE1 TO CATER FOR DB2 UPGRADE                     00216000
//*=================================================================*   00220000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00230000
//*=====================================================================00240000
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                            00250000
//*  PRT01                                                              00260000
//*---------------------------------------------------------------------00270000
//PRT01    EXEC PGM=IEBGENER                                            00280000
//SYSUT1   DD *                                                         00290000
$DJDE$ JDE=BP13D,JDL=BP13,END;                                          00300000
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                           00310000
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00320000
//SYSPRINT DD SYSOUT=*                                                  00330000
//SYSIN    DD DUMMY                                                     00340000
//*=====================================================================00350000
//*      VERIFY FILES BEFORE JOB RUN                                    00360000
//*=====================================================================00370000
//STEPA    EXEC PGM=IDCAMS,COND=(0,NE)                                  00380000
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=OLD                              00390000
//INPUT2   DD DSN=BP13.K820.OCCUP,DISP=OLD                              00400000
//INPUT3   DD DSN=BP13.K840.APPLHIST,DISP=OLD                           00410000
//SYSPRINT DD SYSOUT=*                                                  00420000
//SYSIN    DD *                                                         00430000
          VFY FILE(INPUT1)                                              00440000
          VFY FILE(INPUT2)                                              00450000
          VFY FILE(INPUT3)                                              00460000
//*---------------------------------------------------------------------00470000
//*- BACKUP SOC MASTER                                                  00480000
//*---------------------------------------------------------------------00490000
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                  00500000
//SYSPRINT DD SYSOUT=*                                                  00510000
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=SHR,                             00520000
//            AMP=('BUFND=13')                                          00530000
//OUTPUT1  DD DSN=BP13.F800.APPLN,DISP=OLD                              00540000
//SYSIN    DD *                                                         00550000
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                               00560000
//*---------------------------------------------------------------------00570000
//* SORT ONLY NEW REN CASES                                             00580000
//*---------------------------------------------------------------------00590000
//STEP02  EXEC SORT,COND=(0,NE)                                         00600000
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                           00610000
//           AMP=('BUFND=22')                                           00620000
//SORTOUT DD DSN=&&BP13F740,DISP=(NEW,PASS),                            00630000
//           UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                       00640000
//           SPACE=(CYL,(70,10),RLSE)                                   00650000
//SYSIN   DD *                                                          00660000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      00670000
   INCLUDE COND=(300,1,CH,EQ,C'R')                                      00680000
//*OUTREC FIELDS=(1,210,2X,213,13,3X,229,72)                            00690000
//*---------------------------------------------------------------------00700000
//* OUTPUT LESSEE-CHECK = 'Y'                                           00710000
//*---------------------------------------------------------------------00720000
//STEP03   EXEC SORT,COND=(0,NE)                                        00730000
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                           00740000
//            AMP=('BUFND=23')                                          00750000
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                           00760000
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                       00770000
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                        00780000
//SYSIN    DD *                                                         00790000
  SORT FIELDS=(1,8,A),FORMAT=CH                                         00800000
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                       00810000
  OUTREC FIELDS=(1,200,200X)                                            00820000
/*                                                                      00830000
//*---------------------------------------------------------------------00840000
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY   00850000
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                 00860000
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"         00870000
//*---------------------------------------------------------------------00880000
//STEP04   EXEC PGM=BP13C577,COND=(0,NE)                                00890000
//BP13F500 DD DSN=&&BP13F740,DISP=(OLD,PASS)                            00900000
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,PASS)                            00910000
//BP13F558 DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   00920000
//SYSDBG   DD SYSOUT=*                                                  00930000
//SYSDBOUT DD SYSOUT=*                                                  00940000
//SYSOUT   DD SYSOUT=*                                                  00950000
//*                                                                     00960000
//*---------------------------------------------------------------------00970000
//* SORT BY NRIC SEQUENCE                                               00980000
//*---------------------------------------------------------------------00990000
//STEP05   EXEC SORT,COND=(0,NE)                                        01000000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   01010000
//SORTOUT  DD DSN=&&P13F558B,DISP=(NEW,PASS),                           01020000
//            DCB=(BLKSIZE=27600,LRECL=600,RECFM=FB),                   01030000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01040000
//SYSIN    DD *                                                         01050000
   SORT FIELDS=(9,9,A),FORMAT=CH                                        01060000
//*---------------------------------------------------------------------01070000
//* BASED ON THE NRIC IN REQUEST, SOC-OCCUPIER FILE                     01080000
//* MATCH NRIC IN SMS FILE, IF MATCH UPDATE AS UPGRADER                 01090000
//*---------------------------------------------------------------------01100000
//STEP06   EXEC PGM=BP13U706,COND=(0,NE)                                01110000
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                    01120000
//BP13F558 DD DSN=&&P13F558B,DISP=(OLD,PASS)                            01130000
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                          01140000
//            AMP=('BUFND=8','BUFNI=4')                                 01150000
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                            01160000
//            AMP=('BUFND=8','BUFNI=4')                                 01170000
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                             01180000
//            AMP=('BUFND=8','BUFNI=4')                                 01190000
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                          01200000
//            AMP=('BUFND=8','BUFNI=4')                                 01210000
//P13F558O DD DSN=&&P13F558C,DISP=(NEW,PASS),                           01220000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01230000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01240000
//BP13F559 DD DUMMY                                                     01250000
//BP13L706 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          01260000
//SYSPRINT DD SYSOUT=*                                                  01270000
//SYSDBG   DD SYSOUT=*                                                  01280000
//SYSDBOUT DD SYSOUT=*                                                  01290000
//SYSOUT   DD SYSOUT=*                                                  01300000
//*-----------------------------------------------------------------    01310000
//* MATCH NRIC WITH TRANSFER HISTORY ONLY FOR TRF-APPLN-DTE  AFTER      01320000
//* '19970901' OR FOR DIVORCE CASES TRF-APPLN-DATE > 19970709           01330000
//* AND TRF-SCH-ACC IS NOT THE SAME AS SMS-SCH-ACC                      01340000
//* AS ONE NRIC TRANSFER, ALL FOUR LESSEE WILL BE FOUND IN TRANSFER     01350000
//* BP13.F558.UPGOCCP CONTAINS TRANSFER HISTORY DATA                    01360000
//*-----------------------------------------------------------------    01370000
//STEP07   EXEC PGM=BP13C619,COND=(0,NE)                                01380000
//BB13K510 DD DSN=BB13.K510.UINHIST,DISP=SHR,                           01390000
//            AMP=('BUFND=4','BUFNI=8')                                 01400000
//BB13K500 DD DSN=BB13.K500.HISTORY,DISP=SHR,                           01410000
//            AMP=('BUFND=4','BUFNI=8')                                 01420000
//BP13F558 DD DSN=&&P13F558C,DISP=(OLD,PASS)                            01430000
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   01440000
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          01450000
//SYSPRINT DD SYSOUT=*                                                  01460000
//SYSDBG   DD SYSOUT=*                                                  01470000
//SYSDBOUT DD SYSOUT=*                                                  01480000
//SYSABOUT DD SYSOUT=*                                                  01490000
//SYSIN    DD *                                                         01500000
/*                                                                      01510000
//*---------------------------------------------------------------------01520000
//* SORT IN SCH-ACC-NI ORDER FOR RETRIEVING FLAT TYPE FROM PBF          01530000
//*---------------------------------------------------------------------01540000
//STEP08   EXEC SORT,COND=(0,NE)                                        01550000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   01560000
//SORTOUT  DD DSN=&&F558SORT,DISP=(NEW,PASS),                           01570000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01580000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01590000
//SYSIN     DD  *                                                       01600000
   SORT FIELDS=(101,11,A),FORMAT=CH                                     01610000
//*---------------------------------------------------------------------01620000
//* FLAT TYPE  IS NOT AVAILABLE IN SMS                                  01630000
//* BASED ON THE SCHEME ACCOUNT FR SMS EXTRACT FLAT TYPE FROM PBF       01640000
//*---------------------------------------------------------------------01650000
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       01660000
//BP13F558 DD DSN=&&F558SORT,DISP=(OLD,PASS)                            01670000
//BP13OUT  DD DSN=&&F558PBF,DISP=(NEW,PASS),                            01680000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01690000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01700000
//SYSTSPRT DD SYSOUT=*                                                  01710000
//SYSPRINT DD SYSOUT=*                                                  01720000
//SYSUDUMP DD SYSOUT=*                                                  01730000
//SYSOUT   DD SYSOUT=*                                                  01740000
//SYSDBOUT DD SYSOUT=*                                                  01750000
//SYSTSIN  DD *                                                         01760000
  DSN SYSTEM(DSN)                                                       01770000
  RUN PROGRAM(BP13C742) PLAN(BP13PCC) -                                 01780000
      LIB('BP13.BATCH.LOADCOB')                                         01790000
  END                                                                   01800000
/*                                                                      01810000
//*---------------------------------------------------------------------01820000
//* SORT OUT BP13F558 IN NRIC ORDER, IF ONE NRIC WITH MULTIPLE SMS REC  01830000
//* PROGRAM WILL SELECT THE BIGGER FLAT TYPE                            01840000
//*---------------------------------------------------------------------01850000
//STEP10   EXEC SORT,COND=(0,NE)                                        01860000
//SORTIN   DD DSN=&&F558PBF,DISP=(OLD,PASS)                             01870000
//SORTOUT  DD DSN=&&F558SMSF,DISP=(NEW,PASS),                           01880000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01890000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01900000
//SYSIN    DD  *                                                        01910000
   SORT FIELDS=(1,17,A),FORMAT=CH                                       01920000
//*---------------------------------------------------------------------01930000
//* SELECT THE LEAST PRIORITY IF FOUND TO HAVE MULTIPLE SMS RECORDS     01940000
//* SELECT BIGGER FLAT TYPE, DIRENT PURCHASE OVER OPEN MARKET           01950000
//*---------------------------------------------------------------------01960000
//STEP11   EXEC PGM=BP13C734,COND=(0,NE)                                01970000
//BP13F558 DD DSN=&&F558SMSF,DISP=(OLD,PASS)                            01980000
//P13F558A DD DSN=&&F558FLAT,DISP=(NEW,PASS),                           01990000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   02000000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      02010000
//SYSPRINT DD SYSOUT=*                                                  02020000
//SYSDBG   DD SYSOUT=*                                                  02030000
//SYSDBOUT DD SYSOUT=*                                                  02040000
//SYSOUT   DD SYSOUT=*                                                  02050000
//*---------------------------------------------------------------------02060000
//* SORT OUT BY NRIC SEQUENCE                                           02070000
//*---------------------------------------------------------------------02080000
//STEP12   EXEC SORT,COND=(0,NE)                                        02090000
//SORTIN   DD DSN=&&F558FLAT,DISP=(OLD,PASS)                            02100000
//SORTOUT  DD DSN=&&F558RESL,DISP=(NEW,PASS),                           02110000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   02120000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      02130000
//SYSIN    DD  *                                                        02140000
   SORT FIELDS=(9,9,A),FORMAT=CH                                        02150000
//*---------------------------------------------------------------------02160000
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                    02170000
//* MATCH NRIC IN RESALE FILE, IF MATCH UPDATE AS UPGRADER              02180000
//*---------------------------------------------------------------------02190000
//STEP13   EXEC PGM=BP13U702,COND=(0,NE)                                02200000
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                    02210000
//BP13F558 DD DSN=&&F558RESL,DISP=(OLD,PASS)                            02220000
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                          02230000
//            AMP=('BUFND=8','BUFNI=4')                                 02240000
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                           02250000
//            AMP=('BUFND=8','BUFNI=4')                                 02260000
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   02270000
//BP13L702 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          02280000
//SYSPRINT DD SYSOUT=*                                                  02290000
//SYSDBG   DD SYSOUT=*                                                  02300000
//SYSDBOUT DD SYSOUT=*                                                  02310000
//SYSOUT   DD SYSOUT=*                                                  02320000
//*---------------------------------------------------------------------02330000
//* SORT REQUEST OCCUPIER BY NRIC                                       02340000
//*---------------------------------------------------------------------02350000
//STEP14A  EXEC SORT,COND=(0,NE)                                        02360000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   02370000
//SORTOUT  DD DSN=&&F558NRIC,DISP=(NEW,PASS),                           02380000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                     02390000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                    02400000
//SYSIN    DD  *                                                        02410000
      SORT FIELDS=(9,9,A),FORMAT=CH                                     02420000
//*---------------------------------------------------------------------02430000
//* SORT DEBARMENT FILE BY PRIMARY KEY                                  02440000
//*---------------------------------------------------------------------02450000
//STEP14B  EXEC SORT,COND=(0,NE)                                        02460000
//SORTIN   DD DSN=BP04.K010.DEBAR,DISP=SHR,                             02470000
//            AMP=('BUFND=8','BUFNI=4')                                 02480000
//SORTOUT  DD DSN=&&BP04K010,DISP=(NEW,PASS),                           02490000
//            UNIT=(SYSDA,2),SPACE=(CYL,(1000,150),RLSE),               02500000
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                    02510000
//SYSIN    DD  *                                                        02520000
      SORT FIELDS=(1,44,A),FORMAT=CH                                    02530000
//*---------------------------------------------------------------------02540000
//* MATCH SOC OCCUPIER REC WITH DEBARMENT REC FD IN                     02550000
//*---------------------------------------------------------------------02560000
//STEP15   EXEC PGM=BP13C690,COND=(0,NE)                                02570000
//BP13F558 DD DSN=&&F558NRIC,DISP=(OLD,PASS)                            02580000
//P04K010  DD DSN=&&BP04K010,DISP=(OLD,PASS)                            02590000
//P13F558A DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   02600000
//P13F558B DD DUMMY                                                     02610000
//P13F558C DD DUMMY                                                     02620000
//P13F558D DD DUMMY                                                     02630000
//P13F558E DD DUMMY                                                     02640000
//SYSPRINT DD SYSOUT=*                                                  02650000
//SYSDBG   DD SYSOUT=*                                                  02660000
//SYSDBOUT DD SYSOUT=*                                                  02670000
//SYSOUT   DD SYSOUT=*                                                  02680000
/*                                                                      02690000
//*-----------------------------------------------------------------    02700000
//* SORT BY REGN NO                                                     02710000
//*-----------------------------------------------------------------    02720000
//STEP16   EXEC SORT,COND=(0,NE)                                        02730000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   02740000
//SORTOUT  DD DSN=&&BP13F558,DISP=(NEW,PASS),                           02750000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                     02760000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                    02770000
//SYSIN    DD  *                                                        02780000
    SORT FIELDS=(1,17,A),FORMAT=CH                                      02790000
//*=====================================================================02800000
//* RDB INFO                                                            02810000
//*=====================================================================02820000
//*---------------------------------------------------------------------02830000
//* SPLIT F558 FILE FROM THE OUTPUT OF DETERMINE THE HOUSEHOLD TYPE     02840000
//* IF - HHTYPE='G' OR '3' OR                                           02850000
//*      (HHTYPE='H' AND FILE-STATUS-SMS OR FILE-STATUS-RSL = 'OM')     02860000
//*          OUTPUT TO BP13F716                                         02870000
//* ELSE                                                                02880000
//*      OUTPUT TO BP13F716 TO CHECK RDB                                02890000
//*---------------------------------------------------------------------02900000
//* 1)  P13F716A - TO FURTHER CHECK WITH RDB                            02910000
//* 2)  BP13F716 - INFO ALREADY FOUND IN SMS & RESALE                   02920000
//*---------------------------------------------------------------------02930000
//STEP16A  EXEC PGM=BP13C788,COND=(0,NE)                                02940000
//BP13F558 DD DSN=&&BP13F558,DISP=(OLD,PASS)                            02950000
//P13F716A DD DSN=&&P13F716A,DISP=(NEW,PASS),                           02960000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                   02970000
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                       02980000
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                           02990000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                   03000000
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                       03010000
//SYSPRINT DD SYSOUT=*                                                  03020000
//SYSDBG   DD SYSOUT=*                                                  03030000
//SYSDBOUT DD SYSOUT=*                                                  03040000
//SYSOUT   DD SYSOUT=*                                                  03050000
//*---------------------------------------------------------------------03060000
//* SORT OUT IN NRIC SEQUENCE                                           03070000
//*---------------------------------------------------------------------03080000
//STEP16B  EXEC SORT,COND=(0,NE)                                        03090000
//SORTIN   DD DSN=&&P13F716A,DISP=(OLD,PASS)                            03100000
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                           03110000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03120000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03130000
//SYSIN    DD *                                                         03140000
   SORT FIELDS=(9,9,A),FORMAT=CH                                        03150000
//*---------------------------------------------------------------------03160000
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                     03170000
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED       03180000
//*---------------------------------------------------------------------03190000
//STEP16C  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                    03200000
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                            03210000
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                            03220000
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                           03230000
//P13F716A DD DSN=&&F716Q748,DISP=(NEW,PASS),                           03240000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03250000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03260000
//SYSPRINT DD SYSOUT=*                                                  03270000
//SYSTSPRT DD SYSOUT=*                                                  03280000
//SYSOUT   DD SYSOUT=*                                                  03290000
//SYSDBOUT DD SYSOUT=*                                                  03300000
//SYSABOUT DD SYSOUT=*                                                  03310000
//SYSTSIN DD *                                                          03320000
 DSN SYSTEM(DSN)                                                        03330000
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                 03340000
      LIB('BP13.BATCH.LOADCOB')                                         03350000
 END                                                                    03360000
/*                                                                      03370000
//*---------------------------------------------------------------------03380000
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                            03390000
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                03400000
//*---------------------------------------------------------------------03410000
//STEP16D  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       03420000
//BP13F716 DD DSN=&&F716Q748,DISP=(OLD,PASS)                            03430000
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                             03440000
//BP13OUT  DD DSN=&&F716C754,DISP=(NEW,PASS),                           03450000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03460000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03470000
//SYSTSPRT DD SYSOUT=*                                                  03480000
//SYSPRINT DD SYSOUT=*                                                  03490000
//SYSUDUMP DD SYSOUT=*                                                  03500000
//SYSOUT   DD SYSOUT=2                                                  03510000
//SYSDBOUT DD SYSOUT=*                                                  03520000
//SYSTSIN  DD *                                                         03530000
  DSN SYSTEM(DSN)                                                       03540000
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                 03550000
      LIB('BP13.BATCH.LOADCOB')                                         03560000
  END                                                                   03570000
/*                                                                      03580000
//*---------------------------------------------------------------------03590000
//* SORT OUT IN REGN NO SEQUENCE                                        03600000
//*---------------------------------------------------------------------03610000
//STEP16E  EXEC SORT,COND=(0,NE)                                        03620000
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                            03630000
//         DD DSN=&&F716C754,DISP=(OLD,PASS)                            03640000
//SORTOUT  DD DSN=&&F716REGN,DISP=(NEW,PASS),                           03650000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03660000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03670000
//SYSIN    DD *                                                         03680000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        03690000
//*---------------------------------------------------------------------03700000
//*  TO DETERMINE SMS FT/STATUS, RSL FT/STATUS, RDB FT/STATUS           03710000
//*---------------------------------------------------------------------03720000
//STEP16F   EXEC PGM=BP13C519,COND=(0,NE)                               03730000
//BP13F716  DD DSN=&&F716REGN,DISP=(OLD,PASS)                           03740000
//BP13F520  DD DSN=&&BP13F740,DISP=(OLD,PASS)                           03750000
//P13F520A  DD DSN=&&F520C519,DISP=(NEW,PASS),                          03760000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   03770000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       03780000
//SYSPRINT  DD SYSOUT=*                                                 03790000
//SYSDBG    DD SYSOUT=*                                                 03800000
//SYSDBOUT  DD SYSOUT=*                                                 03810000
//SYSOUT    DD SYSOUT=*                                                 03820000
//*                                                                     03830000
//*-----------------------------------------------------------------    03840000
//* SORT THE REGN NO ORDER                                              03850000
//*-----------------------------------------------------------------    03860000
//STEP16G  EXEC SORT,COND=(0,NE)                                        03870000
//SORTIN   DD DSN=&&F520C519,DISP=(OLD,PASS)                            03880000
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                           03890000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   03900000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       03910000
//SYSIN DD *                                                            03920000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      03930000
//*---------------------------------------------------------------------03940000
//*  TO DETERMINE LOAN TAG & PREMIUM CODE                               03950000
//*---------------------------------------------------------------------03960000
//STEP17    EXEC PGM=BP13C520,COND=(0,NE)                               03970000
//BP13F520  DD DSN=&&F520SORT,DISP=(OLD,PASS)                           03980000
//BP13F558  DD DSN=&&BP13F558,DISP=(OLD,PASS)                           03990000
//BR10K010  DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                          04000000
//             AMP=('BUFNI=8','BUFND=4')                                04010000
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                         04020000
//             AMP=('BUFNI=8','BUFND=4')                                04030000
//P13F520A  DD DSN=&&BP13F520,DISP=(NEW,PASS),                          04040000
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                  04050000
//             UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                      04060000
//BP13L520  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                         04070000
//SYSPRINT  DD SYSOUT=*                                                 04080000
//SYSDBG    DD SYSOUT=*                                                 04090000
//SYSDBOUT  DD SYSOUT=*                                                 04100000
//SYSOUT    DD SYSOUT=*                                                 04110000
//*                                                                     04120000
//*-----------------------------------------------------------------    04130000
//* SORT F520 IN REGN NO ORDER                                          04140000
//*-----------------------------------------------------------------    04150000
//STEP16   EXEC SORT,COND=(0,NE)                                        04160000
//SORTIN   DD DSN=&&BP13F520,DISP=(OLD,PASS)                            04170000
//SORTOUT  DD DSN=&&P13F520A,DISP=(NEW,PASS),                           04180000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   04190000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       04200000
//SYSIN DD *                                                            04210000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      04220000
//*---------------------------------------------------------------------04230000
//* TO EXTRACT THE SUCCESSFUL BALLOTED APPLICANT'S & OCCUPIER INFOR     04240000
//* TO UPDATE THE SOC MASTER AND SOC OCCUPIER FILE                      04250000
//* TO PASS RECORDS TO CFS FOR PRE-ELIGIBILITY CHECK                    04260000
//*---------------------------------------------------------------------04270000
//STEP17   EXEC PGM=BP13C528,COND=(0,NE)                                04280000
//BP13F800  DD DSN=&&BP13F800,DISP=(NEW,PASS),                          04290000
//          UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),             04300000
//          SPACE=(CYL,(100,50),RLSE)                                   04310000
//BP13F520 DD DSN=&&P13F520A,DISP=(OLD,PASS)                            04320000
//BP13K530 DD DSN=BP13.K530.ISSUENO,DISP=SHR                            04330000
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                            04340000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             04350000
//            AMP=('BUFNI=8','BUFND=4')                                 04360000
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                             04370000
//            AMP=('BUFNI=8','BUFND=4')                                 04380000
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                          04390000
//            AMP=('BUFNI=8','BUFND=4')                                 04400000
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                         04410000
//             AMP=('BUFNI=8','BUFND=4')                                04420000
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR,                            04421000
//             AMP=('BUFNI=8','BUFND=4')                                04422000
//BP13F310 DD DSN=BP13.F310.APPOINT,DISP=MOD                            04430000
//SYSPRINT DD SYSOUT=*                                                  04440000
//SYSDBG   DD SYSOUT=*                                                  04450000
//SYSDBOUT DD SYSOUT=*                                                  04460000
//SYSOUT   DD SYSOUT=*                                                  04470000
//*-----------------------------------------------------------------    04480000
//* ASSIGNING RESISTRATION NUMBER TO OIC                                04490000
//*-----------------------------------------------------------------    04500000
//STEP17A  EXEC PGM=BP13C144,COND=(0,NE)                                04510000
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                            04520000
//BP13F520 DD DSN=&&P13F520A,DISP=(OLD,PASS)                            04530000
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                           04540000
//         AMP=('BUFNI=8','BUFND=4')                                    04550000
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                            04560000
//         AMP=('BUFNI=8','BUFND=4')                                    04570000
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                      04580000
//         AMP=('BUFND=8','BUFNI=4')                                    04590000
//BP13L144 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          04600000
//SYSOUT   DD SYSOUT=*                                                  04610000
//SYSUDUMP DD SYSOUT=*                                                  04620000
//SYSABEND DD SYSOUT=*                                                  04630000
//SYSDBUG  DD SYSOUT=*                                                  04640000
//SYSABOUT DD SYSOUT=*                                                  04650000
//SYSDBOUT DD SYSOUT=*                                                  04660000
//*-----------------------------------------------------------------    04670000
//* SKIP F800 CASES WHERE DTE-REGN IS NOT = F001-CURR-DTE               04680000
//*-----------------------------------------------------------------    04690000
//STEP17B  EXEC PGM=BP13C145,COND=(0,NE)                                04700000
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                            04710000
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                            04720000
//         AMP=('BUFNI=8','BUFND=4')                                    04730000
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                      04740000
//         AMP=('BUFND=8','BUFNI=4')                                    04750000
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                            04760000
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                         04770000
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR                   04780000
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR                   04790000
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR                   04800000
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR                   04810000
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                           04811000
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                     04812000
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                     04813000
//P13L145A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          04820000
//SYSOUT   DD SYSOUT=*                                                  04830000
//SYSUDUMP DD SYSOUT=*                                                  04840000
//SYSABEND DD SYSOUT=*                                                  04850000
//SYSDBUG  DD SYSOUT=*                                                  04860000
//SYSABOUT DD SYSOUT=*                                                  04870000
//SYSDBOUT DD SYSOUT=*                                                  04880000
//*----------------------------------------------------------------*    04890000
//* TO EXTRACT SUCCESSFUL APPLICANTS FROM REQUEST FILE             *    04900000
//*----------------------------------------------------------------*    04910000
//STEP18   EXEC PGM=BP13C579,COND=(0,NE)                                04920000
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                          04930000
//BP13F520 DD DSN=&&BP13F740,DISP=(SHR,PASS)                            04940000
//BP13F200 DD DSN=&&P13F200A,DISP=(NEW,PASS),                           04950000
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=23400),                   04960000
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE)                         04970000
//SYSOUT   DD SYSOUT=2                                                  04980000
//SYSPRINT DD SYSOUT=*                                                  04990000
//SYSABOUT DD SYSOUT=*                                                  05000000
//SYSDBOUT DD SYSOUT=*                                                  05010000
/*                                                                      05020000
//*-------------------------------------------------------------------- 05030000
//* TO APPEND BP13F200 RECORDS TO BOOKING APPOINTMENT FILE              05040000
//*---------------------------------------------------------------------05050000
//STEP19    EXEC PGM=IDCAMS,COND=(0,NE)                                 05060000
//SYSPRINT  DD SYSOUT=*                                                 05070000
//INPUT1    DD DSN=&&P13F200A,DISP=(SHR,PASS)                           05080000
//OUTPUT1   DD DSN=BP13.F200.BKAPPMT,DISP=MOD                           05090000
//SYSIN     DD  *                                                       05100000
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                05110000
/*                                                                      05120000
//*---------------------------------------------------------------------05130000
//* TO UPDATE RESALE STATUS = 'LN' OR 'LNS' TO MASTER                   05140000
//* AFTER DETAIL UPDATED TO MASTER                                      05150000
//*---------------------------------------------------------------------05160000
//STEP21    EXEC PGM=BP13C71N,COND=(0,NE)                               05170000
//BP13F520  DD DSN=&&P13F520A,DISP=(OLD,PASS)                           05180000
//BP13K825  DD DSN=BP13.K825.REQOCCP,DISP=SHR                           05190000
//BB24K510  DD DSN=BB24.K510.UINHIST,DISP=SHR,                          05200000
//             AMP=('BUFNI=8','BUFND=4')                                05210000
//BB24K500  DD DSN=BB24.K500.RESLHIST,DISP=SHR,                         05220000
//             AMP=('BUFNI=8','BUFND=4')                                05230000
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                            05240000
//             AMP=('BUFNI=8','BUFND=4')                                05250000
//SYSPRINT  DD SYSOUT=*                                                 05260000
//SYSDBG    DD SYSOUT=*                                                 05270000
//SYSDBOUT  DD SYSOUT=*                                                 05280000
//SYSOUT    DD SYSOUT=*                                                 05290000
//*---------------------------------------------------------------------05300000
//* END BP13A595                                                        05310000
//*---------------------------------------------------------------------05320000
