//BP13AHN1 JOB (BP13P),'BP13AHN1',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB00302
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*  THIS JCL IS TO MOVE THE HNR DETAILS FOR BTO CASES TO      *                
//*  BP13K747                                                  *                
//*  THIS JCL IS ONLY FOR BTO CASES. BE CASES USE BP13AHN2                      
//**************************************************************                
//* CHG-NO  BY   ON                                                             
//* ---------------                                                             
//*BP132496 CKK 040422 - NEW JCL                                                
//*BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                  
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN                                            
//*-----------------------------------------------------------------            
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K747.SUCCREGN,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1, APPLICATION TEAM                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* INCLUDE SUCC PA BTO CASES ONLY.                                             
//* PRIORITY CASES TAKING PA QUOTA INCLUDED TOO.                                
//* SORT BY ZONE/FT/ALLOC-SCH/HHTY/CAT/CDE-STATUS                               
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520HIGH,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(130,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,213,3,A,116,1,A,225,1,A,                         
               260,1,A),                                                        
            FORMAT=CH                                                           
  INCLUDE COND=(226,3,CH,NE,C'   ',AND,                                         
                213,3,CH,EQ,C'PA')                                              
//*---------------------------------------------------------------------        
//* UPDATE CAT4 TO CAT3 AND UPDATE HHTY = T TO HHTY = H                         
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C798,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F520HIGH,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=&&F520REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(130,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY ZONE/FT/ALLOCA-SCH/HHTY/CAT/CDE-STATUS/RANDOM NO                    
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520REGN,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,213,3,A,116,1,A,225,1,A,                         
               260,1,D,1,28,A),                                                 
            FORMAT=CH                                                           
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING                             
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//BP13F747 DD DSN=&&F747,DISP=(NEW,PASS),                                       
//            SPACE=(CYL,(15,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=150)                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*                                                                             
//*---------------------------------------------------------------------        
//* RE-ARRANGE RANDOM NO IN F747 FILE                                           
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13C542,COND=(0,NE)                                        
//BP13F747 DD DSN=&&F747,DISP=(OLD,PASS)                                        
//P13F747A DD DSN=BP13.F747.SUCCREGN.BTO,DISP=OLD                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT OUT CASES FOR PRINTING REPORT                                          
//*---------------------------------------------------------------------        
//STEP06 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD DSN=BP13.F747.SUCCREGN.BTO,DISP=SHR                                
//SORTOUT DD DSN=&&F747SCH,DISP=(NEW,PASS),                                     
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(15,5),RLSE),                                           
//           DCB=(RECFM=FB,LRECL=150)                                           
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
   INCLUDE COND=(12,3,CH,NE,C'JB ')                                             
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT THE RANGE OF SUCCESSFUL RANDOM NO                      
//*---------------------------------------------------------------------        
//STEP07   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F713 DD DSN=BP13.BLANK.CHAR50,DISP=SHR                                    
//BP13K747 DD DSN=&&F747SCH,DISP=(OLD,PASS)                                     
//BP13L710 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S710),DISP=SHR                             
/*                                                                              
//*-------------------------------------------------------------------- 00130010
//* SORT OUT EXISTING CASES IN PRODUCTION                                       
//*------------------------------------------------------------------           
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.K747.SUCCREGN,DISP=SHR                                    
//SORTOUT DD DSN=BP13.F747.SUCCREGN.BKUP,DISP=SHR                               
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
//*-------------------------------------------------------------------- 00130010
//* SORT OUT EXISTING CASES IN PRODUCTION                                       
//*------------------------------------------------------------------           
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F747.SUCCREGN.BTO,DISP=SHR                                
//        DD DSN=BP13.F747.SUCCREGN.BKUP,DISP=SHR                               
//SORTOUT DD DSN=&&F747END,DISP=(NEW,PASS),                                     
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=150),                                             
//        SPACE=(CYL,(8,5),RLSE)                                                
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* TO DELETE AND DEFINE BP13K747                                               
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=&&F747END,DISP=(OLD,PASS)                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DEL (BP13.K747.SUCCREGN) CL PURGE                                             
  DEF CLUSTER                                         -                         
        (NAME(BP13.K747.SUCCREGN)                     -                         
        SHAREOPTIONS(2,3)                             -                         
        KEYS(16 0)                                    -                         
        RECSZ(150 150)                                -                         
        CYL(8 5)                                      -                         
        STORCLAS(PRODRLS)                             -                         
        LOG(NONE)                                     -                         
        FREESPACE(30 30)                              -                         
        CISZ(4096)                                    -                         
        IXD                                           -                         
        UNQ)                                          -                         
      DATA                                            -                         
        (NAME(BP13.K747.SUCCREGN.DATA))          -                              
      INDEX                                           -                         
        (NAME(BP13.K747.SUCCREGN.INDEX))                                        
         IF LASTCC = 0 THEN                           -                         
           REPRO IFILE(INPUT1)                        -                         
                 ODS(BP13.K747.SUCCREGN)                                        
/*                                                                              
//*---------------------------------------------------------------------        
