//BP13RP02 JOB (BP13P),'PRECHK',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),              
//      NOTIFY=CSD0071,USER=BP13SURP,SCHENV=HICPU                               
//*=====================================================================        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=====================================================================        
//*  BATCH JOB TRIGGER ONLINE PROGRAM (RUN AFTER BP13A810 & BP13DP03)           
//*  IF COND CODE 99 TO CHECK L9CI LOG BECAUSE PRE-E CHK NOT COMPLETE           
//*=====================================================================        
//PS010    EXEC PGM=BP13C9CI,COND=(0,NE),PARM='CI1TORP,BP13SURP'                
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//         DD DSN=CICS.ALIAS.SDFHEXCI,DISP=SHR                                  
//BP13F730 DD DSN=BP13.F730.SERSREQ,DISP=SHR                                    
//BP13L9CI DD DSN=BP13.L9CI.SERSERR,DISP=OLD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
