//BP13M224 JOB (BP13P),'BP13M224',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010005
//         SCHENV=PKZIP,NOTIFY=CSD0071                                  00020005
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030005
//*                                                                     00040005
//******************************************************************    00050005
//*CHG REF  OIC   DATE    DESCRIPTION                                   00060005
//*-------- ---- -------- -----------                                   00070005
//*BP139306 PP11 19102022 NEW JCL FOR FTP TO MND                        00080005
//*BP139419 PP11 17112022 CATER TO MODIFY ZIPPED DSN FILE FW3G.         00081007
//*-------------------------------------------------------------------- 00090005
//* STEP 00 : DEL ZIP FILE                                              00100005
//*--------------------------------------------------------------------*00110005
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                  00120005
//SYSPRINT DD SYSOUT=*                                                  00130005
//SYSIN    DD *                                                         00140005
     DEL BP13.FW3F.APPLMHA.SENT.FORMAT.ZIP                              00150005
     DEL BP13.FTPPUT.FW3F.APPLMHA.SENT                                  00160005
     DEL BP13.ZIPINP.FW3F.APPLMHA.SENT                                  00170005
     DEL BP13.FW3G.OCCPMHA.SENT.FORMAT.ZIP                              00180005
     DEL BP13.FTPPUT.FW3G.OCCPMHA.SENT                                  00190005
     DEL BP13.ZIPINP.FW3G.OCCPMHA.SENT                                  00200005
     IF MAXCC < 12 THEN                                                 00210005
        SET MAXCC = 0                                                   00220005
/*                                                                      00230005
//*--------------------------------------------------------------------*00240005
//* STEP01:  TO PREPARE ZIP AND FTP FILE                                00250005
//*--------------------------------------------------------------------*00260005
//STEP01 EXEC SAS,COND=(0,NE)                                           00270005
//BP13FTP DD DSN=BP13.FTPPUT.FW3F.APPLMHA.SENT,DISP=(NEW,CATLG),        00280005
//      AVGREC=K,SPACE=(1,(5,50),RLSE),                                 00290005
//      LRECL=400,BLKSIZE=0,RECFM=FB,DSORG=PS                           00300005
//BP13ZIP DD DSN=BP13.ZIPINP.FW3F.APPLMHA.SENT,DISP=(NEW,CATLG),        00310005
//      AVGREC=K,SPACE=(1,(5,50),RLSE),                                 00320005
//      LRECL=402,BLKSIZE=0,RECFM=FB,DSORG=PS                           00330005
//SYSOUT DD SYSOUT=*                                                    00340005
//SYSPRINT DD SYSOUT=*                                                  00350005
//SYSIN DD *                                                            00360005
  %GLOBAL CCYYMMDD;                                                     00370005
                                                                        00380005
  DATA _NULL_;                                                          00390005
    LENGTH ODD $2.;                                                     00400005
    LENGTH OMM $2.;                                                     00410005
    LENGTH OYY $4.;                                                     00420005
    LENGTH OHH $2.;                                                     00430005
    LENGTH ONN $2.;                                                     00440005
    LENGTH OSS $2.;                                                     00450005
    CUT_DTE = TODAY();                                                  00460005
    CUR_TME = TIME();                                                   00470005
    ODD = DAY(CUT_DTE);                                                 00480005
    OMM = MONTH(CUT_DTE);                                               00490005
    OYY = YEAR(CUT_DTE);                                                00500005
    OHH = HOUR(CUR_TME);                                                00510005
    ONN = MINUTE(CUR_TME);                                              00520005
    OSS = SECOND(CUR_TME);                                              00530005
    DTE_CURR = OYY||OMM||ODD||OHH||ONN||OSS;                            00540005
    DTE_CURR = TRANSLATE(DTE_CURR,'0',' ');                             00550005
                                                                        00560005
    STDZIP00 = "-ARCHIVE(BP13.FW3F.APPLMHA.SENT.FORMAT.ZIP)";           00570005
    STDZIP01 = "-ARCHVOL(DUMMY)";                                       00580005
    STDZIP02 = "-METHOD(FAST)";                                         00590005
    STDZIP03 = "-ZIPPED_DSN(BP13.FW3F.APPLMHA.SENT.FORMAT,";            00600005
    STDZIP06 = "-FILE_TERMINATOR()";                                    00610005
    STDZIP07 = "   BP13.FW3F.APPLMHA.SENT.FORMAT";                      00620005
                                                                        00630005
    STDPUT00 = "CD /PROD/APPN/DATA/BP13/FROM-HDB/MHA-RESDATA";          00640005
    STDPUT01 = "DIR";                                                   00650005
    STDPUT02 = "BINARY";                                                00660005
    STDPUT03 = "PUT 'BP13.FW3F.APPLMHA.SENT.FORMAT.ZIP' + ";            00670005
    STDPUT04 = "BP13FW3F_MHA_APPLMHA_";                                 00680005
    STDPUT06 = ".txt";                                                  00690005
    STDPUT07 = ".zip";                                                  00700005
                                                                        00710005
    STDPUT05 = STDPUT04||DTE_CURR||STDPUT06||STDPUT07;                  00720005
    STDZIP04 = STDZIP03||STDPUT04||'-';                                 00730005
    STDZIP05 = DTE_CURR||STDPUT06||')';                                 00740005
    STDPUT08 = "LS";                                                    00750005
    STDPUT09 = "QUIT";                                                  00760005
                                                                        00770005
    FILE BP13ZIP;                                                       00780005
         PUT STDZIP00;                                                  00790005
         PUT STDZIP01;                                                  00800005
         PUT STDZIP02;                                                  00810005
         PUT STDZIP04;                                                  00820005
         PUT STDZIP05;                                                  00830005
         PUT STDZIP06;                                                  00840005
         PUT STDZIP07;                                                  00850005
                                                                        00860005
    FILE BP13FTP;                                                       00870005
         PUT STDPUT00;                                                  00880005
         PUT STDPUT01;                                                  00890005
         PUT STDPUT02;                                                  00900005
         PUT STDPUT03;                                                  00910005
         PUT STDPUT05;                                                  00920005
         PUT STDPUT08;                                                  00930005
         PUT STDPUT09;                                                  00940005
//*--------------------------------------------------------------------*00950005
//* STEP 02 : COMPRESS FILE                                             00960005
//*--------------------------------------------------------------------*00970005
//STEP02   EXEC PKZIP,COND=(0,NE)                                       00980005
//SYSIN DD DSN=BP13.ZIPINP.FW3F.APPLMHA.SENT,DISP=SHR                   00990005
//*--------------------------------------------------------------------*01000005
//* STEP 03 : FTP COMPRESSED FILE TO SGNETSTAGE SERVER                  01010005
//*           PATH --> E:\FTP\PROD\APPN\DATA\BP13\FROM-HDB\BULKSMS      01020005
//*--------------------------------------------------------------------*01030005
//STEP03   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                 01040005
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          01050005
//INPUT    DD DSN=BP13.FTPPUT.FW3F.APPLMHA.SENT,DISP=SHR                01060005
//*                                                                     01070005
//*--------------------------------------------------------------------*01080005
//* STEP04:  TO PREPARE ZIP AND FTP FILE                                01090005
//*--------------------------------------------------------------------*01100005
//STEP04 EXEC SAS,COND=(0,NE)                                           01110005
//BP13FTP DD DSN=BP13.FTPPUT.FW3G.OCCPMHA.SENT,DISP=(NEW,CATLG),        01120005
//      AVGREC=K,SPACE=(1,(5,50),RLSE),                                 01130005
//      LRECL=300,BLKSIZE=0,RECFM=FB,DSORG=PS                           01140005
//BP13ZIP DD DSN=BP13.ZIPINP.FW3G.OCCPMHA.SENT,DISP=(NEW,CATLG),        01150005
//      AVGREC=K,SPACE=(1,(5,50),RLSE),                                 01160005
//      LRECL=302,BLKSIZE=0,RECFM=FB,DSORG=PS                           01170005
//SYSOUT DD SYSOUT=*                                                    01180005
//SYSPRINT DD SYSOUT=*                                                  01190005
//SYSIN DD *                                                            01200005
  %GLOBAL CCYYMMDD;                                                     01210005
                                                                        01220005
  DATA _NULL_;                                                          01230005
    LENGTH ODD $2.;                                                     01240005
    LENGTH OMM $2.;                                                     01250005
    LENGTH OYY $4.;                                                     01260005
    LENGTH OHH $2.;                                                     01270005
    LENGTH ONN $2.;                                                     01280005
    LENGTH OSS $2.;                                                     01290005
    CUT_DTE = TODAY();                                                  01300005
    CUR_TME = TIME();                                                   01310005
    ODD = DAY(CUT_DTE);                                                 01320005
    OMM = MONTH(CUT_DTE);                                               01330005
    OYY = YEAR(CUT_DTE);                                                01340005
    OHH = HOUR(CUR_TME);                                                01350005
    ONN = MINUTE(CUR_TME);                                              01360005
    OSS = SECOND(CUR_TME);                                              01370005
    DTE_CURR = OYY||OMM||ODD||OHH||ONN||OSS;                            01380005
    DTE_CURR = TRANSLATE(DTE_CURR,'0',' ');                             01390005
                                                                        01400005
    STDZIP00 = "-ARCHIVE(BP13.FW3G.OCCPMHA.SENT.FORMAT.ZIP)";           01410005
    STDZIP01 = "-ARCHVOL(DUMMY)";                                       01420005
    STDZIP02 = "-METHOD(FAST)";                                         01430005
    STDZIP03 = "-ZIPPED_DSN(BP13.FW3G.OCCPMHA.SENT.FORMAT,";            01440006
    STDZIP06 = "-FILE_TERMINATOR()";                                    01450005
    STDZIP07 = "   BP13.FW3G.OCCPMHA.SENT.FORMAT";                      01460005
                                                                        01470005
    STDPUT00 = "CD /PROD/APPN/DATA/BP13/FROM-HDB/MHA-RESDATA";          01480005
    STDPUT01 = "DIR";                                                   01490005
    STDPUT02 = "BINARY";                                                01500005
    STDPUT03 = "PUT 'BP13.FW3G.OCCPMHA.SENT.FORMAT.ZIP' + ";            01510005
    STDPUT04 = "BP13FW3G_MHA_OCCPMHA_";                                 01520005
    STDPUT06 = ".txt";                                                  01530005
    STDPUT07 = ".zip";                                                  01540005
                                                                        01550005
    STDPUT05 = STDPUT04||DTE_CURR||STDPUT06||STDPUT07;                  01560005
    STDZIP04 = STDZIP03||STDPUT04||'-';                                 01570005
    STDZIP05 = DTE_CURR||STDPUT06||')';                                 01580005
    STDPUT08 = "LS";                                                    01590005
    STDPUT09 = "QUIT";                                                  01600005
                                                                        01610005
    FILE BP13ZIP;                                                       01620005
         PUT STDZIP00;                                                  01630005
         PUT STDZIP01;                                                  01640005
         PUT STDZIP02;                                                  01650005
         PUT STDZIP04;                                                  01660005
         PUT STDZIP05;                                                  01670005
         PUT STDZIP06;                                                  01680005
         PUT STDZIP07;                                                  01690005
                                                                        01700005
    FILE BP13FTP;                                                       01710005
         PUT STDPUT00;                                                  01720005
         PUT STDPUT01;                                                  01730005
         PUT STDPUT02;                                                  01740005
         PUT STDPUT03;                                                  01750005
         PUT STDPUT05;                                                  01760005
         PUT STDPUT08;                                                  01770005
         PUT STDPUT09;                                                  01780005
//*--------------------------------------------------------------------*01790005
//* STEP 05 : COMPRESS FILE                                             01800005
//*--------------------------------------------------------------------*01810005
//STEP05   EXEC PKZIP,COND=(0,NE)                                       01820005
//SYSIN DD DSN=BP13.ZIPINP.FW3G.OCCPMHA.SENT,DISP=SHR                   01830005
//*--------------------------------------------------------------------*01840005
//* STEP 06 : FTP COMPRESSED FILE TO SGNETSTAGE SERVER                  01850005
//*           PATH --> E:\FTP\PROD\APPN\DATA\BP13\FROM-HDB\BULKSMS      01860005
//*--------------------------------------------------------------------*01870005
//STEP06   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                 01880005
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          01890005
//INPUT    DD DSN=BP13.FTPPUT.FW3G.OCCPMHA.SENT,DISP=SHR                01900005
//*                                                                     01910005
//*--------------------------------------------------------------------*01920005
