//BP13A730  JOB (BP13P),'BP13A730',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//        DD DSN=BR12.BATCH.LOADCOB,DISP=SHR                                    
//*--------------------------------------------------------------------         
//* QUARTERLY REPORT FOR 10-YEAR CHECK                                          
//*--------------------------------------------------------------------         
//* JOB RUN : BP13A730 - CHECK SMS, SUBLET, RESALE HISTORY                      
//*         :          - CHECK RELATIONSHIP  TO RE-UPDATE 10-YR TAG             
//*         : BP13A736 - CHECK TRANSFER HISTORY                                 
//* WEEKLY    REPORT FOR 10-YEAR CHECK                                          
//* JOB RUN : BP13A535 - CHECK SMS, SUBLET, RESALE HISTORY                      
//*         :          - CHECK RELATIONSHIP  TO RE-UPDATE 10-YR TAG             
//*         : BP13A737 - CHECK TRANSFER HISTORY                                 
//* EXEC CONDO COMPUTE FOR 5-YEAR CHECK                                         
//* JOB RUN : BP13A955 - CHECK SMS, SUBLET, RESALE HISTORY                      
//*         :          - CHECK RELATIONSHIP  TO RE-UPDATE 10-YR TAG             
//*         : BP13A956   CHECK TRANSFER HISTORY                                 
//*--------------------------------------------------------------------         
//* CHG-NO   BY    ON     DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP130630 YCH 990703   READ RDB2 AND CHGE F715 TO F716                       
//* BP130630 LSB 990727   CHG Q748 TO Q747 READ MOBILITY TABLE, MULTIPLE        
//*                       REC,BP13C626 TO SELECT EARLIER DATE,                  
//* BP130652 LSB 990826   EXPAND F 500,510,520,K520 RECL 300 TO 500             
//* BP130789 AKT 000122   SORT BP13.F558.UPGOCCP.YR10BKUP(STEP0B).              
//* BP130871 SSS 000609   LISTING FOR EAALSS                                    
//* BP130897 AKT 000807   EXPAND F558 RECL FROM 400 TO 600                      
//* BP132589 SK  040914   INCLUDE DB2 ROUTINE IN BP13C669                       
//* BP135171 RJE 140210   TO CATER FOR DB2 UPGRADE                              
//* BP135370 YCH2 100614  ADD BR12 LOAD DUE TO BR12C902 MODULE NOT FOUND        
//*--------------------------------------------------------------------         
//* FOR CUTOVER CASES, USE 9409 TO COMPUTE 5YR                                  
//*     OCT 94  CASES, USE 9410 TO COMPUTE 5YR                                  
//*     NOV ONWARDS  , USE DTE-REGN TO COMPUTE 5YR                              
//*--------------------------------------------------------------------         
//*      5 YEARS RESIDENT PRIORITY SCHEME                                       
//*      CURRENT HA'S + TAG OCCUPIERS AS LESSEE/CO-LESSEE IN RDB                
//*      AND RESALE HUDC FLAT                                                   
//*      DETERMINE THE LENGTH OF OCCUPATION                                     
//*=====================================================================        
//* STEP 00-01   LASER PRINT                                                    
//*      10-20   CHK CURRENT LSE OR RESALE HUDC FLAT                            
//*      30-80   CHK LENGTH OF OCCUPATION IF IT IS CURRENT LESSEE               
//*      90-120  UPDATE 5YR ELIG TAG TO MASTER FILE                             
//*********************************************************************         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : 1 COPY                                                             
//*--------------------------------------------------------------------         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//* REPRO FILE FOR BACKUP PURPOSE                                               
//*--------------------------------------------------------------------         
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F520.BALLOT,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F520.BALLOT.YR10BKUP,DISP=OLD                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*---------------------------------------------------------------------        
//* SORT BP13F558 IN REGN/NRIC ORDER                                            
//*---------------------------------------------------------------------        
//STEP0B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//SORTOUT  DD DSN=BP13.F558.UPGOCCP.YR10BKUP,DISP=SHR                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* PROGRAM TO MATCH SMS SUBLET HISTORY TO GET                                  
//* SUBLET-SMS - SUBLET UNDER CURRENT, SMS HDBREF-NO                            
//* SUBLET-RSL - SUBLET UNDER EX-ACCOUNT, RSL HDBREF-NO                         
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F558 DD DSN=BP13.F558.UPGOCCP.YR10BKUP,DISP=SHR                           
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F558  DD DSN=BP13.F558.UPGOCCP.RFS,DISP=OLD                                
//P13L669  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C669) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BP13F558 IN REGN/NRIC ORDER                                            
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558MTH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(240,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A,9,9,A),FORMAT=CH                                          
//*--------------------------------------------------------------------         
//* INITIALISE 10-YR INFOR BEFORE PROCESS                                       
//* OUTREC MTH-RESIDE, MTH-RES-JB-IND, 5YR-OCCUPN = ZEROS                       
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.BALLOT,DISP=SHR                                     
//SORTOUT  DD DSN=&&F520BLAN,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                                
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      OUTREC FIELDS=(1,67,C'000',71,104,C' ',176,41,C'000',220,281)             
//*---------------------------------------------------------------------        
//* SORT UPGRADER REQUEST RECORD BY REF-NO,                                     
//* INCLUDE UPGRADER 'G' OR '3'                                                 
//* EXIST-FLAT-TYE = '2B' FOR SMS-SALES TYPE = 2B CASES                         
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.BALLOT,DISP=SHR                                     
//SORTOUT  DD DSN=&&F500ZERO,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                                
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      INCLUDE COND=(116,1,CH,EQ,C'G',OR,116,1,CH,EQ,C'3',OR,                    
                    185,2,CH,EQ,C'2B')                                          
      OUTREC FIELDS=(1,67,C'000',71,104,C' ',176,41,C'000',220,281)             
//*---------------------------------------------------------------------        
//* EXCLUDE CASES FOUND IN DEBRAMENT AS '62','64','66',TREAT AS UPGRADER        
//* BUT BYPASS 10-YR CHECK, CDE-EXIST-FLAT-TYE = 'DB'                           
//*---------------------------------------------------------------------        
//*STEP03   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F500UPG,DISP=(OLD,PASS)                                    
//*SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                  
//*         UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                               
//*         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                              
//*SYSIN    DD  *                                                               
//*      SORT FIELDS=(123,8,A),FORMAT=CH                                        
//*      OMIT COND=(116,1,CH,EQ,C'G',AND,185,2,CH,EQ,C'DB')                     
//*---------------------------------------------------------------------        
//* BASED ON THE REF-NO IN REQUEST MATCH SOC-OCCUPIER FILE                      
//* EXTRACT UPGRADER RECORD IN SOC-OCCUPIER FILE                                
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13C809,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500ZERO,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558MTH,DISP=(OLD,PASS)                                     
//P13F558O DD DSN=&&F558UPG,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(300,30),RLSE)                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*---------------------------------------------------------------------        
//* CHECK SMS ^= 'OM' & FT ^= ' ' OUTPUT P13F558A FOR OCCUPATION CHECK          
//* CHECK RSL  = 'OM' & FT  = 'H' PRINT A REPORT FOR SALES                      
//* OTHERS WILL BE TAG AS ELIGIBLE FOR 5YR OCCUPATION OUTPUT P13F558B           
//*        ELIGIBLE CASES WILL BE UPDATED AFTER BP13U722                        
//* PRINT REPORT FOR HUDC CASES WITH RESALE STATUS = 'H1'                       
//*--------------------------------------------------------------------         
//STEP06   EXEC PGM=BP13C808,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558UPG,DISP=(OLD,PASS)                                     
//P13F558A DD DSN=&&F558EXLS,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(140,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//P13F716A DD DSN=&&P13F716,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(180,50),RLSE),                             
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//BP13F716 DD DSN=BP13.F716.SMS5YR,DISP=OLD                                     
//BP13L808 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MATCH RDB TO GET MOVE-IN-DATE FOR SALES TYPE 2A & 8                         
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F716,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,50),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=BP13.F716.A730Q747,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q747) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO/NRIC/SCH-ACC(X9)/MOVE-IN(DESCENDING)/MOVE-OUT               
//* FOR SALES TYPE 8                                                            
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.A730Q747,DISP=OLD                                   
//SORTOUT  DD DSN=&&F716TYP8,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,50),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A,51,9,A,115,8,D,123,8,A),FORMAT=CH                        
   INCLUDE COND=(133,2,CH,NE,C'2A')                                             
//*---------------------------------------------------------------------        
//* MATCH BY REGN-NO/NRIC IN BP13F716 TO BP13F558, THE F716-SCHE-ACC            
//* MUST BE = F558-HDBREF-SMS                                                   
//* TO GET THE DIRECT PURCHASE FLAT REC IN BP13F716                             
//* SELECT EARLIER MOVE-IN-DATE FROM MOBILITY TABEL, COUNTLAPSE 3 MONTH         
//*--------------------------------------------------------------------         
//STEP10   EXEC PGM=BP13C626,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716TYP8,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558MTH,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=&&F716MRES,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,90),RLSE),                             
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO/NRIC/SCH-ACC(X9)/MOVE-IN(DESCENDING)/MOVE-OUT               
//* FOR SALES TYPE 2A, DO NOT CONSIDER LAPSE                                    
//*---------------------------------------------------------------------        
//STEP10A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.A730Q747,DISP=OLD                                   
//SORTOUT  DD DSN=&&F716TY2A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,50),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A,51,9,A,115,8,D,123,8,A),FORMAT=CH                        
   INCLUDE COND=(133,2,CH,EQ,C'2A')                                             
//*---------------------------------------------------------------------        
//* MATCH BY REGN-NO/NRIC IN BP13F716 TO BP13F558, THE F716-SCHE-ACC            
//* MUST BE = F558-HDBREF-SMS                                                   
//* TO GET THE DIRECT PURCHASE FLAT REC IN BP13F716                             
//* SELECT EARLIER MOVE-IN-DATE FROM MOBILITY TABEL, DO NOT COUNT LAPSE         
//*--------------------------------------------------------------------         
//STEP10B  EXEC PGM=BP13C050,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716TY2A,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558MTH,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=&&F716MRES,DISP=(MOD,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,90),RLSE),                             
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT ONLY SALES FLATS IN NRIC/SCH-ACC-NO SEQUENCE                       
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716MRES,DISP=(OLD,PASS)                                    
//         DD DSN=BP13.F716.SMS5YR,DISP=SHR                                     
//SORTOUT  DD DSN=&&F716STAY,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(150,90),RLSE),                             
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(51,9,CH,GE,C'700000000')                                       
//*---------------------------------------------------------------------        
//* COMPUTE THE LENGTH OF OCCUPATION BASE ON MOVING-IN-DATE AND 10/94           
//* FOR DUPLICATE HH TAKE IN LSE/CO-LSE OR LATEST DATE ACCEPTED                 
//* IF RECORD NOT MATCH IN RDB, UPDATE 9999 TO MTH-RESIDE                       
//*--------------------------------------------------------------------         
//* FOR NEW APPLN, USE DTE-REGN TO COMPUTE 10-YR OCCP                           
//* FOR OLD APPLN, USE DTE-BALLOT TO COMPUTE 10-YR OCCP                         
//* F713-CDE-COHORT = QT (QUARTERLY)                                            
//*--------------------------------------------------------------------         
//STEP12   EXEC PGM=BP13U726,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F716 DD DSN=&&F716STAY,DISP=(OLD,PASS)                                    
//P13F716A DD DSN=BP13.F716.QTRYR5,DISP=OLD                                     
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* MATCH BY REGN-NO/NRIC                                                       
//* WRITE F716-MTH-RESIDE TO F558-MTH-RESIDE                                    
//*--------------------------------------------------------------------         
//STEP13   EXEC PGM=BP13C625,COND=(0,NE)                                        
//BP13F716 DD DSN=BP13.F716.QTRYR5,DISP=SHR                                     
//BP13F558 DD DSN=&&F558MTH,DISP=(OLD,PASS)                                     
//P13F558A DD DSN=BP13.F558.UPGOCCP.RFS,DISP=OLD                                
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* BROWSE SOC OCCUPIER BP13K558, SO LONG AS ONE HA WITH MTH-RES < 119          
//* UPDATE THE CASE AS 'N' INELIGIBLE FOR 10-YR CHECK                           
//* F713-CDE-COHORT = OP, EC OPEN CATEGORY COMPUTE 5-YR                         
//* F713-CDE-COHORT = QT, WK COMPUTE 10-YR                                      
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=BP13U722,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F558 DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//BP13F500 DD DSN=&&F520BLAN,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=BP13.F520.QTRYR5,DISP=OLD                                     
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* INCLUDE 10YR=NO CASES                                                       
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558ADST,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(34,3,CH,LT,C'120',AND,                                          
                34,3,CH,NE,C'000',AND,                                          
                34,3,CH,NE,C'   ')                                              
  SUM FIELDS=NONE                                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO ORDER                                                       
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F520.QTRYR5,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F520,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(240,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* TO CONFIRM WITH BP13F520 THE 10YR=NO                                        
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=BP13C638,COND=(0,NE)                                        
//BP13F520 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558ADST,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558YR10,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(180,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------                
//* SORT BY REGN/NRIC ORDER                                                     
//*-------------------------------------------------------------                
//STEP22   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558LONG,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(180,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
/*                                                                              
//*---------------------------------------------------------------------        
//* MATCH TO EXTRACT FULL BP13F558 RECORDS                                      
//*---------------------------------------------------------------------        
//STEP23   EXEC PGM=BP13C637,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558LONG,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558YR10,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558CHK,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(180,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------          
//* PRINT REPORT TO VERIFY PARENT/CHILD OR HUSBAND/WIFE CASES ON 10YR           
//* FOR 1 "YES"  AND 1 "NO", MTH-RESIDE DIFFERENT BUT SAME FLAT,                
//* TAKE THE LONGER MTH-RESIDE, OUTPUT FILE SO AS TO FORCE AS 'YES'             
//*-------------------------------------------------------------------          
//STEP24   EXEC PGM=BP13C639,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F558 DD DSN=&&F558CHK,DISP=(OLD,PASS)                                     
//BP13F500 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13F558A DD DSN=&&F558SON,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13F558B DD DSN=&&F558PART,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13L639A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L639B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L639C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------                
//* SORT BY REGN ORDER, MTH-RESIDE IN DECENDING ORDER                           
//*-------------------------------------------------------------                
//STEP25   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F558SON,DISP=(OLD,PASS)                                     
//         DD DSN=&&F558PART,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558MTF,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(180,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A,34,3,D),FORMAT=CH                                          
  OMIT COND=(34,3,CH,EQ,C'   ')                                                 
/*                                                                              
//*-------------------------------------------------------------------          
//* UPDATE 10-YR FROM NO TO YES, UPDATE WITH THE BIGGEST MTH-RESIDE             
//*-------------------------------------------------------------------          
//STEP26   EXEC PGM=BP13C698,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F500 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558MTF,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=BP13.F520.QTRYR5.UPDATE,DISP=OLD                              
//BP13F510 DD DSN=BP13.F520.QTRYR5.ADJYES,DISP=OLD                              
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO ORDER INCLUDE CASES RE-UPDATE AS 10YR=YES                   
//*---------------------------------------------------------------------        
//STEP27   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F520.QTRYR5.UPDATE,DISP=SHR                              
//SORTOUT  DD DSN=&&F520YES,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(240,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* TO CONFIRM WITH BP13F520 THE 10YR=NO                                        
//*---------------------------------------------------------------------        
//STEP28   EXEC PGM=BP13C638,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F520YES,DISP=(OLD,PASS)                                     
//BP13F558 DD DSN=&&F558ADST,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558NO,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* MATCH TO EXTRACT FULL BP13F558 RECORDS                                      
//*---------------------------------------------------------------------        
//STEP29   EXEC PGM=BP13C637,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558LONG,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558NO,DISP=(OLD,PASS)                                      
//P13F558O DD DSN=&&F558REC,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(180,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------          
//* FOR 10-YR=NO CASES, TO FURTHER CHECK,                                       
//* FOR TWO "NO" , MTH-RESIDE DIFFERENT BUT SAME FLAT, TAKE LONGER              
//* MTH-RESIDE                                                                  
//*-------------------------------------------------------------------          
//STEP30   EXEC PGM=BP13C640,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F558 DD DSN=&&F558REC,DISP=(OLD,PASS)                                     
//BP13F500 DD DSN=&&F520YES,DISP=(OLD,PASS)                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13F558A DD DSN=&&F558NO1,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13F558B DD DSN=&&F558NO2,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13L640A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L640B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------                
//* SORT BY REGN ORDER, MTH-RESIDE IN DECENDING ORDER                           
//*-------------------------------------------------------------                
//STEP31   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F558NO2,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F558REST,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(180,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A,34,3,D),FORMAT=CH                                          
  OMIT COND=(34,3,CH,EQ,C'   ')                                                 
/*                                                                              
//*-------------------------------------------------------------------          
//* UPDATE 10-YR FROM NO TO YES, UPDATE WITH THE BIGGEST MTH-RESIDE             
//*-------------------------------------------------------------------          
//STEP32   EXEC PGM=BP13C677,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F500 DD DSN=&&F520YES,DISP=(OLD,PASS)                                     
//BP13F558 DD DSN=&&F558REST,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=BP13.F520.QTRYR5.UPDATE,DISP=OLD                              
//BP13F510 DD DSN=BP13.F520.QTRYR5.ADJNO,DISP=OLD                               
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*--------------------------------------------------------------------         
//* SORT REC UPDATE THRU BP13C698, BP13C677                                     
//*--------------------------------------------------------------------         
//STEP33   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.QTRYR5.ADJYES,DISP=SHR                              
//         DD DSN=BP13.F520.QTRYR5.ADJNO,DISP=SHR                               
//SORTOUT  DD DSN=&&F520UPD,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//**--------------------------------------------------------------------        
//* UPDATE LONGER MTH-RESIDE AFTER ADJUSTMENT FROM BP13C639, C640               
//* TO BP13F558                                                                 
//*---------------------------------------------------------------------        
//STEP34   EXEC PGM=BP13C693,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F520UPD,DISP=(OLD,PASS)                                     
//BP13F558 DD DSN=&&F558LONG,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=BP13.F558.UPGOCCP.RFS,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT UPGRADER REQUEST RECORDS BY REGN-NO                                    
//* INCLUDE UPGRADER AND 10-YR=YES CASES                                        
//* EXIST-FLAT-TYE = '2B' FOR SMS-SALES TYPE = 2B CASES                         
//*---------------------------------------------------------------------        
//STEP35   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.QTRYR5.UPDATE,DISP=SHR                              
//SORTOUT  DD DSN=&&F500EXAP,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,SPACE=(CYL,(200,20),RLSE),                                 
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      INCLUDE COND=(116,1,CH,EQ,C'G',AND,175,1,CH,NE,C'N')                      
//*---------------------------------------------------------------------        
//* EXCLUDE CASES FOUND IN DEBRAMENT AS '62','64','66',TREAT AS UPGRADER        
//* BUT BYPASS 10-YR CHECK, CDE-EXIST-FLAT-TYE = 'DB'                           
//*---------------------------------------------------------------------        
//*STEP20   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F500RSL,DISP=(OLD,PASS)                                    
//*SORTOUT  DD DSN=&&F500EXAP,DISP=(NEW,PASS),                                  
//*        UNIT=SYSDA,SPACE=(CYL,(200,20),RLSE),                                
//*        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//*SYSIN    DD  *                                                               
//*      SORT FIELDS=(123,8,A),FORMAT=CH                                        
//*      OMIT COND=(116,1,CH,EQ,C'G',AND,185,2,CH,EQ,C'DB')                     
//*---------------------------------------------------------------------        
//* SORT REQUEST OCCUPIER BY REF-NO                                             
//*---------------------------------------------------------------------        
//STEP36   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558EXAP,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,SPACE=(CYL,(240,20),RLSE),                                 
//        DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                                
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,8,A,9,9,A),FORMAT=CH                                       
      INCLUDE COND=(84,1,CH,EQ,C'Y')                                            
//*---------------------------------------------------------------------        
//* BASED ON THE REF-NO IN REQUEST MATCH SOC-OCCUPIER FILE                      
//* EXTRACT UPGRADER RECORD IN SOC-OCCUPIER FILE                                
//*---------------------------------------------------------------------        
//STEP37   EXEC PGM=BP13C627,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500EXAP,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558EXAP,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558FND,DISP=(NEW,PASS),                                    
//           DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                            
//           UNIT=SYSDA,SPACE=(CYL,(240,20),RLSE)                               
//P13F558A DD DSN=&&F558NHH,DISP=(NEW,PASS),                                    
//           DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                            
//           UNIT=SYSDA,SPACE=(CYL,(240,20),RLSE)                               
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//*---------------------------------------------------------------------        
//* 1) FOR EX-LESSEE -TCP/HUDC, MATCH RESALE HISTORY, COMPUTE THE 10 YR         
//*    BASED ON DATE-SOLD-TO-SELLER                                             
//* 2) SUBTRACT SUBLET-RSL (DUE TO RESALE FLAT) FROM 10-YR OCCP-PERIOD          
//*---------------------------------------------------------------------        
//* FOR NEW APPLN, USE DTE-REGN TO COMPUTE 10-YR-OCCP                           
//* FOR OLD APPLN, USE DTE-BALLOT TO COMPUTE 10-YR-OCCP                         
//* FOR EXEC OPEN CATEGORY, USE CURRENT DATE TO COMPUTE 5-YR-OCCP               
//* F713-CDE-COHORT = OP, EC OPEN CATEGORY COMPUTE 5-YR                         
//* F713-CDE-COHORT = QT, WK COMPUTE 10-YR                                      
//*---------------------------------------------------------------------        
//STEP38   EXEC PGM=BP13U724,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F558 DD DSN=&&F558FND,DISP=(OLD,PASS)                                     
//P13F558O DD DSN=&&F558HIST,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(180,20),RLSE)                              
//BP13L724 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO ORDER                                                       
//*---------------------------------------------------------------------        
//STEP39   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558HIST,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558RESL,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* SORT REQUEST FILE IN REGNO ORDER FOR RESALE MATCHING REC                    
//*---------------------------------------------------------------------        
//STEP40   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.QTRYR5.UPDATE,DISP=SHR                              
//SORTOUT  DD DSN=&&F500RESL,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(200,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* UPDATE 10YR-OCCUPN TAG TO SOC REQUEST AS INEILIGIBLE CASE (N)               
//*        - FOR EX-LESSEE                                                      
//*---------------------------------------------------------------------        
//* TO  COMPUTE 10-YR-OCCP FOR QUARTERLY. WEEKLY                                
//* FOR EXEC OPEN CATEGORY, USE CURRENT DATE TO COMPUTE 5-YR-OCCP               
//* F713-CDE-COHORT = OP, EC OPEN CATEGORY COMPUTE 5-YR                         
//* F713-CDE-COHORT = QT, WK COMPUTE 10-YR                                      
//*---------------------------------------------------------------------        
//STEP41   EXEC PGM=BP13U725,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F500 DD DSN=&&F500RESL,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558RESL,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=BP13.F520.QTRYR5,DISP=OLD                                     
//BP13L725 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO ORDER                                                       
//*---------------------------------------------------------------------        
//STEP42   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558RESL,DISP=(OLD,PASS)                                    
//         DD DSN=&&F558NHH,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*********************************************************************         
//* 1) PRINT REPORT TO CHECK MTH-RESIDE IN RESALE < SMS-MTH-RESIDE              
//*---------------------------------------------------------------------        
//* INCLUDE ONLY SMS-MTH-RESIDE > 000 AND SMS-MTH-RESIDE < 120                  
//*              RSL-MTH-RESIDE > 000 AND RSL-MTH-RESIDE < 120                  
//* SORT BY REGN-NO/NRIC ORDER,                                                 
//*---------------------------------------------------------------------        
//STEP43   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558RSL,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(180,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(21,3,CH,GT,C'000',AND,21,3,CH,LT,C'120',AND,                   
                 24,3,CH,GT,C'000',AND,24,3,CH,LT,C'120')                       
//*---------------------------------------------------------------------        
//* MATCH TO EXTRACT FULL BP13F558 RECORDS                                      
//*---------------------------------------------------------------------        
//STEP44   EXEC PGM=BP13C637,COND=(0,NE)                                        
//BP13F558 DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//P13F558A DD DSN=&&F558RSL,DISP=(OLD,PASS)                                     
//P13F558O DD DSN=&&F558OLD,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT REQUEST FILE IN REGNO ORDER FOR RESALE MATCHING REC                    
//*---------------------------------------------------------------------        
//STEP45   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.QTRYR5,DISP=SHR                                     
//SORTOUT  DD DSN=&&F500QTR,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(200,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* CHECK RESALE-MTH-RESIDE < SMS-MTH-RESIDE                                    
//* UPDATE BP13F520 MTH-RESIDE                                                  
//*---------------------------------------------------------------------        
//STEP46   EXEC PGM=BP13U730,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F500 DD DSN=&&F500QTR,DISP=(OLD,PASS)                                     
//BP13F558 DD DSN=&&F558OLD,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=BP13.F520.QTRYR5,DISP=OLD                                     
//BP13L730 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*=====================================================================        
//* AFTER RESALE,RUN TO CHECK MULTI-TIER FAMILY/HUSBAND WIFE WITH 2 FLAT        
//* SELECT LONGER MTH-RESIDE RUN ON LY BP13C639                                 
//*=====================================================================        
//*---------------------------------------------------------------------        
//* INCLUDE 10YR=NO CASES                                                       
//*---------------------------------------------------------------------        
//STEP47   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558BEST,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(34,3,CH,LT,C'120',AND,                                          
                34,3,CH,NE,C'000',AND,                                          
                34,3,CH,NE,C'   ')                                              
  SUM FIELDS=NONE                                                               
/*                                                                              
//*-------------------------------------------------------------                
//* SORT BY REGN/NRIC ORDER                                                     
//*-------------------------------------------------------------                
//STEP48   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558SP48,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(180,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO ORDER                                                       
//*---------------------------------------------------------------------        
//STEP49   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F520.QTRYR5,DISP=SHR                                     
//SORTOUT  DD DSN=&&F520BEST,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(240,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* TO CONFIRM WITH BP13F520 THE 10YR=NO                                        
//*---------------------------------------------------------------------        
//STEP50   EXEC PGM=BP13C638,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F520BEST,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558BEST,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558YEAR,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(180,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* MATCH TO EXTRACT FULL BP13F558 RECORDS                                      
//*---------------------------------------------------------------------        
//STEP51   EXEC PGM=BP13C637,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558SP48,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558YEAR,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558CASE,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(150,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------          
//* PRINT REPORT TO VERIFY PARENT/CHILD OR HUSBAND/WIFE CASES ON 10YR           
//* FOR 1 "YES"  AND 1 "NO", MTH-RESIDE DIFFERENT BUT SAME FLAT,                
//* TAKE THE LONGER MTH-RESIDE, OUTPUT FILE SO AS TO FORCE AS 'YES'             
//*-------------------------------------------------------------------          
//STEP52   EXEC PGM=BP13C639,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F558 DD DSN=&&F558CASE,DISP=(OLD,PASS)                                    
//BP13F500 DD DSN=&&F520BEST,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13F558A DD DSN=&&F558SONA,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13F558B DD DSN=&&F558PARA,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13L639A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L639B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L639C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------                
//* SORT BY REGN ORDER, MTH-RESIDE IN DECENDING ORDER                           
//*-------------------------------------------------------------                
//STEP53   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F558SONA,DISP=(OLD,PASS)                                    
//         DD DSN=&&F558PARA,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558MTFA,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(180,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A,34,3,D),FORMAT=CH                                          
  OMIT COND=(34,3,CH,EQ,C'   ')                                                 
/*                                                                              
//*-------------------------------------------------------------------          
//* UPDATE 10-YR FROM NO TO YES, UPDATE WITH THE BIGGEST MTH-RESIDE             
//*-------------------------------------------------------------------          
//STEP54   EXEC PGM=BP13C698,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F500 DD DSN=&&F520BEST,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558MTFA,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=BP13.F520.QTRYR5,DISP=OLD                                     
//BP13F510 DD DSN=BP13.F520.QTRYR5.ADJYES,DISP=OLD                              
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO ORDER INCLUDE CASES RE-UPDATE AS 10YR=YES                   
//*---------------------------------------------------------------------        
//STEP55   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F520.QTRYR5,DISP=SHR                                     
//SORTOUT  DD DSN=&&F520YESA,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(240,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* TO CONFIRM WITH BP13F520 THE 10YR=NO                                        
//*---------------------------------------------------------------------        
//STEP56   EXEC PGM=BP13C638,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F520YESA,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558BEST,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558NOA,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* MATCH TO EXTRACT FULL BP13F558 RECORDS                                      
//*---------------------------------------------------------------------        
//STEP57   EXEC PGM=BP13C637,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558SP48,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558NOA,DISP=(OLD,PASS)                                     
//P13F558O DD DSN=&&F558RECA,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------          
//* FOR 10-YR=NO CASES, TO FURTHER CHECK,                                       
//* FOR TWO "NO" , MTH-RESIDE DIFFERENT BUT SAME FLAT, TAKE LONGER              
//* MTH-RESIDE                                                                  
//*-------------------------------------------------------------------          
//STEP58   EXEC PGM=BP13C640,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F558 DD DSN=&&F558RECA,DISP=(OLD,PASS)                                    
//BP13F500 DD DSN=&&F520YESA,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13F558A DD DSN=&&F558NO1A,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13F558B DD DSN=&&F558NO2A,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(150,20),RLSE)                                             
//P13L640A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L640B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------                
//* SORT BY REGN ORDER, MTH-RESIDE IN DECENDING ORDER                           
//*-------------------------------------------------------------                
//STEP59   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F558NO2A,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558RESA,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(180,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A,34,3,D),FORMAT=CH                                          
  OMIT COND=(34,3,CH,EQ,C'   ')                                                 
/*                                                                              
//*-------------------------------------------------------------------          
//* UPDATE 10-YR FROM NO TO YES, UPDATE WITH THE BIGGEST MTH-RESIDE             
//*-------------------------------------------------------------------          
//STEP60   EXEC PGM=BP13C677,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.YR10QTR,DISP=SHR                             
//BP13F500 DD DSN=&&F520YESA,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558RESA,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=BP13.F520.QTRYR5,DISP=OLD                                     
//BP13F510 DD DSN=BP13.F520.QTRYR5.ADJNO,DISP=OLD                               
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD DUMMY                                                             
//*                                                                             
//*--------------------------------------------------------------------         
//* SORT REC UPDATE THRU BP13C698, BP13C677                                     
//*--------------------------------------------------------------------         
//STEP61   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.QTRYR5.ADJYES,DISP=SHR                              
//         DD DSN=BP13.F520.QTRYR5.ADJNO,DISP=SHR                               
//SORTOUT  DD DSN=&&F520SONA,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//**--------------------------------------------------------------------        
//* UPDATE LONGER MTH-RESIDE AFTER ADJUSTMENT FROM BP13C639, C640               
//* TO BP13F558                                                                 
//*---------------------------------------------------------------------        
//STEP62   EXEC PGM=BP13C693,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F520SONA,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558SP48,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=BP13.F558.UPGOCCP.RFS,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* REPRO FILE TO BP13.F520.BALLOT FOR UPDATE TO SOC FILE IN BP13A549           
//*--------------------------------------------------------------------         
//STEP63 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.F520.QTRYR5,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F520.BALLOT,DISP=OLD                                     
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*--------------------------------------------------------------------         
//* REPRO FILE FOR BACKUP PURPOSE                                               
//*--------------------------------------------------------------------         
//STEP64   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//OUTPUT2  DD DSN=BP13.F558.UPGOCCP.YR10SMS,DISP=OLD                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
