//BP13D601 JOB (BP13P),'BP13D601',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//        NOTIFY=CSD0071                                                        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* C P F   B A C K U P   F I L E   M O D U L E                                 
//*=================================================================            
//* CHG REF  DATE     BY    DESCRIPTION                                         
//* -------- ----     ---   -----------                                         
//* BP130418 19980831 CLT1  Y2K COMPLIANCE CHANGES                              
//* BP130929 20000103 CLT1  MOVE LOAN SCHEME TO AB02F870                        
//* BP132546 20040611 YCH2  INCLUDE STORCLAS(PRODRLS) & LOG(NONE)               
//* BP132913 20060919 SSS2  REMOVE HOLD                                         
//* BP133707 20091008 CT2   ADD PROGRAM BP13C23N TO PASS CASES                  
//*                         WITH CPF ACKNOWLEDGE DATE TO CPF BOARD              
//* BP135420 20141020 ESD1  CATER FOR PROCESSING 2ND CA NET LOAN.               
//* BP135619 20150115 ESD1  ADD BP13C26A FOR CPF REQUEST APPOINTMENT.           
//* BP135959 20150915 LJL1  ADD BP13F630 BACKUP FILE                            
//* BP137713 20190920 KV6   MATCH BP27 CA LOWRISK WITH BP13F683                 
//*=================================================================            
//*  VERIFY FILES BEFORE RUN                                                    
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K465.APPT,DISP=OLD                                       
//INPUT2   DD DSN=BP13.K68A.CPFBAL.APPT,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*-----------------------------------------------------------------            
//*  PREPARE APPOINTMENT FILE                                                   
//*  DISP=MOD BECAUSE FILE IS ALSO IN JOB BP13A680                              
//*-----------------------------------------------------------------            
//STEP2    EXEC PGM=BP13C609                                                    
//BP13K454 DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//BP13F454 DD DSN=BP13.F454.APPTABLE.CPF,DISP=MOD                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  PREPARED CASES THAT REQUIRE CPF STATEMENT                                  
//*-----------------------------------------------------------------            
//STEP3    EXEC PGM=BP13C605,COND=(0,NE)                                        
//BP13F454 DD DSN=BP13.F454.APPTABLE.CPF,DISP=SHR                               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR                                  
//AB02F870 DD DSN=BP13.F630.CPFREQ,DISP=MOD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  DEFINE WORKPLAN TABLE VSAM FILE BP13.K465.APPT                             
//*-----------------------------------------------------------------            
//STEP4    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.BLANK.CHAR50,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL 'BP13.K465.APPT' CLUSTER PURGE                                     
         DEF CL (NAME(BP13.K465.APPT)     -                                     
                 CYL(2 1)                 -                                     
                 SHR(2 3)                 -                                     
                 KEYS(8 0)                -                                     
                 RECSZ(50 50)             -                                     
                 CISZ(1024)               -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 IXD                      -                                     
                 UNQ)                     -                                     
              DATA                        -                                     
              (NAME(BP13.K465.APPT.DATA)) -                                     
              INDEX                       -                                     
              (NAME (BP13.K465.APPT.INDEX))                                     
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K465.APPT)                                                 
/*                                                                              
//*-----------------------------------------------------------------            
//*  CLEAR FILE                                                                 
//*-----------------------------------------------------------------            
//STEP5    EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F454.APPTABLE.CPF,DISP=SHR                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-----------------------------------------------------------------            
//* TO SORT OUT BOOKING RECORDS                                                 
//*-----------------------------------------------------------------            
//STEP2    EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD  DSN=&&BP13F800,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(1,1,CH,NE,C'C',AND,                                           
                  509,2,CH,NE,C'  ',AND,                                        
                  155,2,CH,EQ,C'  ')                                            
//*-----------------------------------------------------------------            
//*  PREPARED CASES THAT REQUIRE CPF STATEMENT                                  
//*-----------------------------------------------------------------            
//STEP6    EXEC PGM=BP13C23E,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F800 DD DSN=&&BP13F800,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//AB02F870 DD DSN=BP13.F630.CPFREQ,DISP=MOD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* TO SORT OUT DBSS S&P RECORDS                                                
//*-----------------------------------------------------------------            
//STEP7    EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SORTOUT  DD  DSN=&&BP13FD00,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                              
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(1025,2,CH,NE,C'  ')                                           
//*-----------------------------------------------------------------            
//*  PREPARED CASES THAT REQUIRE CPF STATEMENT                                  
//*-----------------------------------------------------------------            
//STEP8    EXEC PGM=BP13C23L,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13FD00 DD DSN=&&BP13FD00,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//AB02F870 DD DSN=BP13.F630.CPFREQ,DISP=MOD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* TO SORT OUT BOOKING RECORDS                                                 
//*-----------------------------------------------------------------            
//STEP9    EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD  DSN=&&BP13F800,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(1,1,CH,NE,C'C',AND,                                           
                  1499,8,CH,NE,C'        ',AND,                                 
                  1507,1,CH,NE,C'Y')                                            
//*-----------------------------------------------------------------            
//*  PREPARED CASES THAT REQUIRE CPF STATEMENT                                  
//*-----------------------------------------------------------------            
//STEP10   EXEC PGM=BP13C23N,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//AB02F870 DD DSN=BP13.F630.CPFREQ,DISP=MOD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BP27 LOW RISK RECORD 2ND CA PROCESSING                                 
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP27.BP13.F800.CA2ND.LOWRISK,DISP=SHR                         
//SORTOUT  DD  DSN=&&LOWRISK,                                                   
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD *                                                                 
      SORT FIELDS=(04,08,A),FORMAT=CH                                           
//*-----------------------------------------------------------------            
//*  PREPARED CASES THAT REQUIRE CPF STATEMENT 2ND CA                           
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=BP13C25P,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F800 DD DSN=&&LOWRISK,DISP=(OLD,PASS)                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//AB02F870 DD DSN=BP13.F630.CPFREQ,DISP=MOD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* REPRO BP27 LOW RISK RECORD 2ND CA PROCESSING                                
//*-----------------------------------------------------------------            
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&LOWRISK,DISP=(OLD,PASS)                                     
//OUTPUT1  DD DSN=BP13.K800.SECONDCA,DISP=OLD                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-----------------------------------------------------------------*           
//* SORT ALL C7 AND C8 TRANSACTIONS                                 *           
//*-----------------------------------------------------------------*           
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP14,DISP=(NEW,PASS),                                     
//            UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                
      INCLUDE COND=(9,2,CH,EQ,C'C7',OR,                                         
                    9,2,CH,EQ,C'C8')                                            
//*-----------------------------------------------------------------            
//*  PREPARED CASES THAT REQUIRE CPF STATEMENT APPOINTMENT                      
//*-----------------------------------------------------------------            
//STEP15   EXEC PGM=BP13C26A,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F310 DD DSN=&&STEP14,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K68A DD DSN=BP13.K68A.CPFBAL.APPT,DISP=SHR,                               
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                              
//AB02F870 DD DSN=BP13.F630.CPFREQ,DISP=MOD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F630.CPFREQ  - GDG(15)                                *         
//*-------------------------------------------------------------------*         
//STEP28   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.F630.CPFREQ,DISP=SHR                                     
//OUTPUT5  DD DSN=BP13.F630.CPFREQ.BKUP(+1),DISP=(NEW,CATLG),                   
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=200,RECFM=FB)                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                     
//*                                                                             
//*-----------------------------------------------------------------*           
//* SORT BP13.K683.CPF.SECONDCA BY REGN                                         
//*-----------------------------------------------------------------*           
//STEP29   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K683.CPF.SECONDCA,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13F683,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* MATCH FILE FROM BP27 AND BP13F683 SECOND CA LOWRISK                         
//*---------------------------------------------------------------------        
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&LOWRISK,DISP=(OLD,PASS)                             00005003
//SORTJNF2 DD DSN=&&BP13F683,DISP=(OLD,PASS)                            00006003
//MATCH    DD DSN=BP13.F683.CPF.BALANCE.A2NDCA.LOWRISK,DISP=OLD         00007003
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(4,8,A)                                      00009403
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                      00009503
   REFORMAT FIELDS=(F2:1,2000)                                          00009703
   OUTFILE FNAMES=MATCH                                                 00009802
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
