//BP13AHN2 JOB (BP13P),'BP13AHN2',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*  THIS JCL IS TO MOVE THE HNR DETAILS FOR CASES TO          *                
//*  BP13K747                                                  *                
//*  THIS JCL IS ONLY FOR BE AND BTO CASES                     *                
//*============================================================*                
//*  STEP100 TO STEP190 - FOR PA CASES                         *                
//*  STEP200 TO STEP230 - FOR FTS CASES                        *                
//*  STEP300 TO STEP340 - FOR PPS CASES                        *                
//*  STEP400 TO STEP440 - FOR AST CASES                        *                
//*  STEP500 TO STEP540 - FOR MCPS CASES                       *                
//*  STEP600 TO STEP660 - FOR ELDERLY CASES                    *                
//*  STEP700 TO STEP730 - FOR PRIO (TCP/TPS) CASES             *                
//**************************************************************                
//* CHG-NO  BY   ON                                                             
//* ---------------                                                             
//*BP132496 CKK 040422 - NEW JCL                                                
//*BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                  
//*BP132601 CKK 111004 - AMEND SORT IN STEP 1                                   
//*BP132663 CKK 100305 - CHANGE SORT IN STEP 1                                  
//*BP132985 CKK 170107 - CHANGE SORTING                                         
//*BP133142 LSB 240907 - ADD SUM FIELDS=NONE BEFORE DEFINE BP13K747             
//*BP133432 IL5 300708 - CHANGE DEF OF K747 FOR NEW FILE LAYOUT                 
//*BP134301 IL5 020801 - OMIT HARDLUCK CASES WHEN DETERMINING RANGE             
//*BP134536 IL5 180612 - OMIT MGPS CASES WHEN DETERMINING RANGE                 
//*BP134602 IL5 220812 - OMIT PRIORITY CASES AND BYPASS HH WHEN                 
//*                      DETERMINING RANGE FOR STUDIO APTS                      
//*BP134782 IL5 150213 - OMIT SHORTLISTED PPS APPLICATIONS FROM HNR             
//*BP134857 SMR 080413 - CATER FOR NON-PA SCHEME (PPS, TCP, TPS)                
//*BP135100 IL5 141113 - OMIT SHORTLISTED AST APPLICATIONS FROM HNR             
//*BP135255 SMR 070314 - CHANGE SORT CONDITION FOR REPORT BP13L710              
//*BP135255 SMR 280314 - CATER FOR AST IN BP13K747                              
//*BP135513 SMR 201014 - CATER FOR FTS IN BP13K747                              
//*BP135551 SMR 271114 - CATER FOR MCPS IN BP13K747                             
//*BP135551 SMR 230215 - CATER FOR PPS & AST IN 400%                            
//*BP136259 SMR 310516 - CATER FOR ELDERLY                                      
//*BP136519 IL5 221216 - DETERMINE HNR FOR TCP, REN, SAP WITHOUT                
//*                      BALLOT HOUSEHOLD                                       
//*BP136588 SMR 150217 - EXCLUDE PORT CASES UNDER PRIO IN HNR RANGE /           
//*                      REMOVE ALLOC SCH IN SORT FIELDS OF PPS AND AST         
//*BP138301 AM2 140520 - HARDCOPY REPORTS CONVERSION                            
//*BP139670 AM2 250823 - CATER FOR FT(PMC)                                      
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN                                            
//*-----------------------------------------------------------------            
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K747.HNR.RANGE,DISP=OLD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
           VFY FILE(INPUT1)                                                     
//*--------------------------------------------------------------------         
//* DELETE DATASETS                                                             
//*--------------------------------------------------------------------         
//STEP0B EXEC  PGM=IDCAMS                                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
    DEL  'BP13.F740.MATUREBA.HNR.IN'                                            
    DEL  'BP13.F740.MATUREBA.HNR.OUT'                                           
    DEL  'BP13.F740.MATUREBA.HNR.PA'                                            
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELD'                                        
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELD.NSP'                                    
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELD.SAP'                                    
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELDN'                                       
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELDN.AST'                                   
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELDN.FTS'                                   
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELDN.MCP'                                   
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELDN.PA'                                    
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELDN.PAOTH'                                 
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELDN.PA100'                                 
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELDN.PPS'                                   
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELDN.PPS.G1'                                
    DEL  'BP13.F740.MATUREBA.HNR.PA.ELDN.PPS.G2'                                
    DEL  'BP13.F740.MATUREBA.HNR.PRIO'                                          
    DEL  'BP13.F740.MATUREBA.HNR.PRIO.UPDSCH'                                   
                SET MAXCC = 0                                                   
/*                                                                              
//*---------------------------------------------------------------------        
//* SPLIT RECORDS INTO INCLUDE FOR HNR AND EXCLUDE                              
//* EXCLUDE GROUP CONTAINS                                                      
//*    A)UNSUCCESSFUL                                                           
//*    B)GRO RECORDS                                                            
//*    C)MGPS RECORDS                                                           
//*    D)SPECIAL ASSISTANCE RECORDS                                             
//*    E)CCA                                                                    
//*---------------------------------------------------------------------        
//STEP100  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT1 DD DSN=BP13.F740.MATUREBA.HNR.IN,DISP=(NEW,CATLG),                   
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SORTOUT2 DD DSN=BP13.F740.MATUREBA.HNR.OUT,DISP=(NEW,CATLG),                  
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  OUTFIL FNAMES=SORTOUT1,INCLUDE=(260,1,CH,NE,C'U',AND,                         
                                    260,1,CH,NE,C'K',AND,                       
                                    213,3,CH,NE,C'GRO',AND,                     
                                    245,1,CH,EQ,C' ',AND,                       
                                    466,1,CH,EQ,C' ',AND,                       
                                    433,1,CH,NE,C'P',AND,                       
                                    211,1,CH,NE,C'1')                           
  OUTFIL FNAMES=SORTOUT2,SAVE                                                   
//*---------------------------------------------------------------------        
//* UPDATE CAT4 TO CAT3 AND UPDATE HHTY = T TO HHTY = H                         
//* INPUT FILE - BP13.F740.MATUREBA.HNR.IN                                      
//*---------------------------------------------------------------------        
//STEP110  EXEC PGM=BP13C79A,COND=(0,NE)                                        
//BP13F500 DD DSN=BP13.F740.MATUREBA.HNR.IN,DISP=SHR                            
//BP13F520 DD DSN=BP13.F740.MATUREBA.HNR.IN,DISP=OLD                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*=====================================================================        
//* SPLIT SHORTLISTED RECORDS INTO 2 GROUPS                                     
//*     A)SHORTLISTED UNDER UPFRONT PRIORITY                                    
//*     B)OTHER RECORDS                                                         
//*--------------------------------------------------------------------         
//STEP120  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.F740.MATUREBA.HNR.IN,DISP=SHR                            
//SORTJNF2 DD DSN=BP13.F740.MATUREBA.PRIO.SUCC,DISP=SHR                         
//MATCH    DD DSN=BP13.F740.MATUREBA.HNR.PRIO,DISP=(NEW,CATLG),                 
//         SPACE=(CYL,(50,50),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                   
//NOMATCH1 DD DSN=BP13.F740.MATUREBA.HNR.PA,DISP=(NEW,CATLG),                   
//         SPACE=(CYL,(50,50),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                   
//NOMATCH2 DD DUMMY                                                             
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(1,28,A)                                             
   JOINKEYS FILE=F2,FIELDS=(1,28,A)                                             
   JOIN UNPAIRED,F1,F2                                                          
   REFORMAT FIELDS=(?,F1:1,500,F2:1,500)                                        
   OPTION COPY                                                                  
   OUTFIL FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B',AND,434,1,CH,NE,C'P'),           
                 BUILD=(1:2,500)                                                
   OUTFIL FNAMES=NOMATCH1,INCLUDE=(1,1,CH,EQ,C'1'),BUILD=(1:2,500)              
   OUTFIL FNAMES=NOMATCH2,INCLUDE=(1,1,CH,EQ,C'2'),BUILD=(1:2,500)              
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SPLIT SHORTLISTED RECORDS IN PUBLIC TO ELDERLY AND NON-ELDERLY              
//*---------------------------------------------------------------------        
//STEP130  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.HNR.PA,DISP=SHR                            
//SORTOUT1 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELD,                                
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SORTOUT2 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN,                               
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  OUTFIL FNAMES=SORTOUT1,INCLUDE=(210,1,CH,EQ,C'F',OR,210,1,CH,EQ,C'S')         
  OUTFIL FNAMES=SORTOUT2,SAVE                                                   
//*---------------------------------------------------------------------        
//* GET FTS, AST, PPS AND MCP RECORDS FROM NON-ELDERLY                          
//* SORT BY NT, FT, BALLOT HH, ETHNIC, RESULT, RANDOM NO                        
//*---------------------------------------------------------------------        
//STEP200  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN,DISP=SHR                       
//SORTOUT1 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.FTS,                           
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SORTOUT2 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PPS,                           
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SORTOUT3 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.AST,                           
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SORTOUT4 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.MCP,                           
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SORTOUT5 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PA,                            
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,213,3,A,118,1,A,461,1,A,225,1,A,                 
               260,1,D,1,28,A),FORMAT=CH                                        
  OUTFIL FNAMES=SORTOUT1,INCLUDE=(213,3,CH,EQ,C'FTS')                           
  OUTFIL FNAMES=SORTOUT2,INCLUDE=(470,1,CH,EQ,C'Y')                             
  OUTFIL FNAMES=SORTOUT3,INCLUDE=(472,1,CH,EQ,C'Y')                             
  OUTFIL FNAMES=SORTOUT4,INCLUDE=(213,3,CH,EQ,C'MCP')                           
  OUTFIL FNAMES=SORTOUT5,SAVE                                                   
//*-----------------------------------------------------------------            
//* SEPARATE FPPS RECORDS INTO 2 GROUPS                                         
//* 1. PPS APPLY FOR 4-ROOM AND SMALLER FLATS UNDER BTO AND FTPMC               
//* 2. THE REST OF THE RECORDS                                                  
//*---------------------------------------------------------------------        
//STEP210   EXEC PGM=BP13C52C,COND=(0,NE)                                       
//BP13F740  DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PPS,DISP=SHR                  
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR                                     
//P13F740A  DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PPS.G1,                       
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(130,15),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                           
//P13F740B  DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PPS.G2,                       
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(130,15),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                           
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PA                        
//*---------------------------------------------------------------------        
//STEP300  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PA,DISP=SHR                    
//SORTOUT1 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PA100,                         
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SORTOUT2 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PAOTH,                         
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,213,3,A,461,1,A,225,1,A,                         
               260,1,D,1,28,A),FORMAT=CH                                        
  OUTFIL FNAMES=SORTOUT1,INCLUDE=(260,1,CH,EQ,C'S')                             
  OUTFIL FNAMES=SORTOUT2,SAVE                                                   
//*---------------------------------------------------------------------        
//* SPLIT ELDERLY RECORDS INTO SAP OR NSP (NON-PRIORITY)                        
//* SORT BY NT, FT, ALLO SCH, BALLOT HH, ETHNIC, RESULT, RANDOM NO              
//*---------------------------------------------------------------------        
//STEP400  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.HNR.PA.ELD,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELD.SAP,                            
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SORTOUT2 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELD.NSP,                            
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,15),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,213,3,A,225,1,A,                                 
               260,1,D,1,28,A),FORMAT=CH                                        
  OUTFIL FNAMES=SORTOUT1,INCLUDE=(213,3,CH,EQ,C'SAP')                           
  OUTFIL FNAMES=SORTOUT2,SAVE,BUILD=(1,212,C'NSP',216,285)                      
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PRIO CASES                
//*---------------------------------------------------------------------        
//STEP400A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PA100,DISP=SHR                 
//SORTOUT  DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PA100,DISP=SHR                 
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,213,3,A,461,1,A,225,1,A,                         
               260,1,D,1,28,A),FORMAT=CH                                        
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PA CASES                  
//*---------------------------------------------------------------------        
//STEP400B EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PA100,DISP=SHR                 
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=OLD                                  
//SYSIN    DD *                                                                 
PA                                                                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PRIO CASES                
//*---------------------------------------------------------------------        
//STEP401A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PAOTH,DISP=SHR                 
//SORTOUT  DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PAOTH,DISP=SHR                 
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,213,3,A,461,1,A,                                 
               260,1,D,1,28,A),FORMAT=CH                                        
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PA CASES                  
//*---------------------------------------------------------------------        
//STEP401B EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PAOTH,DISP=SHR                 
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=MOD                                  
//SYSIN    DD *                                                                 
PA1                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - FTS CASES                 
//*---------------------------------------------------------------------        
//STEP410  EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.FTS,DISP=SHR                   
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=MOD                                  
//SYSIN    DD *                                                                 
FTS                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PRIO CASES                
//*---------------------------------------------------------------------        
//STEP180A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PPS.G1,DISP=SHR                
//SORTOUT  DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PPS.G1,DISP=SHR                
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,461,1,A,225,1,A,                                 
               260,1,D,1,28,A),FORMAT=CH                                        
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PPS CASES GROUP1          
//*---------------------------------------------------------------------        
//STEP420A EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PPS.G1,DISP=SHR                
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=MOD                                  
//SYSIN    DD *                                                                 
PP1                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PRIO CASES                
//*---------------------------------------------------------------------        
//STEP180B EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PPS.G2,DISP=SHR                
//SORTOUT  DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PPS.G2,DISP=SHR                
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,461,1,A,225,1,A,                                 
               260,1,D,1,28,A),FORMAT=CH                                        
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PPS CASES GROUP2          
//*---------------------------------------------------------------------        
//STEP420B EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.PPS.G2,DISP=SHR                
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=MOD                                  
//SYSIN    DD *                                                                 
PPS                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - AST CASES                 
//*---------------------------------------------------------------------        
//STEP430  EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.AST,DISP=SHR                   
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=MOD                                  
//SYSIN    DD *                                                                 
AST                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - MCP CASES                 
//*---------------------------------------------------------------------        
//STEP440  EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELDN.MCP,DISP=SHR                   
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=MOD                                  
//SYSIN    DD *                                                                 
MCP                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PRIO CASES                
//*---------------------------------------------------------------------        
//STEP180  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.HNR.PA.ELD.NSP,DISP=SHR                    
//SORTOUT  DD DSN=BP13.F740.MATUREBA.HNR.PA.ELD.NSP,DISP=SHR                    
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,213,3,A,225,1,A,                                 
               260,1,D,1,28,A),FORMAT=CH                                        
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - NSP CASES                 
//*---------------------------------------------------------------------        
//STEP440  EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=BP13.F740.MATUREBA.HNR.PA.ELD.NSP,DISP=SHR                    
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=MOD                                  
//SYSIN    DD *                                                                 
NSP                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* UPDATE CAT4 TO CAT3 AND UPDATE HHTY = T TO HHTY = H                         
//*---------------------------------------------------------------------        
//STEP170  EXEC PGM=BP13C798,COND=(0,NE)                                        
//BP13F500 DD DSN=BP13.F740.MATUREBA.HNR.PRIO,DISP=SHR                          
//BP13F520 DD DSN=BP13.F740.MATUREBA.HNR.PRIO.UPDSCH,                           
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(130,10),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PRIO CASES                
//*---------------------------------------------------------------------        
//STEP180  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.HNR.PRIO.UPDSCH,DISP=SHR                   
//         DD DSN=BP13.F740.MATUREBA.HNR.PA.ELD.SAP,DISP=SHR                    
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(130,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,213,3,A,225,1,A,                                 
               260,1,D,1,28,A),FORMAT=CH                                        
//*---------------------------------------------------------------------        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - PA CASES                  
//*---------------------------------------------------------------------        
//STEP190  EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F520SORT,DISP=(OLD,DELETE)                                  
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=MOD                                  
//SYSIN    DD *                                                                 
TCP                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT CASES FOR PRINTING REPORT                                          
//*---------------------------------------------------------------------        
//STEP900  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F747.HNR.RANGE,DISP=SHR                                  
//SORTOUT  DD DSN=&&F747SCH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,6,A,7,3,A,10,2,A,17,1,A,18,2,A,12,3,D,                        
                16,1,A,15,1,A),FORMAT=CH                                        
   INCLUDE COND=(12,3,CH,NE,C'JB ')                                             
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT THE RANGE OF SUCCESSFUL RANDOM NO                      
//*---------------------------------------------------------------------        
//STEP910  EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F713 DD DSN=BP13.BLANK.CHAR50,DISP=SHR                                    
//BP13K747 DD DSN=&&F747SCH,DISP=(OLD,DELETE)                                   
//BP13L710 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S710),DISP=SHR                             
//*--------------------------------------------------------------------         
//* SORT OUT EXISTING CASES IN PRODUCTION                                       
//*------------------------------------------------------------------           
//STEP920  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K747.HNR.RANGE,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F747.HNR.RANGE.BKUP,DISP=SHR                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,20,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//* MERGE EXITING CASES AND NEW CASES.                                          
//*------------------------------------------------------------------           
//STEP930  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F747.HNR.RANGE,DISP=SHR                                  
//         DD DSN=BP13.F747.HNR.RANGE.BKUP,DISP=SHR                             
//SORTOUT  DD DSN=&&F747END,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,20,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* TO DELETE AND DEFINE BP13K747                                               
//*---------------------------------------------------------------------        
//STEP940  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=&&F747END,DISP=(OLD,DELETE)                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DEL (BP13.K747.HNR.RANGE) CL PURGE                                            
  DEF CLUSTER                                         -                         
        (NAME(BP13.K747.HNR.RANGE)                    -                         
        SHAREOPTIONS(2,3)                             -                         
        KEYS(20 0)                                    -                         
        RECSZ(150 150)                                -                         
        CYL(50 20)                                    -                         
        STORCLAS(PRODRLS)                             -                         
        LOG(NONE)                                     -                         
        FREESPACE(30 30)                              -                         
        CISZ(4096)                                    -                         
        IXD                                           -                         
        UNQ)                                          -                         
      DATA                                            -                         
        (NAME(BP13.K747.HNR.RANGE.DATA))              -                         
      INDEX                                           -                         
        (NAME(BP13.K747.HNR.RANGE.INDEX))                                       
         IF LASTCC = 0 THEN                           -                         
           REPRO IFILE(INPUT1)                        -                         
                 ODS(BP13.K747.HNR.RANGE)                                       
/*                                                                              
//*---------------------------------------------------------------------        
//*                      END OF JOB                                             
//*---------------------------------------------------------------------        
