//BP13A22A JOB (BP13P),'BP13A22A',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*********************************************************************         
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP135171 RJE1 20140210 TO CATER FOR DB2 UPGRADE                             
//* BP135404 EL27 20140711 CHANGE PRINTER FROM L03Z TO X6AI                     
//* BP135404 NST1 20140719 CHANGE PRINTER FROM X6AI TO X6AU(LANDSCAPE)          
//* BP135561 ESA1 20150115 OUTPUT TO DATASET BEFORE SENDING TO PRINTER          
//*********************************************************************         
//*-------------------------------------------------------------------- 00001860
//*    SORT OUT RECORDS UPDATED THROUGH M199 PANEL                              
//*-------------------------------------------------------------------- 00001860
//STEP01   EXEC  SORT                                                           
//SORTIN   DD  DSN=BM06.K190.LOG,                                               
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F190,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=650,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
   INCLUDE COND=(637,6,CH,EQ,C'B19900')                                         
   SUM FIELDS=NONE                                                              
/*                                                                              
//*-------------------------------------------------------------------- 00001860
//* BP13C24D - PRINT REPORT ON UPDATED POD/POF DATES                    00001870
//*-------------------------------------------------------------------- 00001880
//STEP02 EXEC    PGM=BP13C24D,COND=(0,NE)                               00001890
//BM06F190 DD  DSN=&&BM06F190,DISP=(SHR,PASS)                           00001900
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR                             00001900
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR                            00001900
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,DISP=SHR                          00001900
//BP13K276 DD  DSN=BP13.K276.OPTION,DISP=SHR                                    
//BP13L24D DD DSN=&&BP13L24D,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FBA,LRECL=133)                                         
//P13L24DA DD DSN=&&P13L24DA,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FBA,LRECL=133)                                         
//SYSOUT   DD  SYSOUT=*                                                 00001940
//SYSPRINT DD  SYSOUT=*                                                 00001940
//SYSDBOUT DD  SYSOUT=*                                                 00001950
//*                                                                     00001960
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP02 IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP2A EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L24D,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP02 IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP2B EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&P13L24DA,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------- 00001860
//* BP13C24E - PRINT REPORT ON RECORDS WITH DIFFERENT SELLING PRICE     00001870
//*-------------------------------------------------------------------- 00001880
//STEP03 EXEC    PGM=IKJEFT01,COND=(0,NE),                              00000260
//             REGION=4096K,                                            00000270
//             DYNAMNBR=20                                              00000280
//BM06F190 DD  DSN=&&BM06F190,DISP=(SHR,PASS)                           00001900
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                           00001900
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                     00001900
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR                            00001900
//BP13K276 DD  DSN=BP13.K276.OPTION,DISP=SHR                            00001900
//BP13L24E DD DSN=&&BP13L24E,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FBA,LRECL=133)                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                 00000450
//SYSTSIN  DD  *                                                        00000490
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C24E) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                      00000500
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP03 IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP3A EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L24E,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------- 00001860
//* BP13C22H - PRINT REPORT ON UNITS WITH BALCONY                       00001870
//*-------------------------------------------------------------------- 00001880
//STEP04 EXEC    PGM=IKJEFT01,COND=(0,NE),                              00000260
//             REGION=4096K,                                            00000270
//             DYNAMNBR=20                                              00000280
//BM06F190 DD  DSN=&&BM06F190,DISP=(SHR,DELETE)                         00001900
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                           00001900
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                     00001900
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR                            00001900
//BP13L22H DD  DSN=&&BP13L22H,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FBA,LRECL=133)                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                 00000450
//SYSTSIN  DD  *                                                        00000490
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C22H) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                      00000500
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP04 IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP4A EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L22H,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*----------------------------------------------------------------             
//*   CREATE SOFTCOPY REPORT FOR ALL REPORTS PRINTED                            
//*----------------------------------------------------------------             
//STEP05  EXEC    PGM=IDCAMS,COND=(0,NE)                                        
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13L24D,DISP=(SHR,PASS)                                   
//         DD  DSN=&&P13L24DA,DISP=(SHR,PASS)                                   
//         DD  DSN=&&BP13L24E,DISP=(SHR,PASS)                                   
//         DD  DSN=&&BP13L22H,DISP=(SHR,PASS)                                   
//OUTPUT1  DD  DSN=BP13.L22A.RPT,                                               
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-----------------------------------------------------------------            
//* END OF BP13A22A                                                             
//*-----------------------------------------------------------------            
