//BP13A590 JOB (BP13P),'BP13A590',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=====================================================================        
//* COMPUTER BALLOTING OF REN CASES FOR FLAT SET ASIDE:                         
//*    EXTRACT REN CASES FROM BP13.K595.BALLOT.LOG (WITH REGN)                  
//*    INITIALISE REN CASES EXTRACTED                                           
//*    COMBINE WITH NEW REN CASES IN BP13.K730.MATURERQ                         
//*                                                                             
//*    EXTRACT REN-OCCUPIERS-REC FROM HISTORY MOD WITH BP13T.F825.REN           
//*    REPRO   BP13T.F825.REN TO BP13.K825.REQOCCP                              
//*                                                                             
//*    RUN THE REN JOB SEQUENCE                                                 
//*                                                                             
//*NOTE:                                                                        
//*    BEWARE OF EXISTING BOOKING BALLOTING                                     
//*                                                                             
//*=================================================================            
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP130652      19990823 EXPAND F500 RECL 300 TO 500                          
//* BP132818 BA3  20060126 TO CHANGE SORTING OF REF NO FROM 6 BYTES             
//*                        TO 8 BYTES.                                          
//*=================================================================            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET                                                                    
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13K520,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* SORT PREREGN RECORD FOR 'RE' FLAT TYPES FOR RESETTLEMENT                    
//* AND RELOCATION SCHEMES                                                      
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&REN,DISP=(NEW,PASS),                                        
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(160,60),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(123,1,CH,EQ,C'Q')                                              
//*-----------------------------------------------------------------            
//* INITIALISE REN REQUESTS                                                     
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&REN,DISP=(OLD,PASS)                                         
//SORTOUT  DD DSN=BP13.F500.REN,DISP=OLD                                        
//SYSIN    DD *                                                                 
   SORT   FIELDS=(123,8,A),FORMAT=CH                                            
   OUTREC FIELDS=(32X,33,80,C'N',7X,121,114,13X,                                
                  248,12,X,261,19,12X,292,8,C'P',301,200)                       
//*-----------------------------------------------------------------            
//* TO PRINT REPORT ON APPLICANT WHO RESPOND TO                                 
//* OPENING OF NEW TOWN  FOR REGISTRATION                                       
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13C590,COND=(0,NE)                                        
//BP13F500 DD DSN=BP13.F500.REN,DISP=SHR                                        
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13L590 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* END BP13A590                                                                
//*-----------------------------------------------------------------            
