//BP13ADB6  JOB (BP13P),'BP13ADB6',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//**************************************************************                
//* TO DEBAR THE PORT CASES WHICH FALLS INSIDE 100%                             
//**************************************************************                
//* CHG-NO   BY   DATE      - DESCRIPTION                                       
//*----------------------------------                                           
//* BP132626 CKK 17/12/2004 - NEW JCL                                           
//* BP132626 SK  22/12/2004 - ADD BP17K890 FOR BP13C005                         
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-------------------------------------------------------------                
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* SORT OUT PORT CASES WHICH FALLS UNDER 100%                                  
//*---------------------------------------------------------------------        
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F740,DISP=(NEW,PASS),                                  
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(25,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(260,1,CH,EQ,C'S',AND,                                           
                433,1,CH,EQ,C'P')                                               
//*---------------------------------------------------------------------        
//* CREATE DEBARMENT RECORD FOR BP04 TO DEBAR CASES UNDER REASON 'EW'           
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C005,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13K665 DD DSN=BP13.K665.DEBARREF.SOC,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//BP04K010 DD DSN=BP13.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//BP17K890 DD DSN=BP17.K890.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//BP13L005 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* SORT K010 TO F010 FOR DEBARMENT SYSTEM                            *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.DEBAR,DISP=SHR                                      
//SORTOUT  DD DSN=BP13.F010.DEBAR.SOC,DISP=MOD                                  
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,44,A),FORMAT=CH                                              
//*                                                                             
