//BP13AFT2 JOB (BP13P),'BP13AFT2',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//* DETERMINE FT-2T                                                             
//*-------------------------                                                    
//* FOR CDE-HOUSEHOLD = G, SYSTEM FURTHER CHECK                                 
//* DETERMINE FT-2T FOR MARRIED COUPLE WHERE HA1=2T, SPOUSE=FT                  
//*                                          HA1=FT, SPOUSE=2T                  
//* SYSTEM TO BYPASS :                                                          
//* NON-CITIZEN SPOUSE,                                                         
//* USE SMS SCH-ACC-NO TO READ RDB TO EXTRACT FAMILY MEMBERS, IF SOC            
//* SPOUSE IS ALSO FOUND IN RDB AS SPOUSE                                       
//* SYSTEM TO TAG NUM-FT2T=Y, DEFAULT=N                                         
//*                                                                             
//* DETERMINE SINGLE SCHEME                                                     
//*-------------------------                                                    
//*===================================================================*         
//* CHG REF   BY    DATE    DESCRIPTION                                         
//* --------  ----  ------  -----------                                         
//* BP135279  SMR2  010414  NEW JCL (SIMILAR TO BP13DFT2)                       
//* BP135340  IL5   070614  REMOVE REPORTS                                      
//*===================================================================*         
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                 
//* PRT01 : COPIES = 1                                                          
//*-------------------------------------------------------------------*         
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* DAILY FILE USE TO DETERMINE CDE-HOUSEHOLD                                   
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F595,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(80,30),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(116,1,CH,EQ,C'G',AND,                                         
                  211,2,CH,NE,C'1A')                                            
//*---------------------------------------------------------------------        
//* CHECK FOR CASES WITH FT/2T                                                  
//* TAG COL 475 TAG 'Y' FOR FT-2T CASES                                         
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13CD82,COND=(0,NE)                                        
//BP13F595 DD DSN=&&BP13F595,DISP=(OLD,DELETE)                                  
//BP13K558 DD DSN=BP13.K558.BP13DPRE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K716 DD DSN=BP13.K716.DPREQ750,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                          
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F595A DD DSN=&&F730CD82,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(80,30),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* COL 475 = 'Y' FOR FT-2T CASES, COL 116 = G UPGRADER                         
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CD82,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.F730.FT2T,DISP=OLD,                                      
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(116,1,CH,EQ,C'G',AND,                                         
                  475,1,CH,EQ,C'Y')                                             
//*--------------------------------------------------------------------*        
//* BYPASS NON-CITIZEN SPOUSE                                                   
//*--------------------------------------------------------------------*        
//STEP04   EXEC PGM=BP13CY83,COND=(0,NE)                                        
//BP13F595 DD DSN=BP13.F730.FT2T,DISP=SHR                                       
//BP13K828 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13LY83 DD DSN=&&BP13LY83,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(RECFM=FB,LRECL=133)                                          
//P13F595A DD DSN=&&F595NONC,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------*        
//* BYPASS SPOUSE FOUND AS OCCUPIER IN THE DP FLAT                              
//* RDB ROLE 023(LESSEE), 024(CO-LESSEE) 025(OCCUPIER)                          
//*--------------------------------------------------------------------*        
//STEP05   EXEC PGM=BP13CY84,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595NONC,DISP=(OLD,DELETE)                                  
//BP13K828 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K716 DD DSN=BP13.K716.DPREQ750,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13LY84 DD DSN=&&BP13LY83,DISP=(MOD,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(RECFM=FB,LRECL=133)                                          
//P13F595A DD DSN=BP13.F730.FT2T,DISP=OLD                                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*-----------------------------------------------------------------            
//* PRINT REPORT ON CASH RECEIPT FOR THE MONTH ON HARDCOPY                      
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LY83,DISP=(OLD,DELETE)                                  
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* SORT BY REGNO                                                               
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.FT2T,DISP=SHR                                       
//SORTOUT  DD DSN=&&F730REGN,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* SORT BY REGNO                                                               
//*-------------------------------------------------------------------*         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&F500REGN,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(80,30),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* NOT MATCH : IN F500 & NOT IN F730                                           
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F500REGN,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=&&F730REGN,DISP=(OLD,PASS)                                    
//F1ONLY   DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//SYSIN    DD *                                                                 
  JOINKEYS FILE=F1,FIELDS=(123,8,A)                                             
  JOINKEYS FILE=F2,FIELDS=(123,8,A)                                             
  JOIN UNPAIRED,F1,ONLY                                                         
  REFORMAT FIELDS=(F1:1,500)                                                    
  OUTFILE FNAMES=F1ONLY                                                         
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* MATCH BY REGNO                                                              
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F500REGN,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=&&F730REGN,DISP=(OLD,DELETE)                                  
//MATCH    DD DSN=BP13.F500.SEQUENCE,DISP=MOD                                   
//SYSIN    DD *                                                                 
  JOINKEYS FILE=F1,FIELDS=(123,8,A)                                             
  JOINKEYS FILE=F2,FIELDS=(123,8,A)                                             
  REFORMAT FIELDS=(F1:1,474,F2:475,1,F1:476,25)                                 
  OUTFILE FNAMES=MATCH                                                          
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
