//BP13A747 JOB (BP13P),'BP13A747',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//*-----------------------------------------------------------------            
//* CHG REF  BY  ON      DESCRIPTION                                            
//* ----------------------------------------------------------------            
//* BP130652 SRA 991014  EXPAND F510 RECL FROM 300 TO 500                       
//*-----------------------------------------------------------------            
//* JCL TO PRINT JB FOR BP13APA4                                                
//* SUBMITED FROM PANEL BP13M541 (OPTION 7)                                     
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*----------------------------------------------------------------*            
//* SORT BP13F520 IN ZONE,FT,SEQNO,REGNP SEQUENCE                  *            
//* INCLUDE RECS WITH ALLOCATION-SCHEME 'JB'                       *            
//*----------------------------------------------------------------*            
//STEP01   EXEC SORT                                                            
//SORTIN   DD DSN=BP13.K722.RANAPA4,                                            
//            DISP=SHR                                                          
//SORTOUT  DD DSN=&&BP13F520,                                                   
//            DISP=(NEW,PASS),                                                  
//            DCB=(LRECL=500,BLKSIZE=32500,RECFM=FB,DSORG=PS),                  
//            SPACE=(CYL,(80,10),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(78,2,A,155,8,A,131,8,A,123,8,A),FORMAT=CH                        
  INCLUDE COND=(213,3,CH,EQ,C'JB ')                                             
/*                                                                              
//*----------------------------------------------------------------*            
//* PRINT REPORT ON BALLOTING FILE                                 *            
//*----------------------------------------------------------------*            
//STEP02   EXEC  SAS,DYNAMNBR=20,OPTIONS='MACRO',COND=(0,NE)                    
//BP13F510 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13L541 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S541),DISP=SHR                             
