//BP13A639 JOB (BP13P),'BP13A639',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* ADHOC JOB TO OMIT CANCELLED CASES WITH BP13F730 FORMAT FOR HLE              
//**********************************************************************        
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP135656 SMR2 03022015 NEW JCL                                              
//*---------------------------------------------------------------------        
//* DELETE SEQUENTIAL FILE                                                      
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL (BP13.F730.HLE)                                                        
     DEL (BP13.REPORT.BP13A639)                                                 
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*---------------------------------------------------------------------        
//* OMIT CANCELLED CASES                                                        
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=BP13.F730.HLE,DISP=(NEW,CATLG),                               
//            SPACE=(CYL,(80,10),RLSE),DATACLAS=MULTIVOL,                       
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(260,1,CH,EQ,C'C')                                                 
   SUM FIELDS=NONE                                                              
/*                                                                              
//*---------------------------------------------------------------------        
//STEP03   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP13F730 DD DSN=BP13.F730.HLE,DISP=SHR                                        
//FT42F001 DD DSN=BP13.REPORT.BP13A639,DISP=(NEW,CATLG),                        
//            SPACE=(CYL,(1,1),RLSE),DATACLAS=MULTIVOL,                         
//            DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                                 
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S572),DISP=SHR                             
