//BP13ABT2  JOB (BP13P),'BP13ABT2',CLASS=I,MSGCLASS=N,                          
//      MSGLEVEL=(1,1),NOTIFY=CSD0071                                           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP135171 RJE1 20140210 TO CATER FOR DB2 UPGRADE                             
//*-------------------------------------------------------------------          
//*=================================================================            
//* BTO                                                                         
//*=================================================================            
//* NOTIFICATION LETTER TO INFORM APPLICANT ON DECISION TO PROCEED              
//* WITH BUILDING PROGRAM                                                       
//*                                                                             
//* NOTE: CUSTOMISE PGM BEFORE PRINT (CHK FOR EST/NEIGH/CONTRACT)               
//*                                                                             
//*=================================================================            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* FOR LOAN TAG = H                                                            
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POT3,FORM=BP13TB,JDL=BP13,END;                                     
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* FOR LOAN TAG = P                                                            
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POT3,FORM=BP13TB,JDL=BP13,END;                                     
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1C                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* FOR LOAN TAG = N                                                            
//*-----------------------------------------------------------------            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POT3,FORM=BP13TC,JDL=BP13,END;                                     
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1D                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* FOR HDB LOAN (TAG H) APPLICANTS ONLY                                        
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F800H,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(8,4),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(1,1,CH,NE,C'C',AND,                                           
                  155,9,CH,NE,C'         ',AND,                                 
                  49,2,CH,EQ,C'PG',AND,                                         
                  51,2,CH,EQ,C'PG',AND,                                         
                  509,8,CH,GE,C'20080102',AND,                                  
                  924,3,CH,EQ,C'BTO',AND,                                       
                  963,1,CH,EQ,C'H',AND,                                         
                  785,6,CH,EQ,C'200708')                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&P13F800H,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13P037 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//BP13L037 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C037) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*=================================================================            
//* FOR HDB LOAN (TAG P) APPLICANTS ONLY                                        
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F800P,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(8,4),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(1,1,CH,NE,C'C',AND,                                           
                  155,9,CH,NE,C'         ',AND,                                 
                  49,2,CH,EQ,C'PG',AND,                                         
                  51,2,CH,EQ,C'PG',AND,                                         
                  509,8,CH,GE,C'20080102',AND,                                  
                  924,3,CH,EQ,C'BTO',AND,                                       
                  963,1,CH,EQ,C'P',AND,                                         
                  785,6,CH,EQ,C'200708')                                        
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&P13F800P,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13P037 DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID)                                  
//BP13L037 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C037) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*=================================================================            
//* FOR HDB LOAN (TAG N) APPLICANTS ONLY                                        
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F800N,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(8,4),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(1,1,CH,NE,C'C',AND,                                           
                  155,9,CH,NE,C'         ',AND,                                 
                  49,2,CH,EQ,C'PG',AND,                                         
                  51,2,CH,EQ,C'PG',AND,                                         
                  509,8,CH,GE,C'20080102',AND,                                  
                  924,3,CH,EQ,C'BTO',AND,                                       
                  963,1,CH,EQ,C'N',AND,                                         
                  785,6,CH,EQ,C'200708')                                        
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&P13F800N,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13P037 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID)                                  
//BP13L037 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C037) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
