//BP13Y700 JOB (BP13P),'BP13Y700',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),    00010000
//          NOTIFY=CSD0071                                              00020000
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                          00030000
//*==================================================================== 00040000
//* RUN IN JAN OF THE YEAR TO PRINT STATEMENT OF ACCOUNT FOR PREV YEAR  00041000
//*==================================================================== 00042000
//* CHGNO     ONNN   BY                                                 00043000
//*-----------------------------------                                  00043100
//* BP133171 021107 ED1 DBSS JOB                                        00043200
//* BP133489 120100 LSB CHG INTR-ADJ TO INTRADJ                         00043300
//* BP133662 130110 JB8 NEW PGM BP13CC91 TO SEPARATE LETTERS            00043400
//* BP135171 140211 RJE TO CATER FOR DB2 UPGRADE                        00043800
//*-------------------------------------------------------------------  00043900
//*==================================================================== 00044000
//*-----------------------------------------------------------------    00044100
//*  PRT01 : 1 COPY                      MA&B                           00044200
//*-----------------------------------------------------------------    00044300
//PRT01    EXEC PGM=IEBGENER                                            00044400
//SYSUT1   DD *                                                         00044500
$DJDE$ JDE=13CC92,JDL=BP13,END;                                         00044600
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                           00045000
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00046000
//SYSPRINT DD SYSOUT=*                                                  00047000
//SYSIN    DD DUMMY                                                     00048000
//*                                                                     00049000
//*-----------------------------------------------------------------    00050000
//*  PRT02 : 1 COPY                      MA&B                           00060000
//*-----------------------------------------------------------------    00070000
//PRT02    EXEC  PGM=IEBGENER                                           00080000
//SYSUT1   DD  *                                                        00090000
$DJDE$ JDE=BP13D,JDL=BP13,END;                                          00100000
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1B                           00110000
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                               00120000
//SYSPRINT DD  SYSOUT=*                                                 00130000
//SYSIN    DD  DUMMY                                                    00131000
//*                                                                     00132000
//*------------------------------------------------------------------   00133000
//* SORT BP13KD63  - OMIT INST OR ARRADJ                                00134000
//*-------------------------------------- ---------------------------   00135000
//STEP01   EXEC SORT,COND=(0,NE)                                        00136000
//SORTIN   DD DSN=BP13.KD63.TXHIST,DISP=SHR                             00137000
//SORTOUT  DD DSN=&&BP13FD63,DISP=(,PASS),                              00138000
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                          00139000
//         SPACE=(CYL,(50,10),RLSE)                                     00140000
//SYSIN    DD *                                                         00150000
   SORT FIELDS=(1,22,A),FORMAT=CH                                       00160000
   OMIT COND=(23,8,CH,EQ,C'INST    ',OR,23,8,CH,EQ,C'ARRADJ  ',OR,      00161000
              23,7,CH,EQ,C'INTRADJ')                                    00162000
//*-------------------------------------------------------------------* 00162100
//* SEPARATE DATA BASED ON PAGE NUMBER                                  00162200
//*-------------------------------------------------------------------* 00162300
//STEP02   EXEC PGM=BP13CC91,COND=(0,NE)                                00162400
//BP13FD63 DD DSN=&&BP13FD63,DISP=(OLD,PASS)                            00162500
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               00162600
//P13FD63A DD DSN=&&FD63P1,DISP=(,PASS),                                00162700
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                          00162800
//         SPACE=(CYL,(50,10),RLSE)                                     00162900
//P13FD63B DD DSN=&&FD63P2,DISP=(,PASS),                                00163000
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                          00163100
//         SPACE=(CYL,(50,10),RLSE)                                     00163200
//P13FD63C DD DSN=&&FD63P3,DISP=(,PASS),                                00163300
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                          00163400
//         SPACE=(CYL,(50,10),RLSE)                                     00163500
//SYSDBG   DD SYSOUT=*                                                  00163600
//SYSDBOUT DD SYSOUT=*                                                  00163700
//SYSOUT   DD SYSOUT=*                                                  00163800
/*                                                                      00163900
//*-----------------------------------------------------------------    00164000
//*  PRINT MORTGAGE LOAN STATEMENT OF ACCOUNT (1 PAGE)                  00164100
//*-----------------------------------------------------------------    00165000
//STEP03   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00166000
//BP13FD63 DD  DSN=&&FD63P1,DISP=(OLD,DELETE)                           00167000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00168000
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                          00169000
//             AMP=('BUFND=8','BUFNI=4')                                00170000
//BP13KD61 DD  DSN=BP13.KD61.ACCHIST,DISP=SHR,                          00180000
//             AMP=('BUFND=8','BUFNI=4')                                00190000
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                            00200000
//             AMP=('BUFND=8','BUFNI=4')                                00210000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00220000
//             AMP=('BUFND=8','BUFNI=4')                                00230000
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                             00240000
//             AMP=('BUFND=8','BUFNI=4')                                00250000
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                       00260000
//             AMP=('BUFND=8','BUFNI=4')                                00270000
//BP13PC92 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                         00280000
//BP13LC92 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                         00290000
//SYSOUT   DD SYSOUT=*                                                  00300000
//SYSTSPRT DD SYSOUT=*                                                  00310000
//SYSPRINT DD SYSOUT=*                                                  00320000
//SYSDBG   DD SYSOUT=*                                                  00330000
//SYSDBOUT DD SYSOUT=*                                                  00340000
//SYSTSIN  DD *                                                         00350000
  DSN SYSTEM(DSN)                                                       00360000
  RUN PROGRAM(BP13CC92) PLAN(BP13PCC) -                                 00370000
      LIB('BP13.BATCH.LOADCOB')                                         00380000
  END                                                                   00390000
//*-----------------------------------------------------------------    00400000
//*  PRINT MORTGAGE LOAN STATEMENT OF ACCOUNT (2 PAGES)                 00410000
//*-----------------------------------------------------------------    00420000
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00430000
//BP13FD63 DD  DSN=&&FD63P2,DISP=(OLD,DELETE)                           00440000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00450000
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                          00460000
//             AMP=('BUFND=8','BUFNI=4')                                00470000
//BP13KD61 DD  DSN=BP13.KD61.ACCHIST,DISP=SHR,                          00480000
//             AMP=('BUFND=8','BUFNI=4')                                00490000
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                            00500000
//             AMP=('BUFND=8','BUFNI=4')                                00510000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00520000
//             AMP=('BUFND=8','BUFNI=4')                                00530000
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                             00540000
//             AMP=('BUFND=8','BUFNI=4')                                00550000
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                       00560000
//             AMP=('BUFND=8','BUFNI=4')                                00570000
//BP13PC92 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                         00580000
//BP13LC92 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                         00590000
//SYSOUT   DD SYSOUT=*                                                  00600000
//SYSTSPRT DD SYSOUT=*                                                  00610000
//SYSPRINT DD SYSOUT=*                                                  00620000
//SYSDBG   DD SYSOUT=*                                                  00630000
//SYSDBOUT DD SYSOUT=*                                                  00640000
//SYSTSIN  DD *                                                         00650000
  DSN SYSTEM(DSN)                                                       00660000
  RUN PROGRAM(BP13CC92) PLAN(BP13PCC) -                                 00670000
      LIB('BP13.BATCH.LOADCOB')                                         00680000
  END                                                                   00690000
//*-----------------------------------------------------------------    00700000
//*  PRINT MORTGAGE LOAN STATEMENT OF ACCOUNT (3 PAGES)                 00710000
//*-----------------------------------------------------------------    00720000
//STEP05   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00730000
//BP13FD63 DD  DSN=&&FD63P3,DISP=(OLD,DELETE)                           00740000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00750000
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                          00760000
//             AMP=('BUFND=8','BUFNI=4')                                00770000
//BP13KD61 DD  DSN=BP13.KD61.ACCHIST,DISP=SHR,                          00780000
//             AMP=('BUFND=8','BUFNI=4')                                00790000
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                            00800000
//             AMP=('BUFND=8','BUFNI=4')                                00810000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00820000
//             AMP=('BUFND=8','BUFNI=4')                                00830000
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                             00840000
//             AMP=('BUFND=8','BUFNI=4')                                00850000
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                       00860000
//             AMP=('BUFND=8','BUFNI=4')                                00870000
//BP13PC92 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                         00880000
//BP13LC92 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                         00890000
//SYSOUT   DD SYSOUT=*                                                  00900000
//SYSTSPRT DD SYSOUT=*                                                  00910000
//SYSPRINT DD SYSOUT=*                                                  00920000
//SYSDBG   DD SYSOUT=*                                                  00930000
//SYSDBOUT DD SYSOUT=*                                                  00940000
//SYSTSIN  DD *                                                         00950000
  DSN SYSTEM(DSN)                                                       00960000
  RUN PROGRAM(BP13CC92) PLAN(BP13PCC) -                                 00970000
      LIB('BP13.BATCH.LOADCOB')                                         00980000
  END                                                                   00990000
