//BP13DP01 JOB (BP13P),'PRECHK',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),              
//      NOTIFY=CSD0071,USER=BP13SURP,SCHENV=HICPU                               
//*=====================================================================        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=====================================================================        
//*  BATCH JOB TO INSERT DAILY REQUEST FOR                                      
//*  BP13K730, BP13K825, BP13K830, BP13K853, BP13K857                           
//*=====================================================================        
//PS0100   EXEC PGM=BP13C9CA,COND=(0,NE),PARM='CI1TORP,BP13SURP'                
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//         DD DSN=CICS.ALIAS.SDFHEXCI,DISP=SHR                                  
//BP13F730 DD DSN=BP13.F730.REQAPPN.DAY,DISP=SHR                                
//BP13F825 DD DSN=BP13.F825.REQOCCP.DAY,DISP=SHR                                
//BP13F830 DD DSN=BP13.F830.REQADDR.DAY,DISP=SHR                                
//BP13F853 DD DSN=BP13.F853.REQMCPS.DAY,DISP=SHR                                
//BP13F857 DD DSN=BP13.F857.REQEMAIL.DAY,DISP=SHR                               
//BP13L9CA DD DSN=BP13.L9CA.ERRLOG,DISP=OLD                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
