//BP13A604 JOB (BP13P),'BP13A604',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0018                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*--------------------------------------------------------------------         
//*-USING APPLICANT1 ONLY                                                       
//*--------------------------------------------------------------------         
//*-PRINT REPORT ON SUCC BALLOTED CASE WITH NO, OF UNSUCC ATTEMP                
//*-3 REPORT A. SUCC (WITHIN 100%) SHOW BOOKED /NOT BK FLAT                     
//*          B. SUCC (WITHIN 200%) SHOW BOOKED /NOT BK FLAT                     
//*          C. UNSUCC CASES       SHOW BOOKED /NOT BOOK FLAT                   
//*--------------------------------------------------------------------         
//* OUTPUT BOOKD CASES FROM SOC MASTER                                          
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(250,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,CH,A),FORMAT=CH                                             
   INCLUDE COND=(155,4,CH,NE,C'    ')                                           
//*--------------------------------------------------------------------         
//* OUTPUT BOOKD CASES FORM SOC HISTORY                                         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F800,DISP=(MOD,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(250,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,CH,A),FORMAT=CH                                             
   INCLUDE COND=(155,4,CH,NE,C'    ')                                           
   OUTREC FIELDS=(1,2000)                                                       
//*--------------------------------------------------------------------         
//* OUTREC BP13K800, NRIC1                                                      
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F820,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,50),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=30,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,CH,A),FORMAT=CH                                             
   OUTREC FIELDS=(4,8,88,9,785,6,924,3,4X)                                      
//*--------------------------------------------------------------------         
//* SORT BY NRIC                                                                
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F820,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F800NRIC,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(150,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=30,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,CH,A),FORMAT=CH                                             
   SUM FIELDS=NONE                                                              
//*-----------------------------------------------------------------            
//*- THIS PORTION IS FOR UNSUCC ATTEMPT                                         
//*-----------------------------------------------------------------            
//*  OMIT CONDITION FOR COMPUTATION OF UNSUCC ATTEMPTS                          
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F595BALL,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN   DD *                                                                  
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(1,1,CH,EQ,C' ',OR,                                                
              260,1,CH,EQ,C' ',OR,                                              
              334,4,CH,LT,C'2001',OR,                                           
              334,6,CH,EQ,C'      ',OR,                                         
              334,6,CH,EQ,C'200204',OR,                                         
              334,6,CH,EQ,C'200205',OR,                                         
              334,6,CH,EQ,C'200303',OR,                                         
              334,6,CH,EQ,C'200305',OR,                                         
              376,1,CH,EQ,C'W',OR,                                              
              376,1,CH,EQ,C' ',OR,                                              
              376,2,CH,EQ,C'3R')                                                
//*-----------------------------------------------------------------            
//*- OUTPUT NRIC1                                                               
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595BALL,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F595,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(20,20),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OUTREC FIELDS=(1,483,41,9,8X)                                                
   OMIT COND=(41,1,CH,EQ,C'#')                                                  
//*---------------------------------------------------------------------        
//*- NRIC1- SORT OUTREC BY NRIC ASC & DTE-BALLOT ASC, SUCC-STATUS               
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F595DTE,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(250,20),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(484,9,A,334,6,A,260,1,A),FORMAT=CH                              
//*---------------------------------------------------------------------        
//* COMPUTE UNSUCC ATTEMPT                                                      
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13CB27,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595DTE,DISP=(OLD,PASS)                                     
//BP13F593 DD DSN=BP13.F593.UNSUCCNT.SUCC,DISP=(,CATLG),                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(250,20),RLSE)                                         
//P13F593A DD DSN=BP13.F593.UNSUCCNT.REV,DISP=(,CATLG),                         
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(250,20),RLSE)                                         
//P13F593B DD DSN=BP13.F593.UNSUCCNT.UNSUCC,DISP=(,CATLG),                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(250,20),RLSE)                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* SUCC UNDER 100% FLAT SUPPLY                                                 
//*--------------------------------------------------------------------         
//* SORT BY NRIC1 IN COL 1                                                      
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F593.UNSUCCNT.SUCC,DISP=SHR                              
//SORTOUT  DD DSN=&&F593SUCC,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(150,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,9,CH,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* CPMPUTE UNSCC COUNT AND TAG BOOKED/NOT BOOKED                               
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=BP13CB28,COND=(0,NE)                                        
//BP13F593 DD DSN=&&F593SUCC,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=&&F800NRIC,DISP=(OLD,PASS)                                    
//P13F593A DD DSN=BP13.F593.UNSUCCNT.SCASE.NOTBK,DISP=(,CATLG),                 
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(150,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//P13F593B DD DSN=BP13.F593.UNSUCCNT.SCASE.BOOK,DISP=(,CATLG),                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(150,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* SUCC UNDER 200% FLAT SUPPLY                                                 
//*--------------------------------------------------------------------         
//* SORT BY NRIC                                                                
//*-------------------------------------------------------------------*         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F593.UNSUCCNT.REV,DISP=SHR                               
//SORTOUT  DD DSN=&&F593REV1,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(150,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,9,CH,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* CPMPUTE UNSCC COUNT AND TAG BOOKED/NOT BOOKED                               
//*-------------------------------------------------------------------*         
//STEP12   EXEC PGM=BP13CB28,COND=(0,NE)                                        
//BP13F593 DD DSN=&&F593REV1,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=&&800NRIC,DISP=(OLD,PASS)                                     
//P13F593A DD DSN=BP13.F593.UNSUCCNT.RCASE.NOTBK,DISP=(,CATLG),                 
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(250,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//P13F593B DD DSN=BP13.F593.UNSUCCNT.RCASE.BOOK,DISP=(,CATLG),                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(150,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*- UNSUCC CASES                                                               
//*--------------------------------------------------------------------         
//* SORT BY NRIC                                                                
//*-------------------------------------------------------------------*         
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F593.UNSUCCNT.UNSUCC,DISP=SHR                            
//SORTOUT  DD DSN=&&F593UNS2,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(150,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,9,CH,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* RETRIEVE NRIC COUNT AND WRITE TO BP13F730                         *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=BP13CB28,COND=(0,NE)                                        
//BP13F593 DD DSN=&&F593UNS2,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=&&F800NRIC,DISP=(OLD,PASS)                                    
//P13F593A DD DSN=BP13.F593.UNSUCCNT.UCASE,DISP=(,CATLG),                       
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(150,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//P13F593B DD DSN=BP13.F593.UNSUCCNT.UCASE.BOOK,DISP=(,CATLG),                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,50),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
