//BP13DM25 JOB (BP13P),'BP13DM25',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             COND=(0,NE),NOTIFY=CSD0071                                       
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//***************************************************************               
//* TO DETERMINE APPLICATION CORE NUCLEUS PERSON RESIDENTIAL                    
//* OWNERSHIP ELIGIBILITY FOR FTPMC                                             
//***************************************************************               
//*STEP01: SET RECORD TYPE 0 FOR HEADER, 1 TO APPLICATION RECORD                
//*DETAIL AND 9 TO CONTROL RECORD                                               
//***************************************************************               
//STEP01  EXEC PGM=SORT                                                         
//SORTIN   DD DISP=SHR,DSN=BP13.FDM26001.ACCEPTED.SD(0)                         
//SORTOUT  DD DSN=&&STEP01,DISP=(NEW,PASS,DELETE),UNIT=CART,                    
//            DCB=(LRECL=101,RECFM=FB,BLKSIZE=0)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(7,8,CH,A)                                                        
  INREC IFTHEN=(WHEN=(7,8,CH,EQ,X'0000000000000000'),                           
        BUILD=(1:C'0',2:1,100)),                                                
        IFTHEN=(WHEN=(7,8,CH,EQ,X'FFFFFFFFFFFFFFFF'),                           
        BUILD=(1:C'9',2:1,100)),                                                
        IFTHEN=(WHEN=NONE,                                                      
        BUILD=(1:C'1',2:1,100))                                                 
//*                                                                             
//***************************************************************               
//*STEP02: SORT CORE NUCLEUS PERSON BY ASCENDING NRIC AND SET RECORD            
//*TYPE 2 TO CORE NUCLEUS PERSON DETAILS                                        
//***************************************************************               
//STEP02  EXEC PGM=SORT                                                         
//SORTIN   DD DISP=SHR,DSN=BP13.K825.REQOCCP,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&STEP02,DISP=(NEW,PASS,DELETE),UNIT=CART,                    
//            DCB=(LRECL=101,RECFM=FB,BLKSIZE=0)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,CH,A,9,9,CH,A)                                               
  INCLUDE COND=(1,1,CH,EQ,C'8',AND,131,1,CH,EQ,C'Y')                            
  OUTREC IFTHEN=(WHEN=(1,8,CH,NE,C' '),                                         
        BUILD=(1:C'2',2:C'      ',1,8,9,9,131,1,76:X))                          
//*                                                                             
//***************************************************************               
//*STEP03: MERGE HEADER, APPLICATION DETAIL, CONTROL RECORD WITH PERSON         
//*RECORD AND SORT BY ASCENDING REGN, RECORD TYPE AND NRIC                      
//***************************************************************               
//STEP03   EXEC SORT                                                            
//SORTIN   DD DSN=&&STEP01,DISP=(OLD,DELETE,DELETE),UNIT=CART                   
//         DD DSN=&&STEP02,DISP=(OLD,DELETE,DELETE),UNIT=CART                   
//SORTOUT  DD DSN=&&STEP03,DISP=(NEW,PASS,DELETE),UNIT=CART,                    
//            DCB=(LRECL=101,RECFM=FB,BLKSIZE=0)                                
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(8,8,CH,A,1,1,CH,A,16,9,CH,A)                                     
//***************************************************************               
//*STEP04: DETERMINE CORE NUCLEUS PERSON RESIDENTIAL PROPERTY                   
//*OWNERSHIP ELIGIBLITY                                                         
//***************************************************************               
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20                                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//BP13FIN1 DD DSN=&&STEP03,DISP=(OLD,DELETE,DELETE),UNIT=CART                   
//BB24K520 DD DISP=SHR,DSN=BB24.K520.RESLSOC,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K530 DD DISP=SHR,DSN=BB24.K530.UINSOC,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K510 DD DISP=SHR,DSN=BB24.K510.UINHIST,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K502 DD DISP=SHR,DSN=BB24.K502.RESLHIST,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BR10K010 DD DISP=SHR,DSN=BR10.K010.PTEPPTY,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BR10K080 DD DISP=SHR,DSN=BR10.K080.PTEPPTY.HIST,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BR05K100 DD DISP=SHR,DSN=BR05.K100.SLSSOC,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB13K510 DD DISP=SHR,DSN=BB13.K510.UINHIST,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB13K500 DD DISP=SHR,DSN=BB13.K500.HISTORY,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FOT1 DD DSN=BP13.FDM25001.ACCEPTED.SD(+1),                                
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(10,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                            
//BP13FOT2 DD DSN=BP13.FDM25002.REJECTED.SD(+1),                                
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(10,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                            
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CM25) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
