//BP13ASU1 JOB (BP13P),'BP13ASU1',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- --------------------------------------------         
//* BP133316 IL5  11042008 NEW                                                  
//* BP133913 ZDD  03062010 ADD BP13C71D                                         
//* BP134688 IL5  25102012 OMIT UNSHORTLISTED GRO RECORDS FROM                  
//*                        PUBLIC ROUND                                         
//*                        UPDATE SBF APPLICATION AS 'U' IF NOT                 
//*                        SHORTLISTED WITHIN 300%                              
//* BP134718 SMR2 04122012 ADD DATASET FOR UNSUCCESSFUL MGPS                    
//* BP134982 IL5  29072013 PRINT CUMULATIVE REPORT FOR BP13C525                 
//* BP135708 SMR2 31032015 CHANGE CLASS=2 TO CLASS=J                            
//* BP136107 SMR2 18032016 REMOVE BP13C525                                      
//* BP137052 SMR2 26102017 SAVE RECORDS THAT WERE SHORTLISTED UNDER APPZ        
//* BP137173 SMR2 19012018 ADD NEW PROGRAM, BP13CB66                            
//* BP137173 JF7  19042018 ADD FILE BP13K813 FOR PROGRAM BP13CB65               
//* BP137173 IL5  19042018 BACKUP BP13.K740.MATUREBA                            
//* BP137455 LSB1 28082018 ADD FW3H/FW3I                                        
//* BP138214 AM25 11032020 BP13CB65 NEW INPUT FILE                              
//* BP138301 AM25 09072020 REMOVE DJDE                                          
//* BP138511 IL5 221220 - INCLUDE 'E' FLAT INTO REPORT BP13LB66                 
//**********************************************************************        
//*------------------------------------------------------------------           
//* FOR CDE-REQUEST-STATUS = W (UNSUCC)                                 00000030
//* UPDATE '01' FOR ROUND 1 TO CDE-COHORT                               00000030
//*---------------------------------------------------------------------00000030
//*- UNSUCC ROUND 1                                                             
//*---------------------------------------------------------------------        
//STEP01   EXEC  PGM=BP13C71H,COND=(0,NE)                               00002680
//BP13F740 DD DSN=BP13.F740.MATUREBA.ARE2.R01,DISP=SHR                          
//BP13F713 DD DSN=BP13.F713.PIGEON.COHORT01,DISP=SHR                            
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//*-----------------------------------------------------------------    01491002
//* SORT BY REGN                                                        01492002
//* INCLUDE ALL UNSUCCESSFUL APPLICATIONS                               01493002
//*-----------------------------------------------------------------    01494002
//STEP02A EXEC SORT,COND=(0,NE)                                         01495002
//SORTIN  DD DSN=BP13.F740.MATUREBA.ARE2.R01,DISP=SHR                   01496003
//        DD DSN=BP13.F740.MATUREBA.GRO.UNSUCC,DISP=SHR                         
//        DD DSN=BP13.F740.MATUREBA.MGP.UNSUCC,DISP=SHR                         
//SORTOUT DD DSN=&&F740REGN,DISP=(,PASS),                               01497002
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                     01498002
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                        01499002
//SYSIN   DD  *                                                         01499102
    SORT FIELDS=(123,8,A),FORMAT=CH                                     01499202
//* -------- ---- -------- --------------------------------------------         
//* TO UPDATE RESULT STATUS = 'U' AND BOOK STATUS = 'NS' FOR                    
//* BTO APPLICATIONS                                                            
//*--------------------------------------------------------------------         
//STEP02B   EXEC PGM=BP13C71D,COND=(0,NE)                                       
//BP13F740  DD DSN=&&F740REGN,DISP=(OLD,DELETE)                                 
//BP13K740  DD DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* F1 : ALL CASES (SHORTLISTED & NOT SHORTLISTED)                              
//* F2 : CASES SHORTLISTED IN BP13APPZ                                          
//* MATCH BY RANDOM NUMBER                                                      
//* REUSE THE FIELD F740-CDE-NT5 COL 199 LEN 3 TO TAG AS 'APZ'                  
//*--------------------------------------------------------------------         
//STEP03   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTJNF2 DD DSN=BP13.F740.MATUREBA.APPZ.SUCC,DISP=SHR                         
//MATCH    DD DSN=BP13.F740.MATUREBA.APPZ,DISP=MOD                              
//SYSIN    DD *                                                                 
   JOINKEYS FILE=F1,FIELDS=(1,28,A)                                             
   JOINKEYS FILE=F2,FIELDS=(1,28,A)                                             
   REFORMAT FIELDS=(F1:1,500)                                                   
   OUTFILE FNAMES=MATCH,                                                        
      OUTREC=(1,198,C'APZ',202,299)                                             
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SHORTLISTED IN 300%                                                         
//* S1: SORT OUT ALL 2F CASES                                                   
//* S2: SORT OUT SBF CASES W/ 3-ROOM & ABOVE FLAT TYPE                          
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT1 DD DSN=&&F740CB65,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(50,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SORTOUT2 DD DSN=&&F740CB66,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(50,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,187,3,A,211,2,A,123,8,A),FORMAT=CH                     
    OUTFIL FNAMES=SORTOUT1,INCLUDE=(226,3,CH,NE,C'   ',AND,                     
                 211,2,CH,EQ,C'2F',AND,260,1,CH,EQ,C'W')                        
    OUTFIL FNAMES=SORTOUT2,INCLUDE=(226,3,CH,NE,C'   ',AND,                     
                 (211,2,CH,GE,C'3 ',OR,211,2,CH,EQ,C'E '),AND,                  
                 376,3,CH,EQ,C'SBF',AND,                                        
                 260,1,CH,EQ,C'W')                                              
//*--------------------------------------------------------------------         
//* SHORTLISTED ONLY IN BP13APPZ (300%)                                         
//* S1: SORT OUT 2F CASES                                                       
//* S2: SORT OUT SBF CASES W/ 3-ROOM & ABOVE FLAT TYPE                          
//*--------------------------------------------------------------------         
//STEP05   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.F740.MATUREBA.APPZ.SUCC,DISP=SHR                         
//SORTOUT1 DD DSN=&&F730CB65,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SORTOUT2 DD DSN=&&F730CB66,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,187,3,A,211,2,A,123,8,A),FORMAT=CH                     
    OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,2,CH,EQ,C'2F')                          
    OUTFIL FNAMES=SORTOUT2,INCLUDE=((211,2,CH,GE,C'3 ',OR,                      
                                     211,2,CH,EQ,C'E '),AND,                    
                                    376,3,CH,EQ,C'SBF')                         
//*--------------------------------------------------------------------         
//* GENERATE SHORTLISTING REPORTS TO BE USED FOR CLEARANCE OF                   
//* BALLOT RESULTS FOR 2F ONLY (300%)                                           
//*--------------------------------------------------------------------         
//STEP06   EXEC PGM=BP13CB65,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CB65,DISP=(OLD,DELETE)                                  
//BP13F730 DD DSN=&&F730CB65,DISP=(OLD,DELETE)                                  
//P13F730A DD DUMMY                                                             
//BP13K010 DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//BP13K01A DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K030 DD DSN=BP13.K010.TENDER.BFADJUST,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//BP13K71A DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13LB65 DD DSN=BP13.LB65.REPORT,DISP=MOD                                     
//BP13FW3I DD DSN=BP13.FW3I.BALLOT.RESULT.A300,DISP=OLD                         
//SYSIN    DD *                                                                 
300                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* GENERATE SHORTLISTING REPORTS TO BE USED FOR CLEARANCE OF                   
//* BALLOT RESULTS FOR SBF 3-RM AND ABOVE (300%)                                
//*--------------------------------------------------------------------         
//STEP07   EXEC PGM=BP13CB66,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CB66,DISP=(OLD,DELETE)                                  
//BP13F730 DD DSN=&&F730CB66,DISP=(OLD,DELETE)                                  
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K030 DD DSN=BP13.K010.TENDER.BFADJUST,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13LB66 DD DSN=BP13.LB66.REPORT,DISP=MOD                                     
//BP13FW3I DD DSN=BP13.FW3I.BALLOT.RESULT.A300,DISP=MOD                         
//SYSIN    DD *                                                                 
300                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  BACKUP TO SEQUENTIAL FILES                                                 
//*--------------------------------------------------------------------         
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F740.MATUREBA.APPZ.SUCC,DISP=SHR                         
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.APPZ.SUCC300,DISP=OLD                      
//INPUT2   DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//OUTPUT2  DD DSN=BP13.F010.ELDERLY.ASU1,DISP=OLD                               
//INPUT3   DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//OUTPUT3  DD DSN=BP13.F712.ELDERLY.ASU1,DISP=OLD                               
//INPUT4   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT4  DD DSN=BP13.F010.TENDER.ASU1,DISP=OLD                                
//INPUT5   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT5  DD DSN=BP13.F712.FLATNHUG.ASU1,DISP=OLD                              
//INPUT6   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT6  DD DSN=BP13.F740.MATUREBA.ASU1,DISP=OLD                              
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
/*                                                                              
