//BP13A515 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130170 LSB 960829 - STEP01, EXPAND TEMP SPACE                             
//* BP130445 SSS 980210 - EXPAND F558 RECL FROM 150 TO 400                      
//* BP132818 BA3 060126 - TO CHANGE SORTING OF REF NO FROM 6 BYTES              
//*                       TO 8 BYTES.                                           
//******************************************************************            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 2                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C526,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2                                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT02 : SINGLE COPY                                                        
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1                                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* SORT BY SUCC NT, FLAT TYPE, REF-NO                                          
//*---------------------------------------------------------------------        
//STEPA1   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F520A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=300),                              
//            SPACE=(CYL,(50,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(226,3,A,211,2,A,41,9,A),FORMAT=CH                               
   INCLUDE COND=(226,3,CH,NE,C'   ')                                            
//*---------------------------------------------------------------------        
//* PRINT SUCC LIST FOR SALES PUBLIC VIEWING ON SALES NOTICE BOARD              
//*---------------------------------------------------------------------        
//STEPA2   EXEC PGM=BP13C526,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13F520 DD DSN=&&P13F520A,DISP=(OLD,PASS)                                    
//P13L526A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//**********************************************************************        
//* BP13 & AG06 (SOC & EIS) QUATERLY BOOKING BALLOT RESULTS INTERFACE           
//* TO PASS RECORDS BY PERIOD FORMAT YYMM,NEW TOWN,FLAT TYPE,NUMBER OF          
//* FLATS OFFERED,NUMBER OF NEW REQUESTS RECEIVED,NUMBER OF REPEATS             
//* REQUESTS RECEIVED,NUMBER OF REOPTION REQUESTS & NUMBER OF BALLOTED          
//* (SUCCESSFUL) REQUESTS IN BOOKING EXERCISE TO AG06F54C FILE                  
//*=====================================================================        
//* STEP    DESCRIPTION                                                         
//* -----   -----------                                                         
//* 01-04   OUTREC RELEVANT HISTORY RECORDS BY NRIC WITH INFO ON:               
//*           NRIC, REF-NO, DTE-BALLOT, CDE-NT                                  
//* 11-13   OUTREC RELEVANT CURRENT BALLOT RECORDS BY NRIC WITH INFO ON:        
//*           NRIC, CUR-REF-NO, DTE-BALLOT, CDE-NT                              
//* 21-24   MATCH BALLOT & HISTORY - TO OMIT APPLN NOT FOUND IN CURRENT         
//*           BALLOT.                                                           
//*         FOR ALL REQUESTS IN BALLOT, INDICATE WHETHER REQUEST IS:            
//*           OPTION, REPEAT OR NEW.                                            
//*=====================================================================        
//* TO INCLUDE VALID HISTORY RECORDS (BP13K595)                                 
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&BP13K595,DISP=(NEW,PASS),                                   
//            DCB=(LRECL=300,RECFM=FB),                                         
//            UNIT=(SYSDA,2),SPACE=(CYL,(800,200),RLSE)                         
//SYSIN    DD *                                                                 
   SORT FIELDS=(280,20,A),FORMAT=CH                                             
   OMIT    COND=(260,1,CH,EQ,C' ',OR,                                           
                 260,1,CH,EQ,C'C')                                              
//*---------------------------------------------------------------------        
//* OUTREC NRIC1 FROM HISTORY RECORDS                                           
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13K595,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&HNRIC,DISP=(NEW,PASS),                                      
//            DCB=(LRECL=50,RECFM=FB),                                          
//            UNIT=(SYSDA,1),SPACE=(CYL,(50,10),RLSE)                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   OUTREC FIELDS=(42,8,33,8,261,8,260,1,187,3,117,4,6X,226,3,                   
       113,1,X,211,2,7X)                                                        
//*---------------------------------------------------------------------        
//* OUTREC NRIC2 FROM HISTORY RECORDS                                           
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13K595,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&HNRIC,DISP=(MOD,PASS)                                       
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   OMIT COND=(83,1,CH,EQ,C'#')                                                  
   OUTREC FIELDS=(83,8,33,8,261,8,260,1,187,3,117,4,6X,226,3,                   
       113,1,X,211,2,7X)                                                        
//*---------------------------------------------------------------------        
//* SORT HISTORY NRIC BY NRIC & DTE-REQ (DESCENDING ORDER)                      
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&HNRIC,DISP=(OLD,PASS)                                       
//SORTOUT  DD DSN=&&HISTNRIC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),DCB=(LRECL=50,RECFM=FB),                           
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A,27,4,D),FORMAT=CH                                         
//*=====================================================================        
//* OUTREC NRIC1 FROM CURRENT BALLOT RECORDS (BP13K520)                         
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&CNRIC,DISP=(NEW,PASS),                                      
//            DCB=(LRECL=50,RECFM=FB),                                          
//            UNIT=(SYSDA,1),SPACE=(CYL,(50,10),RLSE)                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(72,6,CH,EQ,C'      ')                                          
   OUTREC FIELDS=(42,8,33,8,261,8,260,1,187,3,117,4,33,8,226,3,                 
       113,1,X,211,2,7X)                                                        
//*---------------------------------------------------------------------        
//* OUTREC NRIC2 FROM CURRENT BALLOT RECORDS                                    
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&CNRIC,DISP=(MOD,PASS)                                       
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(72,6,CH,EQ,C'      ',AND,                                      
                 83,1,CH,NE,C'#')                                               
   OUTREC FIELDS=(83,8,33,8,261,8,260,1,187,3,117,4,33,8,226,3,                 
       113,1,X,211,2,7X)                                                        
//*---------------------------------------------------------------------        
//* SORT BALLOT NRIC                                                            
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&CNRIC,DISP=(OLD,PASS)                                       
//SORTOUT  DD DSN=&&CURRNRIC,DISP=(NEW,PASS),                                   
//            DCB=(LRECL=50,RECFM=FB),                                          
//            UNIT=(SYSDA,1),SPACE=(CYL,(50,10),RLSE)                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A,27,4,D),FORMAT=CH                                         
//*=====================================================================        
//* MATCH NRIC FROM CURRENT AND HISTORY RECORDS                                 
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=BP13C700,COND=(0,NE)                                        
//BP13REQT DD DSN=&&CURRNRIC,DISP=(OLD,PASS)                                    
//BP13HIST DD DSN=&&HISTNRIC,DISP=(OLD,PASS)                                    
//BP13F706 DD DSN=&&MNRIC,DISP=(,PASS),                                         
//            SPACE=(CYL,(50,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=50)                                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT MATCHED REQUESTS BY REF-NO & NRIC                                      
//* (OMIT CURRENT REQUESTS INFORMATION - IDENTIFY BY COL 41)                    
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&MNRIC,DISP=(OLD,PASS)                                       
//SORTOUT  DD DSN=&&MTCHNRIC,DISP=(NEW,PASS),                                   
//            DCB=(LRECL=50,RECFM=FB),                                          
//            UNIT=(SYSDA,1),SPACE=(CYL,(50,10),RLSE)                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(31,6,A,1,8,A),FORMAT=CH                                         
   OMIT COND=(41,1,CH,EQ,C'Y')                                                  
//*---------------------------------------------------------------------        
//* SORT BP13K520 SEQUENTIALLY BY REF-NO                                        
//*---------------------------------------------------------------------        
//STEP23A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&BALLOT,DISP=(NEW,PASS),                                     
//            DCB=(LRECL=300,RECFM=FB),                                         
//            UNIT=(SYSDA,1),SPACE=(CYL,(50,10),RLSE)                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(33,8,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SORT OUT THE HOUSEHOLD TYPE = 'G' UPGRADER CASES                            
//*---------------------------------------------------------------------        
//STEP23B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F558UPG,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=400)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(93,1,CH,EQ,C'G')                                               
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* INDICATE WHETHER REQUESTS IN BALLOT FILE IS OPTION, REPEAT OR NEW           
//*---------------------------------------------------------------------        
//STEP24   EXEC PGM=BP13C706,COND=(0,NE)                                        
//BP13F520 DD DSN=&&BALLOT,DISP=(OLD,PASS)                                      
//BP13F558 DD DSN=&&F558UPG,DISP=(OLD,PASS)                                     
//BP13F706 DD DSN=&&MTCHNRIC,DISP=(OLD,PASS)                                    
//BP13OUT  DD DSN=&&NEWF520,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),DCB=(LRECL=300,RECFM=FB),                          
//            SPACE=(CYL,(30,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY NEW TOWN & FLAT TYPE                                                
//*---------------------------------------------------------------------        
//STEP12A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&NEWF520,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&BP13F520,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),DCB=(LRECL=300,RECFM=FB),                          
//            SPACE=(CYL,(30,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,2,A),FORMAT=CH                                      
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13C537,COND=(0,NE)                                        
//BP13F520 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//AG06F54C DD DSN=AG06.F54C.BREQ,DISP=OLD                                       
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//**********************************************************************        
//* BP13 & AG06 (SOC & EIS) QUATERLY BOOKING OF FLATS INTERFACE                 
//* TO PASS RECORDS BY PERIOD FORMAT YYMM, NEW TOWN, FLAT TYPE & NUMBER         
//* OF UNITS OFFERED IN BOOKING SYSTEM TO AG06F54C FILE                         
//**********************************************************************        
//STEPB3   EXEC PGM=BP13C536,COND=(0,NE)                                        
//BP13F010 DD DSN=BP13.F010.TENDER.NEWBAL,DISP=SHR                              
//BP13F54D DD DSN=&&BP13OFFR,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=14),                                          
//            UNIT=SYSDA,SPACE=(TRK,(50,20),RLSE)                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=====================================================================        
//STEPB4  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=&&BP13OFFR,DISP=(OLD,DELETE)                                   
//SORTOUT DD DSN=&&AG06OFFR,DISP=(,PASS),                                       
//           DCB=(RECFM=FB,LRECL=14),                                           
//           UNIT=SYSDA,SPACE=(TRK,(50,20),RLSE)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(5,5,A),FORMAT=CH                                               
//*=====================================================================        
//STEPB5  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=AG06.F54C.BREQ,DISP=SHR                                        
//SORTOUT DD DSN=&&AG06BREQ,DISP=(,PASS),                                       
//        DCB=(RECFM=FB,LRECL=34),                                              
//        UNIT=SYSDA,SPACE=(TRK,(50,20),RLSE)                                   
//SYSIN   DD  *                                                                 
    SORT FIELDS=(5,5,A),FORMAT=CH                                               
/*                                                                              
//*=====================================================================        
//STEPB6   EXEC PGM=BP13C542,COND=(0,NE)                                        
//BP13F54D DD DSN=&&AG06OFFR,DISP=(OLD,DELETE)                                  
//AG06F54C DD DSN=&&AG06BREQ,DISP=(OLD,DELETE)                                  
//AG06OUT  DD DSN=AG06.F54C.BREQ,DISP=OLD                                       
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A515                                                                
//*---------------------------------------------------------------------        
