//BP13ADP6 JOB (BP13P),'BP13ADP6',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//* PRINT REPORT ON DBSS FLAT, PREPARE REPORT TO DEVELOPER                      
//**************************************************************                
//*=================================================================            
//* CHG REF  BY   ON     DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP133244 LSB 260108  NEW JCL FOR DBSS REPORT                                
//* BP133544 ESA1190509  REPLACE BP13K825 WITH BP13KB20(BP13CD08)               
//*                      REMOVE BP13K830 IN BP13CD08                            
//*                      REMOVE P13LD08B REPORT IN BP13CD08                     
//* BP134259 IL5 300611  HARDCODE REGN NUMBERS OF APPLICATIONS                  
//*                      CANCELLED BY SIM LIAN AFTER BALLOT                     
//*                      TO OMIT                                                
//* BP134447 IL5 270112  TO CHANGE BP13.K740.MATUREBA TO                        
//*                                BP13.K740.MATUREBA.DBS                       
//* BP134674 SMR2 101012 TO DELETE AND DEFINE ALL THE LD08 DATASETS             
//* BP135016 SMR2 200813 TO CHANGE BP13.K200.BKAPPMT TO                         
//*                                BP13.K200.BKAPPMT.EC                         
//* BP135016 IL5  020913 REMOVE REFERENCE TO BP13KB20                           
//*                      RECORDS HAVE NOT BEEN CREATED IN BP13KB20 YET          
//* BP135872 SMR2 310715 CHANGE CLASS 2 TO CLASS J                              
//* BP139931 AM25 290224 CHANGE CLASS J TO CLASS 2                              
//*=================================================================            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//*  DELETE SEQUENTIAL DATASETS                                                 
//*---------------------------------------------------------------------        
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DEL (BP13.LD08.GRO)                                                         
    DEL (BP13.LD08.PA100)                                                       
    DEL (BP13.LD08.PA200)                                                       
    DEL (BP13.LD08.UNSUC)                                                       
    IF MAXCC < 12 THEN                                                          
       SET MAXCC = 0                                                            
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.DBS,DISP=SHR                               
//SORTOUT  DD DSN=&&F740TOT,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(235,5,A,123,8,A),FORMAT=CH                                       
//*-----------------------------------------------------------------            
//* OUTPUT FILES FOR SEPARATE PIGEONHOLING PROCESS, PRIORITY,                   
//* TRANSITION NHH > 7 MTH, AND COHORTS ( MAX 5 )                               
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=BP13C741,COND=(0,NE),ADDRSPC=VIRT,REGION=4096K              
//BP13F520 DD  DSN=&&F740TOT,DISP=(OLD,PASS)                                    
//BP13MGP  DD  DUMMY                                                            
//BP13PR   DD  DSN=&&F740PRIO,DISP=(,PASS),                                     
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(8,5),RLSE)                                               
//BP13GRO  DD  DSN=&&F740GRO,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(5,5),RLSE)                                               
//BP13PUB  DD DSN=&&F740PUB,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(10,5),RLSE)                                              
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* REPORT ON DBSS BALLOT RESULT -GRO                                           
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13CD08,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740GRO,DISP=(OLD,PASS)                                     
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K200 DD DSN=BP13.K200.BKAPPMT.EC,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K201 DD DSN=BP13.K200.BKAPPMT.EC.PATH1,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13LD08A DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13FD08 DD  DSN=BP13.LD08.GRO,DISP=(NEW,CATLG),                              
//         DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                              
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT SUCC DBSS CASES                                                    
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740PRIO,DISP=(OLD,PASS)                                    
//         DD DSN=&&F740PUB,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740SUCC,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(235,5,A,123,8,A),FORMAT=CH                                       
  INCLUDE COND=(260,1,CH,EQ,C'S')                                               
//*-----------------------------------------------------------------            
//* REPORT ON DBSS BALLOT RESULT - SUCC 100%                                    
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13CD08,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K200 DD DSN=BP13.K200.BKAPPMT.EC,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K201 DD DSN=BP13.K200.BKAPPMT.EC.PATH1,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13LD08A DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13FD08 DD  DSN=BP13.LD08.PA100,DISP=(NEW,CATLG),                            
//         DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                              
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT SUCC 101% - 200%                                                       
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740PRIO,DISP=(OLD,PASS)                                    
//         DD DSN=&&F740PUB,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740RESV,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(235,5,A,123,8,A),FORMAT=CH                                       
  INCLUDE COND=(260,1,CH,EQ,C'R')                                               
//*-----------------------------------------------------------------            
//* REPORT ON DBSS BALLOT RESULT - RESERVE LIST                                 
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13CD08,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740RESV,DISP=(OLD,PASS)                                    
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K200 DD DSN=BP13.K200.BKAPPMT.EC,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K201 DD DSN=BP13.K200.BKAPPMT.EC.PATH1,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13LD08A DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13FD08 DD  DSN=BP13.LD08.PA200,DISP=(NEW,CATLG),                            
//         DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                              
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT UNSUCC CASES                                                       
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740PRIO,DISP=(OLD,PASS)                                    
//         DD DSN=&&F740PUB,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740UNSC,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(235,5,A,123,8,A),FORMAT=CH                                       
  INCLUDE COND=(260,1,CH,EQ,C'W')                                               
//*-----------------------------------------------------------------            
//* REPORT ON BALLOT RESULT                                                     
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=BP13CD08,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740UNSC,DISP=(OLD,PASS)                                    
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K200 DD DSN=BP13.K200.BKAPPMT.EC,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K201 DD DSN=BP13.K200.BKAPPMT.EC.PATH1,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13LD08A DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13FD08 DD  DSN=BP13.LD08.UNSUC,DISP=(NEW,CATLG),                            
//         DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                              
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* REPORT ON BALLOT RESULT FOR GRO, ALSO INDICATE GRO-PA RESULT                
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=BP13CD10,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740GRO,DISP=(OLD,PASS)                                     
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K740 DD DSN=BP13.K740.MATUREBA.DBS,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K200 DD DSN=BP13.K200.BKAPPMT.EC,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K201 DD DSN=BP13.K200.BKAPPMT.EC.PATH1,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LD10 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13FD10 DD  DSN=BP13.LD10.GRO,DISP=OLD                                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
