//BP13D121 JOB (BP13P),'BP13D121',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//* ============================================================== *            
//* CHG REF  BY   ON       DESCRIPTION                             *            
//* -------- ---- -------- -----------                             *            
//* BP137965 SRG1 20190516 CREATE FILES FROM CPFB RETURN FILE      *            
//* ============================================================== *            
//*=================================================================            
//*--------------------------------------------------------------------         
//* STEP01 COPY TO DAILY FILES                                                  
//*---------------------------------------------------------------------        
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=AB02.F945.SOC,DISP=SHR                                       
//SORTOUT  DD  DSN=BP13.AB02.F945.SOC.DAILY,DISP=SHR                            
//SYSIN    DD  *                                                                
        SORT FIELDS=(40,8,A,2,9,A),FORMAT=CH                                    
//*--------------------------------------------------------------------         
//* STEP02 BACKUP FILES TO ACCUM                                                
//*---------------------------------------------------------------------        
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F945.SOC.DAILY,DISP=SHR                            
//SORTOUT  DD  DSN=BP13.AB02.F945.SOC.ACCUM,DISP=MOD                            
//SYSIN    DD  *                                                                
        SORT FIELDS=(40,8,A,2,9,A),FORMAT=CH                                    
//*--------------------------------------------------------------------*        
//* GENERATE REPORT FOR FINANCE                                        *        
//*--------------------------------------------------------------------*        
//STEP03   EXEC PGM=BP13CB3E,COND=(0,NE)                                        
//AB02F945 DD DSN=BP13.AB02.F945.SOC.DAILY,DISP=SHR                             
//BP13L945 DD DSN=BP13.AB02.F945.SOC.FINANCE,DISP=MOD                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------         
//* STEP04 SORT INPUT FILE                                                      
//*---------------------------------------------------------------------        
//STEP04   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F940.DPFLAT.BKUP(0),DISP=SHR                       
//SORTOUT  DD  DSN=&&AB02F940,DISP=(NEW,PASS),                                  
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                              
//             SPACE=(CYL,(10,10),RLSE)                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,47,A),FORMAT=CH                                              
//*--------------------------------------------------------------------         
//* STEP05 SORT RETURN FILE                                                     
//*---------------------------------------------------------------------        
//STEP05   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F945.SOC.DAILY,DISP=SHR                            
//SORTOUT  DD  DSN=&&AB02F945,DISP=(NEW,PASS),                                  
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,47,A),FORMAT=CH                                              
//*--------------------------------------------------------------------*        
//* MATCH SENT AND RETURN FILES                                        *        
//*--------------------------------------------------------------------*        
//STEP06   EXEC PGM=BP13CB3F,COND=(0,NE)                                        
//AB02F940 DD DSN=&&AB02F940,DISP=(OLD,DELETE)                                  
//AB02F945 DD DSN=&&AB02F945,DISP=(OLD,DELETE)                                  
//P13F945A DD DSN=BP13.AB02.F945.SOC.DAILY.MATCH,DISP=SHR                       
//P13F945B DD DSN=BP13.AB02.F945.SOC.DAILY.NMATCH,DISP=SHR                      
//P13F940A DD DSN=BP13.AB02.F940.DPFLAT.MATCH,DISP=SHR                          
//P13F940B DD DSN=BP13.AB02.F940.DPFLAT.NMATCH,DISP=SHR                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------         
//* STEP07 SORT ALL RECS THE AMOUNT REQUESTED BY HDB WAS RECOVERED              
//*---------------------------------------------------------------------        
//STEP07   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F945.SOC.DAILY.MATCH,DISP=SHR                      
//SORTOUT  DD  DSN=BP13.AB02.F945.FULL.RECVED,DISP=SHR                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(40,8,A,2,9,A),FORMAT=CH                                        
    INCLUDE COND=(101,1,CH,EQ,C'1')                                             
//*--------------------------------------------------------------------         
//* STEP08 SORT ONLY PART OF THE AMOUNT REQUESTED BY HDB WAS RECOVERED          
//*---------------------------------------------------------------------        
//STEP08   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F945.SOC.DAILY.MATCH,DISP=SHR                      
//SORTOUT  DD  DSN=BP13.AB02.F945.PARTL.RECVED,DISP=SHR                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(40,8,A,2,9,A),FORMAT=CH                                        
    INCLUDE COND=(101,1,CH,EQ,C'2')                                             
//*--------------------------------------------------------------------         
//* STEP09 SORT NO MONIES WERE RECOVERED                                        
//*---------------------------------------------------------------------        
//STEP09   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F945.SOC.DAILY.MATCH,DISP=SHR                      
//SORTOUT  DD  DSN=BP13.AB02.F945.REJECT,DISP=SHR                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(40,8,A,2,9,A),FORMAT=CH                                        
    INCLUDE COND=(101,1,CH,EQ,C'3')                                             
//*--------------------------------------------------------------------         
//* STEP10 BACKUP FULL AMNT RECOVERD CASES TO ACCUM                             
//*---------------------------------------------------------------------        
//STEP10   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F945.FULL.RECVED,DISP=SHR                          
//SORTOUT  DD  DSN=BP13.AB02.F945.FULL.RECVED.ACCUM,DISP=MOD                    
//SYSIN    DD  *                                                                
        SORT FIELDS=(40,8,A,2,9,A),FORMAT=CH                                    
//*--------------------------------------------------------------------         
//* STEP11 BACKUP PARTIAL RECOVERD CASES TO ACCUM                               
//*---------------------------------------------------------------------        
//STEP11   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F945.PARTL.RECVED,DISP=SHR                         
//SORTOUT  DD  DSN=BP13.AB02.F945.PARTL.RECVED.ACCUM,DISP=MOD                   
//SYSIN    DD  *                                                                
        SORT FIELDS=(40,8,A,2,9,A),FORMAT=CH                                    
//*--------------------------------------------------------------------         
//* STEP12 BACKUP NO MONIES RECOVERD CASES TO ACCUM                             
//*---------------------------------------------------------------------        
//STEP12   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F945.REJECT,DISP=SHR                               
//SORTOUT  DD  DSN=BP13.AB02.F945.REJECT.ACCUM,DISP=MOD                         
//SYSIN    DD  *                                                                
        SORT FIELDS=(40,8,A,2,9,A),FORMAT=CH                                    
//*-----------------------------------------------------------------            
//* EMPTY AB02 FILE                                                   *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AB02.F945.SOC,DISP=OLD                                        
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*                                                                             
