//BP13REV8 JOB (BP13P),'BP13Q502',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//      NOTIFY=CSD0071                                                  00020000
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030000
//*=================================================================            
//* RECOVERY JOB FOR BP13Q502 IF JOB ABENDED, DEFINE THE FILE FROM              
//* BACKUP TAPE                                                                 
//*BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                  
//*-----------------------------------------------------------------            
//*   SORT BP13K800 BY REGN                                                     
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F810.WAITHIST.QTR(0),DISP=OLD                            
//SORTOUT  DD DSN=&&F810SORT,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(200,20),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,23,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//* DEFINE BPO13K810                                                            
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&F810SORT,DISP=(OLD,PASS)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL 'BP13.K810.WAITHIST' CL PURGE                                      
         DEF CL (NAME(BP13.K810.WAITHIST)              -                        
                 CYL(220 20)                             -                      
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K810.WAITHIST.DATA)        -                        
                 KEYS(23 0)                            -                        
                 RECSZ(400 400)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K810.WAITHIST)                                        
