//BP13DP09 JOB (BP13P),'BTO BKUP',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//        NOTIFY=CSD0071                                                        
//JOBLIB DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                     
//*===================================================================          
//* HOUSEKEEP ALL FILES WHEN NEW EXERCISE START                                 
//* NOTES: THIS IS ONLY APPLICABLE FOR BTO/SBF EXERCISE                         
//*===================================================================          
//* CHG REF   BY   DATE    DESCRIPTION                                          
//* -------- ---- -------- ----------                                           
//* BP133625 YCH2 07072012 NEW JOB TO HOUSEKEEP BTO/SBF EXERCISE                
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DELETE DEFINE FILES                                
//*--------------------------------------------------------------------         
//STEP010  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K76R.COUPON.REGN,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          IF LASTCC=12 THEN                                                     
             DO                                                                 
                SET MAXCC=0                                                     
                VFY FILE(INPUT1)                                                
             END                                                                
//*-----------------------------------------------------------------            
//*====================  ((( BACKUP FILES  )))  ====================            
//*-----------------------------------------------------------------            
//STEP020  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.FTP.CASHCARD.ACCUM,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.FTP.CASHCARD.BKUP(+1),DISP=(NEW,CATLG),                  
//         SPACE=(CYL,(20,20),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                               
//*                                                                             
//INPUT2   DD DSN=BP13.K76R.COUPON.REGN,DISP=SHR                                
//OUTPUT2  DD DSN=BP13.F76R.COUPON.BKUP(+1),DISP=(NEW,CATLG),                   
//         SPACE=(CYL,(50,10),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                               
//*                                                                             
//INPUT3   DD DSN=BP13.AC28F589.ACCUM,DISP=SHR                                  
//OUTPUT3  DD DSN=BP13.AC28F589.SOC.BKUP(+1),DISP=(NEW,CATLG),                  
//         SPACE=(CYL,(50,10),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                               
//*                                                                             
//INPUT4   DD DSN=BP13.FTP.CREDCARD.ACCUM,DISP=SHR                              
//OUTPUT4  DD DSN=BP13.FTP.CREDCARD.BKUP(+1),DISP=(NEW,CATLG),                  
//         SPACE=(CYL,(50,10),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                               
//*                                                                             
//INPUT5   DD DSN=BP13.AC28F590.ACCUM,DISP=SHR                                  
//OUTPUT5  DD DSN=BP13.AC28F590.SOC.BKUP(+1),DISP=(NEW,CATLG),                  
//         SPACE=(CYL,(30,10),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)                               
//*                                                                             
//INPUT6   DD DSN=BP13.AC28F588.ACCUM,DISP=SHR                                  
//OUTPUT6  DD DSN=BP13.AC28F588.ACCUM.BKUP(+1),DISP=(NEW,CATLG),                
//         SPACE=(CYL,(50,40),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                               
//*                                                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
//*---------------------------------------------------------------------        
//*      DELETE DEFINE COUPON FILES                                             
//*--------------------------------------------------------------------         
//STEP030  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.BLANK.CHAR100,DISP=SHR                                   
//SYSIN    DD *                                                                 
         DEL (BP13.K76R.COUPON.REGN) CL PURGE                                   
         DEF CL (NAME(BP13.K76R.COUPON.REGN) -                                  
                 CYL(50 30)                      -                              
                 UNIQUE                          -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K76R.COUPON.REGN.DATA) -                            
                 KEYS(8 0)                       -                              
                 RECSZ(100 100)                -                                
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K76R.COUPON.REGN)                                     
//*-----------------------------------------------------------------            
//*====================  ((( INITIALIZE    )))  ====================            
//*-----------------------------------------------------------------            
//STEP040  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.FTP.CASHCARD.ACCUM,DISP=OLD                              
//OUTPUT2  DD DSN=BP13.FTP.CREDCARD.ACCUM,DISP=OLD                              
//OUTPUT3  DD DSN=BP13.FTP.CASHCARD.CURR,DISP=OLD                               
//OUTPUT4  DD DSN=BP13.FTP.CREDCARD.CURR,DISP=OLD                               
//OUTPUT5  DD DSN=BP13.AC28F589.ACCUM,DISP=OLD                                  
//OUTPUT6  DD DSN=BP13.AC28F589.CURR,DISP=OLD                                   
//OUTPUT7  DD DSN=BP13.AC28F590.ACCUM,DISP=OLD                                  
//OUTPUT8  DD DSN=BP13.AC28F590.CURR,DISP=OLD                                   
//OUTPUT9  DD DSN=BP13.AC28F588.ACCUM,DISP=OLD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT6)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT7)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT8)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT9)                                       
//*--------------------------------------------------------------------         
//*-----------------------------------------------------------------            
//*====================  ((( INITIALIZE    )))  ====================            
//*-----------------------------------------------------------------            
//PS900    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AC28.F589.SOC,DISP=OLD                                        
//OUTPUT2  DD DSN=AC28.F590.SOC,DISP=OLD                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                       
