//BP13M027  JOB (BP13P),'BP13M027',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* CHG-NO   BY   ON        DESCRIPTION                                         
//* -------- ---  -------   -----------                                         
//* BP132387 CKK 17112003   NEW JOB TO DELETE 'C2' CASES                        
//* BP132627 GAN 10112004   CHG F800.APPLN.KEYISSUE TO BP13K893                 
//*                         CHG F820.OCCUP.KEYISSUE TO BP13K895                 
//* BP132693 CG7 25052005   REMOVED BP13K893 AND BP13K895                       
//* BP138026 IL5 01112019   STOP PRINTING BP13L156                              
//*=================================================================            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : CLASS = 2                                                          
//*-----------------------------------------------------------------            
//*PRT01    EXEC PGM=IEBGENER                                                   
//*SYSUT1   DD *                                                                
//*$DJDE$ JDE=BP13D,JDL=BP13,END;                                               
//*FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1A                                  
//*SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                       
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*--------------------------------------------------------------------*        
//*  SORT OUT CASES FROM BP13K800 THAT                                          
//*  (I)  CANCELLED                                                             
//*  (II) CANCEL REASON = 'C2'                                                  
//*--------------------------------------------------------------------*        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&F800,DISP=(NEW,PASS),                                       
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=2000),                                          
//          SPACE=(CYL,(20,10),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,EQ,C'C',AND,                                            
                 193,2,CH,EQ,C'C2')                                             
//*                                                                             
//*--------------------------------------------------------------------*        
//*  DELETE 'C2' CASES FROM                                                     
//*  BP13K800, BP13K820, BP13K830, BP13K840 AND BM06K950                        
//*--------------------------------------------------------------------*        
//STEP1    EXEC PGM=BP13C156,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800,DISP=(OLD,PASS)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K950 DD DSN=BM06.K950.FIS.HISTORY,DISP=SHR,                               
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13L156 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
