//BP13D516 JOB (BP13P),'BP13D516',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//*  FOR MATURE ESTATE BALLOTING EXERCISE                             *         
//*  TO UPDATE DEMAND/SUPPLY                                          *         
//*                                                                   *         
//*===================================================================*         
//* CHG REF  BY  ON       DESCRIPTION                                 *         
//* -------- --- -------- -----------                                 *         
//* BP131064 CLT 191201   OTB                                         *         
//* BP131064 CLT 100102   INCLUDE ALL CASES                           *         
//* BP132438 CKK 111103   INCLUDE CANCELLED COUNTER CASE              *         
//* BP132599 CLT 240904   CHANGE JOB TO BE SIMILAR TO BTO EXERCISE    *         
//* BP132659 CLT 280105   UPDATE APPLICATION DATES                    *         
//* BP132728 CLT 280705   UPDATE APPLICATION DATES FOR AUG BE         *         
//* BP132809 CLT 020206   SEND MSG WHEN JOB COMPLETES                 *         
//* BP133001 CLT 150207   FEB 07 BE                                   *         
//* BP133102 CLT 110707   JUL 07 BE                                   *         
//* BP133237 CLT 070108   JAN 08 BE                                   *         
//* BP133435 CCC 200809   SEP 08 BE                                   *         
//* BP133715 CCC 200909   SEP 09 SBF, INCLUDE CANCELLED CASES.        *         
//* BP133715 CCC 200909   SEP 09 SBF -> LAUNCH DATE POSTPONED TO OCT. *         
//* BP133984 CCC 201008   OCT 10 SBF                                  *         
//* BP134316 CCC 201109   SEP 11 SBF                                  *         
//* BP134481 CCC 201203   MAR 12 SBF -> CATER FOR 1ST/2ND-TIMER RATE  *         
//* BP135144 KAM 201311   NOV    SBF -> ADDED STEP TO UPDT BP13K76F   *         
//* BP135543 CCC 201411   NOV 14 SBF -> ADDED STEP TO UPDATE F762     *         
//*                                  -> FOR UPLOAD TO DATA ANALYTICS  *         
//* BP135748 IL5 201503   MAY 15 SBF -> OMIT 1B RECORDS IN BP13F762   *         
//* BP136140 IL5 201602   FEB 16 BTO -> CHANGE STEP08 DISP TO MOD FOR *         
//*                                     BP13.F762.BTO.DEMAND          *         
//* BP136239 IL5 201602   MAY 16 BTO -> MOVE                          *         
//*                                     BP13.FF02.SUPPLY.DEMAND.SBF   *         
//* BP138215 AM2 230320   UPDATE OUTREC FOR BP13K769                  *         
//* BP139207 PP11160622   AUTO OPENING FILES.                         *         
//*===================================================================*         
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD  DSN=BP13.K769.BE.DEMAND,DISP=OLD                                 
//INPUT2   DD  DSN=BP13.K76F.DEMAND.LIMIT,DISP=OLD                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*-------------------------------------------------------------------* 00001330
//* TO UPDATE DEMAND / SUPPLY OF BTO EXERCISE                          *        
//*--------------------------------------------------------------------*        
//STEP03 EXEC  PGM=BP13C73A,COND=(0,NE)                                         
//BP13FF01 DD  DSN=BP13.FF01.SALES.DEMAND,DISP=SHR                              
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K762 DD  DSN=BP13.K769.BE.DEMAND,DISP=OLD,                                
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13L730 DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------*00000850
//*--------------------------------------------------------------------         
//* TO EXTRACT DEMAND FOR 1B ROOM TYPE (SA WITH 45 SQM)                         
//*--------------------------------------------------------------------         
//STEP04  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K769.BE.DEMAND,DISP=SHR                                   
//SORTOUT DD DSN=&&BP13K762,                                                    
//           DISP=(,PASS),                                                      
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(5,5),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                                 
//SORTWK01 DD UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=(4,2,CH,EQ,C'1A')                                                
  OUTREC FIELDS=(1,3,C'1B',6,16,C'00000000000000',36,165)                       
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*   TO UPDATE 1B SA WITH THE SAME DEMAND AS 1A SA                             
//*--------------------------------------------------------------------         
//STEP05  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&BP13K762,DISP=(OLD,PASS)                                   
//OUTPUT1   DD DSN=BP13.K769.BE.DEMAND,DISP=OLD                                 
//SYSIN     DD *                                                                
  REPRO INFILE(INPUT1) OUTFILE(OUTPUT1) REPLACE                                 
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT FILE FOR BP13C76F INPUT                                                
//*---------------------------------------------------------------------        
//STEP06  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K76F.DEMAND.LIMIT,DISP=SHR                                
//SORTOUT DD DSN=&&BP13K76F,                                                    
//           DISP=(,PASS),                                                      
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(5,5),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                 
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,14,A),FORMAT=CH                                               
/*                                                                              
//*-------------------------------------------------------------------* 00001330
//* TO UPDATE DEMAND / SUPPLY OF SBF EXERCISE                          *        
//*--------------------------------------------------------------------*        
//STEP07 EXEC  PGM=BP13C76F,COND=(0,NE)                                         
//BP13F76F DD  DSN=&&BP13K76F,DISP=(OLD,PASS)                                   
//BP13K769 DD  DSN=BP13.K769.BE.DEMAND,DISP=SHR,                                
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K76F DD  DSN=BP13.K76F.DEMAND.LIMIT,DISP=SHR                              
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* SORT K769 TO SEQUENTIAL FILE                                      *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K769.BE.DEMAND,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F762.BTO.DEMAND,DISP=MOD                                 
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,14,A),FORMAT=CH                                               
   OMIT COND=(4,2,CH,EQ,C'1B')                                                  
//*-------------------------------------------------------------------*         
//* DELETE FILE BP13.F762.SALES.DEMAND                                          
//*-------------------------------------------------------------------*         
//STEP09A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FF02.SUPPLY.DEMAND.SBF')                                        
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*  GENERATE BP13.FF02.SUPPLY.DEMAND.SBF FOR USER DOWNLOAD                     
//*--------------------------------------------------------------------         
//STEP09B EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K769.BE.DEMAND,DISP=SHR                                   
//SORTOUT DD DSN=BP13.FF02.SUPPLY.DEMAND.SBF,DISP=(NEW,CATLG),                  
//           SPACE=(CYL,(2,1),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                  
//SYSOUT  DD SYSOUT=*                                                           
//SYSIN   DD *                                                                  
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  OUTREC FIELDS=(1,3,C';',4,2,C';',6,5,C';',11,4,C';',75,4,C';',                
                45,4,C';',36,5,C';',79,4,C';',53,4,C';',49,4,C';',              
                83,4,C';',71,4,C';',67,4,C';',16X)                              
//*-------------------------------------------------------------------*         
//* AUTO-OPEN FILES                                                   *         
//*-------------------------------------------------------------------*         
//STEP09Z  EXEC PGM=IKJEFT01,PARM='OPNFILE',COND=(0,NE)                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//GETJOBNW DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*--------------------------------------------------------------------         
//STEP10   EXEC WTOG,COND=(0,NE)                                                
   ---->  BP13D516 COMPLETED, PLS CHK BP13K769, BP13K76F IS AUTO-OPEN.          
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
