//BP13D108  JOB (BP13P),'BP13D108',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071,SCHENV=PKZIP                             
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*==================================================================           
//* THIS JOB IS RUN AT 8:00 AM AFTER SY02F001 HAS REFECT TODAY DATE             
//* BP13MC79 - COMPARE DUE-DATE WITH SY02 TODAY DATE                            
//* BP13CC89 - COMPARE UDPATED WITH SY02 PREVIOUS DAY DATE                      
//*==================================================================           
//*                                                                             
//* NOTE: IF SENDMAIL STEP NO CHANGES, PLS UPDATE RUNSHEET                      
//*                                                                             
//*==================================================================           
//* CHG REF  DATE     BY   DESC                                                 
//* -------- -------- ---- -----                                                
//* BP133175 20080109 ED1  INCLUDE BP13CC89                                     
//* BP133242 20080116 SSS2 RE-ARRANGE STEP                                      
//* BP133250 20080505 ED1  ADD BP13KD30 FOR BP13CC79                            
//* BP133350 20080606 LSB  ADD REMARK TO THIS JOB                               
//* BP133360 20080613 ED1  SORT FD10 FOR BP13CC79 BY PROJECT & REGN             
//* BP133489 20090319 JB8  TO PRINT IBG IN CC79                                 
//* BP133573 20090525 JB8  SORT FD10 FOR BP13CC79 BY PROJECT & TRANS            
//*                        TYPE & PAYMENT MODE & REGN                           
//* BP133398 20090518 JB8  EXPAND KD10 LENGTH FR 450 TO 1400                    
//* BP133682 20090918 JB8  SORT BY PP BEFORE REGN IN STEP01                     
//* BP134154 20110429 LSB  USE BP13.FD10.VOUCHOIC.ACCUMIBG                      
//* BP134269 20120622 LJL  EMAIL ALERT FOR PP CHANGE                            
//* BP134573 20120723 IMC  INCLUDE ONLY DBSS CASES IN BP13CD91                  
//* BP135197 20140114 NST  TO RELOCATE RESALES CASE REPORT FROM                 
//*                        BP13D305 TO BP13D108 UNDER STEP 18                   
//*                        (PROGRAM - BP13C38C)                                 
//* BP135171 20140210 RJE1 TO CATER FOR DB2 UPGRADE                             
//* BP135181 20140526 PCL4 TO CATER FOR BCP REPORT AND ADD BP13C38I             
//*                        (MOVED FROM BP13D401)                                
//* BP135195 ESD1 270214 - CATER FOR ADDITIONAL ALERT FOR CD85        *         
//* BP135384 PCL4 210814 - ADD P04K010/BP13K820 ON BP13C38C FOR CG DEB*         
//* BP135880 PCL4 180216 - CATER FOR BP13C38S FOR RSL EXCEPTION REPORT*         
//* BP136797 KVL1 050717 - ADDED STEPS 20 AND 21 FOR LATE COMPLETION  *         
//*                        INTEREST                                   *         
//* BP136986 KVL1 201017 - ADDED STEPS 24-25 TO CREATE INTRAY FOR TEMP*         
//*                        LOAN THAT HAS BEEN KEY ISSUED.             *         
//* BP137090 20171205 LJL  TO RELOCATE RESALES CASE REPORT FROM                 
//*                        BP13D108 TO BP13D419.                                
//*                        (PROGRAM - BP13C38C)                                 
//* BP137354 20180731 ESA1 TO COMMENT OUT STEPE6 TO STEPE14 UNTIL               
//*                        FURTHER INSTRUCTION                                  
//* BP137701 20190301 ZS13 REMOVED CHECKING OF DATE ON STEP20                   
//* BP137701 20190302 LJL1 CHANGE FROM GE,DATE2P-3 to GE,DATE2P-5               
//*                                    LE,DATE2P-2    LE,DATE2P-4               
//* BP137701 20190302 LJL1 CHANGE FROM GE,DATE2P-3 to GE,DATE2P-5               
//* BP137765 20200806 LJL1 CHANGE FROM DATE1P   to DATE1P-2                     
//* BP138427 20200830 LJL1 TO CREATE INTRAY TO CRM POINTING TO                  
//*                        RESALE PORTAL FOR APPROVED AND KEY-ISSUED            
//* BP139363 20221020 LJL1 TO REMOVE DBSS STEPS                                 
//*==================================================================           
//* DAILY JOB DBSS FLAT SEND EMAIL ON CHEQUE DUE                                
//*---------------------------------------------------------------------        
//* SORT BP13K454 - RSL ELIGIBLE = 'Y'                                          
//*---------------------------------------------------------------------        
//STEP18C  EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F455,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=100)                                             
//SYSIN    DD *                                                                 
       SORT FIELDS=(1,22,A),FORMAT=CH                                           
       INCLUDE COND=(53,1,CH,EQ,C'Y')                                           
//*--------------------------------------------------------------------         
//* BP13C38S - PRINT EXCEPTION REPORT FOR RESALE CODES                          
//*--------------------------------------------------------------------         
//STEP18D  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F454 DD  DSN=&&BP13F455,DISP=(OLD,PASS)                                   
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                                     
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR                                     
//AB03K080 DD  DSN=AB03.K080.UINACC,DISP=SHR                                    
//AB03K030 DD  DSN=AB03.K030.SALEMAST,DISP=SHR                                  
//BP13L38S DD  DSN=BP13.L38S.BP13L38S,DISP=SHR                                  
//MAILC38S DD  DSN=BP13.MAILRPT.BP13L38S,DISP=SHR                               
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C38S) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//*---------------------------------------------------------------------        
//* SORT BP13K454 (MOVED FROM BP13D401)                                         
//*---------------------------------------------------------------------        
//STEP19A  EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F454,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),                                   
//         DCB=(RECFM=FB,LRECL=100)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,22,A),FORMAT=CH                                               
   INCLUDE COND=(1,8,CH,NE,C'        ',AND,                                     
                 1,8,CH,NE,C'00000000')                                         
//*--------------------------------------------------------------------         
//* BP13C38I - DETAILS OF THE TRANSACTION CASES (BCP USE)                       
//*--------------------------------------------------------------------         
//STEP19B  EXEC PGM=BP13C38I,COND=(4,LT)                                        
//BP13F454 DD  DSN=&&BP13F454,DISP=(OLD,PASS)                                   
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR                                     
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                                     
//BP13K857 DD  DSN=BP13.K857.EMAIL,DISP=SHR                                     
//BP13K480 DD  DSN=BP13.K480.CONTRA,DISP=SHR                                    
//BP13L38I DD  DSN=BP13.L38I.BP13L38I,DISP=SHR                                  
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*****************************************************************             
//*         AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*****************************************************************             
//STEP19C  EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD DSN=&&P13MHDG,DISP=(NEW,PASS),                                    
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=205,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*                                                                             
//*---------------------------------------------------------------------        
//STEP19D  EXEC SAS,COND=(4,LT),OPTIONS='MACRO'                                 
//SYSOUT   DD SYSOUT=*                                                          
//MAILNAME DD DSN=&&MAILNAME,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                        00080000
//            DCB=(RECFM=VB,LRECL=205)                                  00090001
//MAILRCPT DD DSN=&&MAILRCPT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                        00080000
//            DCB=(RECFM=VB,LRECL=205)                                  00090001
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
    FILE MAILNAME;                                                              
    PUT @01 '           FILENAME="BP13L38I.TXT"';                               
    PUT @01 ' ';                                                                
  RUN;                                                                          
//         DD DSN=BP13.MAIL.BP13L38I,DISP=SHR                                   
//         DD *                                                                 
    PUT @01 'SUBJECT : DETAILS OF THE TRANSACTION - BCP USE';                   
//*---------------------------------------------------------------------        
//STEP19E  EXEC PGM=IEBGENER,COND=(4,LT)                                        
//SYSUT1   DD DSN=*.STEP19C.SMTPHDR,DISP=(OLD,DELETE)                           
//         DD DSN=&&MAILRCPT,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&MAILNAME,DISP=(OLD,DELETE)                                  
//         DD *                                                                 
//         DD DSN=BP13.L38I.BP13L38I,DISP=SHR                                   
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILRPT.BP13L38I,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*  DETAILS OF THE TRANSACTION CASES (BCP USE)                       *         
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//STEP19F  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L38I,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*  EXCEPTION REPORT FOR RSL STATUS                                  *         
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//STEP19G  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L38S,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//* EXTRACT FROM BP13K800                                             *         
//* K800-DTE-TP-ORIG = > 20190101                                               
//* old - CURRENT DATE - K800-DTE-TP-ORIG = > 2 MONTHS                          
//*-------------------------------------------------------------------*         
//STEP20   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(30,08,A),FORMAT=CH                                               
  INCLUDE COND=((924,03,CH,NE,C'SER',AND,                                       
                1148,01,CH,NE,C'Y'),AND,                                        
                (1849,06,ZD,GE,DATE2P-5,AND,                                    
                 1849,06,ZD,LE,DATE2P-4))                                       
/*                                                                              
//*-------------------------------------------------------------------*         
//* CREATE INTRAY RECORD FOR LATE COMPLETION INTEREST                 * 11      
//*-------------------------------------------------------------------*         
//STEP21   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K365 DD DSN=BP13.K365.LATE.COMPL,DISP=SHR                                 
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BB24K110 DD DSN=BB24.K110.UIN,DISP=SHR                                        
//BB24K010 DD DSN=BB24.K010.MASTER,DISP=SHR                                     
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR                                   
//BP13L983 DD DSN=BP13.L983.LATECOMP,DISP=SHR                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C983) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* BP13C982 - GENERATE SUMMARY LIST OF CASES SENT TO OIC VIA INTRAY            
//*            DUE TO LATE COMPLETION INTEREST                                  
//*--------------------------------------------------------------------         
//STEP22   EXEC PGM=BP13C982,COND=(4,LT)                                        
//BP13F983 DD  DSN=BP13.L983.LATECOMP,DISP=SHR                                  
//BP13L982 DD  DSN=BP13.L982.LATECOMP,DISP=SHR                                  
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------         
//* SENDMAIL LATE COMPLETION INTEREST                                           
//*--------------------------------------------------------------------         
//STEP23   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L982.LATECOMP,DISP=SHR                                   
/*                                                                              
//*****************************************************************             
//*  EXTRACT TEMP LOAN/CONTRA CASES approved   FOR TODAY                        
//*****************************************************************             
//STEP24A  EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.K48K.TLCONTRA.REQ,DISP=SHR                               
//SORTOUT  DD DSN=&&F48KA,DISP=(,PASS),                                         
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=1200,BLKSIZE=27600)                           
//SYSIN    DD *                                                                 
  SORT   FIELDS=COPY                                                            
  INCLUDE COND=(180,01,CH,EQ,C'A',AND,                                          
                164,08,ZD,EQ,DATE1P-2)                                          
/*                                                                              
//*****************************************************************             
//*  CREATE INTRAY RECORD FOR TEMP LOAN/CONTRA CASES APPROVED   FOR             
//*  TODAY                                                                      
//*****************************************************************             
//STEP25A  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BP13F48K DD DSN=&&F48KA,DISP=(OLD,DELETE)                                     
//BB24K010 DD DSN=BB24.K010.MASTER,DISP=SHR                                     
//BB24K050 DD DSN=BB24.K050.USERID,DISP=SHR                                     
//BB24K051 DD DSN=BB24.K050.USERID.PATH1,DISP=SHR                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C94I) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*****************************************************************             
//*  EXTRACT TEMP LOAN/CONTRA CASES KEY ISSUED FOR TODAY                        
//*****************************************************************             
//STEP24   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.K48K.TLCONTRA.REQ,DISP=SHR                               
//SORTOUT  DD DSN=&&F48K,DISP=(,PASS),                                          
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=1200,BLKSIZE=27600)                           
//SYSIN    DD *                                                                 
  SORT   FIELDS=COPY                                                            
  INCLUDE COND=(180,01,CH,EQ,C'A',AND,                                          
                553,08,ZD,EQ,DATE1P-2)                                          
/*                                                                              
//*****************************************************************             
//*  CREATE INTRAY RECORD FOR TEMP LOAN/CONTRA CASES KEY ISSUED FOR             
//*  TODAY                                                                      
//*****************************************************************             
//STEP25   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BP13F48K DD DSN=&&F48K,DISP=(OLD,DELETE)                                      
//BB24K010 DD DSN=BB24.K010.MASTER,DISP=SHR                                     
//BB24K050 DD DSN=BB24.K050.USERID,DISP=SHR                                     
//BB24K051 DD DSN=BB24.K050.USERID.PATH1,DISP=SHR                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C94I) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT DATA TO FLATFILE FOR SERS REPORTING                                    
//*---------------------------------------------------------------------        
//STEPE1   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.KQ00.REGN.APPT,DISP=SHR                                  
//SORTOUT  DD DSN=&&P13FQ00,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                 
//         SPACE=(CYL,(1,1),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(48,4,A,47,1,A),FORMAT=CH                                        
   INCLUDE COND=(1,3,CH,EQ,C'SER',AND,                                          
                 24,6,CH,EQ,C'201802',AND,                                      
                 30,2,CH,NE,C'RF')                                              
//*---------------------------------------------------------------------        
//STEPE2   EXEC SORT,COND=(4,LT)                                                
//SORTJNF1 DD DSN=&&P13FQ00,                                                    
//            DISP=(OLD,DELETE)                                                 
//SORTJNF2 DD DSN=BP13.L290.SERSADDR,                                           
//            DISP=SHR                                                          
//SORTOUT  DD DSN=BP13.L290.SERSRPT,                                            
//            DISP=OLD                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   JOINKEYS FILES=F1,FIELDS=(90,8,A)                                            
   JOINKEYS FILES=F2,FIELDS=(1,8,A)                                             
   REFORMAT FIELDS=(F2:9,3,12,7,1,8,F1:39,8,98,4,47,5)                          
//*---------------------------------------------------------------------        
//STEPE3   EXEC SORT,COND=(4,LT)                                                
//SORTJNF1 DD DSN=BP13.L290.SERSRPT,                                            
//            DISP=SHR                                                          
//SORTJNF2 DD DSN=BP13.KL00.LETTER,                                             
//            DISP=SHR                                                          
//SORTOUT  DD DSN=BP13.L290.SERSRPT,                                            
//            DISP=OLD                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   JOINKEYS FILES=F1,FIELDS=(11,8,A)                                            
   JOINKEYS FILES=F2,FIELDS=(1,8,A)                                             
   REFORMAT FIELDS=(F1:1,35,F2:150,9,52,12,9,10)                                
   INCLUDE COND=(57,10,CH,EQ,C'BK   EINV ')                                     
//*---------------------------------------------------------------------        
//STEPE4  EXEC SORT,COND=(4,LT)                                                 
//SORTIN   DD DSN=BP13.L290.SERSRPT,DISP=OLD                                    
//SORTOUT  DD DSN=BP13.L290.SERSRPT,DISP=OLD                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   OUTREC FIELDS=(1,3,C';',4,7,C';',11,8,C';',                                  
                  25,2,C'/',23,2,C'/',19,4,C';',                                
                  27,4,C';',31,5,C';',36,9,C';',                                
                  51,2,C'/',49,2,C'/',45,4,C';',                                
                  53,4,C';')                                                    
//*---------------------------------------------------------------------        
//STEPE5  EXEC SORT,COND=(4,LT)                                                 
//SORTIN   DD DSN=BP13.L290.SERSRPT,DISP=OLD                                    
//SORTOUT  DD DSN=BP13.L290.SERSRPT,DISP=OLD                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   INREC IFTHEN=(WHEN=(56,4,CH,EQ,C'/  /'),OVERLAY=(56:C'    '))                
//*-----------------------------------------------------------------            
//*   DELETE ZIP FILE BEFORE PROCESSING                                         
//*-----------------------------------------------------------------            
//*STEPE6    EXEC  PGM=IDCAMS,COND=(4,LT)                                       
//*SYSPRINT  DD  SYSOUT=*                                                       
//*SYSIN     DD *                                                               
//*  DEL (BP13.BP13L290.ZIP)                                                    
//*  IF MAXCC < 12 THEN                                                         
//*     SET MAXCC = 0                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//*         AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*-----------------------------------------------------------------            
//*STEPE7   EXEC PGM=IRXJCL,PARM='SMTPHDR'                                      
//*SYSTSPRT DD  SYSOUT=*                                                        
//*SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                  
//*SMTPHDR  DD  DSN=&&P13HDG1,DISP=(NEW,PASS),                                  
//*         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=200,RECFM=VB)                 
//*SYSTSIN  DD  DUMMY                                                           
//*                                                                             
//*--------------------------------------------------------------------*        
//*          ZIP THE REPORT FILE                                                
//*--------------------------------------------------------------------*        
//*STEPE8    EXEC PKZIP,COND=(4,LT)                                             
//*-ARCHIVE(BP13.BP13L290.ZIP)                                                  
//*-UPDATE                                                                      
//*-ARCHVOL(DUMMY)                                                              
//*-METHOD(FAST)                                                                
//*-ZIPPED_DSN(BP13.L290.SERSRPT,BP13L290.TXT)                                  
//*-FILE_TERMINATOR()                                                           
//* BP13.L290.SERSRPT                                                           
//*-----------------------------------------------------------------            
//*          CREATE EMAIL RECIPIENT AND SUBJECT                                 
//*-----------------------------------------------------------------            
//*STEPE9    EXEC SAS,OPTIONS='MACRO'                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*BP13RCPT DD DSN=&&BP13RCPT,DISP=(NEW,PASS),                                  
//*         LRECL=200,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                     
//*         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                              
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD *                                                                
//* DATA _NULL_;                                                                
//*     FILE BP13RCPT;                                                          
//*     PUT @01 'RCPT TO:<TEEU_HUI@HDB.GOV.SG>';                                
//*     PUT @01 'DATA                                    ';                     
//*     PUT @01 'FROM:SOC SYSTEM - EMAIL ALERT           ';                     
//*     PUT @01 'TO:TEEU_Hui@hdb.gov.sg                  ';                     
//*     PUT @01 'SUBJECT: Daily report for SERS EINV     '                      
//*         @42 '                                        ';                     
//*-----------------------------------------------------------------            
//*          SPECIFY ATTACHMENT FILE NAME                                       
//*-----------------------------------------------------------------            
//*STEPE10   EXEC SAS,OPTIONS='MACRO'                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*BP13NAME DD DSN=&&BP13NAME,DISP=(NEW,PASS),                                  
//*         LRECL=200,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                     
//*         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                              
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD *                                                                
//*   DATA _NULL_;                                                              
//*     FILE BP13NAME;                                                          
//*     PUT @01 '           NAME="BP13L290.ZIP"';                               
//*****************************************************************             
//*          ENCODE A ZIP DATASET INTO BASE64 FORMAT                            
//*****************************************************************             
//*STEPE11  EXEC ENCODE,COND=(4,LT)                                             
//*ENCODOUT DD DSN=&&BASE64,DISP=(,PASS),                                       
//*            SPACE=(5,(10,10),RLSE),AVGREC=M                                  
//*ENCODIN  DD DSN=BP13.BP13L290.ZIP,DISP=SHR                                   
//*                                                                             
//*****************************************************************             
//*          CONVERT OUTPUT TO VARIABLE-BLOCKED (VB)                            
//*****************************************************************             
//*STEPE12  EXEC SORT,COND=(4,LT)                                               
//*SORTIN   DD DSN=&&BASE64,DISP=(SHR,DELETE)                                   
//*FBVB     DD DSN=&&VB64,DISP=(,PASS),                                         
//*           SPACE=(TRK,(10,5),RLSE),                                          
//*           DCB=(DSORG=PS,LRECL=200,RECFM=VB)                                 
//*SYSIN    DD *                                                                
//*MERGE FIELDS=COPY                                                            
//*OUTFIL FNAMES=FBVB,FTOV,VLTRIM=X'40'                                         
//*                                                                             
//*-----------------------------------------------------------------            
//*          CREATE EMAIL FOR FIRST ATTACHMENT                                  
//*-----------------------------------------------------------------            
//*STEPE13  EXEC PGM=IEBGENER,COND=(4,LT)                                       
//*SYSUT1   DD DSN=*.STEPE7.SMTPHDR,DISP=(SHR,PASS)                             
//*         DD DSN=&&BP13RCPT,DISP=(OLD,PASS)                                   
//*         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                       
//*         DD DSN=AV05.MIME.HEADERS.VB(APPLHDR),DISP=SHR                       
//*         DD DSN=&&BP13NAME,DISP=(SHR,DELETE)                                 
//*         DD DSN=&&VB64,DISP=(SHR,DELETE)                                     
//*SYSUT2   DD DSN=BP13.MAILOUT.BP13L290.SERSRPT,DISP=SHR,                      
//*         LRECL=200,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                     
//*         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                              
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*-----------------------------------------------------------------            
//*    SEND EMAIL                                                               
//*-----------------------------------------------------------------            
//*STEPE14  EXEC SENDMAIL,COND=(4,LT)                                           
//*INPUT    DD DSN=BP13.MAILOUT.BP13L290.SERSRPT,DISP=SHR                       
//*                                                                             
//*---------------------------------------------------------------------05360006
//* SORT BP13FQ10 TO INCLUDE FQ10-CDE-NOTIFICATION-PRINTED = 'Y'        05370006
//*---------------------------------------------------------------------05380006
//STEPF1  EXEC SORT,COND=(4,LT)                                         05390006
//SORTIN  DD DSN=BP13.KQ10.DOC.TBL,DISP=SHR                             05400006
//SORTOUT DD DSN=&&BP13FQ10,                                            05420006
//           DISP=(NEW,PASS),                                           05430006
//           UNIT=(SYSDA,1),                                            05440006
//           SPACE=(CYL,(10,5),RLSE),                                   05450006
//           DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                         05460006
//SYSIN     DD  *                                                       05470006
   SORT FIELDS=(1,8,A),FORMAT=CH                                        05480006
   INCLUDE COND=(310,1,CH,EQ,C'Y')                                              
//*---------------------------------------------------------------------05360006
//*  PRINT REPORT OF CANCELLED CASES BEFORE SENDING NOTIFICATION                
//*---------------------------------------------------------------------05360006
//STEPF2   EXEC PGM=BP13C25O,COND=(4,LT)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13FQ10 DD DSN=&&BP13FQ10,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                    
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                              
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                            
//BP13L25O DD DSN=BP13.L25O.NOTIF.RPT,DISP=SHR                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                     05790006
//*-----------------------------------------------------------------            
//*   DELETE ZIP FILE BEFORE PROCESSING                                         
//*-----------------------------------------------------------------            
//STEPF3    EXEC  PGM=IDCAMS,COND=(4,LT)                                        
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD *                                                                
     DEL (BP13.BP13L25O.ZIP)                                                    
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//*         AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*-----------------------------------------------------------------            
//STEPF4   EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD  DSN=&&P13HDG1,DISP=(NEW,PASS),                                   
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=200,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*                                                                             
//*--------------------------------------------------------------------*        
//*          ZIP THE REPORT FILE                                                
//*--------------------------------------------------------------------*        
//STEPF5    EXEC PKZIP,COND=(4,LT)                                              
-ARCHIVE(BP13.BP13L25O.ZIP)                                                     
-UPDATE                                                                         
-ARCHVOL(DUMMY)                                                                 
-METHOD(FAST)                                                                   
-ZIPPED_DSN(BP13.L25O.NOTIF.RPT,BP13L25O.TXT)                                   
-FILE_TERMINATOR()                                                              
 BP13.L25O.NOTIF.RPT                                                            
//*-----------------------------------------------------------------            
//*          CREATE EMAIL RECIPIENT AND SUBJECT                                 
//*-----------------------------------------------------------------            
//STEPF6    EXEC SAS,OPTIONS='MACRO'                                            
//SYSOUT   DD SYSOUT=*                                                          
//BP13RCPT DD DSN=&&P13RCPTA,DISP=(NEW,PASS),                                   
//         LRECL=200,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DATA _NULL_;                                                                
        FILE BP13RCPT;                                                          
        PUT @01 'RCPT TO:<TAN_Thiam_Har@HDB.GOV.SG>';                           
        PUT @01 'RCPT TO:<KONG_Yoke_Gan@HDB.GOV.SG>';                           
        PUT @01 'RCPT TO:<Nica_FT_CHIN@HDB.GOV.SG>';                            
        PUT @01 'RCPT TO:<Francis_WM_CHEE@HDB.GOV.SG>';                         
        PUT @01 'RCPT TO:<CHEW_Lay_Cheng@HDB.GOV.SG>';                          
        PUT @01 'RCPT TO:<LEW_Ai_Choo@HDB.GOV.SG>';                             
        PUT @01 'RCPT TO:<CHUA_Swan_Hua@HDB.GOV.SG>';                           
        PUT @01 'RCPT TO:<KUI_Meau_Kian@HDB.GOV.SG>';                           
        PUT @01 'DATA                                    ';                     
        PUT @01 'FROM:SOC SYSTEM - EMAIL ALERT           ';                     
        PUT @01 'TO:TAN_Thiam_Har@hdb.gov.sg             ';                     
        PUT @01 'TO:KONG_Yoke_Gan@hdb.gov.sg             ';                     
        PUT @01 'TO:Nica_FT_CHIN@hdb.gov.sg              ';                     
        PUT @01 'TO:Francis_WM_CHEE@hdb.gov.sg           ';                     
        PUT @01 'TO:CHEW_Lay_Cheng@hdb.gov.sg            ';                     
        PUT @01 'TO:LEW_Ai_Choo@hdb.gov.sg               ';                     
        PUT @01 'TO:CHUA_Swan_Hua@hdb.gov.sg             ';                     
        PUT @01 'TO:KUI_Meau_Kian@hdb.gov.sg             ';                     
        PUT @01 'SUBJECT: Daily report for Cancelled appln'                     
            @42 '                                        ';                     
//*-----------------------------------------------------------------            
//*          SPECIFY ATTACHMENT FILE NAME                                       
//*-----------------------------------------------------------------            
//STEPF7    EXEC SAS,OPTIONS='MACRO'                                            
//SYSOUT   DD SYSOUT=*                                                          
//BP13NAME DD DSN=&&P13NAMEA,DISP=(NEW,PASS),                                   
//         LRECL=200,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DATA _NULL_;                                                                
        FILE BP13NAME;                                                          
        PUT @01 '           NAME="BP13L25O.ZIP"';                               
//*****************************************************************             
//*          ENCODE A ZIP DATASET INTO BASE64 FORMAT                            
//*****************************************************************             
//STEPF8   EXEC ENCODE,COND=(4,LT)                                              
//ENCODOUT DD DSN=&&BASE64,DISP=(,PASS),                                        
//            SPACE=(5,(10,10),RLSE),AVGREC=M                                   
//ENCODIN  DD DSN=BP13.BP13L25O.ZIP,DISP=SHR                                    
/*                                                                              
//*****************************************************************             
//*          CONVERT OUTPUT TO VARIABLE-BLOCKED (VB)                            
//*****************************************************************             
//STEPF9   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=&&BASE64,DISP=(SHR,DELETE)                                    
//FBVB     DD DSN=&&VB64,DISP=(,PASS),                                          
//           SPACE=(TRK,(10,5),RLSE),                                           
//           DCB=(DSORG=PS,LRECL=200,RECFM=VB)                                  
//SYSIN    DD *                                                                 
 MERGE FIELDS=COPY                                                              
 OUTFIL FNAMES=FBVB,FTOV,VLTRIM=X'40'                                           
/*                                                                              
//*-----------------------------------------------------------------            
//*          CREATE EMAIL FOR FIRST ATTACHMENT                                  
//*-----------------------------------------------------------------            
//STEPF10  EXEC PGM=IEBGENER,COND=(4,LT)                                        
//SYSUT1   DD DSN=*.STEPF4.SMTPHDR,DISP=(SHR,PASS)                              
//         DD DSN=&&P13RCPTA,DISP=(OLD,PASS)                                    
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(APPLHDR),DISP=SHR                        
//         DD DSN=&&P13NAMEA,DISP=(SHR,DELETE)                                  
//         DD DSN=&&VB64,DISP=(SHR,DELETE)                                      
//SYSUT2   DD DSN=BP13.MAILOUT.BP13L290.SERSRPT,DISP=SHR,                       
//         LRECL=200,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*    SEND EMAIL (BP13.L25O.NOTIF.RPT)                                         
//*-----------------------------------------------------------------            
//STEPF11  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILOUT.BP13L290.SERSRPT,DISP=SHR                        
//*                                                                             
//*------------------------------------------------------------*                
//*                  END OF BP13D108                                            
//*------------------------------------------------------------*                
//*-----------------------------------------------------------------*           
//*          E N D      O F     J O B                                 *         
//*-------------------------------------------------------------------*         
