//BP13A209 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071                                                         
//*------------------------------------------------------------------           
//* TO PRINT SUMMARY OF FLAT SUPPLY BY ZONE/NEW TOWN/ESTATE/NEIGH/              
//*                                    CONTRACT/BLOCK/ROOM TYPE                 
//*------------------------------------------------------------------           
//STEP01 EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                     
//WORK      DD UNIT=SYSDA,SPACE=(CYL,(30,10),,,ROUND)                           
//BP13K017  DD DSN=BP13.K017.FLATBLK,DISP=SHR                                   
//FT18F001  DD DSN=BP13.F260.FSUPPLY,DISP=OLD                                   
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S206),DISP=SHR                            
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A209                                                                
//*---------------------------------------------------------------------        
