//BP13DT01 JOB (BP13P),'BP13DT01',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//JOBLIB DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                     
//*-------------------------------------------------------------------*         
//* CHG-NO    ON    BY  - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP135678 050615 IL  - CHANGE SERVER NAME FR SGISFTP TO SGNETSTAGE           
//*-------------------------------------------------------------------*         
//*=====================================================================        
//*                                                                             
//* DELETE ZIP FILE BEFORE PROCESSING                                           
//* SN&P FILE TO CPFB                                                           
//*                                                                             
//*=====================================================================        
//STEP01    EXEC  PGM=IDCAMS,COND=(0,NE)                                        
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD *                                                                
     DEL (BP13.F105.CPFSNP.SENT.ZIP)                                            
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*=====================================================================        
//*                                                                             
//*   PKZIP FILE                                                                
//*                                                                             
//*=====================================================================        
//STEP02    EXEC PKZIP,COND=(0,NE)                                              
-ARCHIVE(BP13.F105.CPFSNP.SENT.ZIP)                                             
-ARCHVOL(DUMMY)                                                                 
-UPDATE                                                                         
-METHOD(FAST)                                                                   
-ZIPPED_DSN(BP13.F105.CPFSNP.SENT,BP13SNP.TXT)                                  
-FILE_TERMINATOR()                                                              
    BP13.F105.CPFSNP.SENT                                                       
/*                                                                              
//*=====================================================================        
//*                                                                             
//*   TRANSMIT COMPRESSED FILE TO SGNETSTAGE SERVER                             
//*   PROD PATH --> /PROD/APPN/DATA/BP13/FROM-HDB/CPF                           
//*   TEST PATH --> /TEST/APPN/DATA/BP13/FROM-HDB/CPF                           
//*                                                                             
//*=====================================================================        
//STEP03   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
    CD /PROD/APPN/DATA/BP13/FROM-HDB/CPF                                        
    BINARY                                                                      
    PUT 'BP13.F105.CPFSNP.SENT.ZIP' BP13SNP.TXT.ZIP                             
    QUIT                                                                        
