//BP13M400  JOB (BP13P),'BP13M400',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*                                                                             
//*===================================================================*         
//*  PURPOSE : TO BACKUP/MAINTAIN BP13K800, K820 ETC                  *         
//*  TIMING  : RUN ON 1ST SAT OF EACH MONTH                           *         
//*===================================================================*         
//*-------------------------------------------------------------------*         
//* CHG-NO   BY  ON      DESCRIPTION                                  *         
//* --------------------------------                                  *         
//* BP130085 LSB 960205 - ADD IN STEPA, VERIFY FILE                   *         
//* BP130487 SSS 980507 - CHG UNIT=3480 TO UNIT=CART                  *         
//* BP130461 LSB 980805 - ADD BP13C114 TO DELETE BP13K150             *         
//* BP130418 CLT 980923 - Y2K COMPLIANCE CHANGES                      *         
//* BP130915 CLT 110900 - INCLUDE BACKUP/CLEARING OF BP13E400         *         
//* BP130929 CLT 231000 - CHANGE NAME FOR BP13F435 TO AB02F860        *         
//* BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)       *         
//* BP132587 CLT 280904 - CHANGE DDNAME FOR BP13C607                  *         
//* BP132627 GAN 250904 - TRANSFER STEP02(BP13C450 RUN) TO BP13Y100   *         
//* BP132795 CLT 071205 - EXPAND BP13F990 TO 2000 CHAR                *         
//* BP135571 MRN 051214 - BACKUP BP13.F415.SERS.MONTH AND EMPTY FILE  *         
//* BP135545 NST 270115 - BACK UP BP13KR90 TO GDG & REDEFINE FILE     *         
//* BP136598 LJL 010217 - MONTHLY BACKUP BP13.AB20.F302.FIREINSU.ACCUM*         
//*                       AND EMPTY FILE                              *         
//* BP136632 KSJ 130417 - TO EXPAND BP13K600/E605                     *         
//* BP136692 KSJ 250417 - EXPAND AB02F860 FROM 600 TO 2000            *         
//* BP136711 KSJ 150517 - ADD BLKSIZE IN STEP15                       *         
//* BP136757 KSJ 230517 - BACK-UP SENT ACCUM FILE TO GDG AND NULLIFY  *         
//* BP136851 RJB 060617 - TO HOUSEKEEP THOSE LOAN REDUCTION CASES THAT*         
//*                       REQUIRE NO CONVERSION                       *         
//* BP136987 LJL 291217 - TO BACKUP CPF WITHDRAWAL FILE FOR YEARLY    *         
//*                       FILE  BP13F600                              *         
//* BP139355 LJL 061022 - TO EXPAND TEMP SPACE                        *         
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//*      VERIFY FILES BEFORE JOB RUN                                  *         
//*-------------------------------------------------------------------*         
//STEPA   EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT2   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*                                                                             
//*-------------------------------------------------------------------*         
//*      TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET               *         
//*-------------------------------------------------------------------*         
//STEP0   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//*      TO DELETE LAST MONTH AGREEMENT ORDER RECORDS                 *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=BP13C419,COND=(0,NE)                                        
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13F330 DD DSN=BP13.F330.DELETE(+1),DISP=(,CATLG),                           
//            DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB),                 
//            SPACE=(CYL,(30,20),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*      REPRO BP13K800 VSAM FILE TO SEQUENTIAL FILES                 *         
//*-------------------------------------------------------------------*         
//STEP03    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT3    DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//   AMP=('BUFND=13')                                                           
//OUTPUT3   DD DSN=BP13.F800.APPLN,DISP=OLD                                     
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//*      TO DELETE/CREATE SOC MASTER FILE (BP13.K800.APPLN)           *         
//*-------------------------------------------------------------------*         
//STEP04    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=BP13.F800.APPLN,DISP=SHR                                     
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL (BP13.K800.APPLN) CL PURGE                                        
          DEF CLUSTER                                -                          
              (NAME(BP13.K800.APPLN)                 -                          
              CYL(700 100)                           -                          
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K800.APPLN.DATA)            -                          
              KEYS(8 3)                              -                          
              RECSZ(2000 2000)                       -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K800.APPLN.INDEX)           -                          
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K800.APPLN)                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//*      SORT OCCUPIER FILE TO TEMP FILE                              *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//SORTOUT  DD DSN=&&TEMP1,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),                               
//            SPACE=(CYL,(300,100),RLSE)                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//*      TO CREATE SOC OCCUPIER FILE  ( BP13.K820.OCCUP )             *         
//*-------------------------------------------------------------------*         
//STEP06    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=&&TEMP1,DISP=(OLD,PASS)                                       
//SYSIN     DD  *                                                               
          DEL (BP13.K820.OCCUP) CL PURGE                                        
          DEF CLUSTER                                -                          
              (NAME(BP13.K820.OCCUP)                 -                          
              CYL(350 100)                           -                          
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K820.OCCUP.DATA)            -                          
              KEYS(17 0)                             -                          
              RECSZ(400 400)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K820.OCCUP.INDEX)           -                          
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K820.OCCUP)                                              
      IF MAXCC = 0  THEN                             -                          
           DEF AIX (NAME(BP13.K820.OCCUP.ALTX1)      -                          
               REL(BP13.K820.OCCUP)                  -                          
               REUSE                                 -                          
               KEYS(9 8)                             -                          
               SHR(2 3)                              -                          
               NUNQK)                                -                          
               DATA                                  -                          
               (NAME(BP13.K820.OCCUP.ALTX1.DATA)     -                          
               CYL(100 50)                          -                           
               RECSZ(31 354)                         -                          
               FSPC(10 10)                           -                          
               CISZ(4096))                           -                          
               INDEX                                 -                          
               (NAME(BP13.K820.OCCUP.ALTX1.INDEX)    -                          
               CISZ(4096))                                                      
         IF MAXCC = 0 THEN                           -                          
           DEF PATH (NAME(BP13.K820.OCCUP.PATH1)     -                          
               PENT(BP13.K820.OCCUP.ALTX1))                                     
         IF MAXCC = 0 THEN                                                      
           BIX IDS(BP13.K820.OCCUP)                  -                          
               ODS(BP13.K820.OCCUP.ALTX1)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//*      PROCESS LIST OF UNAUTHORIZED ACCESS                          *         
//*      SORT BY REGN NO                                              *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AB02.F990.CPFLOG.SOC,DISP=SHR                                 
//SORTOUT  DD DSN=&&AB02F990,DISP=(NEW,PASS),                                   
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                                
//          UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE)                                  
//SYSIN    DD *                                                                 
  SORT FIELDS=(22,8,CH,A)                                                       
  INCLUDE COND=(22,8,CH,NE,C'        ')                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//*      PROCESS LIST OF UNAUTHORIZED ACCESS                          *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=BP13C607,COND=(0,NE)                                        
//AB02E990 DD DSN=&&AB02F990,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFNI=4','BUFND=12')                                           
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFNI=4','BUFND=12')                                           
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//         AMP=('BUFNI=4','BUFND=12')                                           
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFNI=4','BUFND=12')                                           
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR                                     
//BP13F990 DD DSN=BP13.F990.UNAUTH,DISP=SHR                                     
//BP13L607 DD SYSOUT=2,OUTPUT=(*.STEP0.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*      CLEAR AB02.F990.CPFLOG.SOC                                   *         
//*-------------------------------------------------------------------*         
//STEP09    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT9    DD DUMMY                                                            
//OUTPUT9   DD DSN=AB02.F990.CPFLOG.SOC,DISP=OLD                                
//SYSIN     DD *                                                                
      REPRO INFILE(INPUT9) OUTFILE(OUTPUT9)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO DELETE K600 RECORDS WHOSE ACCEPTANCE DATE IS MORE THAN 3 MTHS  *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC  PGM=BP13C471,COND=(0,NE)                                       
//SY02F001 DD  DSN=SY02.F001.DATE,                                              
//             DISP=SHR                                                         
//BP13K600 DD  DSN=BP13.K600.CPFWDL,                                            
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT                                                              *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//SORTOUT  DD DSN=&&STEP11,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27000,LRECL=1800,RECFM=FB),                          
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,31,A),FORMAT=CH                                               
//*                                                                             
//*-------------------------------------------------------------------*         
//* DELETE AND DEFINE BP13K600                                        *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&STEP11,DISP=(OLD,PASS)                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL    (BP13.K600.CPFWDL) CL PURGE                                     
         DEF CL (NAME(BP13.K600.CPFWDL)      -                                  
                 CYL(20 10)                         -                           
                 UNIQUE                            -                            
                 STORCLAS(PRODRLS)                 -                            
                 LOG(NONE)                         -                            
                 SPEED                             -                            
                 SHR(2 3)                          -                            
                 KEYS(31 0)                        -                            
                 CISZ(4096)                        -                            
                 RECSZ(1800 1800) )                                             
         IF LASTCC = 0 THEN                        -                            
           REPRO IFILE(INPUT)                      -                            
               ODS(BP13.K600.CPFWDL)         -                                  
               REUSE                                                            
         IF MAXCC = 0 THEN                         -                            
           DEF AIX (NAME(BP13.K600.CPFWDL.ALTX1) -                              
               REL(BP13.K600.CPFWDL)           -                                
               CYL(10 5)                           -                            
               SHR(2 3)                            -                            
               UNIQUE                              -                            
               KEYS(19 1)                          -                            
                 CISZ(4096)                        -                            
                 RECSZ(1800 1800)   -                                           
               NUNQK)                                                           
         IF LASTCC = 0 THEN                        -                            
           DEF PATH(NAME(BP13.K600.CPFWDL.PATH1) -                              
               PENT(BP13.K600.CPFWDL.ALTX1))                                    
         IF LASTCC = 0 THEN                        -                            
           BIX IDS(BP13.K600.CPFWDL)           -                                
               ODS(BP13.K600.CPFWDL.ALTX1)                                      
         IF MAXCC = 0 THEN                         -                            
           DEF AIX (NAME(BP13.K600.CPFWDL.ALTX2) -                              
               REL(BP13.K600.CPFWDL)           -                                
               CYL(10 5)                           -                            
               SHR(2 3)                            -                            
               UNIQUE                              -                            
               KEYS(11 31)                         -                            
                 CISZ(4096)                        -                            
                 RECSZ(1800 1800)   -                                           
               NUNQK)                                                           
         IF LASTCC = 0 THEN                        -                            
           DEF PATH(NAME(BP13.K600.CPFWDL.PATH2) -                              
               PENT(BP13.K600.CPFWDL.ALTX2))                                    
         IF LASTCC = 0 THEN                        -                            
           BIX IDS(BP13.K600.CPFWDL)           -                                
               ODS(BP13.K600.CPFWDL.ALTX2)                                      
         IF MAXCC = 0 THEN                         -                            
           DEF AIX (NAME(BP13.K600.CPFWDL.ALTX3) -                              
               REL(BP13.K600.CPFWDL)           -                                
               CYL(10 5)                           -                            
               SHR(2 3)                            -                            
               UNIQUE                              -                            
               KEYS(9 22)                         -                             
                 CISZ(4096)                        -                            
                 RECSZ(1800 1800)   -                                           
               NUNQK)                                                           
         IF LASTCC = 0 THEN                        -                            
           DEF PATH(NAME(BP13.K600.CPFWDL.PATH3) -                              
               PENT(BP13.K600.CPFWDL.ALTX3))                                    
         IF LASTCC = 0 THEN                        -                            
           BIX IDS(BP13.K600.CPFWDL)           -                                
               ODS(BP13.K600.CPFWDL.ALTX3)                                      
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F605.CPFLOG - 12 GDG                                  *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT3    DD DSN=BP13.E605.CPFLOG,DISP=SHR                                    
//OUTPUT3   DD DSN=BP13.F605.CPFLOG.MONTH(+1),DISP=(,PASS),                     
//             UNIT=CART,LABEL=(,SL),                                           
//             DCB=(BP13.GDG,BLKSIZE=27000,LRECL=1800,RECFM=FB)                 
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                      
//*                                                                             
//*-------------------------------------------------------------------*         
//* CATALOG GDG                                                       *         
//*-------------------------------------------------------------------*         
//STEP14    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT4    DD DSN=BP13.F605.CPFLOG.MONTH(+1),DISP=(OLD,CATLG),                 
//             UNIT=(,,DEFER)                                                   
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13.AB02.F860.HDBWDL - 36 GDG                             *         
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT15   DD DSN=BP13.AB02.F860.HDBWDL.MONTH.NEW,DISP=SHR                     
//OUTPUT15  DD DSN=BP13.AB02.F860.HDBWDL.MONTH.BACKUP(+1),DISP=(,PASS),         
//             UNIT=CART,LABEL=(,SL),                                           
//             DCB=(BP13.GDG,LRECL=2000,RECFM=FB,BLKSIZE=0)                     
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT15) OUTFILE(OUTPUT15)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* CATALOG GDG                                                       *         
//*-------------------------------------------------------------------*         
//STEP16    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT4    DD DSN=BP13.AB02.F860.HDBWDL.MONTH.BACKUP(+1),                      
//             DISP=(OLD,CATLG),UNIT=(,,DEFER)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* DEFINE APPTABLE TABLE VSAM FILE BP13E605                          *         
//* PROGRAM ID FOR CICS                                               *         
//* BP13E605  = BP13.E605.APPTABLE                                    *         
//*-------------------------------------------------------------------*         
//STEP17    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR1800,DISP=SHR                                 
//SYSIN    DD *                                                                 
         DEL  (BP13.E605.CPFLOG) CL PURGE                                       
         DEF CL (NAME(BP13.E605.CPFLOG) -                                       
                 CYL(20 10)               -                                     
                 SHR(2 3)                 -                                     
                 RECSZ(1800 1800)         -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 CISZ(4096)               -                                     
                 NIXD)                    -                                     
              DATA                        -                                     
              (NAME(BP13.E605.CPFLOG.DATA))                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO EMPTY THE FILE                                                 *         
//*-------------------------------------------------------------------*         
//STEP18    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT18   DD DSN=NULLFILE,DISP=SHR                                            
//OUTPUT18  DD DSN=BP13.AB02.F860.HDBWDL.MONTH.NEW,DISP=SHR                     
//SYSIN     DD *                                                                
   REPRO INFILE(INPUT18) OUTFILE(OUTPUT18)                                      
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13E305         - 36 GDG                                  *         
//*-------------------------------------------------------------------*         
//STEP19   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT19   DD DSN=BP13.E305.AGRORDER.LOG,DISP=SHR                              
//OUTPUT19  DD DSN=BP13.E305.AGRORDER.LOG.MONTH.BACKUP(+1),                     
//             DISP=(,PASS),UNIT=CART,LABEL=(,SL),                              
//             DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)                 
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT19) OUTFILE(OUTPUT19)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* CATALOG GDG                                                       *         
//*-------------------------------------------------------------------*         
//STEP20    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT20   DD DSN=BP13.E305.AGRORDER.LOG.MONTH.BACKUP(+1),                     
//             DISP=(OLD,CATLG),UNIT=(,,DEFER)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* DEFINE APPTABLE TABLE VSAM FILE BP13E305                          *         
//* PROGRAM ID FOR CICS                                               *         
//* BP13E305  = BP13.E305.AGRORDER.LOG                                *         
//*-------------------------------------------------------------------*         
//STEP21    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL  (BP13.E305.AGRORDER.LOG) CL PURGE                                 
         DEF CL (NAME(BP13.E305.AGRORDER.LOG) -                                 
                 CYL(30 15)               -                                     
                 SHR(2 3)                 -                                     
                 RECSZ(2000 2000)         -                                     
                 CISZ(4096)               -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 NIXD)                    -                                     
              DATA                        -                                     
              (NAME(BP13.E305.AGRORDER.LOG.DATA))                               
//*                                                                             
//*-------------------------------------------------------------------*         
//* REPRO BP13K150 VSAM FILE TO SEQUENTIAL FILES                      *         
//*-------------------------------------------------------------------*         
//STEP22    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K150.EXAPPL,DISP=SHR,                                   
//   AMP=('BUFND=13')                                                           
//OUTPUT1   DD DSN=BP13.F150.EXAPPL.DELETE,DISP=OLD                             
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* DELETE EX-APPLN FILE BP13K150                                     *         
//*-------------------------------------------------------------------*         
//STEP23   EXEC PGM=BP13C114,COND=(0,NE)                                        
//BP13K150 DD DSN=BP13.K150.EXAPPL,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//          AMP=('BUFND=4','BUFNI=8')                                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13.E400.SALEORD.LOG - 36 GDG                             *         
//*-------------------------------------------------------------------*         
//STEP24   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT24   DD DSN=BP13.E400.SALEORD.LOG,DISP=SHR                               
//OUTPUT24  DD DSN=BP13.E400.SALEORD.LOG.MONTH(+1),                             
//             DISP=(,PASS),UNIT=CART,LABEL=(,SL),                              
//             DCB=(BP13.GDG,BLKSIZE=18450,LRECL=2050,RECFM=FB)                 
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT24) OUTFILE(OUTPUT24)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* CATALOG GDG                                                       *         
//*-------------------------------------------------------------------*         
//STEP25    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT25   DD DSN=BP13.E400.SALEORD.LOG.MONTH(+1),                             
//             DISP=(OLD,CATLG),UNIT=(,,DEFER)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* DEFINE LOG FILE FOR SALES ORDER                                   *         
//* BP13E400 = BP13.E400.SALEORD.LOG                                  *         
//*-------------------------------------------------------------------*         
//STEP26    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR2050,DISP=SHR                                 
//SYSIN    DD *                                                                 
         DELETE (BP13.E400.SALEORD.LOG) CL PRG                                  
         DEF CL (NAME(BP13.E400.SALEORD.LOG) -                                  
                 CYL(30 15)                   -                                 
                 SHR(2 3)                     -                                 
                 RECSZ(2050 2050)             -                                 
                 CISZ(4096)                   -                                 
                 STORCLAS(PRODRLS)            -                                 
                 LOG(NONE)                    -                                 
                 NIXD)                        -                                 
              DATA                            -                                 
              (NAME(BP13.E400.SALEORD.LOG.DATA))                                
         IF MAXCC = 0  THEN                   -                                 
            REPRO IFILE(INPUT1)               -                                 
                 ODS(BP13.E400.SALEORD.LOG)                                     
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F415.SERS.MONTH                                                 
//*-------------------------------------------------------------------*         
//STEP27   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT27   DD DSN=BP13.F415.SERS.MONTH,DISP=SHR                                
//OUTPUT27  DD DSN=BP13.F415.SERS.MONTH.BACKUP(+1),                             
//             DISP=(,PASS),UNIT=CART,LABEL=(,SL),                              
//             DCB=(BP13.GDG,BLKSIZE=27900,LRECL=100,RECFM=FB)                  
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT27) OUTFILE(OUTPUT27)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* CATALOG GDG                                                       *         
//*-------------------------------------------------------------------*         
//STEP28    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT28   DD DSN=BP13.F415.SERS.MONTH.BACKUP(+1),                             
//             DISP=(OLD,CATLG),UNIT=(,,DEFER)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO EMPTY THE FILE                                                 *         
//*-------------------------------------------------------------------*         
//STEP29    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT29   DD DSN=NULLFILE,DISP=SHR                                            
//OUTPUT29  DD DSN=BP13.F415.SERS.MONTH,DISP=SHR                                
//SYSIN     DD *                                                                
   REPRO INFILE(INPUT29) OUTFILE(OUTPUT29)                                      
//*                                                                             
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//*  BACKUP BP13.KR90.LOG FILE                                        *         
//*-------------------------------------------------------------------*         
//STEP30   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT30  DD DSN=BP13.KR90.LOG,DISP=SHR,                                       
//            AMP=('BUFND=23')                                                  
//OUTPUT30 DD DSN=BP13.FR90.LOG.MONTH(+1),DISP=(NEW,CATLG),                     
//            UNIT=(DISK,20),                                                   
//            SPACE=(CYL,(1000,200),RLSE),DATACLAS=MULTIVOL,                    
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=9100,RECFM=FB)                      
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT30)  OUTFILE(OUTPUT30)                                     
//*                                                                             
//*----------------------------------------------------------------*            
//*********************************************************************         
//*  TO RE-DEFINE THE VSAM FILE BP13KR90 (BP13.KR90.LOG)              *         
//******************************************************************            
//STEP31    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT31   DD DSN=BP13.BLANK.CHAR9100,DISP=SHR                                 
//SYSIN     DD  *                                                               
            DEL 'BP13.KR90.LOG' CLUSTER PURGE                                   
            DEF CLUSTER                                     -                   
                (NAME(BP13.KR90.LOG)                       -                    
                 CYL(100 100)                             -                     
                 UNIQUE                                     -                   
                 DATACLAS(MULTIVOL)                     -                       
                 STORCLAS(PRODRLS)                           -                  
                 LOG(NONE)                                  -                   
                 SHR(2 3))                                  -                   
                DATA                                        -                   
                (NAME(BP13.KR90.LOG.DATA)                  -                    
                 KEYS(18 0)                                 -                   
                 RECSZ(9100 9100)                         -                     
                 CISZ(4096)                                 -                   
                 FSPC(10 10))                               -                   
                INDEX                                       -                   
                (NAME(BP13.KR90.LOG.INDEX)                 -                    
                 CISZ(4096))                                                    
            IF MAXCC = 0  THEN                              -                   
               REPRO IFILE(INPUT31)                          -                  
               ODS(BP13.KR90.LOG)                                               
//*-------------------------------------------------------------------*         
//* BACKUP BP13.AB20.F302.FIREINSU 12 GDG                                       
//*-------------------------------------------------------------------*         
//STEP32   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.AB20.F302.FIREINSU.ACCUM,DISP=SHR                       
//OUTPUT1   DD DSN=BP13.AB20.F302.FIREINSU.MTH(+1),                             
//          DISP=(NEW,CATLG),                                                   
//          SPACE=(CYL,(20,10)),                                                
//          DCB=(BP13.GDG,BLKSIZE=0,LRECL=350,RECFM=FB)                         
//INPUT2    DD DUMMY                                                            
//OUTPUT2   DD DSN=BP13.AB20.F302.FIREINSU.ACCUM,DISP=OLD                       
//SYSIN    DD  *                                                                
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                       
    REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F600.CPFWDL.SENT.ACCUM                                          
//*-------------------------------------------------------------------*         
//STEP33   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F600.CPFWDL.SENT.ACCUM,DISP=SHR                         
//OUTPUT1   DD DSN=BP13.F600.CPFWDL.SENT.MONTH(+1),                             
//          DISP=(NEW,CATLG),                                                   
//          SPACE=(CYL,(50,30)),                                                
//          DCB=(BP13.GDG,BLKSIZE=0,LRECL=1800,RECFM=FB)                        
//INPUT2    DD DSN=BP13.F600.CPFWDL.SENT.ACCUM,DISP=SHR                         
//OUTPUT2   DD DSN=BP13.F600.CPFWDL.SENT.ACCUM.YEAR,DISP=MOD                    
//INPUT3    DD DUMMY                                                            
//OUTPUT3   DD DSN=BP13.F600.CPFWDL.SENT.ACCUM,DISP=OLD                         
//SYSIN    DD  *                                                                
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                       
    REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                       
    REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* HOUSEKEEPING JOB TO LIST ACCOUNTS WITH SMS-TAG = COMPLETED                  
//* AND DATE-COMPLETE IS LESS THAN 1 YEAR AGO.                                  
//*-------------------------------------------------------------------*         
//* SEPARATE ACCOUNTS WITH COMPLETED SMS-TAG                                    
//*-------------------------------------------------------------------*         
//STEP34 EXEC PGM=BP13CFA1,COND=(0,NE)                                          
//BP13K482 DD DSN=BP13.K482.FLATSOLD.BFSL,DISP=SHR                              
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F482 DD DSN=BP13.F482.COMPLETE,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* HOUSEKEEPING - UPDATE BP13K482, BP13K486                                    
//*-------------------------------------------------------------------*         
//STEP35 EXEC PGM=BP13CFA2,COND=(0,NE)                                          
//P13F482A DD DSN=BP13.F482.COMPLETE,DISP=SHR                                   
//BP13K482 DD DSN=BP13.K482.FLATSOLD.BFSL,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K486 DD DSN=BP13.K486.SELLER.BFSL.PATH2,DISP=SHR,                         
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F482 DD DSN=BP13.F482.FLATSOLD.COMPLETE,DISP=MOD                          
//BP13F486 DD DSN=BP13.F486.SELLER.COMPLETE,DISP=MOD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//*                      END OF BP13M400                              *         
//*-------------------------------------------------------------------*         
