//BP13DM27 JOB (BP13P),'CS94324',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),             
//             COND=(0,NE),NOTIFY=CSD0071                                       
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*                                                                             
//**********************************************************************        
//* TO GENERATE FTPMC ELIGIBILE REPORTS AND PRINT NIL LISTING WHEN NO           
//* RECORD TO PRINT                                                             
//**********************************************************************        
//*STEP01:SORT FTPMC ELIGIBLE FILE AFTER RESIDENTIAL OWNERSHIP CHECK            
//**********************************************************************        
//STEP01   EXEC PGM=SORT                                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDUMP  DD SYSOUT=*                                                          
//SORTIN   DD DISP=SHR,DSN=BP13.FDM25001.ACCEPTED.SD(0)                         
//SORTOUT  DD DISP=(NEW,PASS,DELETE),                                           
//            UNIT=CART,                                                        
//            DCB=(RECFM=FB,LRECL=100),                                         
//            DSN=&&STEP01                                                      
//SYSIN    DD *                                                                 
   SORT FIELDS=(07,08,CH,A)                                                     
/*                                                                              
//**********************************************************************        
//*STEP02:TO APPEND FTPMC ELIGIBLE FILE TO CONSOLIDATED FILE                    
//**********************************************************************        
//STEP02   EXEC PGM=ICEGENER                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DISP=SHR,DSN=BP13.FDM25001.ACCEPTED.SD(0)                         
//SYSUT2   DD DISP=MOD,DSN=BP13.FDM27001.ACCEPTED.SD                            
//SYSIN    DD DUMMY                                                             
//*                                                                             
//**********************************************************************        
//*STEP03:TO GENERATE FTPMC ELIGIBLE REPORTS                                    
//**********************************************************************        
//STEP03   EXEC PGM=BP13CM27                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//BP13FIN1 DD DISP=(OLD,DELETE,DELETE),DSN=&&STEP01                             
//BP13FIN2 DD *                                                                 
BP13DM27                                                                        
/*                                                                              
//BP13LRP1  DD SYSOUT=8,DEST=IOM8                                               
//BP13LRP2  DD SYSOUT=8,DEST=IOM8                                               
//*                                                                             
