//BP13A810 JOB (BP13P),'BP13A810',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================          
//* THIS IS A BYPASS RENTAL FLAT AFTER ASSIGN RANDOM NO AND                     
//*  BEFORE UPDATE TO MASTER                                                    
//*  RUN AFTER BP13A815 - ASSIGN RANDOM NUMBER                                  
//*  -  BYPASS FLAT TYPE '0' (KIV CASES)                                        
//*  -  PRIORITISE BY 'G' 'Y' FOR LOW-FLOOR-PREFERECE                           
//*  -  ASSIGN REGISTRATION NUMBER BASED ON RANDOM NUMBER                       
//*  -  DROP RENTAL FLAT '1R' OR '2R'                                           
//*--------------------------------------------------------------------         
//* BP132500 YCH 300304 - BYPASS FLAT TYPE 1R & 2R                              
//* BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//* BP132807 YCH 050106 - INCLUDE LFP='N','B','P'                               
//* BP132826 YCH 040506 - EXPAND REFNO                                          
//* BP132893 YCH 100706 - BACKUP AND REPRO BP13F500 & BP13F558                  
//* BP133046 YCH 040407 - INCLUDE LFP = 'A' AFTER B AND BEFORE P                
//* BP133201 YCH 121107 - APPEND 'SERS' AFTER BP13.F510.RANDOM &                
//*                        BP13.K740.MATUREBA  & BACKUP                         
//*                        BP13F500, BP13F558, BP13F740                         
//* BP134838 YCH 020213 - OUTPUT FILES TO SEQUENTIAL FILES                      
//* BP137208 YCH 100218 - INCLUDE BP13K857 IN BP13C884                          
//*                     - INCLUDE BP13F857                                      
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1B CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1C CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1C                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1D CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1D                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=====================================================================        
//*  TO BYPASS RENTAL FLAT                                                      
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F510.RANDOM.SERS,DISP=SHR                                
//SORTOUT  DD DSN=&&BP13F510,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3),SPACE=(CYL,(80,10),RLSE),                             
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   OMIT COND=(211,2,CH,EQ,C'1R',OR,211,2,CH,EQ,C'2R')                           
//*---------------------------------------------------------------------        
//* TO CREATE THE BALLOT FILE & TO ENSURE THAT NO DUPLICATE RANDOM NO           
//* BY USINF DEFINE VSAM BALLOT FILE                                            
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&BP13F510,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEL (BP13.K740.MATUREBA.SERS) CL PURGE                                 
         DEF CL (NAME(BP13.K740.MATUREBA.SERS)   -                              
                 CYL(80 10)                       -                             
                 UNIQUE                          -                              
                 SPEED                           -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K740.MATUREBA.SERS.DATA) -                          
                 KEYS(28 0)                      -                              
                 RECSZ(500 500)                  -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K740.MATUREBA.SERS)                                   
//*--------------------------------------------------------------------         
//*      TO CREATE PATH/ALTX FOR MATURENT BALLOT FILE                           
//*--------------------------------------------------------------------         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR                              
//SYSIN    DD  *                                                                
           DEF AIX (NAME(BP13.K740.MATUREBA.SERS.ALTX1) -                       
               REL(BP13.K740.MATUREBA.SERS)          -                          
               REUSE                                 -                          
               KEYS(8 122)                           -                          
               SHR(2 3)                              -                          
               NUNQK)                                -                          
               DATA                                  -                          
               (NAME(BP13.K740.MATUREBA.SERS.ALTX1.DATA) -                      
               CYL(15 5)                             -                          
               RECSZ(31 554)                         -                          
               FSPC(10 10)                           -                          
               CISZ(4096))                           -                          
               INDEX                                 -                          
               (NAME(BP13.K740.MATUREBA.SERS.ALTX1.INDEX) -                     
               CISZ(4096))                                                      
         IF MAXCC = 0 THEN                           -                          
           DEF PATH (NAME(BP13.K740.MATUREBA.SERS.PATH1) -                      
               PENT(BP13.K740.MATUREBA.SERS.ALTX1))                             
         IF MAXCC = 0 THEN                          -                           
           BIX IDS(BP13.K740.MATUREBA.SERS)          -                          
               ODS(BP13.K740.MATUREBA.SERS.ALTX1)                               
//*=====================================================================        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------------        
//*-  REPRO REGN NO FILE TO SEQ FILE                                            
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=SHR,                                   
//            AMP=('BUFND=12')                                                  
//OUTPUT1  DD DSN=BP13.F530.ISSUENO,DISP=OLD                                    
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* SORT IN JB CASE, BY NT, RANDOM NUMBER                                       
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(50,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,1,28,A),FORMAT=CH                                     
//*---------------------------------------------------------------------        
//* FOR PA CASES, OUTPUT HIS OWN RANDOM-NO TO RANDOM-JT-ALLOC                   
//* FOR JB-CDE = 8, OUTPUT THE RANDOM-NO OF THE SMALLEST REF-NO                 
//* TO RANDOM-JT-ALLOC                                                          
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C883,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA.SERS,DISP=OLD,                             
//            AMP=('BUFND=23')                                                  
//BP13K741 DD DSN=BP13.K740.MATUREBA.SERS.PATH1,DISP=OLD,                       
//            AMP=('BUFND=23')                                                  
//BP13F565 DD DSN=&&F565RAND,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=550,BLKSIZE=0),                               
//            SPACE=(CYL,(55,15),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=====================================================================        
//* SORT OUT THE SERS REQUEST BY NT/FT/RANDOM-JT-ALLOC/NUM-RANDOM               
//* OMIT FLAT TYPE = 0'                                                         
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F565RAND,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F565FSRS,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=550,BLKSIZE=0),                               
//            SPACE=(CYL,(55,15),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(226,3,A,501,28,A,1,28,A),FORMAT=CH                             
    OMIT COND=(211,1,CH,EQ,C'0')                                                
//*---------------------------------------------------------------------        
//* SORT OUT THE SERS REQUEST BY NT/FT/RANDOM-JT-ALLOC/NUM-RANDOM               
//* INCLUDE LOW FLOOR PREFERNCE = 'G'                                           
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F565FSRS,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F565SERS,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=550,BLKSIZE=0),                               
//            SPACE=(CYL,(55,15),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(226,3,A,501,28,A,1,28,A),FORMAT=CH                             
    INCLUDE COND=(71,1,CH,EQ,C'G')                                              
//*---------------------------------------------------------------------        
//* SORT OUT THE SERS REQUEST BY NT/FT/RANDOM-JT-ALLOC/NUM-RANDOM               
//* INCLUDE LOW FLOOR PREFERNCE = 'Y'                                           
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F565FSRS,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F565SERS,DISP=(MOD,PASS)                                    
//SYSIN    DD *                                                                 
    SORT FIELDS=(226,3,A,501,28,A,1,28,A),FORMAT=CH                             
    INCLUDE COND=(71,1,CH,EQ,C'Y')                                              
//*---------------------------------------------------------------------        
//* SORT OUT THE SERS REQUEST BY NT/FT/RANDOM-JT-ALLOC/NUM-RANDOM               
//* INCLUDE LOW FLOOR PREFERENCE = 'N'                                          
//*---------------------------------------------------------------------        
//STEP11A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F565FSRS,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F565SERS,DISP=(MOD,PASS)                                    
//SYSIN    DD *                                                                 
    SORT FIELDS=(226,3,A,501,28,A,1,28,A),FORMAT=CH                             
    INCLUDE COND=(71,1,CH,EQ,C'N')                                              
//*---------------------------------------------------------------------        
//* SORT OUT THE SERS REQUEST BY NT/FT/RANDOM-JT-ALLOC/NUM-RANDOM               
//* INCLUDE LOW FLOOR PREFERENCE = 'B'                                          
//*---------------------------------------------------------------------        
//STEP11B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F565FSRS,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F565SERS,DISP=(MOD,PASS)                                    
//SYSIN    DD *                                                                 
    SORT FIELDS=(226,3,A,501,28,A,1,28,A),FORMAT=CH                             
    INCLUDE COND=(71,1,CH,EQ,C'B')                                              
//*---------------------------------------------------------------------        
//* SORT OUT THE SERS REQUEST BY NT/FT/RANDOM-JT-ALLOC/NUM-RANDOM               
//* INCLUDE LOW FLOOR PREFERENCE = 'A'                                          
//*---------------------------------------------------------------------        
//STEP11B1 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F565FSRS,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F565SERS,DISP=(MOD,PASS)                                    
//SYSIN    DD *                                                                 
    SORT FIELDS=(226,3,A,501,28,A,1,28,A),FORMAT=CH                             
    INCLUDE COND=(71,1,CH,EQ,C'A')                                              
//*---------------------------------------------------------------------        
//* SORT OUT THE SERS REQUEST BY NT/FT/RANDOM-JT-ALLOC/NUM-RANDOM               
//* INCLUDE LOW FLOOR PREFERENCE = 'P'                                          
//*---------------------------------------------------------------------        
//STEP11C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F565FSRS,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F565SERS,DISP=(MOD,PASS)                                    
//SYSIN    DD *                                                                 
    SORT FIELDS=(226,3,A,501,28,A,1,28,A),FORMAT=CH                             
    INCLUDE COND=(71,1,CH,EQ,C'P')                                              
//*---------------------------------------------------------------------        
//* TO ASSIGN REGN NUMBER TO SUCCESSFUL CASES AFTER BALLOTING                   
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13C884,COND=(0,NE)                                        
//BP13F565 DD DSN=&&F565SERS,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13F730 DD DSN=BP13.F730.SERSREQ,DISP=OLD                                    
//BP13K830 DD DSN=BP17.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP17.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K857 DD DSN=BP17.BP13K857.EMAIL,DISP=SHR,                                 
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K530 DD DSN=BP13.K530.ISSUENO,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L884 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=====================================================================        
//*  PRINT REPORT ON SERS BALLOTING AFTER PIGEON-HOLE                           
//*=====================================================================        
//STEP13   EXEC SAS,COND=(0,NE)                                                 
//BP13F565 DD DSN=&&F565SERS,DISP=(OLD,PASS)                                    
//BP13L537 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S537),DISP=SHR                             
//*                                                                             
//*=====================================================================        
//*  DETERMINE LESSEE CHECK AND PREMIUM CDE                                     
//*---------------------------------------------------------------------        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR                              
//SORTOUT  DD DSN=&&P13REGN,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.K825.REQOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&P13OCCP,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A,107,2,A,9,9,A),FORMAT=CH                                 
    INCLUDE COND=(1,8,CH,GT,C'        ')                                        
//*-------------------------------------------------------------------*         
//* TO UPDATE LESSEE CHECK                                            *         
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=BP13C834,COND=(0,NE)                                        
//BP13F730 DD DSN=&&P13REGN,DISP=(OLD,PASS)                                     
//BP13F825 DD DSN=&&P13OCCP,DISP=(OLD,PASS)                                     
//BP13K825 DD DSN=BP17.K825.REQOCCP,DISP=SHR                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L834 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.K825.REQOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&P13ESSEN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                               
  OUTREC FIELDS=(1,200,200X)                                                    
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP17   EXEC PGM=BP13C577,COND=(0,NE)                                        
//BP13F500 DD DSN=&&P13REGN,DISP=(OLD,PASS)                                     
//BP13F820 DD DSN=&&P13ESSEN,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&P13F558,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT OUT BY NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F558,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&P13FRESL,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                            
//* MATCH NRIC IN RESALE FILE, IF MATCH UPDATE AS UPGRADER                      
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13U702,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&P13FRESL,DISP=(OLD,PASS)                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=BP13.F558.UPGOCCP.SERS,DISP=OLD                               
//BP13L702 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT BY NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.SERS,DISP=SHR                               
//SORTOUT  DD DSN=&&P13FPREM,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A,9,9,A),FORMAT=CH                                          
//*---------------------------------------------------------------------        
//* UPDATE PREMIUM CODE IN BP13K740                                             
//*---------------------------------------------------------------------        
//STEP15   EXEC PGM=BP13C533,COND=(0,NE)                                        
//BP13F558 DD DSN=&&P13FPREM,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K741 DD DSN=BP13.K740.MATUREBA.SERS.PATH1,DISP=SHR,                       
//            AMP=('BUFND=8','BUFNI=4')                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*=====================================================================        
//*  PRINT REPORT ON SERS BALLOTING AFTER PIGEON-HOLE                           
//*=====================================================================        
//STEP15A  EXEC SAS,COND=(0,NE)                                                 
//BP13F740 DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR                              
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13F558 DD DSN=BP13.F558.UPGOCCP.SERS,DISP=SHR                               
//BP13F825 DD DSN=BP17.K825.REQOCCP,DISP=SHR                                    
//BP13F830 DD DSN=BP17.K830.ADDR,DISP=SHR                                       
//BP13L046 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S046),DISP=SHR                             
//*=====================================================================        
//*  TO PRINT REPORT ON RENTAL CASES                                            
//*  SORT BY REFERENCE NUMBER                                                   
//*---------------------------------------------------------------------        
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F510.RANDOM.SERS,DISP=SHR                                
//SORTOUT  DD DSN=&&BP13RENT,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3),SPACE=(CYL,(80,10),RLSE),                             
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(33,8,A),FORMAT=CH                                               
   INCLUDE COND=(211,2,CH,EQ,C'1R',OR,211,2,CH,EQ,C'2R')                        
//*---------------------------------------------------------------------        
//*  REPORT FOR SPU                                                             
//*---------------------------------------------------------------------        
//STEP17   EXEC SAS,COND=(0,NE)                                                 
//BP13F510 DD DSN=&&BP13RENT,DISP=(OLD,PASS)                                    
//BP17F000 DD DSN=BP17.K000.SCHREF.SERSITE,DISP=SHR                             
//BP17K200 DD DSN=BP17.K200.SERSAPPL,DISP=SHR                                   
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13F825 DD DSN=BP17.K825.REQOCCP,DISP=SHR                                    
//BP13F830 DD DSN=BP17.K830.ADDR,DISP=SHR                                       
//P13L546A DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L546B DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S546),DISP=SHR                             
//*--------------------------------------------------------------------         
//* INCLUDE NEW JOBSTEP TO DETERMINE HOUSEHOLD TYPE                             
//*---------------------------------------------------------------------        
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F500SRS,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(123,8,CH,NE,C'        ')                                     
//*---------------------------------------------------------------------        
//* BP13.F500.SEQUENCE - ALREADY UPDATED WITH SEQ-REF-NO                        
//* COMPUTE DTE-BALLOT FOR THE QUARTER                                          
//*---------------------------------------------------------------------        
//STEP19   EXEC PGM=BP13C705,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500SRS,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=BP13.F500.SEQUENCE.SERS,DISP=OLD                              
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* REPRO GENERATED BP13F500 AND BP13F558 ON SERS CASES TO                      
//* DETERMINE HOUSEHOLD TYPE                                                    
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=IDCAMS                                                      
//INPUT1   DD  DSN=BP13.F500.SEQUENCE.SERS,DISP=SHR                             
//OUTPUT1  DD  DSN=BP13.F500.SEQUENCE.SERSA810,DISP=OLD                         
//INPUT2   DD  DSN=BP13.F558.UPGOCCP.SERS,DISP=SHR                              
//OUTPUT2  DD  DSN=BP13.F558.UPGOCCP.SERSA810,DISP=OLD                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*---------------------------------------------------------------------        
//* BACKUP BP13.K740.MATUREBA.SERS BEFORE DETERMINE HOUSEHOLD TYPE              
//*        AND AFTER PREMIUM                                                    
//*---------------------------------------------------------------------        
//STEP22   EXEC PGM=IDCAMS                                                      
//INPUT1   DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.SERS,DISP=OLD                              
//OUTPUT2  DD DSN=BP13.F740.MATUREBA.SERSA810,DISP=OLD                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                     
//*====================================================================         
//*((((((         NEW JOB STREAM WEF 20110213     )))))))))                     
//*====================================================================         
//* INCLUDE NEW JOBSTEP TO DETERMINE HOUSEHOLD TYPE                             
//*---------------------------------------------------------------------        
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.SERSREQ,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F730.SERSREQ,DISP=OLD                                    
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     OMIT COND=(123,8,CH,EQ,C'        ')                                        
//*---------------------------------------------------------------------        
//* SORT OCCUPIER FILE IN REGNO NRIC SEQUENCE                                   
//*---------------------------------------------------------------------        
//STEP31   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.K825.REQOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F825.SERSOCCP,DISP=OLD                                   
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A,9,9,A),FORMAT=CH                                           
//*---------------------------------------------------------------------        
//* SORT ADDRESS  FILE IN REGNO SEQUENCE                                        
//*---------------------------------------------------------------------        
//STEP32   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.K830.ADDR,DISP=SHR                                       
//SORTOUT  DD DSN=BP13.F830.SERSADDR,DISP=OLD                                   
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  OUTREC FIELDS=(20,8,9,242)                                                    
//*---------------------------------------------------------------------        
//* SORT ADDRESS  FILE IN REGNO SEQUENCE                                        
//*---------------------------------------------------------------------        
//STEP33   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F830.SERSADDR,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F830.SERSADDR,DISP=OLD                                   
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* SORT EMAIL  FILE IN REGNO SEQUENCE                                          
//*---------------------------------------------------------------------        
//STEP34   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.BP13K857.EMAIL,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F857.SRSEMAIL,DISP=OLD                                   
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//*   END OF BP13A810                                                           
//*---------------------------------------------------------------------        
