//BP13D218 JOB (BP13P),'BP13D218',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* BOOKING DASHBOARD                                                           
//* BOOKING DATA LOAD TO SASVA DATABASE                                         
//* START FROM YEAR 2016 AS CUT-OFF-DATE                                        
//*---------------------------------------------------------------------        
//* CHG-NO   BY   ON      - REMARK                                              
//* ------------------------------                                              
//* BP136299 LSB 12052017 - NEW JCL                                             
//* BP136856 LSB 27062017 - BACKUP DATA WHEN MGPS,BOOKING EX IS OVER            
//* BP138565 LSB 01022021 - ADD FT=1F                                           
//* BP139057 LSB 28022022 - &&FW3CTEMP IN STEP18                                
//*=================================================================            
//*---------------------------------------------------------------------        
//* SORT BP13K249 BY KEY-FLD                                                    
//*---------------------------------------------------------------------        
//SORT03 EXEC  SORT,COND=(0,NE)                                                 
//SORTIN   DD  DSN=BP13.K249.NT.FT,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13F249,DISP=(NEW,PASS),                                  
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                                 
//         SPACE=(CYL,(8,5),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(33,6,A,30,3,A,1,20,A,21,9,A,39,1,A),FORMAT=CH                    
  INCLUDE COND=(33,6,CH,GE,C'201611',AND,                                       
               (30,3,CH,EQ,C'BTO',OR,30,3,CH,EQ,C'SBF'))                        
//*-----------------------------------------------------------------            
//* OUTPUT F249 TO FW3C BY NT/FT                                                
//*-----------------------------------------------------------------            
//STEP04 EXEC PGM=BP13C92J,COND=(0,NE)                                          
//BP13F249 DD DSN=&&BP13F249,DISP=(OLD,DELETE)                                  
//BP13K240 DD DSN=BP13.K240.HEADFLAT,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K241 DD DSN=BP13.K240.HEADFLAT.PATH4,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FW3C DD DSN=&&FW3CPROJ,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------    00130010
//* GET PROJECT NAME FROM BP13K813                                              
//*-----------------------------------------------------------------            
//STEP4A   EXEC  PGM=BP13C95J,COND=(0,NE)                                       
//BP13FW3C DD DSN=&&FW3CPROJ,DISP=(OLD,PASS)                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13FW3CA DD DSN=BP13.FW3C.BOOKSUM.DAILY,DISP=OLD                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
//*------------------------------------------------------------------           
//*---------------------------------------------------------------------        
//* SORT BP13F200 BY NUM-REGN                                                   
//*---------------------------------------------------------------------        
//SORT05 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K200.BKAPPMT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&BP13F200,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(121,3,A,50,6,A,9,5,A,38,8,A,14,8,A),FORMAT=CH                    
  INCLUDE COND=(50,6,CH,GE,C'201611')                                           
//*-----------------------------------------------------------------            
//* MATCH F200 TO K268 TO OUTPUT FW3D                                           
//*-----------------------------------------------------------------            
//STEP06 EXEC PGM=BP13C92K,COND=(0,NE)                                          
//BP13F200 DD DSN=&&BP13F200,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K268 DD DSN=BP13.K268.REGN,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K261 DD DSN=BP13.K268.REGN.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KH15 DD DSN=BP13.KH15.NOTBKREG,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KH11 DD DSN=BP13.KH15.NOTBKREG.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FW3D DD DSN=BP13.FW3D.BOOKDATA.DAILY,DISP=OLD,                            
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0),                               
//            SPACE=(CYL,(30,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BP13FW3C IN NT/FT/MODE/DTE-BALLOT                                      
//*---------------------------------------------------------------------        
//SORT07 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.FW3C.BOOKSUM.DAILY,DISP=SHR                              
//SORTOUT  DD DSN=&&FW3CC92E,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,14,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* SORT BP13FW3D IN NT/FT/MODE/DTE-BALLOT                                      
//*---------------------------------------------------------------------        
//SORT08 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.FW3D.BOOKDATA.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&FW3D2F,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,14,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1F',OR,4,2,CH,EQ,C'2F')                             
  OUTREC FIELDS=(1,4,C' ',6,295)                                                
//*---------------------------------------------------------------------        
//* SORT BP13FW3D IN NT/FT/MODE/DTE-BALLOT                                      
//*---------------------------------------------------------------------        
//SORT09 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.FW3D.BOOKDATA.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&FW3DOTH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,14,A),FORMAT=CH                                                
  OMIT COND=(4,2,CH,EQ,C'1F',OR,4,2,CH,EQ,C'2F')                                
//*---------------------------------------------------------------------        
//* SORT BP13FW3D IN NT/FT/MODE/DTE-BALLOT                                      
//*---------------------------------------------------------------------        
//SORT10 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&FW3D2F,DISP=(OLD,PASS)                                      
//         DD DSN=&&FW3DOTH,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&FW3DC92E,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,14,A),FORMAT=CH                                                
//*-------------------------------------------------------------------- 00000050
//* UPDATE TOTAL PAIR MGPS APPL/BOOK, INVITED, CANCEL, BALLOTED         00000050
//*-------------------------------------------------------------------- 00000050
//STEP11   EXEC PGM=BP13C92E,COND=(0,NE)                                00002680
//BP13FW3C DD DSN=&&FW3CC92E,DISP=(OLD,PASS)                            00002710
//BP13FW3D DD DSN=&&FW3DC92E,DISP=(OLD,PASS)                            00002710
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               00002710
//BP13KQ60 DD DSN=BP13.KQ60.LAST.QUEUE,DISP=SHR,                        00002710
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K76A DD DSN=BP13.K76A.SALEHIST,DISP=SHR,                          00002710
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13FW3CA DD DSN=BP13.FW3C.BOOKSUM.DAILY,DISP=OLD                      00002710
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
//*---------------------------------------------------------------------        
//* INCLUDE 1ST-SALES-DATE > 2016 OR BLANK                                      
//* SORT BM06F130 IN PROJECT NAME/EST/N/C//BLK                                  
//*---------------------------------------------------------------------        
//SORT12 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BM06.F130.BLOCK.PIDB,DISP=SHR                                 
//SORTOUT  DD DSN=&&BM06F130,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(527,40,A,1,16,A),FORMAT=CH                                       
  INCLUDE COND=((425,4,CH,EQ,C'0000'),AND,                                      
               (417,4,CH,GE,C'2016',OR,417,4,CH,EQ,C'0000'))                    
//*-------------------------------------------------------------------- 00000050
//* CREATE BP13FW3E FROM BM06F130 BY BTO PROJECT                        00000050
//*-------------------------------------------------------------------- 00000050
//STEP13   EXEC PGM=BP13C92Y,COND=(0,NE)                                00002680
//BM06F130 DD DSN=&&BM06F130,DISP=(OLD,PASS)                            00002710
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FW3E DD DSN=BP13.FW3E.PROJECT,DISP=OLD                            00002710
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
//*---------------------------------------------------------------------        
//* SORT BP13FW3E BY PROJECT NAME                                               
//*---------------------------------------------------------------------        
//SORT14 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.FW3E.PROJECT,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FW3E,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,28,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* SORT BP13K230 IN NT/FT/MODE/DTE-BALLOT                                      
//*---------------------------------------------------------------------        
//SORT15 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K230.FLATLIST,DISP=SHR                                   
//SORTOUT  DD DSN=&&F230C92W,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450,BLKSIZE=27900),                
//            SPACE=(CYL,(80,20),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(246,20,A,229,8,A),FORMAT=CH                                      
  INCLUDE COND=(108,3,CH,EQ,C'BTO',AND,                                         
                117,6,CH,GE,C'201611')                                          
//*-------------------------------------------------------------------- 00000050
//* COMPUTE UNIT OFFER/BOOK BY NT/N/C, BTO PROJECT                      00000050
//*-------------------------------------------------------------------- 00000050
//STEP16   EXEC PGM=BP13C92W,COND=(0,NE)                                00002680
//BP13FW3E DD DSN=&&BP13FW3E,DISP=(OLD,PASS)                            00002710
//BP13F230 DD DSN=&&F230C92W,DISP=(OLD,PASS)                            00002710
//P13FW3EA DD DSN=BP13.FW3E.PROJECT,DISP=OLD                            00002710
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
//*---------------------------------------------------------------------        
//* SORT BP13FW3E BY PROJECT NAME                                               
//*---------------------------------------------------------------------        
//SORT17 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.FW3E.PROJECT,DISP=SHR                                    
//SORTOUT  DD DSN=&&FW3EPROJ,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(35,40,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* BY BTO PORJECT NAME                                                         
//*---------------------------------------------------------------------        
//SORT18 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.FW3C.BOOKSUM.DAILY,DISP=SHR                              
//SORTOUT  DD DSN=&&FW3CTEMP,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(77,180,A,1,14,A),FORMAT=CH                                       
  INCLUDE COND=(6,3,CH,EQ,C'BTO')                                               
//*-------------------------------------------------------------------- 00000050
//* UPDATE PROJECT UNIT/BOOK TO BP13FW3C                                00000050
//*-------------------------------------------------------------------- 00000050
//STEP19   EXEC PGM=BP13C924,COND=(0,NE)                                00002680
//BP13FW3C DD DSN=&&FW3CTEMP,DISP=(OLD,PASS)                            00002710
//BP13FW3E DD DSN=&&FW3EPROJ,DISP=(OLD,PASS)                            00002710
//P13FW3CA DD DSN=&&FW3CC924,DISP=(,PASS),                              00002710
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
//*---------------------------------------------------------------------        
//* BY FW3C-KEY, TOTAL-APPL DESCENDING ORDER                                    
//*---------------------------------------------------------------------        
//SORT20 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&FW3CC924,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FW3CC93K,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,15,A,327,5,D),FORMAT=CH                                        
//*-------------------------------------------------------------------- 00000050
//* ADD MGPS FLAT BY PROJECT                                            00000050
//*-------------------------------------------------------------------- 00000050
//STEP21   EXEC PGM=BP13C93K,COND=(0,NE)                                00002680
//BP13FW3C DD DSN=&&FW3CC93K,DISP=(OLD,PASS)                            00002710
//P13FW3CA DD DSN=BP13.FW3C.BOOKSUM.NEW,DISP=OLD                        00002710
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
//*---------------------------------------------------------------------        
//* ADD SBF TO BP13FW3C                                                         
//* SORT BP13FW3C IN NT/FT/MODE/DTE-BALLOT                                      
//*---------------------------------------------------------------------        
//STEP22 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.FW3C.BOOKSUM.DAILY,DISP=SHR                              
//SORTOUT  DD DSN=BP13.FW3C.BOOKSUM.NEW,DISP=MOD                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(6,3,CH,NE,C'BTO')                                               
//*--------------------------------------------------------------------         
//* REPRO FILE TO SQL TABLE                                                     
//*--------------------------------------------------------------------         
//STEP23   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FW3D.BOOKDATA.DAILY,DISP=SHR                             
//OUTPUT1  DD DSN=BP13.FW3D.BOOKDATA.NEW,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------00000030
//* MATCH FA20 WITH FA30 TO GENERATE FW3C AND FW3D BY PROJECT                   
//*---------------------------------------------------------------------        
//STEP24   EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD DSN=BP13.KA20.BLOCK,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13FA20,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,5),                                                   
//            DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB),                           
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,3,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
  OMIT COND=(1,8,CH,EQ,C'        ')                                             
//*---------------------------------------------------------------------00000030
//*SORT FA30 FOR DBSS, EC                                                       
//*---------------------------------------------------------------------        
//STEP25   EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD DSN=BP13.KA30.UNIT,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13FA30,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,5),                                                   
//            DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB),                           
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,3,A,73,8,A),FORMAT=CH                                          
  OMIT COND=(1,8,CH,EQ,C'        ')                                             
//*-------------------------------------------------------------------- 00000050
//* OUTPUT BOOKED EC UNITS TO SASVA DATABASE                            00000050
//*-------------------------------------------------------------------- 00000050
//STEP26  EXEC   PGM=BP13C92C,COND=(0,NE)                               00002680
//BP13FA20 DD  DSN=&&BP13FA20,DISP=(OLD,PASS)                           00002710
//BP13FA30 DD  DSN=&&BP13FA30,DISP=(OLD,PASS)                           00002710
//BP13KA10 DD  DSN=BP13.KA10.PRJCT,DISP=SHR,                            00002710
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13KB20 DD  DSN=BP13.KB20.DBSBK,DISP=SHR,                            00002710
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13FW3C DD  DSN=BP13.FW3C.BOOKSUM.NEW,DISP=MOD                       00002710
//BP13FW3D DD  DSN=BP13.FW3D.BOOKDATA.NEW,DISP=MOD                      00002710
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//*---------------------------------------------------------------------        
//* OMIT RECORD TAGGED WITH 'B' MGPS IS OVER                                    
//*---------------------------------------------------------------------        
//STEP26 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.FW3C.BOOKSUM.NEW,DISP=SHR                                
//SORTOUT  DD DSN=&&FW3CC93P,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                    
//            SPACE=(CYL,(30,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,14,A),FORMAT=CH                                                
  OMIT COND=(453,1,CH,EQ,C'B')                                                  
//*---------------------------------------------------------------------        
//* MATCH FW3C WITH K813, IF MGPS OR BOOKING EX COMPLETED               00000050
//*-------------------------------------------------------------------- 00000050
//STEP27   EXEC PGM=BP13C93P,COND=(0,NE)                                00002680
//BP13FW3C DD DSN=&&FW3CC93P,DISP=(OLD,PASS)                            00002710
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KW3C DD DSN=BP13.KW3C.BOOKSUM,DISP=SHR,                           00002710
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
//*---------------------------------------------------------------------        
//* MATCH NOT FOUND, NEW RECORD                                         00000050
//* MATCH FOUND, IF COMPLETE = BLANK, UPDATE RECORD                     00000050
//* MATCH FOUND, IF COMPLETE = M, DO NOT UPDATE MGPS DATA               00000050
//* MATCH FOUND, IF COMPLETE = B, NO UPDATE                             00000050
//*-------------------------------------------------------------------- 00000050
//STEP28   EXEC PGM=BP13C93R,COND=(0,NE)                                00002680
//BP13FW3C DD DSN=&&FW3CC93P,DISP=(OLD,PASS)                            00002710
//BP13KW3C DD DSN=BP13.KW3C.BOOKSUM,DISP=SHR                            00002710
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
//*---------------------------------------------------------------------        
//* OMIT RECORD TAGGED WITH 'B' MGPS IS OVER                                    
//*---------------------------------------------------------------------        
//STEP29 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.FW3D.BOOKDATA.NEW,DISP=SHR                               
//SORTOUT  DD DSN=&&FW3DC93Q,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900),        00035400
//            SPACE=(CYL,(100,20),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,14,A),FORMAT=CH                                                
  OMIT COND=(208,1,CH,EQ,C'B')                                                  
//*---------------------------------------------------------------------        
//* MATCH FW3D WITH K813, IF MGPS OR BOOKING EX COMPLETED               00000050
//*-------------------------------------------------------------------- 00000050
//STEP30   EXEC PGM=BP13C93Q,COND=(0,NE)                                00002680
//BP13FW3D DD DSN=&&FW3DC93Q,DISP=(OLD,PASS)                            00002710
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KW3D DD DSN=BP13.KW3D.BOOKDATA,DISP=SHR,                          00002710
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
//*---------------------------------------------------------------------        
//* MATCH NOT FOUND, NEW RECORD                                         00000050
//* MATCH FOUND, IF COMPLETE = BLANK, UPDATE RECORD                     00000050
//* MATCH FOUND, IF COMPLETE = M, DO NOT UPDATE MGPS DATA               00000050
//* MATCH FOUND, IF COMPLETE = B, NO UPDATE                             00000050
//*-------------------------------------------------------------------- 00000050
//STEP31   EXEC PGM=BP13C93S,COND=(0,NE)                                00002680
//BP13FW3D DD DSN=&&FW3DC93Q,DISP=(OLD,PASS)                            00002710
//BP13KW3D DD DSN=BP13.KW3D.BOOKDATA,DISP=SHR                           00002710
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
//*--------------------------------------------------------------------         
//* REPRO FILE TO SQL TABLE                                                     
//*--------------------------------------------------------------------         
//STEP32   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KW3C.BOOKSUM,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//OUTPUT1  DD DSN=BP13.FW3C.BOOKSUM,DISP=OLD                                    
//INPUT2   DD DSN=BP13.KW3D.BOOKDATA,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//OUTPUT2  DD DSN=BP13.FW3D.BOOKDATA,DISP=OLD                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-------------------------------------------------------------------- 00000050
//* BACKUP SALES SUMMARY DATA                                                   
//*-------------------------------------------------------------------- 00000050
//STEP33   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FW3C.BOOKSUM,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.FW3C.BOOKSUM.BKUP(+1),DISP=(NEW,CATLG),                  
//         SPACE=(CYL,(50,20),RLSE),                                    00035300
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                       00035400
//INPUT2   DD DSN=BP13.FW3D.BOOKDATA,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.FW3D.BOOKDATA.BKUP(+1),DISP=(NEW,CATLG),                 
//         SPACE=(CYL,(150,50),RLSE),                                   00035300
//         DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                       00035400
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT1) OFILE(OUTPUT1)                                        
      REPRO IFILE(INPUT2) OFILE(OUTPUT2)                                        
//*---------------------------------------------------------------------        
