//BP13D403 JOB (BP13P),'BP13D403',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*---------------------------------------------------------------              
//*- D A I L Y   J O B  -  TO RUN AT 11 PM                                      
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                  
//*BP133811 PCL 050109 - INCLUDE BP13K096(STEP 12)                              
//*BP136030 LSB 020216 - GENERATE REPORT FOR OT STAFF                           
//*--------------------------------------------------------------------         
//STEP01   EXEC  PGM=IDCAMS                                                     
//INPUT1   DD  DSN=BP13.K860.USER,                                              
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BP13.K870.PANEL,                                             
//             DISP=OLD                                                         
//INPUT3   DD  DSN=BP13.K096.SECURITY,                                          
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1          (APPLICATION TEAM)                             
//*=============================================================                
//PRT01    EXEC  PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1                                    
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*      TO BACKUP DATASETS                                                     
//*---------------------------------------------------------------------        
//STEP02   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K860.USER,                                              
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F860.USER,                                              
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BP13.K870.PANEL,                                             
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.F870.PANEL,                                             
//             DISP=OLD                                                         
//INPUT3   DD  DSN=BP13.K096.SECURITY,                                          
//             DISP=SHR                                                         
//OUTPUT3  DD  DSN=BP13.F096.SECURITY,                                          
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*--------------------------------------------------------------------         
//* INCLUDE  OVERTIME STAFF RECORDS FROM BP13K860 - SECURITY USER FILE          
//*--------------------------------------------------------------------         
//STEP2A   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K860.USER,                                              
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F860.USER.OT,DISP=MOD                           00040010
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,9,A),FORMAT=CH                                               
    INCLUDE COND=(41,1,CH,EQ,C'Y')                                              
//*--------------------------------------------------------------------         
//* INCLUDE  OVERTIME STAFF RECORDS FROM BP13K870 - SECURITY USER FILE          
//*--------------------------------------------------------------------         
//STEP2B   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K870.PANEL,                                             
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F870.PANEL.OT,DISP=MOD                          00040010
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,9,A),FORMAT=CH                                               
    INCLUDE COND=(15,1,CH,EQ,C'Y')                                              
//*--------------------------------------------------------------------         
//* INCLUDE  OVERTIME STAFF RECORDS FROM BP13K096 - SECURITY USER FILE          
//*--------------------------------------------------------------------         
//STEP2C   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K096.SECURITY,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F096.SECURITY.OT,DISP=MOD                       00040010
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,9,A),FORMAT=CH                                               
    INCLUDE COND=(120,1,CH,EQ,C'Y')                                             
//*--------------------------------------------------------------------         
//*  TO OMIT OVERTIME STAFF RECORDS FROM BP13K860 - SECURITY USER FILE          
//*--------------------------------------------------------------------         
//STEP03   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K860.USER,                                              
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F860,                                          00040010
//             DISP=(NEW,PASS),                                         00040010
//             UNIT=3380,                                               00050006
//             SPACE=(TRK,(20,10),RLSE),                                00050006
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720)                    00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,9,A),FORMAT=CH                                               
    OMIT COND=(41,1,CH,EQ,C'Y')                                                 
//*--------------------------------------------------------------------         
//*  TO DEFINE BP13.K860.USER                                           00020004
//*--------------------------------------------------------------------         
//STEP04   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00030000
//SYSPRINT DD  SYSOUT=*                                                 00040000
//INPUT1   DD  DSN=&&BP13F860,                                          00040010
//             DISP=(SHR,DELETE)                                        00040010
//SYSIN    DD  *                                                        00050000
  DEL (BP13.K860.USER) CL PURGE                                         001     
  DEF CLUSTER                                         -                 001     
        (NAME(BP13.K860.USER)                         -                   001   
        SHAREOPTIONS(2,3)                             -                   001   
        RECSZ(80 80)                                  -                   001   
        KEYS(9 0)                                     -                   001   
        TRK(20 10)                                    -                   001   
        CISZ(4096)                                    -                   001   
        STORCLAS(PRODRLS)                             -                         
        LOG(NONE)                                     -                         
        INDEXED                                       -                   001   
        UNIQUE)                                       -                   001   
      DATA                                            -                       00
        (NAME(BP13.K860.USER.DATA))                   -                   001   
      INDEX                                           -                       00
        (NAME(BP13.K860.USER.INDEX))                                      001   
      IF MAXCC = 0  THEN                              -                 00033818
         REPRO IFILE(INPUT1)                          -                 00033918
              ODS(BP13.K860.USER)                     -                 00034018
               REUSE                                                            
         IF MAXCC = 0 THEN                            -                         
           DEF AIX (NAME(BP13.K860.USER.ALTX1)        -                         
               REL(BP13.K860.USER)                    -                         
               TRK(10 5)                              -                         
               SHR(2 3)                               -                         
               UNIQUE                                 -                         
               KEYS(1 8)                              -                         
               CISZ(4096)                             -                   001   
               RECSZ(906 5000)                        -                         
               NUNQK)                                                           
         IF LASTCC = 0 THEN                           -                         
           DEF PATH(NAME(BP13.K860.USER.PATH1)        -                         
               PENT(BP13.K860.USER.ALTX1))                                      
         IF LASTCC = 0 THEN                           -                         
           BIX IDS(BP13.K860.USER)                    -                         
               ODS(BP13.K860.USER.ALTX1)                                        
//*--------------------------------------------------------------------         
//*  TO OMIT OVERTIME STAFF RECORDS FROM BP13K870 - SECURITY PANEL FILE         
//*--------------------------------------------------------------------         
//STEP05   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K870.PANEL,                                             
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F870,                                          00040010
//             DISP=(NEW,PASS),                                         00040010
//             UNIT=3380,                                               00050006
//             SPACE=(TRK,(50,25),RLSE),                                00050006
//             DCB=(RECFM=FB,LRECL=30,BLKSIZE=32760)                    00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,13,A),FORMAT=CH                                              
    OMIT COND=(15,1,CH,EQ,C'Y')                                                 
//*--------------------------------------------------------------------         
//*  TO DEFINE BP13.K870.PANEL                                          00020004
//*--------------------------------------------------------------------         
//STEP06   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00030000
//SYSPRINT DD  SYSOUT=*                                                 00040000
//INPUT1   DD  DSN=&&BP13F870,                                          00040010
//             DISP=(SHR,DELETE)                                        00040010
//SYSIN    DD  *                                                        00050000
  DEL (BP13.K870.PANEL) CL PURGE                                        001     
  DEF CLUSTER                                         -                 001     
        (NAME(BP13.K870.PANEL)                        -                   001   
        SHAREOPTIONS(2,3)                             -                   001   
        RECSZ(30 30)                                  -                   001   
        KEYS(13 0)                                    -                   001   
        TRK(50 25)                                    -                   001   
        CISZ(4096)                                    -                   001   
        STORCLAS(PRODRLS)                             -                         
        LOG(NONE)                                     -                         
        INDEXED                                       -                   001   
        UNIQUE)                                       -                   001   
      DATA                                            -                       00
        (NAME(BP13.K870.PANEL.DATA))                  -                   001   
      INDEX                                           -                       00
        (NAME(BP13.K870.PANEL.INDEX))                                     001   
      IF MAXCC = 0  THEN                              -                 00033818
         REPRO IFILE(INPUT1)                          -                 00033918
              ODS(BP13.K870.PANEL)                    -                 00034018
               REUSE                                                            
         IF MAXCC = 0 THEN                            -                         
           DEF AIX (NAME(BP13.K870.PANEL.ALTX1)       -                         
               REL(BP13.K870.PANEL)                   -                         
               TRK(20 10)                             -                         
               SHR(2 3)                               -                         
               UNIQUE                                 -                         
               KEYS(5 8)                              -                         
               CISZ(4096)                             -                   001   
               RECSZ(8000 8000)                       -                         
               NUNQK)                                                           
         IF LASTCC = 0 THEN                           -                         
           DEF PATH(NAME(BP13.K870.PANEL.PATH1)       -                         
               PENT(BP13.K870.PANEL.ALTX1))                                     
         IF LASTCC = 0 THEN                           -                         
           BIX IDS(BP13.K870.PANEL)                   -                         
               ODS(BP13.K870.PANEL.ALTX1)                                       
//*-------------------------------------------------------------------- 00130052
//*  ACCUMULATE THE USER AND ACCESS LOG REC TO ACCUM FILES                      
//*-------------------------------------------------------------------- 00130052
//STEP07   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K868.USER.LOG,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F868.USER.LOG.ACCUM,                                    
//             DISP=MOD                                                         
//INPUT2   DD  DSN=BP13.K878.PANEL.LOG,                                         
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.F878.PANEL.LOG.ACCUM,                                   
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
      REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                     
//*--------------------------------------------------------------------         
//*  TO DEFINE BP13.K868.USER.LOG                                       00020004
//*--------------------------------------------------------------------         
//STEP08   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00030000
//SYSPRINT DD  SYSOUT=*                                                 00040000
//INPUT1   DD  DSN=BP13.BLANK.CHAR200,                                  00040010
//             DISP=SHR                                                 00040010
//SYSIN    DD  *                                                        00050000
  DEL 'BP13.K868.USER.LOG' CL PURGE                                     001     
  DEF CLUSTER                                         -                 001     
        (NAME(BP13.K868.USER.LOG)                     -                   001   
        SHAREOPTIONS(2,3)                             -                   001   
        RECSZ(200 200)                                -                   001   
        KEYS(26 0)                                    -                   001   
        TRK(20 10)                                    -                   001   
        CISZ(4096)                                    -                   001   
        STORCLAS(PRODRLS)                             -                         
        LOG(NONE)                                     -                         
        INDEXED                                       -                   001   
        UNIQUE)                                       -                   001   
      DATA                                            -                       00
        (NAME(BP13.K868.USER.LOG.DATA))               -                   001   
      INDEX                                           -                       00
        (NAME(BP13.K868.USER.LOG.INDEX))                                  001   
      IF MAXCC = 0  THEN                              -                 00033818
         REPRO IFILE(INPUT1)                          -                 00033918
              ODS(BP13.K868.USER.LOG)                                   00034018
//*--------------------------------------------------------------------         
//*  TO DEFINE BP13.K878.PANEL.LOG                                      00020004
//*--------------------------------------------------------------------         
//STEP09   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00030000
//SYSPRINT DD  SYSOUT=*                                                 00040000
//INPUT1   DD  DSN=BP13.BLANK.CHAR100,                                  00040010
//             DISP=SHR                                                 00040010
//SYSIN    DD  *                                                        00050000
  DEL 'BP13.K878.PANEL.LOG' CL PURGE                                    001     
  DEF CLUSTER                                         -                 001     
        (NAME(BP13.K878.PANEL.LOG)                    -                   001   
        SHAREOPTIONS(2,3)                             -                   001   
        RECSZ(100 100)                                -                   001   
        KEYS(26 0)                                    -                   001   
        TRK(50 25)                                    -                   001   
        CISZ(4096)                                    -                   001   
        STORCLAS(PRODRLS)                             -                         
        LOG(NONE)                                     -                         
        INDEXED                                       -                   001   
        UNIQUE)                                       -                   001   
      DATA                                            -                       00
        (NAME(BP13.K878.PANEL.LOG.DATA))              -                   001   
      INDEX                                           -                       00
        (NAME(BP13.K878.PANEL.LOG.INDEX))                                 001   
      IF MAXCC = 0  THEN                              -                 00033818
         REPRO IFILE(INPUT1)                          -                 00033918
              ODS(BP13.K878.PANEL.LOG)                                  00034018
//*--------------------------------------------------------------------         
//* BACKUP FILE BP13K648 BEFORE DELETE                                          
//*--------------------------------------------------------------------         
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K648.BANKLOAN,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F648.BANKLOAN,DISP=OLD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*--------------------------------------------------------------------         
//*TO DELETE RECORDS FROM BP13K648 AFTER KEY-ISSED                              
//*--------------------------------------------------------------------         
//STEP11   EXEC PGM=BP13C018,COND=(0,NE)                                        
//BP13F410 DD DSN=BP13.F410.DAILYSO,DISP=SHR                                    
//BP13K648 DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//*  TO OMIT OVERTIME STAFF RECORDS FROM BP13K096 - SECURITY USER FILE          
//*--------------------------------------------------------------------         
//STEP12   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K096.SECURITY,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F096,                                          00040010
//             DISP=(NEW,PASS),                                         00040010
//             UNIT=3380,                                               00050006
//             SPACE=(TRK,(1,1),RLSE),                                  00050006
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)                   00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(12,6,A),FORMAT=CH                                              
    OMIT COND=(120,1,CH,EQ,C'Y')                                                
//*--------------------------------------------------------------------         
//*  TO DEFINE BP13.K096.SECURITY                                       00020004
//*--------------------------------------------------------------------         
//STEP13   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00030000
//SYSPRINT DD  SYSOUT=*                                                 00040000
//INPUT1   DD  DSN=&&BP13F096,                                          00040010
//             DISP=(SHR,DELETE)                                        00040010
//SYSIN    DD  *                                                        00050000
          DEL (BP13.K096.SECURITY) CL PURGE                                     
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K096.SECURITY)              -                  00810000
              CYL(5 5)                               -                  00830000
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K096.SECURITY.DATA)         -                  00870000
              KEYS(6 11)                            -                   00880000
              RECSZ(200 200)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K096.SECURITY.INDEX)        -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K096.SECURITY)                                   00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.K096.SECURITY.ALTX1)   -                  00980000
               REL(BP13.K096.SECURITY)               -                  00990000
               REUSE                                 -                  01010000
               KEYS(17 0)                            -                  01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.K096.SECURITY.ALTX1.DATA)  -                  01070000
               CYL(3 2)                              -                  01080000
               RECSZ(31 354)                         -                  01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.K096.SECURITY.ALTX1.INDEX) -                  01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.K096.SECURITY.PATH1)  -                  01160000
               PENT(BP13.K096.SECURITY.ALTX1))                          01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.K096.SECURITY)               -                  01190000
               ODS(BP13.K096.SECURITY.ALTX1)                            01200000
