//BP13AMCP  JOB (BP13P),'BP13AMCP',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================*           
//* DETERMINE APPA - AGEING INPALCE SCHEME                                      
//*=================================================================*           
//* CHGE REQ  DATE      BY   DESCRIPTION                            *           
//* --------  ----      ---  -----------                            *           
//* BP134482  15032013  LSB1 NEW JCL                                *           
//* BP134922  04062013  IMC1 MOVE BP13CFZA AND BP13CFZB TO BP13D506 *           
//* BP135254  15042014  SMR2 DELETE UNUSED FILE (BP13K816)          *           
//* BP136007  14112015  IL5  DETERMINE APPS FOR FLAT TYPE 2F        *           
//* BP136609  20062017  SMR2 REMOVE BB29 FILES IN BP13C014          *           
//* BP136852  23062017  SMR2 BYPASS ROF APPLNS FOR DETERMINATION OF *           
//*                          APPS (SENIOR PRIORITY SCHEME)          *           
//* BP138285  05052020  AM25 HARDCOPY REPORTS CONVERSION            *           
//*           05062020  AM25 REMOVE DJDE STEPS                      *           
//* BP138565  29012021  LSB1 APPS NOT APPLICABLE FOR 1F             *           
//* BP139780  06122023  AM25 ADD STEP01A TO EXTRACT K730 BASED ON   *           
//*                          DAILY FILE                             *           
//*=================================================================*           
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*--------------------------------------------------------------------         
//* SORT OUT CASES FROM BP13K730 FILE                                           
//*--------------------------------------------------------------------         
//STEP01A  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&P13F730A,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* ONLY FOR BTO/SBF, SA FLAT TYPE                                              
//*--------------------------------------------------------------------         
//STEP01B EXEC SORT,COND=(0,NE)                                                 
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=&&P13F730A,DISP=(OLD,DELETE)                                   
//SORTOUT DD DSN=&&BP13F730,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN   DD  *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(376,3,CH,NE,C'DBS',AND,                                         
                376,3,CH,NE,C'EC ',AND,                                         
                376,3,CH,NE,C'NPL',AND,                                         
                376,3,CH,NE,C'ROF',AND,                                         
                211,2,CH,EQ,C'2F',AND,                                          
               (210,1,CH,EQ,C'F',OR,                                            
                210,1,CH,EQ,C'S'),AND,                                          
                245,1,CH,EQ,C' ')                                               
//*--------------------------------------------------------------------         
//* APPS SCHEME - APPLICANTS MUST BE EXISTING LESSEE                            
//*             - IF NOT FOUND IN SMS, TAG 'P' IN APPS-ELIG-TAG                 
//*--------------------------------------------------------------------         
//STEP02   EXEC  PGM=BP13CZ15,COND=(0,NE)                                       
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F730F DD DSN=BP13.F730.APPSSMSF,DISP=OLD                                   
//P13F730N DD DSN=BP13.F730.APPSSMSN,DISP=OLD                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* IF FOUND AS LESSEE, SORT BY SCH-ACC-NO                                      
//*--------------------------------------------------------------------         
//STEP03  EXEC SORT,COND=(0,NE)                                                 
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F730.APPSSMSF,DISP=SHR                                    
//SORTOUT DD DSN=&&F730SCHM,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN   DD  *                                                                 
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* IF FOUND AS LESSEE, CHECK FOR SAME ESTATE NEW TOWN - TAG '1' ELIG           
//* IF NT NOT EQUAL, CONTINUE TO CHECK 2KM                                      
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=BP13CZ16,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730SCHM,DISP=(OLD,PASS)                                    
//AB03F089 DD DSN=AB03.F089.PIDB,DISP=SHR                                       
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F730F DD DSN=BP13.F730.APPSNT,DISP=OLD                                     
//P13F730N DD DSN=BP13.F730.APPSNTNO,DISP=OLD                                   
//BP13F725 DD DSN=BP13.F725.SMSADDR,DISP=OLD                                    
//P13F725A DD DSN=BP13.F725.SMSFLAT,DISP=OLD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* IF FOUND AS LESSEE, CHECK FOR 2KM SORT BY NRIC                              
//* PUT NRIC1 IN COL 325 RESIDENT-NRIC1                                         
//*--------------------------------------------------------------------         
//STEP05  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F730.APPSNTNO,DISP=SHR                                    
//SORTOUT DD DSN=&&F730KM2,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN   DD  *                                                                 
  SORT FIELDS=(325,9,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* SORT BY NRIC                                                                
//*------------------------------------------------------------------           
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F725.SMSADDR,DISP=SHR                                    
//SORTOUT  DD DSN=&&F725KM2,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA),                                                     
//            DCB=(BLKSIZE=0,LRECL=211,RECFM=FB),                               
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//*  TO DETERMINE 2KM ELIGIBILITY AND PRINT REPORTS                             
//*  TO UPDATE APPA-ELIG-TAG = 'T' FOR > 2KM DISTANCE                           
//*  TO PRINT REPORT ON NON-HDB ADDRESS FOR MANUAL PROCESS                      
//*  FOR NON-HDB TAG 'P' AS INELIG                                              
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C014,REGION=1500K                                       
//BP13F730 DD DSN=&&F730KM2,DISP=(OLD,PASS)                                     
//BP13F725 DD DSN=&&F725KM2,DISP=(OLD,PASS)                                     
//BP13K016 DD DSN=BP13.K016.POSTAL,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//EJ03K320 DD DSN=EJ03.K320.ALLBLDG.COORD,DISP=SHR,                             
//         AMP=('BUFND=23')                                                     
//P13L014A DD SYSOUT=*                                                          
//P13L014B DD SYSOUT=*                                                          
//P13L014C DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON APPS                                                        
//*--------------------------------------------------------------------         
//STEP08   EXEC PGM=BP13CZ18,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LZ18 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* ACUUM SMS ADDRESS FILE                                                      
//*--------------------------------------------------------------------         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F725.SMSADDR,DISP=SHR                                    
//         DD DSN=BP13.F725.SMSFLAT,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F725.SMSADDR.ACCUM,DISP=MOD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*------------------------------------------------------------------           
