//BP13A636 JOB (BP13P),'BP13A636',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//*====================================================================         
//*  PRINT REPORT FOR APPLICANTS WHO HAVE BOOKED A FLAT                         
//*   - EXCLUDE CANCELLED CASES (COL 1 = 'C')                                   
//*=====================================================================        
//* CHGE REQ  BY    DDMMCCYY  DESCRIPTION                                       
//* --------  ----  --------  -----------------------------------------         
//* BP134688  SMR2  14112012  NEW JCL                                           
//* BP138022  IL5   07102019  REMOVE EXTRACTING OF UIN FROM                     
//*                           BP13.KH25.REJBOOK                                 
//*=====================================================================        
//*  DELETE DATASETS                                                            
//*--------------------------------------------------------------------         
//STEP000  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DEL   ('BP13.L568.REPORT.A636')                                             
    DEL   ('BP13.F740.MATUREBA.BP13A636')                                       
    DEL   ('BP13.F825.REQOCCP.BP13A636')                                        
    DEL   ('BP13.F820.OCCUP.BP13A636')                                          
         IF MAXCC < 12 THEN                                                     
            SET MAXCC = 0                                                       
/*                                                                              
//*--------------------------------------------------------------------         
//*  EXTRACT CURRENT REGN FROM BP13K740                                         
//*--------------------------------------------------------------------         
//STEP010  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F740.MATUREBA.BP13A636,DISP=(NEW,CATLG),                 
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                                  
//         SPACE=(CYL,(20,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*------------------------------------------------------------------*  00003002
//* EXTRACT PERSONS TAGGED 'Y' IN LESSEE_CHK AND FREEZE_OCCP FIELDS  *  00003002
//*------------------------------------------------------------------*  00003002
//STEP011  EXEC PGM=SORT                                                00004002
//SORTJNF1 DD DSN=BP13.F740.MATUREBA.BP13A636,DISP=SHR                  00005003
//SORTJNF2 DD DSN=BP13.K825.REQOCCP.PREV,DISP=SHR                       00006003
//MATCH    DD DSN=BP13.F825.REQOCCP.BP13A636,DISP=(NEW,CATLG),          00007003
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),DATACLAS=MULTIVOL,                
//         SPACE=(CYL,(20,10),RLSE)                                             
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                    00009403
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                      00009503
   REFORMAT FIELDS=(F2:1,200)                                           00009703
   OUTFILE FNAMES=MATCH                                                 00009802
   OPTION COPY                                                          00009303
   INCLUDE COND=(131,1,CH,EQ,C'Y',OR,159,1,CH,EQ,C'Y')                          
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*--------------------------------------------------------------------         
//*  EXTRACT LIVE APPLICATIONS THAT HAVE BOOKED A FLAT FROM BP13K800            
//*--------------------------------------------------------------------         
//STEP020  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=(SHR,PASS)                               
//SORTOUT  DD DSN=&&F800,DISP=(NEW,PASS),                                       
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),DATACLAS=MULTIVOL,             
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,155,4,CH,NE,C'    ')                         
//*------------------------------------------------------------------*  00003002
//* EXTRACT PERSONS TAGGED 'Y' IN LESSEE_CHK AND FREEZE_OCCP FIELDS  *  00003002
//*------------------------------------------------------------------*  00003002
//STEP021  EXEC PGM=SORT                                                00004002
//SORTJNF1 DD DSN=&&F800,DISP=(OLD,DELETE)                              00005003
//SORTJNF2 DD DSN=BP13.K820.OCCUP,DISP=SHR                              00006003
//MATCH    DD DSN=BP13.F820.OCCUP.BP13A636,DISP=(NEW,CATLG),            00007003
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),DATACLAS=MULTIVOL,                
//         SPACE=(CYL,(100,50),RLSE)                                            
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(4,8,A)                                      00009403
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                      00009503
   REFORMAT FIELDS=(F2:1,400)                                           00009703
   OUTFILE FNAMES=MATCH                                                 00009802
   OPTION COPY                                                          00009303
   INCLUDE COND=(131,1,CH,EQ,C'Y',OR,159,1,CH,EQ,C'Y')                          
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*--------------------------------------------------------------------         
//*  SAS PROGRAM TO MATCH PERSON IN CURRENT APPL AND BOOKED FLAT APPL           
//*--------------------------------------------------------------------         
//STEP030  EXEC SAS,COND=(0,NE)                                                 
//BP13F825 DD DSN=BP13.F825.REQOCCP.BP13A636,DISP=SHR                           
//BP13F820 DD DSN=BP13.F820.OCCUP.BP13A636,DISP=SHR                             
//BP13L568 DD DSN=BP13.L568.REPORT.A636,DISP=(NEW,CATLG),                       
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=0),                              
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S568),DISP=SHR                             
/*                                                                              
