//BP13A518 JOB (BP13P),'BP13A518',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* ONETIME RE-ASSIGN OIC FOR EACH NRIC                                         
//*=================================================================            
//*--------------------------------------------------------------------         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K022.WISOIC,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K028.OICHIST,DISP=OLD                                    
//INPUT3   DD DSN=BP13.K025.CSM.DBSS,DISP=OLD                                   
//INPUT4   DD DSN=BP13.KB25.DBSELIG,DISP=OLD                                    
//INPUT5   DD DSN=BP13.K024.WISLAST,DISP=OLD                                    
//INPUT6   DD DSN=BP13.K026.ASGNOIC,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
//*-------------------------------------------------------------------*         
//*  BACKUP FILE BEFORE RUN                                                     
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F022.WISOIC.DAILY(+1),DISP=(NEW,CATLG),                  
//            UNIT=CART,LABEL=(1,SL),                                           
//            SPACE=(CYL,(200,30)),                                             
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//INPUT2   DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F024.WISLAST.DAILY(+1),DISP=(NEW,CATLG),                 
//            UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                         
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//INPUT3   DD DSN=BP13.K025.CSM.DBSS,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F025.CSM.DBSS.DAILY(+1),DISP=(NEW,CATLG),                
//            UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                         
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*                                                                             
//*------------------------------------------------------------------           
//* EXTRACT HA1 UIN FROM BP13K800                                               
//* 2192256J - START REGN-NO FROM YEAR 2009                                     
//* 1533708G - START REGN-NO FOR SERS CASES                                     
//*--------------------------------------------------------------------         
//STEP03  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K800.APPLN,DISP=SHR,                                      
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT DD DSN=&&BP13F034,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=30),                                          
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=((4,8,CH,GE,C'1533708G',AND,                                     
                 4,8,CH,LT,C'19999999'),OR,                                     
                 4,8,CH,GE,C'2192256J')                                         
  OUTREC FIELDS=(4,8,88,9,4X,1,1,8X)                                            
/*                                                                              
//*--------------------------------------------------------------------         
//* EXTRACT HA1 UIN FROM BP13K595                                               
//*--------------------------------------------------------------------         
//STEP04  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                 
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT DD DSN=&&BP13F034,DISP=(MOD,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=30),                                          
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(123,8,CH,GE,C'2192256J')                                        
  OUTREC FIELDS=(123,8,41,9,4X,260,1,8X)                                        
/*                                                                              
//*--------------------------------------------------------------------         
//* EXTRACT HA1 UIN FROM BP13K730                                               
//*--------------------------------------------------------------------         
//STEP05  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                   
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT DD DSN=&&BP13F034,DISP=(MOD,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=30),                                          
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(123,8,CH,GE,C'2192256J')                                        
  OUTREC FIELDS=(123,8,41,9,4X,260,1,8X)                                        
/*                                                                              
//*--------------------------------------------------------------------         
//* EXTRACT HA1 UIN FROM BP13KB78 , DBSS/EC                                     
//*--------------------------------------------------------------------         
//STEP06  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                     
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT DD DSN=&&BP13F034,DISP=(MOD,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=30),                                          
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(6,8,A),FORMAT=CH                                                 
  OUTREC FIELDS=(6,8,29,9,13X)                                                  
/*                                                                              
//*--------------------------------------------------------------------         
//* DROP DUPLICATE REGN/NRIC1                                                   
//*--------------------------------------------------------------------         
//STEP07  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=&&BP13F034,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=BP13.F034.REGNNRIC,DISP=OLD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
/*                                                                              
//*--------------------------------------------------------------------         
//* DELETE/DEFINE BP13K034                                                      
//*--------------------------------------------------------------------         
//STEP08    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=BP13.F034.REGNNRIC,DISP=SHR                                   
//SYSIN     DD  *                                                               
          DEL 'BP13.K034.REGNNRIC' CL PURGE                             00810000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K034.REGNNRIC)              -                  00810000
              CYL(40 10)                           -                    00830000
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K034.REGNNRIC.DATA)         -                  00870000
              KEYS(17 0)                             -                  00880000
              RECSZ(30 30)                         -                    00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K034.REGNNRIC.INDEX)        -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K034.REGNNRIC)                                   00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.K034.REGNNRIC.ALTX1)   -                  00980000
               REL(BP13.K034.REGNNRIC)               -                  00990000
               REUSE                                 -                  01010000
               KEYS(9 8)                             -                  01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.K034.REGNNRIC.ALTX1.DATA)  -                  01070000
               CYL(30 20)                          -                    01080000
               RECSZ(500 1000)                         -                01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.K034.REGNNRIC.ALTX1.INDEX) -                  01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.K034.REGNNRIC.PATH1)  -                  01160000
               PENT(BP13.K034.REGNNRIC.ALTX1))                          01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.K034.REGNNRIC)               -                  01190000
               ODS(BP13.K034.REGNNRIC.ALTX1)                            01200000
//*-------------------------------------------------------------------*         
//* SORT BY OIC REGN                                                            
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//SORTOUT  DD DSN=&&F022CH27,DISP=(NEW,PASS),                                   
//        DCB=(RECFM=FB,LRECL=100),                                             
//        SPACE=(CYL,(130,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(6,8,A),FORMAT=CH                                                 
//*-------------------------------------------------------------------*         
//* GET NRIC FOR RE-ASSIGNED OIC                                                
//* DELETE BP13K022 IF REGN-NO NOT FOUND IN BP13K034                            
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=BP13CH28,COND=(0,NE)                                        
//BP13F022 DD DSN=&&F022CH27,DISP=(OLD,PASS)                                    
//BP13F034 DD DSN=BP13.F034.REGNNRIC,DISP=SHR                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//P13F022A DD DSN=&&F022CH28,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(130,10),RLSE)                                         
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//* SORT BY NRIC AND REGN IN ASCENDING ORDER                                    
//* OMIT DBSS/EC                                                                
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F022CH28,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F022CH39,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(130,10),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(27,9,A,6,8,A),FORMAT=CH                                          
  OMIT COND=(6,1,CH,EQ,C'5',OR,6,1,CH,EQ,C'6')                                  
//*---------------------------------------------------------------------        
//* METHOD 2 - REASSIGN DBSS/EC OIC BASED ON THE LIST IN BP13KB25               
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13CH39,COND=(0,NE)                                        
//BP13F022 DD DSN=&&F022CH39,DISP=(OLD,DELETE)                                  
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//P13F022A  DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=OLD                            
//P13F022B  DD SYSOUT=*                                                         
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//*  BACKUP FILE                                                                
//*-------------------------------------------------------------------*         
//STEP98   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F022.WISOIC.UPDATE,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.F022.WISOIC.REASSIGN.BKUP(+1),DISP=(NEW,CATLG),          
//            UNIT=CART,LABEL=(1,SL),                                           
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//INPUT2   DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=SHR                             
//OUTPUT2  DD DSN=BP13.F026.REPORT(+1),DISP=(NEW,CATLG),                        
//            UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                         
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//INPUT3   DD DSN=BP13.K026.ASGNOIC,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F026.ASGNOIC.BKUP(+1),DISP=(NEW,CATLG),                  
//            UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                         
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*                                                                             
