//BP13A704 JOB (BP13P),'BP13A704',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* THIS IS THE 4TH RESERVE LIST JOB TO RUN.                                    
//* THE PURPOSE OF THIS JCL IS TO ASSIGN THE REGISTRATION NO                    
//* TO THE SUCCESSFUL CASES.                                                    
//* THIS STEP WLD NOT BE USEFUL ANYMORE FOR THOSE REGN '2' SERIES               
//*=================================================================            
//* CHG REF  BY   ON     DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP132293 CKK 110203  NEW JCL FOR RESERVE LIST BALLOTING                     
//* BP132317 JF4 240303  BTO CHANGES FOR BP13C512 AND BP13C514                  
//* BP132417 CKK 271003  REPLACE BP13K825 WITH BP13K823                         
//* BP132412 MJ16151003  INCLUDE FILE BP13K703 IN PGM BP13C514                  
//* BP132496 CKK 030504  TO UPDATE FILE LAYOUT FOR BP13C745                     
//*=================================================================            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALPL1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT02 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=IA1A                                       
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K700.RESERVE,DISP=OLD                                    
//INPUT3   DD DSN=BP13.K830.ADDR,DISP=OLD                                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*---------------------------------------------------------------------        
//* SORT OUT THE RECORDS OUTPUT FROM THE ONLINE UPDATE AFTER BALLOT             
//* PANEL OR UPDATE AFTER ASSIGNED WEIGHTAGE PANEL                              
//* INCLUDE UPDATE DATE >= 950101                                               
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F595,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(13,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(477,8,A),FORMAT=CH                                              
   INCLUDE COND=(300,1,CH,EQ,C'T',AND,485,8,CH,GE,C'19950101')                  
//*---------------------------------------------------------------------        
//* NOTE : COL 123, WILL BE UPDATE BY REGN-NO FOR SUCC CASES, RUN THIS          
//*        STEP BEFORE ASSIGN REGN-NO                                           
//* PRINT REPORT ON BEFORE AND AFTER IMAGE OF UPDATE AFTER BALLOTING            
//* FOR INTERNAL AUDIT                                                          
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13C745,COND=(0,NE)                                        
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K740 DD DSN=BP13.K700.RESERVE,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F595 DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//BP13L745 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*-  REPRO REGN NO FILE TO SEQ FILE                                            
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=SHR,                                   
//            AMP=('BUFND=12')                                                  
//OUTPUT1  DD DSN=BP13.F530.ISSUENO,DISP=OLD                                    
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*-  REPRO BALLOT FILE TO SEQ FILE                                             
//*---------------------------------------------------------------------        
//STEP4A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.K823.RSVOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F825.REQOCCP.RESERVE.BEBKUP,DISP=OLD                     
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*---------------------------------------------------------------------        
//*-  REPRO BALLOT FILE TO SEQ FILE                                             
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.K700.RESERVE,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F700.RESERVE.SL,DISP=OLD                                 
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* SORT IN SUCC CASE, BY ESTATE, FLAT-TYPE, QUEUE NO                           
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K700.RESERVE,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,235,5,A),FORMAT=CH                            
     OMIT COND=(226,3,CH,EQ,C'   ')                                             
//*---------------------------------------------------------------------        
//* TO ASSIGN REGN NUMBER TO SUCCESSFUL CASES AFTER BALLOTING                   
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C512,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K700.RESERVE,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K823.RSVOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K530 DD DSN=BP13.K530.ISSUENO,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L512 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT IN SUCC NEW TOWN,FLAT TYPE AND REGISTRATION NUMBER                     
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K700.RESERVE,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,123,8,A),FORMAT=CH                            
     OMIT    COND=(226,3,CH,EQ,C'   ')                                          
//*---------------------------------------------------------------------        
//* TO PRINT REPORT AFTER BALLOTING                                             
//*---------------------------------------------------------------------        
//STEP09   EXEC SAS,COND=(0,NE)                                                 
//BP13K520 DD DSN=&&F740REGN,DISP=(OLD,PASS)                                    
//BP13L536 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S536),DISP=SHR                             
//*---------------------------------------------------------------------        
//* TO PRINT REPORT AFTER BALLOTING                                             
//*---------------------------------------------------------------------        
//STEP10   EXEC SAS,COND=(0,NE)                                                 
//BP13K520 DD DSN=&&F740REGN,DISP=(OLD,PASS)                                    
//BP13L535 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S535),DISP=SHR                             
