//BP13ARE2  JOB (BP13P),'BP13ARE2',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//* FOR BTO RUN USING BP13C777                                                  
//* THIS JCL TO COMPUTE MCPS QUOTA FOR 200% FLAT SUPPLY                         
//*---------------------------------------------------------------------        
//* THIS JCL COMBINE BP13A509, BP13ABAL AND BP13A522 TOGETHER                   
//* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                 
//* STEP1A-1F ADJUST PA ETHNIC MAX ALLOWANCE TAKEN BY GRO - BP13A509            
//* STEP2A-2D ADJUST BAL GRO QUOTA TO PA AFTER PIGEONHOLING OFGRO               
//* STEP03-04 COMPUTE NO OF RESIDENT AND NON-RESIDENT                           
//* STEP05-07 COMPUTE FLAT QUOAT FOR RESIDENT AND NON-RESIDENT                  
//* STEP08    PRINT REPORT FOR RESIDENT SCHEME                                  
//*                                                                             
//* LATEST CHANGE - 05022002 - COMMENT OUT STEP1B DUE TO SWAP OF GRO            
//*                            AND PRO PIGEONHOLING                             
//**********************************************************************        
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP131064 CKK  20010925 DETERMINE THE RESIDENT QUOTA FOR PA CASES            
//* BP132360 CKK  20030725 TO CREATE ALTERNATE KEY FOR BP13K740                 
//* BP132546 YCH  11062004 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                
//* BP132596 PGS  17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E           
//* BP132693 CKK  12052005 TO REMOVE DEFINATION OF K740 ALT KEY                 
//* BP134861 EAA1 30042013 EXPAND BP13K010 TO 600                               
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K012.MCPSUNIT,DISP=OLD                                   
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, WITH DUPLICATE COPIES                                             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALAP2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* START OF BP13A509                                                           
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP1A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.ARE2,DISP=OLD                                
//INPUT2   DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F012.MCPSUNIT.ARE2,DISP=SHR                              
//INPUT3   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT3  DD DSN=BP13.F740.MATUREBA.SUCC100,DISP=SHR                           
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*-------------------------------------------------------------------          
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING             
//*---------------------------------------------------------------------        
//STEP1C    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010A,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP1D   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010A,DISP=(OLD,DELETE)                                  
//BP13F713 DD DSN=BP13.F713.PIGEON.BALANCE,DISP=SHR                             
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*---------------------------------------------------------------------        
//STEP1E   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K0104PA,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP1F   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&K0104PA,DISP=(OLD,DELETE)                                   
//BP13F713 DD DSN=BP13.F713.PIGEON.BALANCE,DISP=SHR                             
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* FOR MATURE NT                                                               
//* SORT UNSUCC PRIORITY AND PUBLIC CASES FOR PA PIGEONHOLONG                   
//*---------------------------------------------------------------------        
//STEP1G   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.ARE2,DISP=OLD                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ')                                            
//*---------------------------------------------------------------------        
//* PRINT SUMMARY OF PRIORITY GROUP BY NHH/UPG                                  
//* FOR TOTAL OF SUCC AND UNSUCC                                                
//*-------------------------------------------------------------------          
//STEP1H   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//BP13F520 DD DSN=BP13.F740.MATUREBA.ARE2,DISP=SHR                              
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//FT19F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//FT20F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S726),DISP=SHR                             
//*---------------------------------------------------------------------        
//* SORT SOC-RESIDENT FILE BY NT/FT ORDER                                       
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.ARE2,DISP=SHR                              
//SORTOUT  DD DSN=&&F500SORT,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(60,2),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(187,3,A,211,2,A,213,3,A),FORMAT=CH                              
//*--------------------------------------------------------------------         
//* COMPUTE NO OF RESIDENT AND NON-RESIDENT FOR MATURE NT                       
//* BY NT/FT/ALLOC-SCH                                                          
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=BP13C731,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F500SORT,DISP=(OLD,PASS)                                    
//BP13F012 DD DSN=&&F012Z,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=23200),                           
//            SPACE=(TRK,(10,5),RLSE)                                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT SOC-RESIDENT FILE BY NT/FT ORDER                                       
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F012Z,DISP=(SHR,DELETE)                                     
//SORTOUT  DD DSN=&&F012A,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=23200),                           
//            SPACE=(TRK,(10,5),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* TO DELETE & REDEFINE BP13K012                                               
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&F012A,DISP=(OLD,DELETE)                                     
//SYSIN    DD *                                                                 
  DEL (BP13.K012.MCPSUNIT) CLUSTER PURGE                                        
  DEF CLUSTER                                          -                        
        (NAME(BP13.K012.MCPSUNIT)                      -                        
        SHAREOPTIONS(2,3)                              -                        
        KEYS(5 0)                                      -                        
        TRK(5 2)                                       -                        
        RECSZ(400 400)                                 -                        
        FREESPACE(30 30)                               -                        
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        CISZ(4096)                                     -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K012.MCPSUNIT.DATA))                -                        
      INDEX                                            -                        
        (NAME(BP13.K012.MCPSUNIT.INDEX))                                        
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K012.MCPSUNIT)                                        
/*                                                                              
//*-------------------------------------------------------------------          
//* COMPUTE THE MINIMUM FLAT QUOTA FOR RESIDENT AND                             
//*         THE MAXIMUM FLAT QUOTA FOR NON-RESIDENT                             
//*-------------------------------------------------------------------          
//STEP07   EXEC PGM=BP13C732,COND=(0,NE)                                        
//BP13K012 DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT SOC-RESIDENT FILE BY NT/FT ORDER                                       
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F012,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=400,RECFM=FB),                                         
//            SPACE=(CYL,(3,2),RLSE)                                            
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
//*------------------------------------------------------------------           
//* TO UPDATE BP13K012 FROM BP13F760                                            
//*------------------------------------------------------------------           
//STEP09   EXEC PGM=BP13C777,COND=(0,NE)                                        
//BP13F012 DD DSN=&&BP13F012,DISP=(SHR,DELETE)                                  
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K012 DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 1,2,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//SORTOUT  DD DSN=&&F012R,DISP=(,PASS),                                         
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=23200)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13C502,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F012 DD DSN=&&F012R,DISP=(OLD,DELETE)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.BALANCE,DISP=SHR                             
//BP13L502 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 4,5,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//SORTOUT  DD DSN=&&F012B,DISP=(,PASS),                                         
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=23200)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13C502,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F012 DD DSN=&&F012B,DISP=(OLD,DELETE)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.BALANCE,DISP=SHR                             
//BP13L502 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* PRINT REPORT ON RESIDENT FILE INFO ON TOTAL RES/NON-RES, FLAT QUOTA         
//* RES/NON-RES, TOTAL-REG-RES/NON-RES                                          
//*--------------------------------------------------------------------         
//STEP12   EXEC PGM=BP13C733,COND=(0,NE)                                        
//BP13K012 DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//BP13F713 DD DSN=BP13.BLANK.CHAR20,DISP=SHR                                    
//BP13L733 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*  PREPARE FILE TO RUN BP13AMP2                                               
//*--------------------------------------------------------------------         
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F740.MATUREBA.ARE2,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//****************************************************************              
//* END BP13ARE2                                                                
//****************************************************************              
