//BP13A59C JOB (BP13P),'BP13A59C',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//       NOTIFY=CSD0071                                                 00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//*-------------------------------------------------------------------* 00040000
//* DESCRIPTION :  RUN MQ TRIGGER PROGRAM  (SINGLES EMAIL)            * 00050000
//*-------------------------------------------------------------------* 00060000
//*--------------------------------------------------------------------*00070000
//* STEP01:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00080000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00090000
//*          APPT TYPE = (I1)                                          *00100000
//*--------------------------------------------------------------------*00110000
//STEP01   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       00120000
//STEPLIB  DD                                                           00130000
//         DD                                                           00140000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00150000
//BP13F23A DD DSN=BP13.F23A.EMAIL.PAFTS.F100,DISP=SHR                   00160000
//SYSDBG   DD  SYSOUT=*                                                 00170000
//SYSOUT   DD  SYSOUT=*                                                 00180000
//SYSDBOUT DD  SYSOUT=*                                                 00190000
//SYSABOUT DD  SYSOUT=*                                                 00200000
//SYSPRINT DD  SYSOUT=*                                                 00210000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         00220000
/*                                                                      00230000
//*--------------------------------------------------------------------*00240000
//* STEP02:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00250000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00260000
//*          APPT TYPE = (I2)                                          *00270000
//*--------------------------------------------------------------------*00280000
//*--------------------------------------------------------------------*00290000
//STEP02   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       00300000
//STEPLIB  DD                                                           00310000
//         DD                                                           00320000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00330000
//BP13F23A DD DSN=BP13.F23A.EMAIL.PAFTS.F150,DISP=SHR                   00340000
//SYSDBG   DD  SYSOUT=*                                                 00350000
//SYSOUT   DD  SYSOUT=*                                                 00360000
//SYSDBOUT DD  SYSOUT=*                                                 00370000
//SYSABOUT DD  SYSOUT=*                                                 00380000
//SYSPRINT DD  SYSOUT=*                                                 00390000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         00400000
/*                                                                      00410000
//*--------------------------------------------------------------------*00420000
//* STEP03:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00430000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00440000
//*          APPT TYPE = (I3)                                          *00450000
//*--------------------------------------------------------------------*00460000
//STEP03   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       00470000
//STEPLIB  DD                                                           00480000
//         DD                                                           00490000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00500000
//BP13F23A DD DSN=BP13.F23A.EMAIL.PAFTS.F200,DISP=SHR                   00510000
//SYSDBG   DD  SYSOUT=*                                                 00520000
//SYSOUT   DD  SYSOUT=*                                                 00530000
//SYSDBOUT DD  SYSOUT=*                                                 00540000
//SYSABOUT DD  SYSOUT=*                                                 00550000
//SYSPRINT DD  SYSOUT=*                                                 00560000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         00570000
/*                                                                      00580000
//*--------------------------------------------------------------------*00590000
//* STEP04:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00600000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00610000
//*          APPT TYPE = (I4)                                          *00620000
//*--------------------------------------------------------------------*00630000
//STEP04   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       00640000
//STEPLIB  DD                                                           00650000
//         DD                                                           00660000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00670000
//BP13F23A DD DSN=BP13.F23A.EMAIL.PAFTS.F300,DISP=SHR                   00680000
//SYSDBG   DD  SYSOUT=*                                                 00690000
//SYSOUT   DD  SYSOUT=*                                                 00700000
//SYSDBOUT DD  SYSOUT=*                                                 00710000
//SYSABOUT DD  SYSOUT=*                                                 00720000
//SYSPRINT DD  SYSOUT=*                                                 00730000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         00740000
/*                                                                      00750000
//*--------------------------------------------------------------------*00760000
//* STEP05:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00770000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00780000
//*          APPT TYPE = (I5)                                          *00790000
//*--------------------------------------------------------------------*00800000
//STEP05   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       00810000
//STEPLIB  DD                                                           00820000
//         DD                                                           00830000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00840000
//BP13F23A DD DSN=BP13.F23A.EMAIL.PAFTS.F400.F01,DISP=SHR               00850000
//SYSDBG   DD  SYSOUT=*                                                 00860000
//SYSOUT   DD  SYSOUT=*                                                 00870000
//SYSDBOUT DD  SYSOUT=*                                                 00880000
//SYSABOUT DD  SYSOUT=*                                                 00890000
//SYSPRINT DD  SYSOUT=*                                                 00900000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         00910000
/*                                                                      00920000
//*--------------------------------------------------------------------*00930000
//* STEP06:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00940000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00950000
//*          APPT TYPE = (I5)                                          *00960000
//*--------------------------------------------------------------------*00970000
//STEP06   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       00980000
//STEPLIB  DD                                                           00990000
//         DD                                                           01000000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           01010000
//BP13F23A DD DSN=BP13.F23A.EMAIL.PAFTS.F400.F02,DISP=SHR               01020000
//SYSDBG   DD  SYSOUT=*                                                 01030000
//SYSOUT   DD  SYSOUT=*                                                 01040000
//SYSDBOUT DD  SYSOUT=*                                                 01050000
//SYSABOUT DD  SYSOUT=*                                                 01060000
//SYSPRINT DD  SYSOUT=*                                                 01070000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         01080000
/*                                                                      01090000
//*--------------------------------------------------------------------*01100000
//* STEP07:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *01110000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *01120000
//*          APPT TYPE = (I5)                                          *01130000
//*--------------------------------------------------------------------*01140000
//STEP07   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       01150000
//STEPLIB  DD                                                           01160000
//         DD                                                           01170000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           01180000
//BP13F23A DD DSN=BP13.F23A.EMAIL.PAFTS.F400.F03,DISP=SHR               01190000
//SYSDBG   DD  SYSOUT=*                                                 01200000
//SYSOUT   DD  SYSOUT=*                                                 01210000
//SYSDBOUT DD  SYSOUT=*                                                 01220000
//SYSABOUT DD  SYSOUT=*                                                 01230000
//SYSPRINT DD  SYSOUT=*                                                 01240000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         01250000
/*                                                                      01260000
//*--------------------------------------------------------------------*01270000
//* STEP08:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *01280000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *01290000
//*          APPT TYPE = (I5)                                          *01300000
//*--------------------------------------------------------------------*01310000
//STEP08   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       01320000
//STEPLIB  DD                                                           01330000
//         DD                                                           01340000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           01350000
//BP13F23A DD DSN=BP13.F23A.EMAIL.PAFTS.F400.F04,DISP=SHR               01360000
//SYSDBG   DD  SYSOUT=*                                                 01370000
//SYSOUT   DD  SYSOUT=*                                                 01380000
//SYSDBOUT DD  SYSOUT=*                                                 01390000
//SYSABOUT DD  SYSOUT=*                                                 01400000
//SYSPRINT DD  SYSOUT=*                                                 01410000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         01420000
/*                                                                      01430000
//*--------------------------------------------------------------------*01440000
//* STEP09:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *01450000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *01460000
//*          APPT TYPE = (I5)                                          *01470000
//*--------------------------------------------------------------------*01480000
//STEP09   EXEC MQBATCH,NAME=BP13CS06,COND=(0,NE)                       01490000
//STEPLIB  DD                                                           01500000
//         DD                                                           01510000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           01520000
//BP13F23A DD DSN=BP13.F23A.EMAIL.PAFTS.F400.F05,DISP=SHR               01530000
//SYSDBG   DD  SYSOUT=*                                                 01540000
//SYSOUT   DD  SYSOUT=*                                                 01550000
//SYSDBOUT DD  SYSOUT=*                                                 01560000
//SYSABOUT DD  SYSOUT=*                                                 01570000
//SYSPRINT DD  SYSOUT=*                                                 01580000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         01590000
/*                                                                      01600000
//*--------------------------------------------------------------------*01610000
