//BP13A237 JOB (BP13P),'BP13A237',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//*--------------------------------------------------------------------*00000050
//*  SORT BP13F205 BY NT/ZONE, FT, DTE-BALLOT                           00000060
//*--------------------------------------------------------------------*00000070
//STEP01 EXEC    SORT,COND=(0,NE)                                       00000080
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                    00000090
//             DISP=SHR                                                 00000100
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                                
//SYSIN    DD  *                                                        00000130
   SORT FIELDS=(1,15,A),FORMAT=CH                                       00001680
   INCLUDE COND=(14,2,CH,EQ,C'UA')                                      00001690
/*                                                                      00000140
//*---------------------------------------------------------------------00000150
//* SORT BM06F800 BY NT-ZONE, DTE-ALLOCN                                00000160
//*---------------------------------------------------------------------00000170
//STEP02 EXEC    SORT,COND=(0,NE)                                       00000180
//SORTIN   DD  DSN=BM06.F800.ALLOUNIT,                                  00000190
//             DISP=SHR                                                 00000200
//SORTOUT  DD  DSN=&&BM06F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(30,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=800,RECFM=FB)                               
//SYSIN    DD  *                                                        00000230
     SORT FIELDS=(559,2,A,546,2,A,291,8,A,544,2,A),FORMAT=CH                    
/*                                                                      00000240
//*-------------------------------------------------------------------- 00000250
//* EXECUTE PROGRAM BP13C292 TO WRITE BM06K950                          00000260
//*-------------------------------------------------------------------- 00000270
//STEP03 EXEC    PGM=BP13C292,COND=(0,NE)                               00000280
//BP13F205 DD  DSN=&&BP13F205,                                          00000290
//             DISP=(SHR,PASS)                                          00000300
//BM06F800 DD  DSN=&&BM06F800,                                          00000310
//             DISP=(SHR,PASS)                                          00000320
//BM06K950 DD  DSN=BM06.K950.FIS.HISTORY,                               00000330
//             DISP=OLD                                                 00000340
//SYSTSPRT DD  SYSOUT=*                                                 00000350
//SYSPRINT DD  SYSOUT=*                                                 00000360
//SYSUDUMP DD  SYSOUT=*                                                 00000370
//SYSOUT   DD  SYSOUT=*                                                 00000380
//SYSDBOUT DD  SYSOUT=*                                                 00000390
//SYSABOUT DD  SYSOUT=*                                                 00000400
/*                                                                              
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP04   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
//*---------------------------------------------------------------------00000420
//* END BP13A237                                                        00000430
//*---------------------------------------------------------------------00000440
