//BP13D304 JOB (BP13P),'BP13D304',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP130418  31/08/1998  LJL1 Y2K COMPLIANCE CHANGES               *           
//* BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//* BP135019 ESD1 261113 - INCLUDE CASES WITH CHANGE OF HOLDING TYPE            
//* BP137680 LJL1 210519 - TO CATER FOR ERASING K820-NUM-CPF-MEMBER             
//*                        FIELD AFTER SOCA                                     
//*=================================================================*           
//*-----------------------------------------------------------------            
//*   SORT ACCUMULATED AGREEMENT ORDER FILE                                     
//*-----------------------------------------------------------------            
//PS4010 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                    
//           AMP=('BUFND=23')                                                   
//SORTOUT DD DSN=&&F4010,DISP=(NEW,PASS),                                       
//         SPACE=(CYL,(150,10),RLSE),                                           
//       UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                     
//SYSPRINT DD SYSOUT=*                                                          
      SORT FIELDS=(877,9,A),FORMAT=CH,SIZE=E20000                               
//*---------------------------------------------------------------              
//*     SORT BP13K300 CASES WITH 'AB' CDE TRANS.                                
//*---------------------------------------------------------------              
//PS4011  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K300.AGRORDER,DISP=SHR                                   
//SORTOUT  DD DSN=&&F300,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                              
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                 
     INCLUDE COND=(679,2,CH,EQ,C'AB')                                           
//*                                                                             
//*-----------------------------------------------------------------            
//*   SORT ACCUMULATED AGREEMENT ORDER FILE                                     
//*-----------------------------------------------------------------            
//PS4020 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD DSN=BP13.F300.SUCCESS,DISP=OLD                                     
//        DD DSN=BP13.F300.SUCCESS.AFTERSA,DISP=OLD                             
//        DD DSN=&&F300,DISP=(OLD,PASS)                                         
//SORTOUT DD DSN=&&F4020,DISP=(NEW,PASS),                                       
//         SPACE=(CYL,(20,10),RLSE),                                            
//       UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                     
//SYSPRINT DD SYSOUT=*                                                          
      SORT FIELDS=(1,8,A),FORMAT=CH,SIZE=E20000                                 
//*-----------------------------------------------------------------            
//*   MERGE DAILY AGREEMENT ORDER FILE INTO ACCUMULATED AGRORDER FILE           
//*-----------------------------------------------------------------            
//PS4030 EXEC  PGM=BP13C306,COND=(0,NE)                                         
//BP13F300 DD DSN=&&F4020,DISP=(OLD,PASS)                                       
//BP13F330 DD DSN=&&F4010,DISP=(OLD,PASS)                                       
//BP13OUT  DD DSN=BP13.F330.ACCUMAO.BKUP,DISP=OLD                               
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  DEFINE ACCUMULATED AGREEMENT ORDER FILE                                    
//*--------------------------------------------------------------------         
//PS4040 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//BP13F330 DD DSN=BP13.F330.ACCUMAO.BKUP,DISP=OLD                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K330.ACCUMAO) CL PURGE                                       
         DEF CL (NAME(BP13.K330.ACCUMAO)       -                                
                 CYL(150 50)                   -                                
                 DATACLAS(MULTIVOL)            -                                
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SPEED                         -                                
                 UNIQUE                        -                                
                 SHR(2 3))                     -                                
                 DATA                          -                                
                 (NAME(BP13.K330.ACCUMAO.DATA) -                                
                 KEYS(9 876)                   -                                
                 RECSZ(2000 2000)              -                                
                 CISZ(4096))                   -                                
                 INDEX                         -                                
                 (NAME(BP13.K330.ACCUMAO.INDEX))                                
       REPRO INFILE(BP13F330) ODS(BP13.K330.ACCUMAO)                            
//*---------------------------------------------------------------------        
//*  SORT CPF MEMBER APPLICANTS                                                 
//*--------------------------------------------------------------------         
//PS4050   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F820,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,50),RLSE),                              
//            DCB=(RECFM=FB,LRECL=400)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(358,1,CH,EQ,C'Y')                                               
//*---------------------------------------------------------------------        
//*  TO CATER FOR ERASING K820-NUM-CPF-MEMBER                                   
//*  FIELD AFTER SOCA                                                           
//*--------------------------------------------------------------------         
//PS4060   EXEC PGM=BP13C30F,COND=(0,NE)                                        
//BP13F820 DD DSN=&&BP13F820,DISP=(OLD,PASS)                                    
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
