//BP13D50G JOB (BP13P),'BP13D50G',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//*                                                                             
//*  THIS JOB IS USE ONLY FOR EC CASES                                          
//*  TO GENERATE EXCEPTION REPORT BP13S16A                                      
//*                                                                             
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---  -------- -----------                                          
//* BP136563 ZDD1 070317   NEW JCL(PATTERN TO BP13D50B)                         
//* BP137059 ZDD1 091117   COMMENT OUT BP13CB15                                 
//* BP137920 IL5  090919   CHANGES TO PC (REPLACE STEP13A-C)                    
//* BP138495 AM25 301020   SHIFT COLS 1/2/3 FROM REPORT 1 TO REPORT 4           
//*                        ADD OUTREC TO TAG DAILY REPORTS PART1/4              
//* BP139571 AM25 240423   REMOVE COL 9 IN REPORT 4                             
//* BP139875 AM25 080224   REMOVE BP13C174                                      
//*               130224   REMOVE CLASS 2 PRINTING                              
//*=================================================================            
//******************************************************************            
//* START OF DAILY PRINT JOBS                                                   
//*******************************************************************           
//*------------------------------------------------------------------           
//* SORT OUT ONLY BTO CASES FROM THE DAILY FILE                                 
//*------------------------------------------------------------------           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&F730BTO,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(376,3,CH,EQ,C'EC ')                                           
//*------------------------------------------------------------------           
//* COMPARE DAILY FILE WITH ACCUMULATED VSAM FILE.                              
//* SORT OUT ONLY CASES IN THE DAILY FILE                                       
//*------------------------------------------------------------------           
//STEP02   EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730BTO,DISP=(SHR,PASS)                                     
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&BP13F730,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT IN NRIC ORDER                                                          
//*------------------------------------------------------------------           
//STEP11A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BTO,DISP=SHR                                
//SORTOUT  DD DSN=&&BP13F824,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(1,1,CH,EQ,C'6')                                               
    OUTREC FIELDS=(1,17,233X)                                                   
//*-----------------------------------------------------------------            
//* EXTRACT REGNUM WITH RES-HA1                                                 
//*------------------------------------------------------------------           
//STEP11B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730BTO,DISP=(SHR,PASS)                                     
//SORTOUT  DD DSN=&&F824TEMP,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
  INCLUDE  COND=(325,9,CH,NE,C'         ')                                      
  OUTREC FIELDS=(123,8,325,9,233X)                                              
//*-----------------------------------------------------------------            
//* EXTRACT REGNUM WITH RES-HA2                                                 
//*------------------------------------------------------------------           
//STEP11C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730BTO,DISP=(SHR,PASS)                                     
//SORTOUT  DD DSN=&&F824TEMP,DISP=(MOD,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
  INCLUDE  COND=(379,9,CH,NE,C'         ')                                      
   OUTREC FIELDS=(123,8,325,9,233X)                                             
//*------------------------------------------------------------------           
//* SORT IN NRIC ORDER                                                          
//*------------------------------------------------------------------           
//STEP11D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F824,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F824SOR1,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(9,9,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* MATCH DEBARMENT MASTER TO EXTRACT ONLY VALID REASON CODE                    
//*------------------------------------------------------------------           
//STEP11E  EXEC PGM=BP13C919,COND=(0,NE)                                        
//BP13F824 DD DSN=&&F824SOR1,DISP=(OLD,PASS)                                    
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//OUTF824  DD DSN=&&F824DEBR,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT IN NRIC ORDER                                                          
//*------------------------------------------------------------------           
//STEP11F  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824TEMP,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F824SORT,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(9,9,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* MATCH DEBARMENT MASTER TO EXTRACT ONLY VALID REASON CODE                    
//*------------------------------------------------------------------           
//STEP11G  EXEC PGM=BP13C919,COND=(0,NE)                                        
//BP13F824 DD DSN=&&F824SORT,DISP=(OLD,DELETE)                                  
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//OUTF824  DD DSN=&&F824DEB1,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT BTO CASES FROM F558                                                
//*------------------------------------------------------------------           
//STEP12A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F558,DISP=(NEW,PASS),                                       
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(151,11,CH,NE,C'           ',OR,                              
                   318,11,CH,NE,C'           ')                                 
//*------------------------------------------------------------------           
//* SORT OUT BTO CASES FROM F558                                                
//*------------------------------------------------------------------           
//STEP12B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.MAMS,DISP=SHR                               
//SORTOUT  DD DSN=&&F558,DISP=(MOD,PASS),                                       
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
//*------------------------------------------------------------------           
//* SORT OUT BTO CASES FROM F558                                                
//*------------------------------------------------------------------           
//STEP12C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558,DISP=(OLD,DELETE)                                      
//SORTOUT  DD DSN=&&F558A,DISP=(NEW,PASS),                                      
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
    INCLUDE COND=(1,1,CH,EQ,C'6')                                               
     OUTREC FIELDS=(1,313,C'DB',316,285)                                        
//*------------------------------------------------------------------           
//* TO MATCH AND OUTPUT 'Y' IF SLS, MAMS OR TRSF FOUND                          
//* COL 10 = 'Y' IF TRSF HDB-REF FOUND                                          
//* COL 11 = 'Y' IF SLS HDB-REF FOUND                                           
//* COL 12 = 'Y' IF MAMS HDB-REF FOUND                                          
//*------------------------------------------------------------------           
//STEP12D  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558A,DISP=(OLD,DELETE)                                     
//P13F730A DD DSN=&&P13F730S,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT TRF CASES FOR DAILY REPORT                                         
//* TRF HDB-REF NOT = SPACE - COL 10                                            
//* SLS HDB-REF NOT = SPACE - COL 11                                            
//* MAMS HDB-REF NOT = SPACE - COL 12                                           
//*------------------------------------------------------------------           
//STEP12E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F730S,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=OLD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(10,1,CH,EQ,C'Y',OR,                                           
                  11,1,CH,EQ,C'Y',OR,                                           
                  12,1,CH,EQ,C'Y')                                              
//*------------------------------------------------------------------           
//* SORT OUT BTO CASES FROM F558.UPGOCCP.PARENT                                 
//*------------------------------------------------------------------           
//*STEP13A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F558.UPGOCCP.PARENT,DISP=SHR                            
//*SORTOUT  DD DSN=&&F558PC,DISP=(NEW,PASS),                                    
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                              
//*            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                              
//*SYSIN    DD  *                                                               
//*     SORT FIELDS=(1,8,A),FORMAT=CH                                           
//*    INCLUDE COND=(1,1,CH,EQ,C'6')                                            
//*     OUTREC FIELDS=(1,313,C'PC',316,285)                                     
//*------------------------------------------------------------------           
//* TO MATCH AND OUTPUT 'Y' IF P/C RELATIONSHIP IS FOUND                        
//* COL 13 = 'Y' IF P/C IS FOUND                                                
//*------------------------------------------------------------------           
//*STEP13B  EXEC PGM=BP13C169,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13F558 DD DSN=&&F558PC,DISP=(OLD,DELETE)                                   
//*P13F730A DD DSN=&&F730PC,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                             
//*            SPACE=(CYL,(5,3),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT PC CASES FOR DAILY REPORT                                          
//* PC NOT = SPACE - COL 13                                                     
//*------------------------------------------------------------------           
//*STEP13C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730PC,DISP=(OLD,DELETE)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(13,1,CH,EQ,C'Y')                                           
//*------------------------------------------------------------------           
//* SORT OUT PC CASES FOR DAILY REPORT                                          
//* PC NOT = SPACE - COL 13                                                     
//*------------------------------------------------------------------           
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(255,1,CH,EQ,C'P',AND,213,3,CH,NE,C'FTS')                      
    OUTREC FIELDS=(1,12,C'Y',14,487)                                            
//*---------------------------------------------------------------------        
//* SORT OUT WITH SMS SALES TYPE = BLANK                                        
//*---------------------------------------------------------------------        
//STEP14A  EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                     
//SORTOUT  DD DSN=&&F558SB,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(61,1,CH,EQ,C' ',AND,                                           
                 101,11,CH,NE,C'           ',AND,                               
                 (1,1,CH,EQ,C'6'))                                              
   OUTREC FIELDS=(1,313,C'SB',316,285)                                          
//*---------------------------------------------------------------------        
//* TO MATCH AND OUTPUT 'Y' IF SMS SALE TYPE = BLANK                            
//* COL 14 = 'Y' IF SMS SALE TYPE = BLANK                                       
//*---------------------------------------------------------------------        
//STEP14B  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558SB,DISP=(OLD,DELETE)                                    
//P13F730A DD DSN=&&F730SB,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT SALE TYPE = BLANK CASES FOR DAILY REPORT                           
//* SMS SALE TYPE = BLANK - COL 14                                              
//*------------------------------------------------------------------           
//STEP14C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730SB,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(14,1,CH,EQ,C'Y')                                              
//*---------------------------------------------------------------------        
//* SORT OUT WITH SMS SALES TYPE = 7 AND LESSEE CODE = 01                       
//*---------------------------------------------------------------------        
//STEP15A  EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                     
//SORTOUT  DD DSN=&&F558S7,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(61,1,CH,EQ,C'7',AND,110,2,CH,EQ,C'01',AND,                     
                 (1,1,CH,EQ,C'6'))                                              
   OUTREC FIELDS=(1,313,C'S7',316,285)                                          
//*---------------------------------------------------------------------        
//* TO MATCH AND OUTPUT 'Y' SMS SALE TYPE = 7 AND LESSEE CODE = 01 FND          
//* COL 15 = 'Y' IF SMS SALE TYPE = 7 AND LESSEE CODE = 01                      
//*---------------------------------------------------------------------        
//STEP15B  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558S7,DISP=(OLD,DELETE)                                    
//P13F730A DD DSN=&&F730S7,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT SALE TYPE = 7, LESSEE CODE = 01 CASES FOR DAILY REPORT             
//* SMS SALE TYPE = 7 AND LESSEE CODE = 01 - COL 15                             
//*------------------------------------------------------------------           
//STEP15C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730S7,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(15,1,CH,EQ,C'Y')                                              
//*--------------------------------------------------------------------         
//* TO SORT IN APPLICANT REGN+NRIC                                              
//* TO SORT IN OCCUPIER  REGN+NRIC                                              
//*--------------------------------------------------------------------         
//STEP16A EXEC SORT,COND=(0,NE)                                                 
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F558.UPGOCCP.BTO,DISP=SHR                                 
//SORTOUT DD DSN=&&BP13F716,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=350,RECFM=FB)                                
//SYSIN   DD  *                                                                 
  SORT FIELDS=(325,9,A),FORMAT=CH                                               
  OUTREC FIELDS=(1,17,333X)                                                     
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE NUM-ROLE...ETC..                                                   
//*---------------------------------------------------------------------        
//STEP16B  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&BP13F716,DISP=(OLD,DELETE)                                  
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13F716A DD DSN=&&F716ROLE,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(150,30),RLSE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
//*----------------------------------------------------------------             
//* SORT IN THOSE RDB ROLE OF '028', '029', AND '030'                           
//*----------------------------------------------------------------             
//STEP16C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716ROLE,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F558AS,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(75,3,CH,EQ,C'028',OR,75,3,CH,EQ,C'029',OR,                   
                   75,3,CH,EQ,C'030')                                           
     OUTREC FIELDS=(1,17,296X,C'AS',286X)                                       
//*****************************************************************             
//* TO MATCH AND OUTPUT 'Y' EXECUTOR TRUSTEE 'AS'                               
//* COL 16 = 'Y' IF EXECUTOR TRUSTEE 'AS'                                       
//*****************************************************************             
//STEP16D  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558AS,DISP=(OLD,DELETE)                                    
//P13F730A DD DSN=&&F730AS,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT EXECUTOR TRUSTEE    FOR DAILY REPORT                               
//* EXECUTOR TRUSTEE 'AS' - COL 16                                              
//*------------------------------------------------------------------           
//STEP16E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730AS,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(16,1,CH,EQ,C'Y')                                              
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 62,64,66,GA,GB (CONVERSION)                         
//*------------------------------------------------------------------           
//STEP18A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'62',OR,221,2,CH,EQ,C'64',OR,                    
                  221,2,CH,EQ,C'66',OR,221,2,CH,EQ,C'GA',OR,                    
                  221,2,CH,EQ,C'GB')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'CONVERSION' CASES FROM VSAM FILE              
//*------------------------------------------------------------------           
//STEP18B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730CONV,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 62/64/66/GA/GB CASES FOR DAILY REPORT               
//* DEBARMENT CODE  62/64/66/GA/GB = Y - COL 4                                  
//*------------------------------------------------------------------           
//STEP18C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CONV,DISP=(SHR,DELETE)                                  
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,3,C'Y',5,496)                                              
//*----------------------------------------------------------------             
//* SORT IN THOSE WITHOUT P/C REL CASES                                         
//*----------------------------------------------------------------             
//STEP20A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.LONA,DISP=SHR                               
//SORTOUT  DD DSN=&&F558ZW,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(1,1,CH,EQ,C'6')                                              
     OUTREC FIELDS=(1,313,C'ZW',316,285)                                        
//*----------------------------------------------------------------             
//* TO MATCH AND OUTPUT 'Y' IF Z*-DEB WITHOUT P/C REL CASES                     
//* COL 5 = 'Y' IF Z-DEB WITHOUT P/C REL                                        
//*----------------------------------------------------------------             
//STEP20B  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558ZW,DISP=(SHR,PASS)                                      
//P13F730A DD DSN=&&F730ZW,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT ZW CASES FOR DAILY REPORT                                          
//* ZW NOT = SPACE - COL 5                                                      
//*------------------------------------------------------------------           
//STEP20C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730ZW,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(5,1,CH,EQ,C'Y')                                               
//*----------------------------------------------------------------             
//* SORT IN THOSE WITH P/C REL CASES                                            
//* NOTE: BP13.F558.ZDEBR.PARENT - ADDED OUTPUT DSN FROM BP13C168               
//*----------------------------------------------------------------             
//STEP21A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.ZDEBR.PARENT,DISP=SHR                               
//SORTOUT  DD DSN=&&F558ZP,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(1,1,CH,EQ,C'6')                                              
     OUTREC FIELDS=(1,313,C'ZP',316,285)                                        
//*----------------------------------------------------------------             
//* TO MATCH AND OUTPUT 'Y' IF Z-DEB WITH P/C REL CASES                         
//* COL 6 = 'Y' IF Z-DEB WITH P/C REL                                           
//*----------------------------------------------------------------             
//STEP21B  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558ZP,DISP=(SHR,PASS)                                      
//P13F730A DD DSN=&&F730ZP,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT ZP CASES FOR DAILY REPORT                                          
//* ZP NOT = SPACE - COL 6                                                      
//*------------------------------------------------------------------           
//STEP21C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730ZP,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(6,1,CH,EQ,C'Y')                                               
//*---------------------------------------------------------------------        
//* SORT OUT PC RELATION WITH IN-LAW/SPOUSE IN RDB                              
//* NOTE: ...PARENT.RDBINLAW  - INCLUDED OUTPUT DSN FROM BP13C803               
//*---------------------------------------------------------------------        
//STEP22A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.PARENT.RDBINLAW,DISP=SHR                    
//SORTOUT  DD DSN=&&F558LS,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,EQ,C'6')                                                
   OUTREC FIELDS=(1,313,C'LS',316,285)                                          
//*------------------------------------------------------------------           
//* TO MATCH AND OUTPUT 'Y' PC RELATION WITH IN-LAW/SPOUSE IN RDB               
//* COL 7 = 'Y' IF PC RELATION WITH IN-LAW/SPOUSE IN RDB                        
//*------------------------------------------------------------------           
//STEP22B  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558LS,DISP=(OLD,DELETE)                                    
//P13F730A DD DSN=&&F730LS,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT PC RELATION WITH IN-LAW/SPOUSE IN RDB FOR DAILY REPORT             
//* PC RELATION WITH IN-LAW/SPOUSE IN RDB - COL 7                               
//*------------------------------------------------------------------           
//STEP22C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730LS,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(7,1,CH,EQ,C'Y')                                               
//*---------------------------------------------------------------------        
//* SORT OUT WITH EX SPOUSE RESL - DIVORCED                                     
//* NOTE: ...UPGOCCP.XSPOUSE - ADDED OUTPUT DSN FROM BP13C188                   
//*---------------------------------------------------------------------        
//STEP23A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.XSPOUSE,DISP=SHR                            
//SORTOUT  DD DSN=&&F558XS,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,EQ,C'6')                                                
   OUTREC FIELDS=(1,313,C'XS',316,285)                                          
//*------------------------------------------------------------------           
//* TO MATCH AND OUTPUT 'Y' EX SPOUSE RESL - DIVORCED                           
//* COL 8 = 'Y' IF EX SPOUSE RESL - DIVORCED                                    
//*------------------------------------------------------------------           
//STEP23B  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558XS,DISP=(OLD,DELETE)                                    
//P13F730A DD DSN=&&F730XS,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT EX SPOUSE RESL - DIVORCED FOR DAILY REPORT                         
//* EX SPOUSE RESL - DIVORCED - COL 8                                           
//*------------------------------------------------------------------           
//STEP23C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730XS,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(8,1,CH,EQ,C'Y')                                               
//*------------------------------------------------------------------           
//* SORT OUT HH BLANK CASES FOR DAILY REPORT                                    
//* HH BALNK  = Y - COL 14 TOGETHER WITH SLE TYPE = BLANK                       
//*------------------------------------------------------------------           
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(116,1,CH,EQ,C' ')                                             
    OUTREC FIELDS=(1,13,C'Y',15,486)                                            
//* OUTREC FIELDS=(1,1,C'Y',3,498)                                              
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES ACCORDING TO REGN NO                           
//*------------------------------------------------------------------           
//STEP26A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT,DISP=SHR                               
//SORTOUT  DD DSN=&&F730FULL,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*------------------------------------------------------------------           
//* MERGE SIMILAR REF NO TOGETHER                                               
//*------------------------------------------------------------------           
//STEP26B  EXEC PGM=BP13C165,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730FULL,DISP=(OLD,DELETE)                                  
//P13F730A DD DSN=BP13.F730.DAILY.REPORT.EC,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES - HOUSEHOLD CHECKS                             
//*------------------------------------------------------------------           
//STEP26D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT.EC,DISP=SHR                            
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT.EC.PART1,DISP=OLD                      
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(376,3,CH,EQ,C'EC ')                                           
    OUTREC FIELDS=(1,499,C'A')                                                  
//*                                                                             
//*                                                                             
//*BEGIN DATA EXTRACTION FOR REPORT 4                                           
//*                                                                             
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE AD,AC                                               
//*------------------------------------------------------------------           
//STEP50A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'AD',OR,221,2,CH,EQ,C'AC')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'AD/AC' FROM VSAM FILE                         
//*------------------------------------------------------------------           
//STEP50B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT THOSE WITH DEB AD/AC                                               
//* DEBARMENT CODE  AD/AC = Y - COL 2                                           
//*------------------------------------------------------------------           
//STEP50C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=OLD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,1,C'Y',3,498)                                              
//*------------------------------------------------------------------           
//* SORT OUT REJECTED APPLICATION DUE TO 10-YRS PERIOD NOT MET                  
//*------------------------------------------------------------------           
//* SORT OUT 10-YR = N CASES FOR DAILY REPORT                                   
//* 10-YR = N - COL 1                                                           
//*------------------------------------------------------------------           
//STEP51A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(175,1,CH,EQ,C'N')                                             
    OUTREC FIELDS=(C'N',2,499)                                                  
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FOR 5-YEAR                                          
//*------------------------------------------------------------------           
//STEP51B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'GR')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 5-YEAR                                         
//*------------------------------------------------------------------           
//STEP51C  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT THOSE WITH DEB GR                                                  
//* DEBARMENT CODE  5-YEAR = Y - COL 1                                          
//*------------------------------------------------------------------           
//STEP51D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'Y',2,499)                                                  
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE PA,PB,PC,PE,PF,QF (SOLD HUDC)                       
//*------------------------------------------------------------------           
//STEP52A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'PA',OR,221,2,CH,EQ,C'PB',OR,                    
                  221,2,CH,EQ,C'PC',OR,221,2,CH,EQ,C'PE',OR,                    
                  221,2,CH,EQ,C'PF',OR,221,2,CH,EQ,C'QF')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'SOLD HUDC' CASES FROM VSAM FILE               
//*------------------------------------------------------------------           
//STEP52B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730HUDC,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE PA/PB/PC/PE/PF/QF CASES FOR DAILY REPORT            
//* DEBARMENT CODE  PA/PB/PC/PE/PF/QF = Y - COL 3                               
//*------------------------------------------------------------------           
//STEP52C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730HUDC,DISP=(SHR,DELETE)                                  
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,2,C'Y',4,497)                                              
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE EA/EB/ET/EF/4J/R2                                   
//*------------------------------------------------------------------           
//STEP53A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'EA',OR,221,2,CH,EQ,C'EB',OR,                    
                  221,2,CH,EQ,C'ET',OR,221,2,CH,EQ,C'EF',OR,                    
                  221,2,CH,EQ,C'4J',OR,221,2,CH,EQ,C'R2')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE EA/EB/ET/EF/4J/R2 FROM VSAM FILE               
//*------------------------------------------------------------------           
//STEP53B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE EA/EB/ET/EF/4J/R2 CASES FOR DAILY REPORT            
//* DEBARMENT CODE  EA/EB/ET/EF/4J/R2 = Y - COL 4                               
//*------------------------------------------------------------------           
//STEP53C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,3,C'Y',5,496)                                              
//*------------------------------------------------------------------           
//* COMPARE DAILY FILE WITH ACCUMULATED VSAM FILE.                              
//* SORT OUT ONLY CASES IN THE DAILY FILE                                       
//*------------------------------------------------------------------           
//STEP54A  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K730 DD DSN=BP13.K730.MATURERQ.PPO,DISP=SHR                               
//BP13F730 DD DSN=&&F730PPO,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT PPO CASES FOR DAILY REPORT - FROM PPO FILE                         
//* PPOS TAG = Y - COL 6                                                        
//*------------------------------------------------------------------           
//STEP54B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730PPO,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(347,1,CH,EQ,C'Y',AND,211,2,CH,NE,C'1A')                       
    OUTREC FIELDS=(1,5,C'Y',7,494)                                              
//*------------------------------------------------------------------           
//* SORT OUT PPO CASES FOR DAILY REPORT - FROM SURVEY                           
//* PPO TAG = Y - COL 5                                                         
//*------------------------------------------------------------------           
//STEP55   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(347,1,CH,NE,C' ',AND,211,2,CH,NE,C'1A')                       
    OUTREC FIELDS=(1,4,C'Y',6,495)                                              
//*******************************************************************           
//* SORT OUT DUAL APPLICATION CASES FOR DAILY REPORT                            
//* DUAL CASES - 'SL' - COL 7                                                   
//*------------------------------------------------------------------           
//STEP56   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(258,2,CH,EQ,C'SL')                                            
    OUTREC FIELDS=(1,6,C'S',8,493)                                              
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FX/FY                                               
//*------------------------------------------------------------------           
//STEP56A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'FX',OR,221,2,CH,EQ,C'FY')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 33 FROM VSAM FILE                              
//*------------------------------------------------------------------           
//STEP56B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FOR DAILY REPORT                                    
//* DEBARMENT CODE  FX/FY  = Y - COL 7 (SHARE WITH DUAL CASES)                  
//*------------------------------------------------------------------           
//STEP56C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,6,C'F',8,493)                                              
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 33                                                  
//*------------------------------------------------------------------           
//STEP57A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'33')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 33 FROM VSAM FILE                              
//*------------------------------------------------------------------           
//STEP57B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 33 FOR DAILY REPORT                                 
//* DEBARMENT CODE  33 = Y - COL 8                                              
//*------------------------------------------------------------------           
//STEP57C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OMIT COND=(211,2,CH,EQ,C'1A')                                               
    OUTREC FIELDS=(1,7,C'Y',9,492)                                              
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE RA/AC                                               
//*------------------------------------------------------------------           
//STEP57D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'RA',OR,221,2,CH,EQ,C'AC')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE RA/AC FROM VSAM FILE                           
//*------------------------------------------------------------------           
//STEP57E  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE RA/AC FOR DAILY REPORT                              
//* DEBARMENT CODE  RA/AC = Y - COL 8                                           
//*------------------------------------------------------------------           
//STEP57F  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,7,C'Y',9,492)                                              
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 77/GC/GX/GZ                                         
//*------------------------------------------------------------------           
//STEP59A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'77',OR,221,2,CH,EQ,C'GC',OR,                    
                  221,2,CH,EQ,C'GX',OR,221,2,CH,EQ,C'GZ')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 77 AND GC FROM VSAM FILE                       
//*------------------------------------------------------------------           
//STEP59B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 77 FOR DAILY REPORT                                 
//* DEBARMENT CODE  77/GC/GX/GZ = Y - COL 10                                    
//*------------------------------------------------------------------           
//STEP59C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,9,C'Y',11,490)                                             
//*------------------------------------------------------------------           
//* SORT OUT ALLOC SCHEME PAS/PAA  FOR DAILY REPORT                             
//* CDE-ALLOC-SCH PAS/PAA = Y - COL 11                                          
//*------------------------------------------------------------------           
//STEP60   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(248,3,CH,EQ,C'PAS',OR,248,3,CH,EQ,C'PAA',                     
                                     OR,248,3,CH,EQ,C'SMP')                     
    OUTREC FIELDS=(1,10,C'Y',12,489)                                            
//*---------------------------------------------------------------------        
//* SORT OUT WITH NUM-HDB-REF-SMS NOT EMPTY, NUM-HDB-REF-RSL NOT EMPTY,         
//*        CDE-FILE-STATUS-RSL NOT 'OM', AND CDE-FILE-STATUS-SMS EMPTY          
//*---------------------------------------------------------------------        
//STEP60A  EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                     
//SORTOUT  DD DSN=&&F558FL,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(101,11,CH,NE,C'           ',AND,                               
                  71,11,CH,NE,C'           ',AND,                               
                          112,3,CH,NE,C'OM ',AND,                               
                          124,2,CH,EQ,C'  ')                                    
   OUTREC FIELDS=(1,313,C'FL',316,285)                                          
//*---------------------------------------------------------------------        
//* TO MATCH AND OUTPUT 'Y' 2ND FLAT LESSEE                                     
//*         COL 12 = 'Y' IF 2ND FLAT LESSEE                                     
//*---------------------------------------------------------------------        
//STEP60B  EXEC PGM=BP13C169,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&F558FL,DISP=(OLD,DELETE)                                    
//P13F730A DD DSN=&&F730FL,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT 2ND FLAT LESSEE FOR DAILY REPORT                                   
//* 2ND FLAT LESSEE   - COL 12                                                  
//*------------------------------------------------------------------           
//STEP60C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730FL,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(12,1,CH,EQ,C'Y',AND,211,2,CH,NE,C'1A')                        
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE GR,CG,EC,EG,EH,EM,EO,EQ,ES,EU,E5,E6                 
//*------------------------------------------------------------------           
//STEP61A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'GR',OR,221,2,CH,EQ,C'CG',OR,                    
                  221,2,CH,EQ,C'EC',OR,221,2,CH,EQ,C'EG',OR,                    
                  221,2,CH,EQ,C'EH',OR,221,2,CH,EQ,C'EM',OR,                    
                  221,2,CH,EQ,C'EO',OR,221,2,CH,EQ,C'EQ',OR,                    
                  221,2,CH,EQ,C'ES',OR,221,2,CH,EQ,C'EU',OR,                    
                  221,2,CH,EQ,C'E5',OR,221,2,CH,EQ,C'E6')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE GR/CG/EC FROM VSAM FILE                        
//*------------------------------------------------------------------           
//STEP61B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE GR/CG/EC/EG/EH/EM/EO/EQ/ES/EU/E5/E6                 
//* DEBARMENT CODE  GR/CG/EC/EG/EH/EM/EO/EQ/ES/EU/E5/E6 = Y - COL 13            
//*------------------------------------------------------------------           
//STEP61C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,12,C'Y',14,487)                                            
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FS                                                  
//*------------------------------------------------------------------           
//STEP62A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'FS')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE FS FROM VSAM FILE                              
//*------------------------------------------------------------------           
//STEP62B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FS FOR DAILY REPORT                                 
//* DEBARMENT CODE  FS = Y - COL 14                                             
//*------------------------------------------------------------------           
//STEP62C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,13,C'Y',15,486)                                            
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 6C/7A  - ARREARS                                    
//*------------------------------------------------------------------           
//STEP63A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'6C',OR,221,2,CH,EQ,C'7A',OR,                    
                  221,2,CH,EQ,C'6A',OR,221,2,CH,EQ,C'6B',OR,                    
                  221,2,CH,EQ,C'6D',OR,221,2,CH,EQ,C'07',OR,                    
                  221,2,CH,EQ,C'5C',OR,221,2,CH,EQ,C'5B',OR,                    
                  221,2,CH,EQ,C'UA',OR,221,2,CH,EQ,C'UH',OR,                    
                  221,2,CH,EQ,C'UI',OR,221,2,CH,EQ,C'UL',OR,                    
                  221,2,CH,EQ,C'UM',OR,221,2,CH,EQ,C'UD',OR,                    
                  221,2,CH,EQ,C'UE',OR,221,2,CH,EQ,C'UF',OR,                    
                  221,2,CH,EQ,C'UG',OR,221,2,CH,EQ,C'UC')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 6C/7A FROM VSAM FILE                           
//*------------------------------------------------------------------           
//STEP63B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FS FOR DAILY REPORT                                 
//* DEBARMENT CODE  6C/7A = Y - COL 15 - ARREARS                                
//*------------------------------------------------------------------           
//STEP63C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,14,C'Y',16,485)                                            
//*------------------------------------------------------------------           
//* SORT OUT AHG DEBARMENT CODES                                                
//*------------------------------------------------------------------           
//STEP64A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'LA',OR,221,2,CH,EQ,C'LB',OR,                    
                  221,2,CH,EQ,C'LC',OR,221,2,CH,EQ,C'LD',OR,                    
                  221,2,CH,EQ,C'LE',OR,221,2,CH,EQ,C'LF',OR,                    
                  221,2,CH,EQ,C'LG',OR,221,2,CH,EQ,C'LH',OR,                    
                  221,2,CH,EQ,C'LI',OR,221,2,CH,EQ,C'LJ',OR,                    
                  221,2,CH,EQ,C'LK',OR,221,2,CH,EQ,C'LL',OR,                    
                  221,2,CH,EQ,C'JA',OR,221,2,CH,EQ,C'JB',OR,                    
                  221,2,CH,EQ,C'JC',OR,221,2,CH,EQ,C'JD',OR,                    
                  221,2,CH,EQ,C'JE',OR,221,2,CH,EQ,C'JF',OR,                    
                  221,2,CH,EQ,C'JG',OR,221,2,CH,EQ,C'JH',OR,                    
                  221,2,CH,EQ,C'JI',OR,221,2,CH,EQ,C'JJ',OR,                    
                  221,2,CH,EQ,C'JK',OR,221,2,CH,EQ,C'JL',OR,                    
                  221,2,CH,EQ,C'JM',OR,221,2,CH,EQ,C'JN',OR,                    
                  221,2,CH,EQ,C'JO',OR,221,2,CH,EQ,C'JP',OR,                    
                  221,2,CH,EQ,C'JQ',OR,221,2,CH,EQ,C'JR',OR,                    
                  221,2,CH,EQ,C'NA',OR,221,2,CH,EQ,C'NB',OR,                    
                  221,2,CH,EQ,C'NC',OR,221,2,CH,EQ,C'ND',OR,                    
                  221,2,CH,EQ,C'NE',OR,221,2,CH,EQ,C'NF',OR,                    
                  221,2,CH,EQ,C'NG',OR,221,2,CH,EQ,C'NH',OR,                    
                  221,2,CH,EQ,C'NI',OR,221,2,CH,EQ,C'NJ',OR,                    
                  221,2,CH,EQ,C'NK',OR,221,2,CH,EQ,C'NL',OR,                    
                  221,2,CH,EQ,C'NM',OR,221,2,CH,EQ,C'NN',OR,                    
                  221,2,CH,EQ,C'NO',OR,221,2,CH,EQ,C'NP',OR,                    
                  221,2,CH,EQ,C'NQ',OR,221,2,CH,EQ,C'NR',OR,                    
                  221,2,CH,EQ,C'NS',OR,221,2,CH,EQ,C'NT',OR,                    
                  221,2,CH,EQ,C'NU',OR,221,2,CH,EQ,C'NV',OR,                    
                  221,2,CH,EQ,C'NW',OR,221,2,CH,EQ,C'NX',OR,                    
                  221,2,CH,EQ,C'FM',OR,221,2,CH,EQ,C'FN')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE  FROM VSAM FILE                                
//*------------------------------------------------------------------           
//STEP64B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT STRIKE CASES FOR DAILY REPORT COL 18                               
//*------------------------------------------------------------------           
//STEP64C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,17,C'Y',19,482)                                            
//*-----------------------------------------------------------------            
//* TO DETERMINE HA1-HA4 NATIONALITY NOT = SG                                   
//*-----------------------------------------------------------------            
//STEP66A  EXEC PGM=BP13CF17,REGION=1500K                                       
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13F730A DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT OUT APPLCATIONS WITH HA1 NATIONALITY = SG - COL 20                     
//* SORT OUT APPLCATIONS WITH HA1 - HA4 NATIONALITY = SG - COL 21               
//*------------------------------------------------------------------           
//STEP66B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(OLD,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(20,1,CH,EQ,C'Y',OR,21,1,CH,EQ,C'Y')                           
//*-----------------------------------------------------------------            
//* TO DETERMINE AGE :  NON-SA > 21 / SA > 55                                   
//*-----------------------------------------------------------------            
//STEP67A1 EXEC PGM=BP13CF31,REGION=1500K                                       
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13F730A DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT OUT AGE > 21 FOR NON SA AND AGE > 55 FOR SA = Y - COL 22               
//*------------------------------------------------------------------           
//STEP67A2 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(OLD,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,21,C'Y',23,478)                                            
//*-----------------------------------------------------------------            
//* OUTPUT CASES WHERE AGE OF HA1-HA4 IS < 35 YEARS OLD AND                     
//* ALLOC-SCH IS FTS                                                            
//*-----------------------------------------------------------------            
//STEP67B1 EXEC PGM=BP13CF96,REGION=1500K                                       
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13F730A DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT OUT AGE < 35 FOR FTS CASES = A - COL 22                                
//*------------------------------------------------------------------           
//STEP67B2 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(OLD,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,21,C'A',23,478)                                            
//*------------------------------------------------------------------           
//* SORT OUT FTS AND HH=G CASES                                                 
//* FTS & HH IS G = H - COL 22                                                  
//*------------------------------------------------------------------           
//STEP67C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(213,3,CH,EQ,C'FTS',AND,116,1,CH,EQ,C'G')                      
    OUTREC FIELDS=(1,21,C'H',23,478)                                            
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 4E,DY,FC,DV,DW,FW,DZ,DX,FD,FE,DU                    
//*------------------------------------------------------------------           
//STEP67D1 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'4E',OR,221,2,CH,EQ,C'DY',OR,                    
                  221,2,CH,EQ,C'FC',OR,221,2,CH,EQ,C'DV',OR,                    
                  221,2,CH,EQ,C'DW',OR,221,2,CH,EQ,C'FW',OR,                    
                  221,2,CH,EQ,C'DZ',OR,221,2,CH,EQ,C'DX',OR,                    
                  221,2,CH,EQ,C'FD',OR,221,2,CH,EQ,C'FE',OR,                    
                  221,2,CH,EQ,C'DU')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'SOLD HUDC' CASES FROM VSAM FILE               
//*------------------------------------------------------------------           
//STEP67D2 EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F7304E,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 4E/DY/FC/DV/DW/FW/DZ/DX/FD/FE/DU                    
//* DEBARMENT CODE  4E/DY/FC/DV/DW/FW/DZ/DX/FD/FE/DU = Y - COL 23               
//*------------------------------------------------------------------           
//STEP67D3 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F7304E,DISP=(SHR,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,22,C'Y',24,477)                                            
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE PO/4F                                               
//*------------------------------------------------------------------           
//STEP67E1 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'PO',OR,221,2,CH,EQ,C'4F',OR,                    
                  221,2,CH,EQ,C'5T',OR,221,2,CH,EQ,C'5U')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE PO/4F FROM VSAM FILE                           
//*------------------------------------------------------------------           
//STEP67E2 EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE PO/4F                                               
//* DEBARMENT CODE PO/4F = Y - COL 16                                           
//*------------------------------------------------------------------           
//STEP67E3 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,15,C'Y',17,484)                                            
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE SS                                                  
//*------------------------------------------------------------------           
//STEP67F1 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'SS')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'SS' FROM VSAM FILE                            
//*------------------------------------------------------------------           
//STEP67F2 EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE SS                                                  
//* DEBARMENT CODE SS = S - COL 16                                              
//*------------------------------------------------------------------           
//STEP67F3 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,15,C'S',17,484)                                            
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE AT                                                  
//*------------------------------------------------------------------           
//STEP67G1 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'AT')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'AT' FROM VSAM FILE                            
//*------------------------------------------------------------------           
//STEP67G2 EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE SS                                                  
//* DEBARMENT CODE AT = A - COL 16                                              
//*------------------------------------------------------------------           
//STEP67G3 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,15,C'A',17,484)                                            
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 11,18                                               
//*------------------------------------------------------------------           
//STEP67H1 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'11',OR,221,2,CH,EQ,C'18')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 11/18 FROM VSAM FILE                           
//*------------------------------------------------------------------           
//STEP67H2 EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 11/18 CASES FOR DAILY REPORT                        
//* DEBARMENT CODE  11/18 = Y - COL 17                                          
//*------------------------------------------------------------------           
//STEP67H3 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,16,C'Y',18,483)                                            
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES ACCORDING TO REGN NO                           
//*------------------------------------------------------------------           
//STEP68A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT,DISP=SHR                               
//SORTOUT  DD DSN=&&F730FULL,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*------------------------------------------------------------------           
//* MERGE SIMILAR REF NO TOGETHER                                               
//*------------------------------------------------------------------           
//STEP68B  EXEC PGM=BP13C165,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730FULL,DISP=(OLD,DELETE)                                  
//P13F730A DD DSN=BP13.F730.DAILY.REPORT.EC,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES -  MCPS APPLICATIONS                           
//*------------------------------------------------------------------           
//STEP68D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT.EC,DISP=SHR                            
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT.EC.PART4,DISP=OLD                      
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(376,3,CH,EQ,C'EC ')                                           
    OUTREC FIELDS=(1,499,C'D')                                                  
//*                                                                             
//*------------------------------------------------------------------           
//* SORT OUT MGPS AND NON MGPS PART1 - EC                                       
//*------------------------------------------------------------------           
//STEP68H  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT.EC.PART1,DISP=SHR                      
//SORTF1   DD DSN=&&PRT1ECP,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SORTF2   DD DSN=&&PRT1ECN,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=COPY                                                            
    OUTFIL FNAMES=SORTF1,                                                       
             INCLUDE=(245,1,CH,NE,C' ')                                         
    OUTFIL FNAMES=SORTF2,                                                       
             INCLUDE=(245,1,CH,EQ,C' ')                                         
//*                                                                             
//*------------------------------------------------------------------           
//* SORT OUT MGPS AND NON MGPS PART 4 - EC                                      
//*------------------------------------------------------------------           
//STEP68K  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT.EC.PART4,DISP=SHR                      
//SORTF1   DD DSN=&&PRT4ECP,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SORTF2   DD DSN=&&PRT4ECN,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=COPY                                                            
    OUTFIL FNAMES=SORTF1,                                                       
             INCLUDE=(245,1,CH,NE,C' ')                                         
    OUTFIL FNAMES=SORTF2,                                                       
             INCLUDE=(245,1,CH,EQ,C' ')                                         
//*                                                                             
//******************************************************************            
//* PRINT DAILY EXCEPTION REPORT FOR BTO FOR NON MGPS                           
//* 1. HOUSEHOLD CHECKS       (INPUT : F730.DAILY.REPORT.EC.PART1)              
//* 2. MCPS APPLICATIONS      (INPUT : F730.DAILY.REPORT.EC.PART2)              
//* 3. TPS/TCP APPLICATIONSM  (INPUT : F730.DAILY.REPORT.EC.PART3)              
//* 4. OTHERS                 (INPUT : F730.DAILY.REPORT.EC.PART4)              
//******************************************************************            
//STEP69C  EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//P13F730A  DD DSN=&&PRT1ECN,DISP=(OLD,DELETE)                                  
//P13F730B  DD DUMMY                                                            
//P13F730C  DD DUMMY                                                            
//P13F730D  DD DSN=&&PRT4ECN,DISP=(OLD,DELETE)                                  
//BP13L16A  DD DSN=BP13.BP18.PREE.RPT,DISP=MOD                                  
//BP13L16B  DD DUMMY                                                            
//BP13L16C  DD DUMMY                                                            
//BP13L16D  DD DSN=BP13.BP18.PREE.RPT,DISP=MOD                                  
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S16A),DISP=SHR                            
//SYSOUT    DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//******************************************************************            
//* PRINT DAILY EXCEPTION REPORT FOR BTO FOR MGPS                               
//* 1. HOUSEHOLD CHECKS       (INPUT : F730.DAILY.REPORT.EC.PART1)              
//* 2. MCPS APPLICATIONS      (INPUT : F730.DAILY.REPORT.EC.PART2)              
//* 3. TPS/TCP APPLICATIONSM  (INPUT : F730.DAILY.REPORT.EC.PART3)              
//* 4. OTHERS                 (INPUT : F730.DAILY.REPORT.EC.PART4)              
//******************************************************************            
//STEP69D  EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//P13F730A  DD DSN=&&PRT1ECP,DISP=(OLD,DELETE)                                  
//P13F730B  DD DUMMY                                                            
//P13F730C  DD DUMMY                                                            
//P13F730D  DD DSN=&&PRT4ECP,DISP=(OLD,DELETE)                                  
//BP13L16A  DD DSN=BP13.BP18.PREE.RPT,DISP=MOD                                  
//BP13L16B  DD DUMMY                                                            
//BP13L16C  DD DUMMY                                                            
//BP13L16D  DD DSN=BP13.BP18.PREE.RPT,DISP=MOD                                  
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S16A),DISP=SHR                            
//SYSOUT    DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* BACKUP PREVIOUS DAILY REPORT TO ACCUM FILE                                  
//*------------------------------------------------------------------           
//STEP0A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT.EC.PART1,DISP=SHR                      
//         DD DSN=BP13.F730.DAILY.REPORT.EC.PART4,DISP=SHR                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT.ACCUM.EC,DISP=MOD                      
//SYSIN   DD *                                                                  
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
//*------------------------------------------------------------------           
//* SORT BY NT/FT/REGNO                                                         
//*------------------------------------------------------------------           
//*STEP70A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730CB15,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(60,20),RLSE)                                         
//*SYSIN    DD *                                                                
//*  SORT FIELDS=(187,3,A,211,2,A,123,8,A),FORMAT=CH                            
//*------------------------------------------------------------------           
//* GENERATE INTER-RACIAL COUPLE REPORT                                         
//*------------------------------------------------------------------           
//*STEP70B  EXEC PGM=BP13CB15,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&F730CB15,DISP=(OLD,DELETE)                                 
//*BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR,                                      
//*            AMP=('BUFNI=8','BUFND=4')                                        
//*BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                  
//*            AMP=('BUFNI=8','BUFND=4')                                        
//*BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                   
//*BP13LB15 DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//*                      END OF JOB                                             
//*------------------------------------------------------------------           
