//BP13D534 JOB (BP13P),'BP13D534',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//*                                                                             
//*  THIS JOB IS USE                                                            
//*  1. TO CREATE THE ZIP FILE FOR FTP TO SIM LIAN                              
//*  2. TO FTP THE ZIP FILE TO SIM LIAN. THE ZIP FILE WILL BE POSTFIX           
//*     WITH DATE AND TIME                                                      
//*  3. TO FTP THE APPLICATION DATA                                             
//*                                                                             
//*  IMPORTANT : FOR CONNECTIVITY TESTING, RUN STEP03 ONWARDS.                  
//*              STEP 1 AND 2 WILL READ THE PROD DATASET AND RE-CREATE          
//*              THE FILE TO SEND TO SIM LIAN. DO NOT RUN STEP1 AND 2.          
//*                                                                             
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP133388 CKK  010706   NEW JCL FOR FTP FILE TO SIM LIAN                     
//* BP133156 IL5  311207   CHG JCL FOR FTP FILE TO HOIHUP                       
//* BP133156 IL5  311207   CHG JCL FOR FTP FILE TO HOIHUP                       
//* BP133427 IL5  060109   ADD JCL STEP FOR GENERATING FILE TO D04              
//* BP133533 IL5  100409   ADD JCL STEP FOR GENERATING FILE TO D05/6            
//* BP134109 ZDD  231210   PROCESS D07 ONLY                                     
//* BP134211 IL5  230511   REMOVE D05                                           
//* BP134211 IL5  060611   CREATE D08                                           
//* BP134211 IL5  071011   CREATE D09                                           
//* BP134211 IL5  071011   CREATE D11                                           
//* BP134211 IL5  071011   CREATE D12                                           
//* BP134470 IL5  220212   CREATE D13                                           
//* BP135234 IL5  260214   REMOVE DEL STATEMENTS FOR D06 AND D04                
//* BP135609 HH17 230615   FTP MIGRATION TO LANSFTPP01                          
//* BP136718 ZDD1 280317   REMOVE D09                                           
//* BP137844 PP11 190719   REMOVE D01 TO D07 AND D09 TO D12                     
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//*-------------------------------------------------------------------*         
//* STEP0  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//D534S000 EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FB66.FTPUNIT.D08')                                              
     DEL ('BP13.FTP.ZIP.BOOK.D08')                                              
     DEL ('BP13.FB66.FTPUNIT.D13')                                              
     DEL ('BP13.FTP.ZIP.BOOK.D13')                                              
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*------------------------------------------------------------------           
//* (((((((((((    FILE FOR PROJECT D08 (CENTRALE)   ))))))))))))               
//*------------------------------------------------------------------           
//D534S046 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.D08,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,5,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'D08')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D534S047 EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2,                                        
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.BOOK.D08)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.D08";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.D08";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D534S048 EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2,DISP=SHR                                
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D534S049 EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT,                                         
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/DBSS/D08/MF';                     
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.BOOK.D08' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D534S050 EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT,DISP=SHR                                 
//*                                                                             
//*------------------------------------------------------------------           
//* (((((((((((    FILE FOR PROJECT D13 (        )   ))))))))))))               
//*------------------------------------------------------------------           
//D534S13A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.D13,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,5,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'D13')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D534S13B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2,                                        
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.BOOK.D13)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.D13";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.D13";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D534S13C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2,DISP=SHR                                
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D534S13D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT,                                         
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/DBSS/D13/MF';                     
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.BOOK.D13' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D534S13E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT,DISP=SHR                                 
//*                                                                             
