//BP13YBK2 JOB (BP13P),'BP13YBK2',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//         NOTIFY=CSD0071                                               00020000
//*===============================================================      00030000
//*                      JCL PROFILE                                    00040000
//*===============================================================      00041000
//* APPLICATION        : BP13                                           00042000
//* JCL                : BP13YBK2                                       00043000
//* PROGRAMMER         : IL5                                            00044000
//* CREATION DATE      : 14/08/2014                                     00045000
//*                                                                     00046000
//*----------------------------------------------------------------     00047000
//* JOB DESCRITION     :                                                00048000
//* --------------                                                      00049000
//* BACKUP MONTHLY CARTRIDGE TO TO YEARLY CARTRIDGE                     00050000
//*---------------------------------------------------------------------00051000
//* CHG REF  BY  ON       DESCRIPTION                                   00052000
//* -------  --  --       ----------------------------------------------00053000
//* BP135439 IL5  20140814 - NEW                                        00054000
//* BP135609 HH17 20150731 - BACKUP BP13.FB66.FTPUNIT.LOG YEARLY        00054100
//* BP135948 NST1 20150914 - BACKUP BP13.F848.BKIMAGE.MONTH YEARLY      00054204
//**********************************************************************00055000
//*  CREATE YEARLY BACKUP - 5 YEARS (5 GEN)                             00056000
//*---------------------------------------------------------------------00057000
//STEP01   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00058000
//SYSPRINT DD  SYSOUT=*                                                 00059000
//INPUT1   DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-11),DISP=SHR         00060000
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-10),DISP=SHR         00070000
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-9),DISP=SHR          00080000
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-8),DISP=SHR          00090000
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-7),DISP=SHR          00100000
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-6),DISP=SHR          00110000
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-5),DISP=SHR          00120000
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-4),DISP=SHR          00121000
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-3),DISP=SHR          00122000
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-2),DISP=SHR          00122100
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(-1),DISP=SHR          00122200
//         DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(0),DISP=SHR           00122300
//OUTPUT1  DD  DSN=BP13.F879.ACCESS.LOG.BKUP.YRLY.TAPE(+1),             00122400
//             DISP=(NEW,CATLG),                                        00122500
//             UNIT=CART,LABEL=(1,SL),                                  00122600
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)              00122700
//*                                                                     00122800
//SYSIN    DD  *                                                        00122900
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                              00123000
//**********************************************************************00124000
//*  BACKUP BP13.FB66.FTPUNIT.LOG YEARLY                                00125000
//*---------------------------------------------------------------------00126000
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                  00310000
//SYSPRINT DD SYSOUT=*                                                  00320000
//INPUT1   DD DSN=BP13.FB66.FTPUNIT.LOG,DISP=SHR                        00330000
//OUTPUT1  DD DSN=BP13.FB66.FTPUNIT.YEAR(+1),DISP=(NEW,CATLG),          00350000
//            UNIT=CART,LABEL=(1,SL),                                   00351000
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=3000,RECFM=FB)              00352000
//*                                                                     00353000
//SYSIN    DD *                                                         00360000
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                             00370000
//*---------------------------------------------------------------------00480000
//* TO CLEAR BP13.FB66.FTPUNIT.LOG                                      00490001
//*---------------------------------------------------------------------00500000
//STEP03   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00510001
//SYSPRINT DD  SYSOUT=*                                                 00520000
//INPUT1   DD  DUMMY                                                    00530000
//OUTPUT1  DD  DSN=BP13.FB66.FTPUNIT.LOG,                               00540000
//             DISP=OLD                                                 00550000
//SYSIN    DD  *                                                        00560000
   REPRO   INFILE(INPUT1)  OUTFILE(OUTPUT1)                             00570001
/*                                                                      00580000
//*---------------------------------------------------------------------00581002
//*  REPRO VSAM FILE TO CARTRIDGE                                       00582002
//*-------------------------------------------------------------------- 00583002
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                  00584002
//SYSPRINT DD SYSOUT=*                                                  00585002
//INPUT1   DD  DSN=BP13.F848.BKIMAGE.MONTH(0),DISP=SHR                  00586002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-1),DISP=SHR                 00587002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-2),DISP=SHR                 00588002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-3),DISP=SHR                 00589002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-4),DISP=SHR                 00590002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-5),DISP=SHR                 00600002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-6),DISP=SHR                 00610002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-7),DISP=SHR                 00620002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-8),DISP=SHR                 00630002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-9),DISP=SHR                 00640002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-10),DISP=SHR                00650002
//         DD  DSN=BP13.F848.BKIMAGE.MONTH(-11),DISP=SHR                00660002
//OUTPUT1  DD  DSN=BP13.F848.BKIMAGE.YEAR(+1),                          00670002
//             DISP=(NEW,CATLG),                                        00680002
//             UNIT=CART,LABEL=(1,SL),                                  00690002
//             DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)         00700002
//SYSIN    DD  *                                                        00710002
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                00720002
//*---------------------------------------------------------------------00730002
