//BP13A587  JOB (BP13P),'BP13CD75',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//* INCLUDE FLAT TYPE = SA                                                      
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=BP13.F800.EMAIL.F100,DISP=SHR                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(785,6,A,4,8,A),FORMAT=CH                                         
  INCLUDE COND=(30,2,CH,EQ,C'1A',AND,785,6,CH,EQ,C'201505',AND,                 
                924,3,CH,EQ,C'SBF')                                             
//*---------------------------------------------------------------------        
//* OMIT LIST OF REGN                                                           
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.F800.EMAIL.F100,DISP=SHR                                
//SORTOUT  DD  DSN=&&F800SA,DISP=(,PASS),                                       
//             UNIT=SYSDA,SPACE=(CYL,(400,200),RLSE),                           
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(785,6,A,4,8,A),FORMAT=CH                                         
  OMIT COND=(4,8,CH,EQ,C'3117870C',OR,                                          
             4,8,CH,EQ,C'3125779D',OR,                                          
             4,8,CH,EQ,C'3119035E',OR,                                          
             4,8,CH,EQ,C'3127578D',OR,                                          
             4,8,CH,EQ,C'3112757B',OR,                                          
             4,8,CH,EQ,C'3110058E',OR,                                          
             4,8,CH,EQ,C'3101023C',OR,                                          
             4,8,CH,EQ,C'3154094A',OR,                                          
             4,8,CH,EQ,C'3154095Z',OR,                                          
             4,8,CH,EQ,C'3154096H',OR,                                          
             4,8,CH,EQ,C'3154097F',OR,                                          
             4,8,CH,EQ,C'3154098D',OR,                                          
             4,8,CH,EQ,C'3154092E',OR,                                          
             4,8,CH,EQ,C'3154093C',OR,                                          
             4,8,CH,EQ,C'3100055F',OR,                                          
             4,8,CH,EQ,C'3100105F',OR,                                          
             4,8,CH,EQ,C'3101110H',OR,                                          
             4,8,CH,EQ,C'3101204Z',OR,                                          
             4,8,CH,EQ,C'3101431Z',OR,                                          
             4,8,CH,EQ,C'3101455G',OR,                                          
             4,8,CH,EQ,C'3101690H',OR,                                          
             4,8,CH,EQ,C'3102157Z',OR,                                          
             4,8,CH,EQ,C'3102568J',OR,                                          
             4,8,CH,EQ,C'3102946E',OR,                                          
             4,8,CH,EQ,C'3103143E',OR,                                          
             4,8,CH,EQ,C'3103779D',OR,                                          
             4,8,CH,EQ,C'3104316F',OR,                                          
             4,8,CH,EQ,C'3104755B',OR,                                          
             4,8,CH,EQ,C'3104763C',OR,                                          
             4,8,CH,EQ,C'3104883D',OR,                                          
             4,8,CH,EQ,C'3104985G',OR,                                          
             4,8,CH,EQ,C'3105858I',OR,                                          
             4,8,CH,EQ,C'3106815J',OR,                                          
             4,8,CH,EQ,C'3107006F',OR,                                          
             4,8,CH,EQ,C'3107901B',OR,                                          
             4,8,CH,EQ,C'3108233A',OR,                                          
             4,8,CH,EQ,C'3109012A',OR,                                          
             4,8,CH,EQ,C'3109393G',OR,                                          
             4,8,CH,EQ,C'3109591C',OR,                                          
             4,8,CH,EQ,C'3109641C',OR,                                          
             4,8,CH,EQ,C'3110894B',OR,                                          
             4,8,CH,EQ,C'3112029B',OR,                                          
             4,8,CH,EQ,C'3112096I',OR,                                          
             4,8,CH,EQ,C'3112114J',OR,                                          
             4,8,CH,EQ,C'3112122A',OR,                                          
             4,8,CH,EQ,C'3112463H',OR,                                          
             4,8,CH,EQ,C'3112865Z',OR,                                          
             4,8,CH,EQ,C'3112931A',OR,                                          
             4,8,CH,EQ,C'3114776Z',OR,                                          
             4,8,CH,EQ,C'3114882J',OR,                                          
             4,8,CH,EQ,C'3115375A',OR,                                          
             4,8,CH,EQ,C'3115726I',OR,                                          
             4,8,CH,EQ,C'3116516D',OR,                                          
             4,8,CH,EQ,C'3116737Z',OR,                                          
             4,8,CH,EQ,C'3116820A',OR,                                          
             4,8,CH,EQ,C'3117113Z',OR,                                          
             4,8,CH,EQ,C'3117265I',OR,                                          
             4,8,CH,EQ,C'3117472D',OR,                                          
             4,8,CH,EQ,C'3117759F',OR,                                          
             4,8,CH,EQ,C'3120649I',OR,                                          
             4,8,CH,EQ,C'3120770C',OR,                                          
             4,8,CH,EQ,C'3120993E',OR,                                          
             4,8,CH,EQ,C'3122073D',OR,                                          
             4,8,CH,EQ,C'3122206J',OR,                                          
             4,8,CH,EQ,C'3122236B',OR,                                          
             4,8,CH,EQ,C'3122510H',OR,                                          
             4,8,CH,EQ,C'3122532I',OR,                                          
             4,8,CH,EQ,C'3122937E',OR,                                          
             4,8,CH,EQ,C'3124167G',OR,                                          
             4,8,CH,EQ,C'3124319Z',OR,                                          
             4,8,CH,EQ,C'3124610E',OR,                                          
             4,8,CH,EQ,C'3124636I',OR,                                          
             4,8,CH,EQ,C'3124658Z',OR,                                          
             4,8,CH,EQ,C'3124680F',OR,                                          
             4,8,CH,EQ,C'3125292Z',OR,                                          
             4,8,CH,EQ,C'3125867G',OR,                                          
             4,8,CH,EQ,C'3126038H',OR,                                          
             4,8,CH,EQ,C'3126283F',OR,                                          
             4,8,CH,EQ,C'3126629G',OR,                                          
             4,8,CH,EQ,C'3126639D',OR,                                          
             4,8,CH,EQ,C'3127279C',OR,                                          
             4,8,CH,EQ,C'3127468J',OR,                                          
             4,8,CH,EQ,C'3128167I',OR,                                          
             4,8,CH,EQ,C'3128201B',OR,                                          
             4,8,CH,EQ,C'3128319A',OR,                                          
             4,8,CH,EQ,C'3128808H',OR,                                          
             4,8,CH,EQ,C'3129211E',OR,                                          
             4,8,CH,EQ,C'3129317J',OR,                                          
             4,8,CH,EQ,C'3129829F',OR,                                          
             4,8,CH,EQ,C'3129843A',OR,                                          
             4,8,CH,EQ,C'3129962D',OR,                                          
             4,8,CH,EQ,C'3130182C',OR,                                          
             4,8,CH,EQ,C'3130285D',OR,                                          
             4,8,CH,EQ,C'3130412A',OR,                                          
             4,8,CH,EQ,C'3130721Z',OR,                                          
             4,8,CH,EQ,C'3131163B',OR,                                          
             4,8,CH,EQ,C'3132160C',OR,                                          
             4,8,CH,EQ,C'3132188C',OR,                                          
             4,8,CH,EQ,C'3132474B',OR,                                          
             4,8,CH,EQ,C'3133975H',OR,                                          
             4,8,CH,EQ,C'3135900G',OR,                                          
             4,8,CH,EQ,C'3136325Z',OR,                                          
             4,8,CH,EQ,C'3136666F',OR,                                          
             4,8,CH,EQ,C'3137087F',OR,                                          
             4,8,CH,EQ,C'3137304B',OR,                                          
             4,8,CH,EQ,C'3137375A',OR,                                          
             4,8,CH,EQ,C'3138288B',OR,                                          
             4,8,CH,EQ,C'3138410I',OR,                                          
             4,8,CH,EQ,C'3139044C',OR,                                          
             4,8,CH,EQ,C'3139479A',OR,                                          
             4,8,CH,EQ,C'3139598D',OR,                                          
             4,8,CH,EQ,C'3139795B',OR,                                          
             4,8,CH,EQ,C'3139875D',OR,                                          
             4,8,CH,EQ,C'3140297B',OR,                                          
             4,8,CH,EQ,C'3140605F',OR,                                          
             4,8,CH,EQ,C'3140687J',OR,                                          
             4,8,CH,EQ,C'3141441E',OR,                                          
             4,8,CH,EQ,C'3141576D',OR,                                          
             4,8,CH,EQ,C'3142154C',OR,                                          
             4,8,CH,EQ,C'3142909I',OR,                                          
             4,8,CH,EQ,C'3143653B',OR,                                          
             4,8,CH,EQ,C'3143743A',OR,                                          
             4,8,CH,EQ,C'3144467E',OR,                                          
             4,8,CH,EQ,C'3144922G',OR,                                          
             4,8,CH,EQ,C'3144954E',OR,                                          
             4,8,CH,EQ,C'3144988Z',OR,                                          
             4,8,CH,EQ,C'3145118C',OR,                                          
             4,8,CH,EQ,C'3145193J',OR,                                          
             4,8,CH,EQ,C'3145429H',OR,                                          
             4,8,CH,EQ,C'3145581B',OR,                                          
             4,8,CH,EQ,C'3145804H',OR,                                          
             4,8,CH,EQ,C'3145873J',OR,                                          
             4,8,CH,EQ,C'3146188Z',OR,                                          
             4,8,CH,EQ,C'3146219C',OR,                                          
             4,8,CH,EQ,C'3146327J',OR,                                          
             4,8,CH,EQ,C'3146385H',OR,                                          
             4,8,CH,EQ,C'3146399H',OR,                                          
             4,8,CH,EQ,C'3147197D',OR,                                          
             4,8,CH,EQ,C'3147267I',OR,                                          
             4,8,CH,EQ,C'3147478G',OR,                                          
             4,8,CH,EQ,C'3147779D',OR,                                          
             4,8,CH,EQ,C'3147937A',OR,                                          
             4,8,CH,EQ,C'3148667Z',OR,                                          
             4,8,CH,EQ,C'3149128B',OR,                                          
             4,8,CH,EQ,C'3150022B',OR,                                          
             4,8,CH,EQ,C'3150218G',OR,                                          
             4,8,CH,EQ,C'3150345J',OR,                                          
             4,8,CH,EQ,C'3150425B',OR,                                          
             4,8,CH,EQ,C'3150923H',OR,                                          
             4,8,CH,EQ,C'3151424Z',OR,                                          
             4,8,CH,EQ,C'3151456H',OR,                                          
             4,8,CH,EQ,C'3151475D',OR,                                          
             4,8,CH,EQ,C'3151570Z',OR,                                          
             4,8,CH,EQ,C'3151770B',OR,                                          
             4,8,CH,EQ,C'3152178E',OR,                                          
             4,8,CH,EQ,C'3152505E',OR,                                          
             4,8,CH,EQ,C'3152899B',OR,                                          
             4,8,CH,EQ,C'3152952B',OR,                                          
             4,8,CH,EQ,C'3152998J',OR,                                          
             4,8,CH,EQ,C'3153095D',OR,                                          
             4,8,CH,EQ,C'3153189F',OR,                                          
             4,8,CH,EQ,C'3153284A',OR,                                          
             4,8,CH,EQ,C'3153439I',OR,                                          
             4,8,CH,EQ,C'3153832G')                                             
//*--------------------------------------------------------------------*        
//* PRINT SBF SHORTLISTED CASES WITH EMAIL ADDRESS (SA)                *        
//*--------------------------------------------------------------------*        
//STEP03   EXEC PGM=BP13CD75,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800SA,DISP=(OLD,PASS)                                      
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13LD35A DD SYSOUT=*                                                          
//P13LD35B DD SYSOUT=*                                                          
//P13LD35C DD SYSOUT=*                                                          
//P13LD35D DD SYSOUT=*                                                          
//P13LD35E DD DUMMY                                                             
//P13F203A DD DSN=BP13.F23A.EMAIL.F100,DISP=SHR                                 
//P13F203B DD DSN=BP13.F23A.EMAIL.F200,DISP=SHR                                 
//P13F203C DD DSN=BP13.F23A.EMAIL.F300,DISP=SHR                                 
//P13F203D DD DSN=BP13.F23A.EMAIL.F400,DISP=SHR                                 
//P13F203E DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* INCLUDE FLAT TYPE NOT = SA                                                  
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=BP13.F800.EMAIL.F200,DISP=SHR                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(785,6,A,4,8,A),FORMAT=CH                                         
  INCLUDE COND=(30,2,CH,NE,C'1A',AND,785,6,CH,EQ,C'201411',AND,                 
                924,3,CH,EQ,C'SBF')                                             
//*---------------------------------------------------------------------        
//* OMIT LIST OF REGN                                                           
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.F800.EMAIL.F200,DISP=SHR                                
//SORTOUT  DD  DSN=&&F800NSA,DISP=(,PASS),                                      
//             UNIT=SYSDA,SPACE=(CYL,(400,200),RLSE),                           
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(785,6,A,4,8,A),FORMAT=CH                                         
  OMIT COND=(4,8,CH,EQ,C'3117870C',OR,                                          
             4,8,CH,EQ,C'3125779D',OR,                                          
             4,8,CH,EQ,C'3119035E',OR,                                          
             4,8,CH,EQ,C'3127578D',OR,                                          
             4,8,CH,EQ,C'3112757B',OR,                                          
             4,8,CH,EQ,C'3110058E',OR,                                          
             4,8,CH,EQ,C'3101023C',OR,                                          
             4,8,CH,EQ,C'3154094A',OR,                                          
             4,8,CH,EQ,C'3154095Z',OR,                                          
             4,8,CH,EQ,C'3154096H',OR,                                          
             4,8,CH,EQ,C'3154097F',OR,                                          
             4,8,CH,EQ,C'3154098D',OR,                                          
             4,8,CH,EQ,C'3154092E',OR,                                          
             4,8,CH,EQ,C'3154093C',OR,                                          
             4,8,CH,EQ,C'3100055F',OR,                                          
             4,8,CH,EQ,C'3100105F',OR,                                          
             4,8,CH,EQ,C'3101110H',OR,                                          
             4,8,CH,EQ,C'3101204Z',OR,                                          
             4,8,CH,EQ,C'3101431Z',OR,                                          
             4,8,CH,EQ,C'3101455G',OR,                                          
             4,8,CH,EQ,C'3101690H',OR,                                          
             4,8,CH,EQ,C'3102157Z',OR,                                          
             4,8,CH,EQ,C'3102568J',OR,                                          
             4,8,CH,EQ,C'3102946E',OR,                                          
             4,8,CH,EQ,C'3103143E',OR,                                          
             4,8,CH,EQ,C'3103779D',OR,                                          
             4,8,CH,EQ,C'3104316F',OR,                                          
             4,8,CH,EQ,C'3104755B',OR,                                          
             4,8,CH,EQ,C'3104763C',OR,                                          
             4,8,CH,EQ,C'3104883D',OR,                                          
             4,8,CH,EQ,C'3104985G',OR,                                          
             4,8,CH,EQ,C'3105858I',OR,                                          
             4,8,CH,EQ,C'3106815J',OR,                                          
             4,8,CH,EQ,C'3107006F',OR,                                          
             4,8,CH,EQ,C'3107901B',OR,                                          
             4,8,CH,EQ,C'3108233A',OR,                                          
             4,8,CH,EQ,C'3109012A',OR,                                          
             4,8,CH,EQ,C'3109393G',OR,                                          
             4,8,CH,EQ,C'3109591C',OR,                                          
             4,8,CH,EQ,C'3109641C',OR,                                          
             4,8,CH,EQ,C'3110894B',OR,                                          
             4,8,CH,EQ,C'3112029B',OR,                                          
             4,8,CH,EQ,C'3112096I',OR,                                          
             4,8,CH,EQ,C'3112114J',OR,                                          
             4,8,CH,EQ,C'3112122A',OR,                                          
             4,8,CH,EQ,C'3112463H',OR,                                          
             4,8,CH,EQ,C'3112865Z',OR,                                          
             4,8,CH,EQ,C'3112931A',OR,                                          
             4,8,CH,EQ,C'3114776Z',OR,                                          
             4,8,CH,EQ,C'3114882J',OR,                                          
             4,8,CH,EQ,C'3115375A',OR,                                          
             4,8,CH,EQ,C'3115726I',OR,                                          
             4,8,CH,EQ,C'3116516D',OR,                                          
             4,8,CH,EQ,C'3116737Z',OR,                                          
             4,8,CH,EQ,C'3116820A',OR,                                          
             4,8,CH,EQ,C'3117113Z',OR,                                          
             4,8,CH,EQ,C'3117265I',OR,                                          
             4,8,CH,EQ,C'3117472D',OR,                                          
             4,8,CH,EQ,C'3117759F',OR,                                          
             4,8,CH,EQ,C'3120649I',OR,                                          
             4,8,CH,EQ,C'3120770C',OR,                                          
             4,8,CH,EQ,C'3120993E',OR,                                          
             4,8,CH,EQ,C'3122073D',OR,                                          
             4,8,CH,EQ,C'3122206J',OR,                                          
             4,8,CH,EQ,C'3122236B',OR,                                          
             4,8,CH,EQ,C'3122510H',OR,                                          
             4,8,CH,EQ,C'3122532I',OR,                                          
             4,8,CH,EQ,C'3122937E',OR,                                          
             4,8,CH,EQ,C'3124167G',OR,                                          
             4,8,CH,EQ,C'3124319Z',OR,                                          
             4,8,CH,EQ,C'3124610E',OR,                                          
             4,8,CH,EQ,C'3124636I',OR,                                          
             4,8,CH,EQ,C'3124658Z',OR,                                          
             4,8,CH,EQ,C'3124680F',OR,                                          
             4,8,CH,EQ,C'3125292Z',OR,                                          
             4,8,CH,EQ,C'3125867G',OR,                                          
             4,8,CH,EQ,C'3126038H',OR,                                          
             4,8,CH,EQ,C'3126283F',OR,                                          
             4,8,CH,EQ,C'3126629G',OR,                                          
             4,8,CH,EQ,C'3126639D',OR,                                          
             4,8,CH,EQ,C'3127279C',OR,                                          
             4,8,CH,EQ,C'3127468J',OR,                                          
             4,8,CH,EQ,C'3128167I',OR,                                          
             4,8,CH,EQ,C'3128201B',OR,                                          
             4,8,CH,EQ,C'3128319A',OR,                                          
             4,8,CH,EQ,C'3128808H',OR,                                          
             4,8,CH,EQ,C'3129211E',OR,                                          
             4,8,CH,EQ,C'3129317J',OR,                                          
             4,8,CH,EQ,C'3129829F',OR,                                          
             4,8,CH,EQ,C'3129843A',OR,                                          
             4,8,CH,EQ,C'3129962D',OR,                                          
             4,8,CH,EQ,C'3130182C',OR,                                          
             4,8,CH,EQ,C'3130285D',OR,                                          
             4,8,CH,EQ,C'3130412A',OR,                                          
             4,8,CH,EQ,C'3130721Z',OR,                                          
             4,8,CH,EQ,C'3131163B',OR,                                          
             4,8,CH,EQ,C'3132160C',OR,                                          
             4,8,CH,EQ,C'3132188C',OR,                                          
             4,8,CH,EQ,C'3132474B',OR,                                          
             4,8,CH,EQ,C'3133975H',OR,                                          
             4,8,CH,EQ,C'3135900G',OR,                                          
             4,8,CH,EQ,C'3136325Z',OR,                                          
             4,8,CH,EQ,C'3136666F',OR,                                          
             4,8,CH,EQ,C'3137087F',OR,                                          
             4,8,CH,EQ,C'3137304B',OR,                                          
             4,8,CH,EQ,C'3137375A',OR,                                          
             4,8,CH,EQ,C'3138288B',OR,                                          
             4,8,CH,EQ,C'3138410I',OR,                                          
             4,8,CH,EQ,C'3139044C',OR,                                          
             4,8,CH,EQ,C'3139479A',OR,                                          
             4,8,CH,EQ,C'3139598D',OR,                                          
             4,8,CH,EQ,C'3139795B',OR,                                          
             4,8,CH,EQ,C'3139875D',OR,                                          
             4,8,CH,EQ,C'3140297B',OR,                                          
             4,8,CH,EQ,C'3140605F',OR,                                          
             4,8,CH,EQ,C'3140687J',OR,                                          
             4,8,CH,EQ,C'3141441E',OR,                                          
             4,8,CH,EQ,C'3141576D',OR,                                          
             4,8,CH,EQ,C'3142154C',OR,                                          
             4,8,CH,EQ,C'3142909I',OR,                                          
             4,8,CH,EQ,C'3143653B',OR,                                          
             4,8,CH,EQ,C'3143743A',OR,                                          
             4,8,CH,EQ,C'3144467E',OR,                                          
             4,8,CH,EQ,C'3144922G',OR,                                          
             4,8,CH,EQ,C'3144954E',OR,                                          
             4,8,CH,EQ,C'3144988Z',OR,                                          
             4,8,CH,EQ,C'3145118C',OR,                                          
             4,8,CH,EQ,C'3145193J',OR,                                          
             4,8,CH,EQ,C'3145429H',OR,                                          
             4,8,CH,EQ,C'3145581B',OR,                                          
             4,8,CH,EQ,C'3145804H',OR,                                          
             4,8,CH,EQ,C'3145873J',OR,                                          
             4,8,CH,EQ,C'3146188Z',OR,                                          
             4,8,CH,EQ,C'3146219C',OR,                                          
             4,8,CH,EQ,C'3146327J',OR,                                          
             4,8,CH,EQ,C'3146385H',OR,                                          
             4,8,CH,EQ,C'3146399H',OR,                                          
             4,8,CH,EQ,C'3147197D',OR,                                          
             4,8,CH,EQ,C'3147267I',OR,                                          
             4,8,CH,EQ,C'3147478G',OR,                                          
             4,8,CH,EQ,C'3147779D',OR,                                          
             4,8,CH,EQ,C'3147937A',OR,                                          
             4,8,CH,EQ,C'3148667Z',OR,                                          
             4,8,CH,EQ,C'3149128B',OR,                                          
             4,8,CH,EQ,C'3150022B',OR,                                          
             4,8,CH,EQ,C'3150218G',OR,                                          
             4,8,CH,EQ,C'3150345J',OR,                                          
             4,8,CH,EQ,C'3150425B',OR,                                          
             4,8,CH,EQ,C'3150923H',OR,                                          
             4,8,CH,EQ,C'3151424Z',OR,                                          
             4,8,CH,EQ,C'3151456H',OR,                                          
             4,8,CH,EQ,C'3151475D',OR,                                          
             4,8,CH,EQ,C'3151570Z',OR,                                          
             4,8,CH,EQ,C'3151770B',OR,                                          
             4,8,CH,EQ,C'3152178E',OR,                                          
             4,8,CH,EQ,C'3152505E',OR,                                          
             4,8,CH,EQ,C'3152899B',OR,                                          
             4,8,CH,EQ,C'3152952B',OR,                                          
             4,8,CH,EQ,C'3152998J',OR,                                          
             4,8,CH,EQ,C'3153095D',OR,                                          
             4,8,CH,EQ,C'3153189F',OR,                                          
             4,8,CH,EQ,C'3153284A',OR,                                          
             4,8,CH,EQ,C'3153439I',OR,                                          
             4,8,CH,EQ,C'3153832G')                                             
//*--------------------------------------------------------------------*        
//* PRINT SBF SHORTLISTED CASES WITH EMAIL ADDRESS (NOT SA)            *        
//*--------------------------------------------------------------------*        
//STEP06   EXEC PGM=BP13CD75,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800NSA,DISP=(OLD,PASS)                                     
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13LD35A DD SYSOUT=*                                                          
//P13LD35B DD SYSOUT=*                                                          
//P13LD35C DD SYSOUT=*                                                          
//P13LD35D DD SYSOUT=*                                                          
//P13LD35E DD SYSOUT=*                                                          
//P13F203A DD DSN=BP13.F23A.EMAIL.F500,DISP=SHR                                 
//P13F203B DD DSN=BP13.F23A.EMAIL.F600,DISP=SHR                                 
//P13F203C DD DSN=BP13.F23A.EMAIL.F700,DISP=SHR                                 
//P13F203D DD DSN=BP13.F23A.EMAIL.F800,DISP=SHR                                 
//P13F203E DD DSN=BP13.F23A.EMAIL.F855,DISP=SHR                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
