//BP13A680 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//        NOTIFY=CSD0071                                                        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------*             
//*     CPF BACKUP FILE MODULE                                    *             
//*---------------------------------------------------------------*             
//*     JOB IS INVOKED FROM BP13M638 PANEL                        *             
//*---------------------------------------------------------------*             
//* CHGE REQ  DATE        BY   DESCRIPTION                        *             
//* --------  ----        ---  -----------                        *             
//* BP130929  08/02/2001  CLT  CHANGE DISP TO MOD                 *             
//*---------------------------------------------------------------*             
//*****************************************************************             
//* SORT BP13K465 FILE BY APPT-DTE                                *             
//*****************************************************************             
//STEP1  EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.K465.APPT,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F465,DISP=(NEW,PASS),                                   
//            DCB=*.SORTIN,                                                     
//            SPACE=(TRK,(50,10),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,CH,A)                                                        
//*****************************************************************             
//* EXTRACT DATES FROM BP13K454 BASED ON BP13K465 RECORDS         *             
//*****************************************************************             
//STEP2  EXEC PGM=BP13C608,COND=(0,NE)                                          
//BP13F465 DD DSN=&&BP13F465,DISP=(OLD,DELETE)                                  
//BP13K454 DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//BP13F454 DD DSN=BP13.F454.APPTABLE.CPF,DISP=MOD                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
