//BP13D110 JOB (BP13P),'BP13D110',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================*           
//* DAILY JOB TO UPDATE KEY-ISSUE DATE WHEN DBSS DEVELOPER UPDATE               
//* INDIVUDUAL TOP DATE VIA E-DBSS PORTAL                                       
//* SYSTEM TO UPDATE KEY-ISSEU-DATE IN FIS                                      
//* OUTPUT FILE TO PUB                                                          
//*=================================================================*           
//* CHG-NO    ON     BY   DESCRIPTION                                           
//*------------------------------------                                         
//* BP133505 190109 LSB1 CREATE SPIN                                            
//* BP133383 130209 LSB1 CHECK PP=09,10 FRO BP13CD48                            
//* BP133489 170209 JB8  CHANGE INPUT OF CD54 TO FD00                           
//* BP133662 030809 LSB  EFF-SUB-TRF DATE ONLY FD IN OLD-REGN                   
//*                      K800-NEW-REGN KEEP SUBTRF OLD REGN-NO                  
//* BP133612 140809 JB8  MOVE PGM BP13CD48 TO BP13D111                          
//* BP133858 230710 PCL3 REMOVE BF02F070 IN BP13CD53                            
//* BP134025 300910 IL5  MOVE PGM BP13CD54 TO BP13D90B                          
//* BP135171 100214 RJE1 TO CATER FOR DB2 UPGRADE                               
//*=================================================================*           
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                       *           
//*-----------------------------------------------------------------*           
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BM06.K110.FLATINV,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY                           (MA&B TEAM)                        
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13S,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* INCLUDE DBSS TOP CASES                                                      
//*--------------------------------------------------------------------         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD15.DBSSTP,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&BP13FD15,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                               03880012
//            DCB=(BLKSIZE=0,LRECL=300,RECFM=FB),                       03890012
//            SPACE=(CYL,(7,5),RLSE)                                    03890112
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(26,11,A),FORMAT=CH                                              
   INCLUDE COND=(90,8,CH,NE,C'        ')                                        
//*-------------------------------------------------------------------*         
//* UPDATE FIS BM06K110 KEY ISSUE-DATE AT TOP DBSS                              
//* OUTPUT FILE TO PUB                                                          
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13FD15 DD DSN=&&BP13FD15,DISP=(OLD,PASS)                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F418 DD DSN=BP13.F418.PUB,DISP=MOD                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CD53) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
