//BP13A406  JOB (BP13P),'BP13A406',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*====================================================================         
//* CHG REQ  BY   ON                                                            
//*--------------------                                                         
//* BP137091 LSB 211117 - NEW PROGRAM UPDATE PCD-DATE                           
//*--------------------------------------------------------------------         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BM06.K100.BLOCK,DISP=OLD                                      
//INPUT2   DD DSN=BM06.K190.LOG,DISP=OLD                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*---------------------------------------------------------------------        
//* SORT BP13F217 BY POSTAL - INPUT FILE FROM BQG                               
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F217.PCD,DISP=SHR                                        
//SORTOUT  DD DSN=&&BP13F217,DISP=(,PASS),                                      
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=20,BLKSIZE=0),                                    
//        SPACE=(CYL,(5,2),RLSE)                                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(8,6,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* SORT BM06F130 BY POSTAL                                                     
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F130.BLOCK.PIDB,DISP=SHR                                 
//SORTOUT  DD DSN=&&BM06F130,DISP=(,PASS),                                      
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                                   
//        SPACE=(CYL,(20,10),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(521,6,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MATCH POSTAL TO UPDATE NUM-PCD, DTE-PCD TO BM06K100                         
//*-----------------------------------------------------------------            
//STEP04  EXEC PGM=BP13C217,COND=(0,NE)                                         
//BP13F217 DD DSN=&&BP13F217,DISP=(OLD,PASS)                                    
//BM06F130 DD DSN=&&BM06F130,DISP=(OLD,PASS)                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K190 DD DSN=BM06.K190.LOG,DISP=SHR,                                       
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13FOUT DD DSN=BP13.L217.UPDPCD,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP INPUT FILE                                                           
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F217.PCD,DISP=SHR                                        
//OUTPUT1  DD DSN=BP13.F217.PCD.BKUP(+1),DISP=(NEW,CATLG),                      
//            SPACE=(CYL,(3,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=27980,LRECL=20,RECFM=FB)                    
//*                                                                             
//INPUT2   DD DSN=BP13.L217.UPDPCD,DISP=SHR                                     
//OUTPUT2  DD DSN=BP13.L217.UPDPCD.BKUP(+1),DISP=(NEW,CATLG),                   
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27900,LRECL=150,RECFM=FB)                   
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
