//BP13A981 JOB (BP13P),'BP13A981',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*=====================================================================        
//* TITLE  : COMPUTER BALLOTING OF EC         DATE CREATED : 31/12/1998         
//*---------------------------------------------------------------------        
//* STEP       PROCESS                                                          
//*=====================================================================        
//* STEP01     PRINT FLAT APPORTIONMENT REPORT.                                 
//*=====================================================================        
//*-------------------------------------------------------------                
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP132360  LMS  05062003 NEW JCL                                             
//* BP132736  CKK  28082005 CHANGE COPYCOB OF BP13K110                          
//* BP134076  ZDD1 11112010 INCLUDE NEW OUTPUT FILE ON BP13C912                 
//* BP134094  IL5  03112011 INCLUDE NEW INPUT FILE ON BP13C912                  
//* BP134558  SMR2 28052012 INCLUDE NEW OUTPUT FILE ON BP13C912                 
//* BP134558  IL5  14062012 INCLUDE NEW OUTPUT FILE ON BP13C912                 
//* BP136609  SMR2 10032017 CHANGE OUTPUT CLASS FROM 2 TO J                     
//* BP137237  JF7  03042018 COMBINE 2A AND 2B FLAT TYPES                        
//* BP138301  AM25 04062020 HARDCOPY REPORTS CONVERSION                         
//*-------------------------------------------------------------                
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT REPORT                                                 
//*---------------------------------------------------------------------        
//STEP01 EXEC    SAS,COND=(0,NE)                                                
//WORK     DD  UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5))                                               
//FT42F001 DD  SYSOUT=8,DEST=IOM8                                               
//P13F100A DD  DSN=BP13.F100.CONDUNIT.RANDOM,                                   
//             DISP=SHR                                                         
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S906),                                    
//             DISP=SHR                                                         
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT REPORT                                                 
//*---------------------------------------------------------------------        
//STEP02 EXEC    SAS,COND=(0,NE)                                                
//WORK     DD  UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5))                                               
//FT42F001 DD  SYSOUT=8,DEST=IOM8                                               
//P13F100A DD  DSN=BP13.F100.CONDUNIT.RANDOM,                                   
//             DISP=SHR                                                         
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S905),                                    
//             DISP=SHR                                                         
//*---------------------------------------------------------------------        
//* SORT BP13K110                                                               
//*---------------------------------------------------------------------        
//STEP3A EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K110.GROUNIT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F11A,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,21,CH,A)                                                   
      INCLUDE COND=(7,2,CH,NE,C'2A',AND,7,2,CH,NE,C'2B')                        
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BP13K110                                                               
//*---------------------------------------------------------------------        
//STEP3B EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K110.GROUNIT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F11B,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,21,CH,A)                                                   
      INCLUDE COND=(7,2,CH,EQ,C'2A',OR,7,2,CH,EQ,C'2B')                         
      OUTREC FIELDS=(1:1,6,                                                     
                     7:C'2 ',                                                   
                     9:9,72)                                                    
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BP13K110                                                               
//*---------------------------------------------------------------------        
//STEP03 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&BP13F11A,DISP=(OLD,DELETE)                                 
//         DD  DSN=&&BP13F11B,DISP=(OLD,DELETE)                                 
//SORTOUT  DD  DSN=&&BP13F110,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,21,CH,A)                                                   
      SUM FIELDS=(22,2,ZD)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BP13F100                                                               
//*---------------------------------------------------------------------        
//STEP4A EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.CONDUNIT.RANDOM,                                   
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F10A,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(117,3,A,120,3,A,72,2,A,59,4,A,63,4,A,67,5,A,19,28,A),          
                FORMAT=CH                                                       
      INCLUDE COND=(72,2,CH,NE,C'2A',AND,72,2,CH,NE,C'2B')                      
      OUTREC FIELDS=(1:1,133,                                                   
                     134:72,2,                                                  
                     136:136,665)                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BP13F100                                                               
//*---------------------------------------------------------------------        
//STEP4B EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.CONDUNIT.RANDOM,                                   
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F10B,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(117,3,A,120,3,A,72,2,A,59,4,A,63,4,A,67,5,A,19,28,A),          
                FORMAT=CH                                                       
      INCLUDE COND=(72,2,CH,EQ,C'2A',OR,72,2,CH,EQ,C'2B')                       
      OUTREC FIELDS=(1:1,71,                                                    
                     72:C'2 ',                                                  
                     74:74,60,                                                  
                     134:72,2,                                                  
                     136:136,665)                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BP13F100                                                               
//*---------------------------------------------------------------------        
//STEP04 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&BP13F10A,DISP=(OLD,DELETE)                                 
//         DD  DSN=&&BP13F10B,DISP=(OLD,DELETE)                                 
//SORTOUT  DD  DSN=&&BP13F100,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(117,3,A,120,3,A,72,2,A,59,4,A,63,4,A,67,5,A,19,28,A),          
                FORMAT=CH                                                       
/*                                                                              
//*---------------------------------------------------------------------        
//* RUN PROGRAM BP13C912                                                        
//*---------------------------------------------------------------------        
//STEP05 EXEC    PGM=BP13C912,COND=(0,NE)                                       
//BP13F110 DD  DSN=&&BP13F110,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F100 DD  DSN=&&BP13F100,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13L912 DD  SYSOUT=8,DEST=IOM8                                               
//BP13FQ50 DD  DSN=BP13.FQ50.GROUNIT,                                           
//             DISP=MOD                                                         
//BP13FNMR DD  DSN=BP13.F100.MGPUNIT,                                           
//             DISP=OLD                                                         
//BP13FSLT DD  DSN=BP13.F100.FNLSLCT,                                           
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* END OF JOB BP13A981                                                         
//*---------------------------------------------------------------------        
