//BP13A22J JOB (BP13P),'BP13A22J',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-------------------------------------------------------------------*         
//*- THIS JOB IS A SUBSET OF BP13D223                                           
//*- ALLOW USERS TO EXTRACT HARDLUCK CASES IN REQUEST FILE                      
//*=================================================================            
//*-CHG-NO   BY   ON    DESCRIPTION                                             
//*------------------------------------                                         
//*-BP138038 IL5 291119 NEW                                                     
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//* STEP0  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//STEP0    EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.F008.A22J.OUTPUT')                                              
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC NRIC FOR HARDLUCK CASES                                              
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F007,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(LRECL=200,RECFM=FB)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  OUTREC FIELDS=(41,9,123,8,82,9,376,3,187,3,211,2,213,3,                       
                 248,3,334,6,225,1,116,1,461,1,475,1,150X)                      
  INCLUDE COND=(376,3,CH,EQ,C'BTO',AND,                                         
                466,1,CH,NE,C' ')                                               
//*-----------------------------------------------------------------            
//* PRINT PROFILE OF HARDLUCK CASES                                             
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13CY90,COND=(0,NE)                                        
//BP13F007 DD  DSN=&&BP13F007,DISP=(OLD,PASS)                                   
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K585 DD  DSN=BP13.K585.HARDLUCK,DISP=SHR,                                 
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K828 DD  DSN=BP13.K828.HISTOCCP,DISP=SHR,                                 
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K593 DD  DSN=BP13.K593.UNSUCCNT,DISP=SHR,                                 
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K595 DD  DSN=BP13.K595.BP13D220,DISP=SHR,                                 
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K591 DD  DSN=BP13.K595.BP13D220.PATH1,DISP=SHR,                           
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13F008 DD  DSN=BP13.F008.A22J.OUTPUT,DISP=(NEW,CATLG),                      
//             SPACE=(CYL,(80,10),RLSE),DATACLAS=MULTIVOL,                      
//             DCB=(BLKSIZE=27000,LRECL=1000,RECFM=FB)                          
//SUMMARY   DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSABOUT  DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSTSPRT  DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSTSIN   DD *                                                                
