//BP13D703  JOB (BP13P),'BP13D703',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*================================================================*            
//*                                                                *            
//*        C H A N G E    O C C U P    J O B                       *            
//*                                                                *            
//*================================================================*            
//* CHGE REQ     DATE     BY   DESCRIPTION                         *            
//* --------  ----------  ---  -----------                         *            
//* BP132163  17/01/2003  CLT1 INTERNET COFN/CANCEL APPLN          *            
//* BP135547  12/11/2014  CCC5 INCLUDE EMAIL ROUTING               *            
//* BP135547  21/11/2014  CCC5 INCLUDE DETAIL REPORT               *            
//* BP135527  03/12/2014  ESA1 TO CATER FOR SENDING OF EMAIL       *            
//*                            INDIVIDUALLY                        *            
//* BP136829  22/02/2019  ZS13 TO ADD BP13K022 AND BP13K024 FOR    *            
//*                            BP13C388 AND BP13C387               *            
//*================================================================*            
//*-------------------------------------------------------------------*         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                  *         
//*  PRT01 : COPIES = 1  SIMPLEX   FOR ALLOCATION SECTION             *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13S,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT CONTROL REPORT             *         
//* PRT02 : CLASS = 2                                                 *         
//*-------------------------------------------------------------------*         
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                         *         
//*-------------------------------------------------------------------*         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1    DD DSN=BP13.K796.APPOCC,DISP=OLD                                    
//INPUT2    DD DSN=BP13.K797.APPCANCL,DISP=OLD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*-------------------------------------------------------------------*         
//*  BACKUP FILES BEFORE RUN                                          *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K796.APPOCC,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F796.APPOCC.DBKUP(+1),DISP=(NEW,CATLG),                  
//            SPACE=(CYL,(5,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)                  
//*                                                                             
//INPUT2   DD DSN=BP13.K797.APPCANCL,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F797.APPCANCL.DBKUP(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO PRINT DAILY COFN CASES                                         *         
//*-------------------------------------------------------------------*         
//STEP03A  EXEC PGM=BP13C387                                                    
//BP13K796 DD DSN=BP13.K796.APPOCC,DISP=SHR                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13L387 DD DUMMY                                                             
//P13L387B DD DUMMY                                                             
//*BP13L387 DD DSN=&&L387,DISP=(,PASS),UNIT=(SYSDA,10),                         
//*         SPACE=(CYL,(5,5),RLSE),                                             
//*         DCB=(RECFM=FB,LRECL=133,BLKSIZE=133)                                
//*P13L387B DD DSN=&&L387B,DISP=(,PASS),UNIT=(SYSDA,10),                        
//*         SPACE=(CYL,(5,5),RLSE),                                             
//*         DCB=(RECFM=FB,LRECL=133,BLKSIZE=133)                                
//P13L387C DD DSN=&&L387C,DISP=(,PASS),UNIT=(SYSDA,10),                         
//         SPACE=(CYL,(5,5),RLSE),                                              
//         DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)                                 
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP03C  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&L387C,DISP=(OLD,DELETE)                                     
//*--------------------------------------------------------------------*        
//*       OUTPUT REPORT P13L387B                                                
//*------------------------------------------------------------------           
//*STEP03D  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD  DSN=&&L387B,DISP=(OLD,PASS)                                     
//*SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*--------------------------------------------------------------------*        
//*       OUTPUT REPORT P13L387                                                 
//*------------------------------------------------------------------           
//*STEP03E  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD  DSN=&&L387,DISP=(OLD,PASS)                                      
//*SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO PRINT DAILY CANCELLATION CASES                                 *         
//*-------------------------------------------------------------------*         
//STEP04A  EXEC PGM=BP13C388                                                    
//BP13K797 DD DSN=BP13.K797.APPCANCL,DISP=SHR                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13L388 DD DUMMY                                                             
//P13L388B DD DUMMY                                                             
//*BP13L388 DD DSN=&&L388,DISP=(,PASS),UNIT=(SYSDA,10),                         
//*         SPACE=(CYL,(5,5),RLSE),                                             
//*         DCB=(RECFM=FB,LRECL=133,BLKSIZE=133)                                
//*P13L388B DD DSN=&&L388B,DISP=(,PASS),UNIT=(SYSDA,10),                        
//*         SPACE=(CYL,(5,5),RLSE),                                             
//*         DCB=(RECFM=FB,LRECL=133,BLKSIZE=133)                                
//P13L388C DD DSN=&&L388C,DISP=(,PASS),UNIT=(SYSDA,10),                         
//         SPACE=(CYL,(5,5),RLSE),                                              
//         DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)                                 
//P13L388D DD DSN=&&L388D,DISP=(,PASS),UNIT=(SYSDA,10),                         
//         SPACE=(CYL,(5,5),RLSE),                                              
//         DCB=(RECFM=FB,LRECL=132,BLKSIZE=132)                                 
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP04C  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&L388C,DISP=(OLD,DELETE)                                     
//*---------------------------------------------------------------------        
//* SEND WEEKLY EMAIL (EVERY SUN NIGHT)                                         
//*---------------------------------------------------------------------        
//STEP04D  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&L388D,DISP=(OLD,DELETE)                                     
//*--------------------------------------------------------------------*        
//*   OUTPUT REPORT P13L388B                                                    
//*------------------------------------------------------------------           
//*STEP04E  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD  DSN=&&L388B,DISP=(OLD,PASS)                                     
//*SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*--------------------------------------------------------------------*        
//*   OUTPUT REPORT P13L388                                                     
//*------------------------------------------------------------------           
//*STEP04F  EXEC PGM=IEBGENER,COND=(0,NE)                                       
//*SYSUT1   DD  DSN=&&L388,DISP=(OLD,PASS)                                      
//*SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD DUMMY                                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC WTOG,COND=(0,NE)                                                
   ----> ############################################                           
   ---->    AFTER SUCCESSFUL COMPLETION OF                                      
   ---->          BP13D701, BP13D703 JOBS                                       
   ---->    PLEASE GROUP OPEN BP13G                                             
   ---->    EXCEPT MTH END OPEN AFTER BP13M403                                  
   ----> ############################################                           
//*-------------------------------------------------------------------*         
//*                     END OF JOB                                    *         
//*-------------------------------------------------------------------*         
