//BP13M507 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* PRINT EXCEPTION REPORT TO SALES/APL FOR CASES WITH                          
//* INVALID ZONE/FLAT TYPE/HOUSEHOLD TYPE                                       
//* RUN ON 15 OF THE MONTH                                                      
//**********************************************************************        
//* CHG REF  BY  ON        DESCRIPTION                                          
//* -------- --- --------  -----------                                          
//* BP130418 SIA 19980922  Y2K COMPLIANCE CHANGES                               
//* BP130871 SSS 20000609  LISTING FOR EAALSS                                   
//* BP135706 ESA120150414  ADD BP13C25U TO UPDATE BP13K800 INCOME               
//*                        COMMENT OFF STEP 8-10 (USER REQUEST)                 
//* BP138026 IL5 20191109  SALES REQ TO STOP PRINTING BP13L524.                 
//*                        DELETE STEPS PRT01, STEP01 TO STEP07                 
//*                        SCRATCH PROGRAM BP13S524                             
//*---------------------------------------------------------------------        
//*  SORT NON-CANCELLED AND BOOKED CASES                                        
//*-----------------------------------------------------------------            
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                              
//            SPACE=(CYL,(220,50),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,155,11,CH,NE,C'           ')                 
//*---------------------------------------------------------------------        
//*  BACK UP -CANCELLED AND BOOKED CASES WITH UNMATCHED INCOME                  
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.L25U.INCOME,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.L25U.INCOME.PREV,DISP=SHR                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*--------------------------------------------------------------------*        
//* MATCH BP13F800 INCOME WITH BP13K820                                         
//*-----------------------------------------------------------------            
//STEP10   EXEC PGM=BP13C25U,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13L25U DD DSN=BP13.L25U.INCOME,DISP=SHR                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
