//BP13AA04 JOB (BP13P),'BP13AA04',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//             NOTIFY=CSD0071                                           00020000
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00030000
//             DISP=SHR                                                 00040000
//*-------------------------------------------------------------        00050000
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                   00060000
//*---------------------------------------------------------------------00070000
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                               00080000
//SYSUT1   DD  *                                                        00090000
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                              00100000
1$DJDE$ JDE=BP13D,COPIES=1,JDL=BP13,END;                                00110000
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                             00120000
//SYSUT2   DD  SYSOUT=8,                                                00130001
//             OUTPUT=(*.FORMID),DEST=IOM8                              00140001
//SYSPRINT DD  SYSOUT=*                                                 00150000
//SYSIN    DD  DUMMY                                                    00160000
/*                                                                      00170000
//*---------------------------------------------------------------------00180000
//* TO SORT BP13K100                                                    00190000
//*---------------------------------------------------------------------00200000
//SORT01  EXEC SORT,CYL=2,COND=(0,NE)                                   00210000
//SORTIN   DD DSN=BP13.K100.DBSSUNIT.UPDATE,DISP=SHR                    00220000
//SORTOUT  DD DSN=&&BP13F100,DISP=(,PASS),                              00230000
//          UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                         00240000
//          DCB=(BLKSIZE=0,LRECL=800,RECFM=FB)                          00250000
//SYSOUT   DD SYSOUT=*                                                  00260000
//SYSIN    DD *                                                         00270000
   SORT FIELDS=(1,8,CH,A,72,2,CH,A,19,28,CH,A)                          00280000
   INCLUDE COND=(50,1,CH,EQ,C'G')                                       00290000
/*                                                                      00300000
//*---------------------------------------------------------------------00310000
//* TO PRINT GRO LIST                                                   00320000
//*---------------------------------------------------------------------00330000
//STEP02 EXEC  PGM=BP13CA09,COND=(0,NE),                                00340000
//             REGION=4096K                                             00350000
//BP13F100 DD  DSN=&&BP13F100,DISP=(SHR,PASS)                           00360000
//BP13LA09 DD  SYSOUT=8,                                                00370001
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM8                        00380001
//SYSOUT   DD  SYSOUT=*                                                 00390000
//SYSTSPRT DD  SYSOUT=*                                                 00400000
//SYSPRINT DD  SYSOUT=*                                                 00410000
//SYSDBG   DD  SYSOUT=*                                                 00420000
//SYSDBOUT DD  SYSOUT=*                                                 00430000
