//BP13D405  JOB (BP13P),'BP13D405',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//*================================================================*            
//*                                                                *            
//*   C P F     W I T H D R A W A L     T H R U      I D - N E T   *            
//*                                                                *            
//*================================================================*            
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP130487  07/05/1998  SSS1 CHG UNIT=3480 TO UNIT=CART           *           
//* BP130418  31/08/1998  LJL1 Y2K COMPLIANCE CHANGES               *           
//* BP130522  12/10/1998  LLW  CHG LAYOUT BP13FCPF                  *           
//* BP130929  23/10/2000  CLT  EXPANSION OF CPF WITHDRAWAL FILE     *           
//* BP130986  21/02/2001  CKK  CHANGES TO K600 ADDRESS FORMAT       *           
//* BP132042  21/12/2001  CKK  CHANGE BP13C470 TO READ DB2(BP13C913)*           
//* BP132842  23/08/2006  CLT  ADD BP13K410 FOR BP13C319            *           
//* BP132909  16/10/2006  LSB  ADD DBSS CASES                       *           
//* BP132973  08/02/2007  LSB  ADD SY02F001 FOR C407, SC09          *           
//* BP133477  05/04/2010  ZDD  ADD BP13S47A                         *           
//* BP135171  11/02/2014  RJE1 TO CATER FOR DB2 UPGRADE                         
//* BP136161  15/03/2016  KSJ3 TO ADD BP17K100/110/112 TO BP13C470  *           
//* BP136161  22/03/2016  KSJ3 TO ADD BP17K000         TO BP13C470  *           
//* BP136161  18/04/2016  KSJ3 TO REMOVE BP17 DS FROM BP13C470      *           
//* BP136416  22/12/2016  KSJ3 TO INCL A1/A2 CONDITION IN SORT FOR  *           
//*                            AB02F860 (STEP11-33)                 *           
//* BP136711  20/03/2017  KSJ3 TO INCL BP13K607 IN BP13C472         *           
//* BP136632  13/04/2017  KSJ3 TO EXPAND BP13K600                   *           
//* BP136692  25/04/2017  KSJ3 EXPAND AB02F860 FROM 600 TO 2000     *           
//* BP136755  04/05/2017  KSJ3 ADD BP13K60F FOR BP13C472 AND GDG    *           
//* BP136740  09/05/2017  KSJ3 EXCLUDE 'E' RECORDS FROM HPI RPTS    *           
//* BP136883  16/08/2017  KSJ3 EXCLUDE K600 BYPASS RECS IN C470 PROC*           
//* BP136757  21/08/2017  KSJ3 CATER FOR ECPF FOR SOCA              *           
//* BP136994  10/10/2017  LJL1 EXCLUDE 'E' RECORDS FOR SOCA CPF RPT *           
//* BP137038  17/04/2018  PCL4 TO READ BP13K857 ON BP13C470         *           
//* BP138865  28/10/2021  KR13 RMVD RPRT L470,L470A,L470B,L319A,L319B           
//*=================================================================*           
//*-----------------------------------------------------------------*           
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                *           
//*  PRT01 : COPIES = 1            ** (SALES - AGM TEAM)            *           
//*-----------------------------------------------------------------*           
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                *           
//*  PRT02 : COPIES = 2            ** (SALES - AGM TEAM)            *           
//*-----------------------------------------------------------------*           
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2 CP-1',END;                                     
1$DJDE$ JDE=13C510,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                *           
//*  PRT2A : COPIES = 2            ** (SALES - APPLN TEAM)          *           
//*-----------------------------------------------------------------*           
//PRT2A    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP2 CP-1',END;                                     
1$DJDE$ JDE=13C510,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP2                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                *           
//*  PRT03 : COPIES = 3            ** (SALES - AGM TEAM)            *           
//*-----------------------------------------------------------------*           
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG3 CP-1',END;                                     
1$DJDE$ JDE=13C413,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG3                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                *           
//*  PRT04 : COPIES = 4            ** (SALES - AGM TEAM)            *           
//*-----------------------------------------------------------------*           
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG4 CP-1',END;                                     
1$DJDE$ JDE=13C319,DUPLEX=NO,JDL=BP13,END;                                      
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG4                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                *           
//*  PRT4A : COPIES = 4            ** (SALES - AGM TEAM)            *           
//*-----------------------------------------------------------------*           
//PRT4A    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP4 CP-1',END;                                     
1$DJDE$ JDE=13C319,DUPLEX=NO,JDL=BP13,END;                                      
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP4                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------*           
//*  BACKUP BP13.K600.CPFWDL - 7 GDG                                *           
//*-----------------------------------------------------------------*           
//STEP1    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F600.CPFWDL.DAILY(+1),DISP=(,PASS),                      
//            UNIT=CART,LABEL=(,SL),                                            
//            DCB=(BP13.GDG,BLKSIZE=27000,LRECL=1800,RECFM=FB)                  
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
//*                                                                             
//*-----------------------------------------------------------------*           
//*  CATALOG GDG                                                    *           
//*-----------------------------------------------------------------*           
//STEP2    EXEC PGM=IEFBR14,COND=(0,NE)                                         
//INPUT4   DD DSN=BP13.F600.CPFWDL.DAILY(+1),DISP=(OLD,CATLG),                  
//             UNIT=(,,DEFER)                                                   
//*                                                                             
//*--------------------------------------------------------------------         
//*  BACKUP FILES BEFORE RUN                                                    
//*--------------------------------------------------------------------         
//STEP2A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K607.CPFREJ,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F607.CPFREJ.BFDAILY(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=2100,RECFM=FB)                      
//INPUT2   DD DSN=BP13.K60F.CPFPEND,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F60F.CPFPEND.BFDAILY(+1),DISP=(NEW,CATLG),               
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//INPUT3   DD DSN=BP13.K60K.CPFSOCA,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F60K.CPFSOCA.BFDAILY(+1),DISP=(NEW,CATLG),               
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*                                                                             
//*-----------------------------------------------------------------*           
//*  SORT THE CPF-WITHDRAWAL FILE FOR CASES NOT SENT TO CPFB YET    *           
//*  DTE-SEND         (COL 405)                                     *           
//*  DTE-PRINT        (COL 370)                                     *           
//*  NUM-SUB-TRANSFER (COL 735)                                     *           
//*  NUM-DBSS         (COL 704)                                     *           
//*-----------------------------------------------------------------*           
//STEP3    EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F600.CPFWDL,DISP=SHR                                     
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,31,A),FORMAT=CH                                                
  INCLUDE COND=((405,8,CH,EQ,C'        '),AND,                                  
                (370,8,CH,GE,C'19960601'),AND,                                  
                (735,1,CH,EQ,C'Y'),AND,                                         
                (704,1,CH,NE,C'Y'),AND,                                         
                (736,1,CH,NE,C'Y',OR,                                           
                (736,1,CH,EQ,C'Y',AND,                                          
                 747,8,CH,NE,C'00000000',AND,                                   
                 747,8,CH,NE,C'        ')),AND,                                 
               (1599,1,CH,EQ,C' '))                                             
/*                                                                              
//******************************************************************            
//* TO PREPARE THE DATASET TO INTERFACE CPF TRANFER SYSTEM (CTS).               
//******************************************************************            
//STEP4    EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F600 DD DSN=BP13.F600.CPFWDL,DISP=SHR                                     
//BP13K600 DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//BP13K601 DD DSN=BP13.K600.CPFWDL.PATH1,DISP=SHR                               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K882 DD DSN=BP13.K882.ACCUMSTF,DISP=SHR                                   
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//AB02F860 DD DSN=BP13.AB02.F860.HDBWDL.SUBTRF,DISP=SHR                         
//BP13F60A DD DSN=BP13.F600.CPFWDL.SENT,DISP=OLD                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C470) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------*           
//*  TO PRINT THE HPI FOR SUB-TRANSFER                              *           
//*-----------------------------------------------------------------*           
//STEP5    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1D  DD DSN=BP13.AB02.F860.HDBWDL.SUBTRF,DISP=SHR                         
//OUTPUT1D DD DSN=BP13.AB02.F860.HDBWDL,DISP=MOD                                
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1D) OUTFILE(OUTPUT1D)                                      
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO PRINT REPORT ON NUMBER OF HPI FORMS                         *           
//*  SEND TO CPF FOR SUB-TRANSFER CASES                             *           
//*-----------------------------------------------------------------*           
//STEP6    EXEC PGM=BP13C359,COND=(0,NE),REGION=4096K                           
//SYSOUT   DD SYSOUT=*                                                          
//BP13K882 DD DSN=BP13.K882.ACCUMSTF,DISP=SHR                                   
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//AB02F860 DD DSN=BP13.AB02.F860.HDBWDL.SUBTRF,DISP=SHR                         
//BP13L359 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//P13L359A DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L359B DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//*                                                                             
//*-----------------------------------------------------------------*           
//*  SORT THE CPF-WITHDRAWAL FILE FOR CASES NOT SENT TO CPFB YET    *           
//*  DTE-SEND         (COL 405)                                     *           
//*  NUM-SUB-TRANSFER (COL 735)                                     *           
//*  NUM-DBSS         (COL 704)                                     *           
//*-----------------------------------------------------------------*           
//STEP7    EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F600.CPFWDL,DISP=SHR                                     
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,31,A),FORMAT=CH                                                
  INCLUDE COND=((405,8,CH,EQ,C'        '),AND,                                  
                (735,1,CH,EQ,C' '),AND,                                         
                (704,1,CH,NE,C'Y'),AND,                                         
                (736,1,CH,NE,C'Y',OR,                                           
                (736,1,CH,EQ,C'Y',AND,                                          
                 747,8,CH,NE,C'00000000',AND,                                   
                 747,8,CH,NE,C'        ')),AND,                                 
               (1599,1,CH,EQ,C' '))                                             
/*                                                                              
//******************************************************************            
//* TO PREPARE THE DATASET TO INTERFACE CPF TRANFER SYSTEM (CTS).               
//******************************************************************            
//STEP8    EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F600 DD DSN=BP13.F600.CPFWDL,DISP=SHR                                     
//BP13K600 DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//BP13K601 DD DSN=BP13.K600.CPFWDL.PATH1,DISP=SHR                               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K882 DD DSN=BP13.K882.ACCUMSTF,DISP=SHR                                   
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//AB02F860 DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//BP13F60A DD DSN=BP13.F600.CPFWDL.SENT,DISP=MOD                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C470) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------*           
//*  TO REPRO TO THE INTERFACE FILE WITH TRS(AB02) DISP=MOD         *           
//*-----------------------------------------------------------------*           
//STEP9    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3A  DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//OUTPUT3A DD DSN=BP13.AB02.F860.HDBWDL,DISP=MOD                                
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT3A) OUTFILE(OUTPUT3A)                                      
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO BACKUP FILE INTO MONTHLY FILE                               *           
//*-----------------------------------------------------------------*           
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3B  DD DSN=BP13.AB02.F860.HDBWDL,DISP=SHR                                
//OUTPUT3B DD DSN=BP13.AB02.F860.HDBWDL.MONTH.NEW,DISP=MOD                      
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT3B) OUTFILE(OUTPUT3B)                                      
//*                                                                             
//*-----------------------------------------------------------------*           
//*  PRINT NO OF HPI9 FORMS SEND TO CPF BOARD FOR SOCA              *           
//*  SORTOUT THE SOCA CASES IE CDE-REPYMT = 'A'                     *           
//*  F860-CDE-ACTION (COL 1)                                        *           
//*  F860-CDE-REPYMT (COL 207)                                      *           
//*-----------------------------------------------------------------*           
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//SORTOUT  DD DSN=&&STEP11,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                 
//SYSIN    DD  *                                                                
  SORT FIELDS=(32,10,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'1',AND,                                             
               (207,2,CH,EQ,C'A ',OR,                                           
                173,2,CH,EQ,C'A1',OR,                                           
                184,2,CH,EQ,C'A2'),AND,                                         
                483,1,CH,NE,C'E')                                               
/*                                                                              
//*-----------------------------------------------------------------*           
//*  PROGRAM TO CREATE THE ACKNOWLEDGMENT LIST FILE AND CPF W/DRAWAL*           
//*  FILE FOR SOCA CASES AND UPDATED LIST AND DELETION LIST         *           
//*-----------------------------------------------------------------*           
//STEP12   EXEC PGM=BP13C319,COND=(0,NE),REGION=4096K                           
//SYSOUT   DD SYSOUT=*                                                          
//AB02F860 DD DSN=&&STEP11,DISP=(OLD,PASS)                                      
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//BP13L319 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//*                                                                             
//*-----------------------------------------------------------------*           
//*  SORTOUT THE SOCA CASES IE CDE-REPYMT = 'A'                     *           
//*  F860-CDE-ACTION (COL 1)                                        *           
//*  F860-CDE-REPYMT (COL 207)                                      *           
//*-----------------------------------------------------------------*           
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//SORTOUT  DD DSN=&&STEP13,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                 
//SYSIN    DD  *                                                                
  SORT FIELDS=(32,10,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'2',AND,                                             
               (207,2,CH,EQ,C'A ',OR,                                           
                173,2,CH,EQ,C'A1',OR,                                           
                184,2,CH,EQ,C'A2'),AND,                                         
                483,1,CH,NE,C'E')                                               
/*                                                                              
//*-----------------------------------------------------------------*           
//*  PROGRAM TO CREATE THE ACKNOWLEDGMENT LIST FILE AND CPF W/DRAWAL*           
//*  FILE FOR SOCA CASES AND UPDATED LIST AND DELETION LIST         *           
//*-----------------------------------------------------------------*           
//STEP14   EXEC PGM=BP13C319,COND=(0,NE),REGION=4096K                           
//SYSOUT   DD SYSOUT=*                                                          
//AB02F860 DD DSN=&&STEP13,DISP=(OLD,PASS)                                      
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//BP13L319 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//*                                                                             
//*-----------------------------------------------------------------*           
//*  SORTOUT THE SOCA CASES IE CDE-REPYMT = 'A'                     *           
//*  F860-CDE-ACTION (COL 1)                                        *           
//*  F860-CDE-REPYMT (COL 207)                                      *           
//*-----------------------------------------------------------------*           
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//SORTOUT  DD DSN=&&STEP15,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                 
//SYSIN    DD  *                                                                
  SORT FIELDS=(32,10,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'3',AND,                                             
               (207,2,CH,EQ,C'A ',OR,                                           
                173,2,CH,EQ,C'A1',OR,                                           
                184,2,CH,EQ,C'A2'),AND,                                         
                483,1,CH,NE,C'E')                                               
/*                                                                              
//*-----------------------------------------------------------------*           
//*  PROGRAM TO CREATE THE ACKNOWLEDGMENT LIST FILE AND CPF W/DRAWAL*           
//*  FILE FOR SOCA CASES AND UPDATED LIST AND DELETION LIST         *           
//*-----------------------------------------------------------------*           
//STEP16   EXEC PGM=BP13C319,COND=(0,NE),REGION=4096K                           
//SYSOUT   DD SYSOUT=*                                                          
//AB02F860 DD DSN=&&STEP15,DISP=(OLD,PASS)                                      
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//BP13L319 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//*                                                                             
//*-----------------------------------------------------------------*           
//*  PRINT NO OF HPI9 FORMS SEND TO CPF BOARD FOR FS CASES          *           
//*  SORTOUT THE SOCA CASES IE CDE-REPYMT = 'F'                     *           
//*  F860-CDE-ACTION (COL 1)                                        *           
//*  F860-CDE-REPYMT (COL 207)                                      *           
//*-----------------------------------------------------------------*           
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//SORTOUT  DD DSN=&&STEP17,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                 
//SYSIN    DD  *                                                                
  SORT FIELDS=(32,10,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'1',AND,                                             
                207,2,CH,EQ,C'F ')                                              
/*                                                                              
//*-----------------------------------------------------------------*           
//*  PROGRAM TO CREATE THE ACKNOWLEDGMENT LIST FILE AND CPF W/DRAWAL*           
//*  FILE FOR SOCA CASES AND UPDATED LIST AND DELETION LIST         *           
//*-----------------------------------------------------------------*           
//STEP18   EXEC PGM=BP13C360,COND=(0,NE),REGION=4096K                           
//SYSOUT   DD SYSOUT=*                                                          
//AB02F860 DD DSN=&&STEP17,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13L360 DD SYSOUT=2,OUTPUT=(*.PRT4A.FORMID),DEST=IOM2                        
//P13L360A DD SYSOUT=2,OUTPUT=(*.PRT2A.FORMID),DEST=IOM2                        
//P13L360B DD SYSOUT=2,OUTPUT=(*.PRT2A.FORMID),DEST=IOM2                        
//*                                                                             
//*-----------------------------------------------------------------*           
//*  PRINT NO OF HPI9 FORMS SEND TO CPF BOARD FOR FS CASES          *           
//*  SORTOUT THE SOCA CASES IE CDE-REPYMT = 'F'                     *           
//*  F860-CDE-ACTION (COL 1)                                        *           
//*  F860-CDE-REPYMT (COL 207)                                      *           
//*-----------------------------------------------------------------*           
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//SORTOUT  DD DSN=&&STEP19,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                 
//SYSIN    DD  *                                                                
  SORT FIELDS=(32,10,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'2',AND,                                             
                207,2,CH,EQ,C'F ')                                              
/*                                                                              
//*-----------------------------------------------------------------*           
//*  PROGRAM TO CREATE THE ACKNOWLEDGMENT LIST FILE AND CPF W/DRAWAL*           
//*  FILE FOR SOCA CASES AND UPDATED LIST AND DELETION LIST         *           
//*-----------------------------------------------------------------*           
//STEP20   EXEC PGM=BP13C360,COND=(0,NE),REGION=4096K                           
//SYSOUT   DD SYSOUT=*                                                          
//AB02F860 DD DSN=&&STEP19,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13L360 DD SYSOUT=2,OUTPUT=(*.PRT4A.FORMID),DEST=IOM2                        
//P13L360A DD SYSOUT=2,OUTPUT=(*.PRT2A.FORMID),DEST=IOM2                        
//P13L360B DD SYSOUT=2,OUTPUT=(*.PRT2A.FORMID),DEST=IOM2                        
//*                                                                             
//*-----------------------------------------------------------------*           
//*  PRINT NO OF HPI9 FORMS SEND TO CPF BOARD FOR FS CASES          *           
//*  SORTOUT THE SOCA CASES IE CDE-REPYMT = 'F'                     *           
//*  F860-CDE-ACTION (COL 1)                                        *           
//*  F860-CDE-REPYMT (COL 207)                                      *           
//*-----------------------------------------------------------------*           
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//SORTOUT  DD DSN=&&STEP21,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                 
//SYSIN    DD  *                                                                
  SORT FIELDS=(32,10,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'3',AND,                                             
                207,2,CH,EQ,C'F ')                                              
/*                                                                              
//*-----------------------------------------------------------------*           
//*  PROGRAM TO CREATE THE ACKNOWLEDGMENT LIST FILE AND CPF W/DRAWAL*           
//*  FILE FOR SOCA CASES AND UPDATED LIST AND DELETION LIST         *           
//*-----------------------------------------------------------------*           
//STEP22   EXEC PGM=BP13C360,COND=(0,NE),REGION=4096K                           
//SYSOUT   DD SYSOUT=*                                                          
//AB02F860 DD DSN=&&STEP21,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13L360 DD SYSOUT=2,OUTPUT=(*.PRT4A.FORMID),DEST=IOM2                        
//P13L360A DD SYSOUT=2,OUTPUT=(*.PRT2A.FORMID),DEST=IOM2                        
//P13L360B DD SYSOUT=2,OUTPUT=(*.PRT2A.FORMID),DEST=IOM2                        
//*                                                                             
//*-----------------------------------------------------------------*           
//*  SORTOUT THE SOCA CASES WHERE CDE-REPYMT NOT = 'A' AND 'F'      *           
//*  F860-CDE-ACTION (COL 1)                                        *           
//*  F860-CDE-REPYMT (COL 207)                                      *           
//*-----------------------------------------------------------------*           
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//SORTOUT  DD DSN=&&STEP23,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                 
//SYSIN    DD  *                                                                
  SORT FIELDS=(32,10,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'1',AND,                                             
               (207,2,CH,NE,C'A ',AND,                                          
                207,2,CH,NE,C'F ',AND,                                          
                173,2,CH,NE,C'A1',AND,                                          
                184,2,CH,NE,C'A2'),AND,                                         
                483,1,CH,NE,C'E')                                               
  OPTION DYNALLOC=(SYSDA,4)                                                     
/*                                                                              
//*-----------------------------------------------------------------*           
//*  PROGRAM TO CREATE THE ACKNOWLEDGMENT LIST FILE AND CPF W/DRAWAL*           
//*  FILE FOR SOCA CASES AND UPDATED LIST AND DELETION LIST         *           
//*-----------------------------------------------------------------*           
//STEP24   EXEC PGM=BP13C406,COND=(0,NE)                                        
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//AB02F860 DD DSN=&&STEP23,DISP=(OLD,PASS)                                      
//BP13FCPF DD DSN=&&BP13FCPF,DISP=(NEW,PASS),UNIT=SYSDA,                        
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=140,BLKSIZE=0)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------*           
//*  SORT THE CPF FILE IN BATCH NO AND SCHEME ACCOUNT NO            *           
//*  NRIC NO SEQUENCE.                                              *           
//*-----------------------------------------------------------------*           
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FCPF,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13CPFA,DISP=(NEW,PASS),UNIT=SYSDA,                         
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=140,BLKSIZE=0)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,4,A,5,11,A,84,8,A),FORMAT=CH,FILSZ=E1500                     
    OMIT COND=(115,2,CH,EQ,C'  ',OR,                                            
               115,2,CH,EQ,C'5B',OR,                                            
               115,2,CH,EQ,C'5C')                                               
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO PRINT OUT THE ACKNOWLEDGEMENT LIST FOR TP CASES             *           
//*  (NOT ON PAPER)                                                 *           
//*-----------------------------------------------------------------*           
//STEP26   EXEC PGM=BP13C407,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13CPF  DD DSN=&&P13CPFA,DISP=(OLD,PASS)                                     
//P13L407A DD SYSOUT=N                                                          
//P13L407B DD SYSOUT=N                                                          
//P13L407C DD SYSOUT=N                                                          
//P13L407D DD SYSOUT=N                                                          
//P13L407E DD SYSOUT=N                                                          
//P13L407F DD SYSOUT=N                                                          
//P13L407G DD SYSOUT=N                                                          
//P13L407H DD SYSOUT=N                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO LIST CPF WITHDRAWAL CASES THAT WAS DELETED                  *           
//*-----------------------------------------------------------------*           
//STEP27   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13FCPF DD DSN=&&P13CPFA,DISP=(OLD,PASS)                                     
//P13S407A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13S407B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S407),DISP=SHR                             
/*                                                                              
//*-----------------------------------------------------------------*           
//*  SORTOUT THE SOCA CASES WHERE CDE-REPYMT NOT = 'A' AND 'F'      *           
//*  F860-CDE-ACTION (COL 1)                                        *           
//*  F860-CDE-REPYMT (COL 207)                                      *           
//*-----------------------------------------------------------------*           
//STEP28   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//SORTOUT  DD DSN=&&STEP28,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                 
//SYSIN    DD  *                                                                
  SORT FIELDS=(32,10,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'2',AND,                                             
               (207,2,CH,NE,C'A ',AND,                                          
                207,2,CH,NE,C'F ',AND,                                          
                173,2,CH,NE,C'A1',AND,                                          
                184,2,CH,NE,C'A2'),AND,                                         
                483,1,CH,NE,C'E')                                               
  OPTION DYNALLOC=(SYSDA,4)                                                     
/*                                                                              
//*-----------------------------------------------------------------*           
//*  PROGRAM TO CREATE THE ACKNOWLEDGMENT LIST FILE AND CPF W/DRAWAL*           
//*  FILE FOR SOCA CASES AND UPDATED LIST AND DELETION LIST         *           
//*-----------------------------------------------------------------*           
//STEP29   EXEC PGM=BP13C406,COND=(0,NE)                                        
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//AB02F860 DD DSN=&&STEP28,DISP=(OLD,PASS)                                      
//BP13FCPF DD DSN=&&STEP29,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=140,BLKSIZE=0)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------*           
//*  SORT THE CPF FILE IN BATCH NO AND SCHEME ACCOUNT NO AND        *           
//*  NRIC NO SEQUENCE.                                              *           
//*-----------------------------------------------------------------*           
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&STEP29,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&STEP30,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=140,BLKSIZE=0)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,4,A,5,11,A,84,8,A),FORMAT=CH,FILSZ=E1500                     
    OMIT COND=(115,2,CH,EQ,C'  ',OR,                                            
               115,2,CH,EQ,C'5B',OR,                                            
               115,2,CH,EQ,C'5C')                                               
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO PRINT OUT THE ACKNOWLEDGEMENT LIST FOR TP CASES             *           
//*-----------------------------------------------------------------*           
//STEP31   EXEC PGM=BP13C407,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13CPF  DD DSN=&&STEP30,DISP=(OLD,PASS)                                      
//P13L407A DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L407B DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L407C DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L407D DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L407E DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L407F DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L407G DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L407H DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO LIST CPF WITHDRAWAL CASES THAT WAS CREATED                  *           
//*-----------------------------------------------------------------*           
//STEP32   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13FCPF DD DSN=&&STEP30,DISP=(OLD,PASS)                                      
//P13S407A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13S407B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S407),DISP=SHR                             
/*                                                                              
//*-----------------------------------------------------------------*           
//*  SORTOUT THE SOCA CASES WHERE CDE-REPYMT NOT = 'A' AND 'F'      *           
//*  F860-CDE-ACTION (COL 1)                                        *           
//*  F860-CDE-REPYMT (COL 207)                                      *           
//*-----------------------------------------------------------------*           
//STEP33   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.AB02.F860.HDBWDL.DAILY,DISP=SHR                          
//SORTOUT  DD DSN=&&STEP33,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                 
//SYSIN    DD  *                                                                
  SORT FIELDS=(32,10,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'3',AND,                                             
               (207,2,CH,NE,C'A ',AND,                                          
                207,2,CH,NE,C'F ',AND,                                          
                173,2,CH,NE,C'A1',AND,                                          
                184,2,CH,NE,C'A2'),AND,                                         
                483,1,CH,NE,C'E')                                               
  OPTION DYNALLOC=(SYSDA,4)                                                     
/*                                                                              
//*-----------------------------------------------------------------*           
//*  PROGRAM TO CREATE THE ACKNOWLEDGMENT LIST FILE AND CPF W/DRAWAL*           
//*  FILE FOR SOCA CASES AND UPDATED LIST AND DELETION LIST         *           
//*-----------------------------------------------------------------*           
//STEP34   EXEC PGM=BP13C406,COND=(0,NE)                                        
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//AB02F860 DD DSN=&&STEP33,DISP=(OLD,PASS)                                      
//BP13FCPF DD DSN=&&STEP34,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=140,BLKSIZE=0)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//* SORT THE CPF FILE IN BATCH NO AND SCHEME ACCOUNT NO                         
//*     NRIC NO SEQUENCE.                                                       
//*--------------------------------------------------------------------         
//STEP35   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&STEP34,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&STEP35,DISP=(NEW,PASS),UNIT=SYSDA,                          
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=140,BLKSIZE=0)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,4,A,5,11,A,84,9,A),FORMAT=CH,FILSZ=E1500                     
    OMIT COND=(115,2,CH,EQ,C'  ',OR,                                            
               115,2,CH,EQ,C'5B',OR,                                            
               115,2,CH,EQ,C'5C')                                               
//*                                                                             
//*--------------------------------------------------------------------         
//* TO PRINT OUT THE ACKNOWLEDGEMENT LIST FOR TP CASES (NOT ON PAPER )          
//*--------------------------------------------------------------------         
//STEP36   EXEC PGM=BP13C407,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13CPF  DD DSN=&&STEP35,DISP=(OLD,PASS)                                      
//P13L407A DD SYSOUT=N                                                          
//P13L407B DD SYSOUT=N                                                          
//P13L407C DD SYSOUT=N                                                          
//P13L407D DD SYSOUT=N                                                          
//P13L407E DD SYSOUT=N                                                          
//P13L407F DD SYSOUT=N                                                          
//P13L407G DD SYSOUT=N                                                          
//P13L407H DD SYSOUT=N                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO LIST CPF WITHDRAWAL CASES THAT WAS UPDATED                  *           
//*-----------------------------------------------------------------*           
//STEP37   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13FCPF DD DSN=&&STEP35,DISP=(OLD,PASS)                                      
//P13S407A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13S407B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S407),DISP=SHR                             
/*                                                                              
//*-----------------------------------------------------------------*           
//*  TO UPDATE ACCEPT/REJECT/PENDING CASES FROM CPF                 *           
//*-----------------------------------------------------------------*           
//STEP38   EXEC PGM=BP13C472,COND=(0,NE)                                        
//SYSOUT   DD SYSOUT=*                                                          
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//AB02F865 DD DSN=AB02.F865.SOC,DISP=SHR                                        
//BP13K600 DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//BP13K601 DD DSN=BP13.K600.CPFWDL.PATH3,DISP=SHR                               
//BP13K607 DD DSN=BP13.K607.CPFREJ,DISP=OLD                                     
//BP13K60F DD DSN=BP13.K60F.CPFPEND,DISP=OLD                                    
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO EMPTY THE FILE                                              *           
//*-----------------------------------------------------------------*           
//STEP40   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT13  DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT13 DD DSN=AB02.F865.SOC,DISP=SHR                                        
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT13) OUTFILE(OUTPUT13)                                      
//*                                                                             
//*-----------------------------------------------------------------*           
//*  SORT BP13.F310.TRANS FOR BOOKED CASES                          *           
//*-----------------------------------------------------------------*           
//STEP41   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F310.TRANS,DISP=SHR                                     
//SORTOUT  DD  DSN=&&STEP41,                                                    
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(150,20),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(9,2,CH,EQ,C'AI',OR,                                            
                 9,2,CH,EQ,C'AS',OR,                                            
                 9,2,CH,EQ,C'AA',OR,                                            
                 9,2,CH,EQ,C'AW')                                               
//*                                                                             
//*-----------------------------------------------------------------*           
//*  APPEND RECORDS TO BP13.F001.CPFB.PROPERTY                      *           
//*-----------------------------------------------------------------*           
//STEP41A  EXEC PGM=BP13C361                                                    
//SYSOUT   DD SYSOUT=*                                                          
//BP13F310 DD DSN=&&STEP41,DISP=(SHR,DELETE)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//AB02F898 DD DSN=BP13.F001.CPFB.PROPERTY,DISP=MOD                              
//BP13L361 DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//*  FOR DBSS WITHDRAWAL FORM                                       *           
//*  ------------------------                                       *           
//*  SORT THE CPF-WITHDRAWAL FILE FOR CASES NOT SENT TO CPFB YET    *           
//*  DTE-SEND         (COL 405)                                     *           
//*  NUM-SUB-TRANSFER (COL 735)                                     *           
//*  NUM-DBSS         (COL 704)                                     *           
//*-----------------------------------------------------------------*           
//STEP42   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F600.CPFWDL,DISP=SHR                                     
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,31,A),FORMAT=CH                                                
  INCLUDE COND=((405,8,CH,EQ,C'        '),AND,                                  
                (735,1,CH,EQ,C' '),AND,                                         
                (704,1,CH,EQ,C'Y'),AND,                                         
                (736,1,CH,NE,C'Y',OR,                                           
                (736,1,CH,EQ,C'Y',AND,                                          
                 747,8,CH,NE,C'00000000',AND,                                   
                 747,8,CH,NE,C'        ')),AND,                                 
               (1599,1,CH,EQ,C' '))                                             
/*                                                                              
//******************************************************************            
//* TO PREPARE THE DATASET TO INTERFACE CPF TRANFER SYSTEM (CTS).               
//******************************************************************            
//STEP43   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F600 DD DSN=BP13.F600.CPFWDL,DISP=SHR                                     
//BP13K600 DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//BP13K601 DD DSN=BP13.K600.CPFWDL.PATH1,DISP=SHR                               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K882 DD DSN=BP13.K882.ACCUMSTF,DISP=SHR                                   
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//AB02F860 DD DSN=BP13.AB02.F860.HDBWDL.DBSS,DISP=SHR                           
//BP13F60A DD DSN=BP13.F600.CPFWDL.SENT,DISP=MOD                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C470) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------*           
//*  TO REPRO TO THE INTERFACE FILE WITH TRS(AB02) DISP=MOD         *           
//*-----------------------------------------------------------------*           
//STEP44   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3A  DD DSN=BP13.AB02.F860.HDBWDL.DBSS,DISP=SHR                           
//OUTPUT3A DD DSN=BP13.AB02.F860.HDBWDL,DISP=MOD                                
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT3A) OUTFILE(OUTPUT3A)                                      
//*                                                                             
//*-----------------------------------------------------------------*           
//*  PRINT NO OF HPI9 FORMS SEND TO CPF BOARD FOR FS CASES          *           
//*  SORTOUT THE SOCA CASES IE CDE-REPYMT = 'F'                     *           
//*  F860-CDE-ACTION (COL 1)                                        *           
//*  F860-CDE-OFFICE (COL 2)                                        *           
//*  F860-CDE-REPYMT (COL 207)                                      *           
//*-----------------------------------------------------------------*           
//STEP45   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.AB02.F860.HDBWDL.DBSS,DISP=SHR                           
//SORTOUT  DD DSN=&&F860DBSS,DISP=(,PASS),                                      
//          SPACE=(TRK,(100,10),RLSE),                                          
//          DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                 
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,4,A,5,11,A,84,9,A),FORMAT=CH                                 
    OMIT COND=(2,2,CH,EQ,C'PP')                                                 
//*-----------------------------------------------------------------*           
//*  PTIMT ACKNOWLEDGMENT LIST FILE AND CPF W/DRAWAL FOR DBSS       *           
//*---------------------------------------------------------------------        
//STEP46   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                   
//AB02F860 DD DSN=&&F860DBSS,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13LC09 DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC09),DISP=SHR                             
//*-----------------------------------------------------------------*           
//*  TO BACKUP FILE INTO MONTHLY FILE                               *           
//*-----------------------------------------------------------------*           
//STEP47   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3B  DD DSN=BP13.AB02.F860.HDBWDL.DBSS,DISP=SHR                           
//OUTPUT3B DD DSN=BP13.AB02.F860.HDBWDL.MONTH.NEW,DISP=MOD                      
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT3B) OUTFILE(OUTPUT3B)                                      
//*                                                                             
//*-----------------------------------------------------------------*           
//*  SORT ECPF SOCA CASES                                           *           
//*-----------------------------------------------------------------*           
//STEP48   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K60K.CPFSOCA,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F60K,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
/*                                                                              
//*-----------------------------------------------------------------*           
//*  TO PROCESS NOTIFICATION AND CLEAN-UP FOR ECPF SOCA             *           
//*-----------------------------------------------------------------*           
//STEP49   EXEC PGM=BP13C47A,COND=(0,NE)                                        
//BP13F60K DD DSN=&&BP13F60K,DISP=(OLD,DELETE)                                  
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K600 DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//BP13K601 DD DSN=BP13.K600.CPFWDL.PATH3,DISP=SHR                               
//BP13K60K DD DSN=BP13.K60K.CPFSOCA,DISP=OLD                                    
//BP13F203 DD DSN=BP13.F203.SMS.CPF.SOCA,DISP=OLD                               
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*  BACKUP FILES AFTER                                                         
//*--------------------------------------------------------------------         
//STEP99   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K607.CPFREJ,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F607.CPFREJ.AFDAILY(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=2100,RECFM=FB)                      
//INPUT2   DD DSN=BP13.K60F.CPFPEND,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F60F.CPFPEND.AFDAILY(+1),DISP=(NEW,CATLG),               
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//INPUT3   DD DSN=BP13.K60K.CPFSOCA,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F60K.CPFSOCA.AFDAILY(+1),DISP=(NEW,CATLG),               
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*                                                                             
//*-----------------------------------------------------------------*           
//*                   END OF JOB                                    *           
//*-----------------------------------------------------------------*           
