//BP13M724 JOB (BP13P),'BP13M724',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*====================================================================         
//* RUN ON ON LAST DAY OF JAN & MAR OF THE YEAR                                 
//*====================================================================         
//* PRINT MONTH END REPORT                                                      
//*====================================================================         
//* BP132772 030506 LSB  DBSS                                                   
//* BP133091 151207 LMS  EXPANSION OF BP13KD00 FROM 1200 TO 1600                
//*====================================================================         
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - FIN DEPT                     
//*-----------------------------------------------------------------            
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-FI1A CP-1',END;                                        
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=FI1A                                       
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* OMIT BLANK REGN-NO                                                          
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FD00,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0),                                 
//         SPACE=(CYL,(3,3),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  OMIT COND=(1,8,CH,EQ,C'        ')                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON CASH RECEIPT FOR PP LUMPSUM                                 
//*-------------------------------------------------------------------*         
//STEP02   EXEC  SAS,COND=(0,NE)                                                
//BP13LC16 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//BP13KD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC16),DISP=SHR                             
