//BP13W400  JOB (BP13P),'WED PH4',CLASS=I,MSGCLASS=N,                           
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-----------------------------------------------------------------            
//*  WEDNESDAY JOB FOR SALES ORDERS                                             
//*-----------------------------------------------------------------            
//* CHG-NO   BY   ON      DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130042 LSB 951228 - BP13C431, BP13C430 ACCESS PIDB, JCL CHG               
//* BP130418 SSS 980721 - ADD REMARK                                            
//* BP130418 CLT 310898 - Y2K CHANGES FOR BM06                                  
//* BP130710 SSS 200100 - CONVERSION FROM TAPE TO CARTRIDGE                     
//* BP130764 SSS 210100 - ENHANCEMENT OF MEDIA TO PUB                           
//* BP130901 AKT 100800 - TO CATER FOR CALLING BP13C904 IN BP13C440.            
//* BP130918 LSB 040900 - ADD BB14K090 TO  BP13C440.                            
//* BP130883 CLT 271000 - REMOVE CALLING OF BP13C904.                           
//* BP130883 CLT 061100 - BP13C420 TO CALL BP13C913.                            
//* BP130954 LSB 211100 - INTERFACE WITH SMS DAILY INSTEAD OF WED/SAT           
//* BP132197 SSS 200303 - REMOVE DJDE STATEMENT                                 
//* BP133460 DW5 011208 - ADD IN SFTP                                           
//* BP133460 DW5 191208 - REMOVE THE TAPE REQUIREMENT                           
//* BP135457 HH17050615 - CHANGE SERVER FROM IDEAL TO LANSFTPP01                
//******************************************************************            
//*---------------------------------------------------------------------        
//*   BACKUP PUB FILE UNTIL NEXT RUN                                            
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.F418.PUB,DISP=SHR                                        
//OUTPUT2  DD DSN=BP13.F418.PUB.PREV,DISP=OLD                                   
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                     
//*----------------------------------------------------------------             
//* TRIM THE DATASET TO REMOVE TRAILING SPACES                                  
//*----------------------------------------------------------------             
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F418.PUB,DISP=SHR                                        
//SORTOUT  DD DSN=BP13.F418.PUB.FTP,DISP=OLD                                    
//SYSIN     DD  *                                                               
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    OUTREC FIELDS=(1,225)                                                       
//******************************************************************            
//* FTP PUB FILE TO LANSFTPP01 SERVER                                           
//******************************************************************            
//*-------------------------------------------------------------------*         
//*  TO DELETE SEQ. DATASETS                                                    
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.SEQ.PUTGET.PUB')                                                
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//STEP05   EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.PUB,DISP=(,CATLG),                            
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                    
//            SPACE=(CYL,(1,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     PUT    'CD \PROD\APPN\DATA\BP13\FROM-HDB\SPOWER\MF';                       
     PUT    'ASCII';                                                            
     STDPUT   = "PUT 'BP13.F418.PUB.FTP' ";                                     
     STDPUT7  = "HDBPUB.TXT";                                                   
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//STEP06   EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.PUB,DISP=SHR                                  
//*                                                                             
//*---------------------------------------------------------------------        
//*   CLEAR PUB FILE FOR THE FOLLOWING WEEK'S                                   
//*   PROCESSING                                                                
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DUMMY                                                             
//OUTPUT3  DD DSN=BP13.F418.PUB,DISP=OLD                                        
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                     
//*--------------------------------------------------------------------         
//* END OF BP13W400.                                                            
//*--------------------------------------------------------------------         
