//BP13ADPU  JOB (BP13P),'BP13ADPU',CLASS=I,MSGCLASS=N,                  JOB00344
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//******************************************************************            
//*    NOTE THE DIFFERENCE                                                      
//*    - TENDER PROGRAM ONLY HAVE NEW FLAT SUPPLY                               
//*    - ADD PA MAX-CAT TO GRO MAX-CAT                                          
//*    - PIGEONHOLING OF GRO FOR EC                                             
//*-----------------------------------------------------------------            
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- --------------------                                           
//* BP135048 IL5  28082013 NEW (SIMILAR TO BP13A525 AND BP13ACC6)               
//* BP135505 SMR2 17102014 UPDATE BP13K010 TO BP13K019                          
//* BP138246 AM25 06032020 ADD SYSIN FOR BP13C525                               
//* BP138246 IL5  07032020 ADD PROGRAM BP13CF79 TO COMPUTE FLAT SUPPLY          
//*                        FOR 200% AND 300%                                    
//* BP139931 AM25 29022024 CHANGE CLASS J TO CLASS 2                            
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* TO DELETE BP13K765                                                          
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
      DEL 'BP13.K765.WARDSRV.EC' CLUSTER PURGE                                  
      DEL 'BP13.F019.TENDER.PA.MAXCAT'                                          
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DEFINE BP13K765                                                  00020004
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                  00030000
//SYSPRINT DD SYSOUT=*                                                  00040000
//INPUT    DD DSN=BP13.K765.WARDSRV,DISP=SHR                                    
//SYSIN    DD *                                                         00050000
                                                                          001   
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K765.WARDSRV.EC)                    -                  001   
        SHAREOPTIONS(2,3)                              -                  001   
        KEYS(8 0)                                      -                  001   
        CYL(1 1)                                       -                  001   
        RECSZ(200 200)                                 -                  001   
        FREESPACE(10 10)                               -                  001   
        CISZ(4096)                                     -                  001   
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                  001   
        UNQ)                                           -                  001   
      DATA                                             -                      00
        (NAME(BP13.K765.WARDSRV.EC.DATA))                    -            001   
      INDEX                                            -                      00
        (NAME(BP13.K765.WARDSRV.EC.INDEX))                                001   
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K765.WARDSRV.EC)                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* TO PREPARE FLAT AND ETHINIC QUOTA FOR SHORTLISTING 200%                     
//*---------------------------------------------------------------------        
//STEP02A  EXEC PGM=BP13CF79,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//BP13F010 DD SYSOUT=*                                                          
//P13F010A DD DSN=BP13.F019.TENDER.PA.MAXCAT,DISP=(NEW,CATLG),                  
//             DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                              
//             SPACE=(CYL,(5,2)),DATACLAS=MULTIVOL                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE TRANSFERRING               
//*---------------------------------------------------------------------        
//STEP03    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//SORTOUT  DD DSN=&&P13K019A,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,4,2,CH,EQ,C'4P',OR,                                   
       4,2,CH,EQ,C'5 ',OR,4,2,CH,EQ,C'5P')                                      
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE TRANSFERRING                     
//*---------------------------------------------------------------------        
//STEP04    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K019A,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY BEFORE TRANSFERRING             
//*---------------------------------------------------------------------        
//STEP05    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//SORTOUT  DD DSN=&&P13K019B,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE TRANSFERRING                     
//*---------------------------------------------------------------------        
//STEP06    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K019B,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* ADD MAX-PA-CAT1/CAT2/CAT3 TO MAX-CCC-CAT1/CAT2/CAT3                         
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C750,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K019.TENDER.EC,DISP=OLD                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER TRANSFERRING                
//*---------------------------------------------------------------------        
//STEP08    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//SORTOUT  DD DSN=&&P13K019N,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,4,2,CH,EQ,C'4P',OR,                                   
       4,2,CH,EQ,C'5 ',OR,4,2,CH,EQ,C'5P')                                      
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER TRANSFERRING                      
//*---------------------------------------------------------------------        
//STEP09    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K019N,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY AFTER TRANSFERRING              
//*---------------------------------------------------------------------        
//STEP10    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//SORTOUT  DD DSN=&&P13K019M,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER TRANSFERRING                      
//*---------------------------------------------------------------------        
//STEP11    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K019M,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F010.TENDER.EC.CC1,DISP=OLD                              
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  BACKUP BALLOT FILE BEFORE PIGEONHOLING                                     
//*  SORT BY RANDOM NO ORDER                                                    
//*-----------------------------------------------------------------            
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=BP13.F740.PIGEON.EC,DISP=OLD                                  
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* OUTPUT FILES FOR SEPARATE PIGEONHOLING PROCESS, PRIORITY,                   
//* TRANSITION NHH > 7 MTH, AND COHORTS ( MAX 5 )                               
//*-----------------------------------------------------------------            
//STEP13   EXEC PGM=BP13C741,COND=(0,NE),ADDRSPC=VIRT,REGION=4096K              
//BP13F520 DD  DSN=BP13.F740.PIGEON.EC,DISP=SHR                                 
//BP13PR   DD  DSN=BP13.F740.MATUREBA.EC.PRIO,DISP=OLD                          
//BP13GRO  DD  DSN=BP13.F740.MATUREBA.EC.GRO,DISP=OLD                           
//BP13MGP  DD  DSN=BP13.F740.MATUREBA.EC.MGP,DISP=OLD                           
//BP13PUB  DD DSN=&&BP13PUB,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* TRANSFER BALANCE FLAT OF SERVE TO NON-SERVE IN BP13K765                     
//*---------------------------------------------------------------------        
//STEP15   EXEC PGM=BP13C779,COND=(0,NE)                                        
//BP13K765 DD DSN=BP13.K765.WARDSRV.EC,DISP=SHR                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* INCLUDE RESIDENT GRO WITH CDE-SERVE = N                                     
//*-----------------------------------------------------------------            
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F740GR2,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(187,3,A,373,3,A,163,2,A,1,28,A),FORMAT=CH                      
    INCLUDE COND=(163,2,CH,NE,C'  ')                                            
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR GRO CASES.                                
//* PROCESS NON-SERVING GRO + UNSUCCESSFUL SERVING GRO FROM 1ST ROUND           
//* GRO PIGEOHOLING                                                             
//* THIS IS 2ND ROUND GRO PIGEONHOLING                                          
//*---------------------------------------------------------------------        
//STEP17   EXEC PGM=BP13U770,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K019.TENDER.EC,DISP=OLD                                  
//BP13K765 DD DSN=BP13.K765.WARDSRV.EC,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//BP13F740 DD DSN=&&F740GR2,DISP=(OLD,PASS)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.CC2,DISP=SHR                                 
//BP13K740 DD DSN=BP13.K740.MATUREBA.EC,DISP=OLD,                               
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=&&BP13F525,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=20000)                            
//BP13L770 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L770A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//SORTOUT  DD DSN=&&K019GR1,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP19    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K019GR1,DISP=(OLD,DELETE)                                  
//BP13F713  DD DSN=BP13.F713.PIGEON.CC1,DISP=SHR                                
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING              
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//SORTOUT  DD DSN=&&K019GR2,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP21    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K019GR2,DISP=(OLD,DELETE)                                  
//BP13F713  DD DSN=BP13.F713.PIGEON.CC1,DISP=SHR                                
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT LAST SUCC REGN-NO IN NT/FT ORDER                                       
//*-----------------------------------------------------------------            
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F525,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&BP13F525,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=20000)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,4,2,A,53,3,A,11,1,A),FORMAT=CH                            
//*-----------------------------------------------------------------            
//* PRINT REPORT TO SHOW LAST SUCC REGN-NO HIT MAX ZONE/ALLOC/CAT               
//*-----------------------------------------------------------------            
//STEP23    EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                 
//BP13K525  DD DSN=&&BP13F525,DISP=(OLD,PASS)                                   
//FT18F001  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S502),DISP=SHR                            
//*---------------------------------------------------------------------        
//* PRINT REPORT ON FLAT/REGISTERED COUNT FOR GRO IN BP13K765                   
//*---------------------------------------------------------------------        
//STEP24   EXEC PGM=BP13C746,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.CC2,DISP=SHR                                 
//BP13K765 DD DSN=BP13.K765.WARDSRV.EC,DISP=SHR                                 
//BP13L746 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION FORM FOR COUNTER AND MAIL CASES                           
//* 3 DIFFERENT LETTERS DEPENDING ON MCPS OPTION                                
//*------------------------------------------------------------------           
//STEP26   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L525C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*--------------------------------------------------------------------         
//* END BP13ADPU                                                                
//*--------------------------------------------------------------------         
