//BP13A50J JOB (BP13P),'BP13A50J',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//      NOTIFY=CSD0071                                                  00020000
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030000
//*===================================================================*         
//* THIS JOB WILL RUN AT 11:00 DAILY DURING THE LAUNCHING PERIOD                
//* AND 2PM ON THE DAY AFTER CLOSING                                            
//*===================================================================*         
//* THIS JOB IS SIMILAR TO BP13A50K                                             
//* BP13A50J RUN AT 08AM DURING LUANCH PERIOD                                   
//* BP13A50K RUN AT 11AM DURING LUANCH PERIOD                                   
//*===================================================================*         
//* CHG-NO   BY   ON      DESCRIPTION                                           
//* ---------------------------------                                           
//* BP136363 LSB 20160720 NEW JOB                                               
//* BP136888 LSB 20170710 ADD ROF                                               
//* BP137358 FNP 20180716 CHANGE F55A SIZE FROM 800 TO 1200                     
//*===================================================================*         
//* PRINT REPORT TO SHOW SPH/SPR AFTER BTO CLOSING                              
//*-------------------------------------------------------------------*         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                  *         
//*  PRT01 : COPIES = 1                                               *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13F730 BY REGN                                                       
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR,                      00584022
//            AMP=('BUFND=4','BUFNI=8')                                 00260000
//SORTOUT  DD DSN=BP13.F730.MATURERQ.SBF.DAY(+1),DISP=(,CATLG),                 
//            SPACE=(CYL,(180,20)),                                             
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(187,3,CH,NE,C'XXX',AND,                                         
               (376,3,CH,EQ,C'BTO',OR,376,3,CH,EQ,C'SBF',OR,                    
                376,3,CH,EQ,C'ROF'))                                            
//*-----------------------------------------------------------------            
//* SORT BP13F730 BY REGN                                                       
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR,                      00584022
//            AMP=('BUFND=4','BUFNI=8')                                 00260000
//SORTOUT  DD DSN=BP13.F730.MATURERQ.AY0D,DISP=OLD                              
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(187,3,CH,NE,C'XXX',AND,                                         
               (376,3,CH,EQ,C'BTO',OR,376,3,CH,EQ,C'SBF',OR,                    
                376,3,CH,EQ,C'ROF'))                                            
//*-----------------------------------------------------------------    00170000
//* GET ALL BTO QTR                                                     00180000
//* EXCLUDE OCCUPIER INCOME FOR SINGLE SCHEME                           00180000
//*-----------------------------------------------------------------    00210000
//STEP03   EXEC  PGM=BP13CB95,COND=(0,NE)                               00220000
//BP13F730 DD  DSN=BP13.F730.MATURERQ.AY0D,DISP=SHR                     00230000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00240000
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                          00250000
//             AMP=('BUFND=4','BUFNI=8')                                00260000
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                            00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00290000
//             AMP=('BUFND=4','BUFNI=8')                                00300000
//BP13K825 DD  DSN=BP13.K825.REQOCCP.SBF,DISP=SHR,                      00310000
//             AMP=('BUFND=4','BUFNI=8')                                00320000
//BP13K828 DD  DSN=BP13.K590.CANOCCP,DISP=SHR,                          00330001
//             AMP=('BUFND=4','BUFNI=8')                                00340000
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                          00350001
//             AMP=('BUFND=4','BUFNI=8')                                00360000
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR,                    00370001
//             AMP=('BUFND=4','BUFNI=8')                                00380000
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR,                    00390001
//             AMP=('BUFND=4','BUFNI=8')                                00400000
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                        00401001
//             AMP=('BUFND=4','BUFNI=8')                                00402001
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                  00403001
//             AMP=('BUFND=4','BUFNI=8')                                00404001
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR,                  00405001
//             AMP=('BUFND=4','BUFNI=8')                                00406001
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR,                  00410000
//             AMP=('BUFND=4','BUFNI=8')                                00420000
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR,                  00430000
//             AMP=('BUFND=4','BUFNI=8')                                00440000
//BP13K585 DD DSN=BP13.K585.HARDLUCK,DISP=SHR,                          00430000
//             AMP=('BUFND=4','BUFNI=8')                                00440000
//BP13K587 DD DSN=BP13.K587.HARDLUCK.HIST,DISP=SHR,                     00430000
//             AMP=('BUFND=4','BUFNI=8')                                00440000
//BP13F55A DD DSN=BP13.F55A.APPLN.DAY(+1),DISP=(NEW,CATLG),                     
//            SPACE=(CYL,(180,20)),                                             
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=1200,RECFM=FB)                      
//BP13F55Y DD DSN=BP13.F55Y.APPLN.DAY(+1),DISP=(NEW,CATLG),                     
//            SPACE=(CYL,(80,20)),                                              
//            DCB=(BP13.GDG,BLKSIZE=27750,LRECL=250,RECFM=FB)                   
//BP13F55Z DD DSN=BP13.F55Z.APPLN.DAY(+1),DISP=(NEW,CATLG),                     
//            SPACE=(CYL,(80,20)),                                              
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)                   
//P13F730A DD  DSN=BP13.F730.MATURERQ.AY0D,DISP=OLD                     00450000
//SYSPRINT DD  SYSOUT=*                                                 00460000
//SYSOUT   DD  SYSOUT=*                                                 00470000
