//BP13A223 JOB (BP13P),'BP13A223',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//******************************************************************            
//* CHG REF  ON       BY   DESCRIPTION                                          
//* -------- -------- ---- -----------                                          
//* BP130857 20000626 SSS  ADD GROUPID                                          
//******************************************************************            
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* STEP01  TO SORT OUT RECORD ON UPDATE OF JUNK MAIL TAG                       
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT                                                            
//SORTIN   DD DSN=BM06.K190.LOG,DISP=SHR                                        
//SORTOUT  DD DSN=&&BM06F190,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(TRK,(10,5),RLSE),                                          
//            DCB=(BLKSIZE=0,LRECL=650,RECFM=FB)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(620,31,A,1,16,A),FORMAT=CH                                     
    INCLUDE COND=(637,6,CH,EQ,C'B20400')                                        
/*                                                                              
//*-----------------------------------------------------------------            
//* STEP02  TO PRINT REPORT ON UPDATE OF JUNK MAIL TAG                          
//*-----------------------------------------------------------------            
//STEP02   EXEC  PGM=BP13C265,COND=(0,NE)                                       
//BM06F190 DD DSN=&&BM06F190,DISP=(SHR,DELETE)                                  
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR                                   
//BP13L265 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//*  END OF JOB BP13A223                                                        
//*-----------------------------------------------------------------            
