//BP13D205 JOB (BP13P),'BP13D205',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB00882
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//*--------------------------------------------------------------------         
//* DELETE/DEFINE BP13KZ00                                                      
//*---------------------------------------------------------------------        
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.BLANK.CHAR150,                                          
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DELETE BP13.KZ00.ALL CL PURGE                                         
          DEF CLUSTER                                -                          
              (NAME(BP13.KZ00.ALL)                   -                          
              CYL(5 5)                               -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.KZ00.ALL.DATA)              -                          
              KEYS(49 0)                             -                          
              RECSZ(150 150)                         -                          
              CISZ(12288)                            -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.KZ00.ALL.INDEX))                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.KZ00.ALL)                       -                          
            REUSE                                                               
/*                                                                              
//*--------------------------------------------------------------------         
//* WRITE RECORDS TO BP13KZ00                                                   
//*---------------------------------------------------------------------        
//STEP02  EXEC PGM=BP13CZ00                                                     
//BP13K230  DD DSN=BP13.K230.FLATLIST,DISP=SHR                                  
//BP13K240  DD DSN=BP13.K240.HEADFLAT,DISP=SHR                                  
//BM06K110  DD DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BP13KZ10  DD DSN=BP13.KZ10.LOCATION,DISP=SHR                                  
//BP13KZ00  DD DSN=BP13.KZ00.ALL,DISP=SHR                                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* DELETE/DEFINE BP13KZ01                                                      
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.BLANK.CHAR150,                                          
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DELETE BP13.KZ01.LOC CL PURGE                                         
          DEF CLUSTER                                -                          
              (NAME(BP13.KZ01.LOC)                   -                          
              CYL(5 5)                               -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.KZ01.LOC.DATA)              -                          
              KEYS(59 0)                             -                          
              RECSZ(150 150)                         -                          
              CISZ(12288)                            -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.KZ01.LOC.INDEX))                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.KZ01.LOC)                       -                          
            REUSE                                                               
/*                                                                              
//*--------------------------------------------------------------------         
//* WRITE RECORDS TO BP13KZ01                                                   
//*---------------------------------------------------------------------        
//STEP04  EXEC PGM=BP13CZ01                                                     
//BP13K230  DD DSN=BP13.K230.FLATLIST,DISP=SHR                                  
//BP13K240  DD DSN=BP13.K240.HEADFLAT,DISP=SHR                                  
//BM06K110  DD DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BP13KZ10  DD DSN=BP13.KZ10.LOCATION,DISP=SHR                                  
//BP13KZ01  DD DSN=BP13.KZ01.LOC,DISP=SHR                                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//*    END OF JOB                                                               
//*--------------------------------------------------------------------         
