//BP13APPF JOB (BP13P),'BP13APPF',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*********************************************************************         
//* CHG REF   BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP138078 IL5  20191121 NEW JOB TO HANDLE SALES' REVISED SOP                 
//*                        ON SHORTLISTING  NON-ELDERLY APPLICATIONS            
//*                        FOR 200% AND 300%                                    
//* BP138078 IL5  20200225 ADD BP13APPF AS INPUT PARAMETER FOR BP13C525         
//* BP138214 IL5  20200331 INCLUDE BP13CB12 TO UPDATE ALLO SCH AS SAP           
//* BP138301 AM25 20200514 HARDCOPY REPORTS CONVERSION                          
//* BP139516 AM25 20230227 CHANGES FOR 2ND TIMERS - STEP27A-C                   
//* BP139670 AM25 20230825 SHIFT AND RENAME STEP27A-C AFTER STEP20              
//*                        COMMENT STEP27 (SA CASES)                            
//******************************************************************            
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.PA4,DISP=OLD                                 
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.PA4,DISP=OLD                               
//INPUT3   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F740.MATUREBA.PA4,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* SET MAX CAT TO AVAILABLE FLAT SUPPLY TO SIMULATE BYPASS OF EIP              
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C758,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* START OF BP13APP1                                                           
//*-----------------------------------------------------------------            
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE ALL UNSUCCESSFUL APPLICATIONS                                       
//*-----------------------------------------------------------------            
//STEP03  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F520PUB,DISP=(,PASS),                                        
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,211,1,CH,NE,C'1',AND,                  
                 (210,1,CH,EQ,C' ',OR,210,1,CH,EQ,C'N'))                        
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR PUBLIC   CASES, THE PROGRAM WILL          
//* ONLY ALLOCATE THE PUBLIC QUOTA AND PRIORITY QUOTA ON CCC, SFF, MTF          
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13U538,COND=(0,NE)                                        
//STEPLIB   DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                           
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13K010  DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//BP13F740  DD DSN=&&F520PUB,DISP=(OLD,PASS)                                    
//BP13K740  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K712  DD DSN=BP13.K712.FLATNHUG,DISP=SHR,                                 
//             AMP=('BUFND=23')                                                 
//BP13F525  DD DSN=BP13.F525.APPL,DISP=OLD                                      
//BP13L538  DD SYSOUT=8,DEST=IOM8                                               
//P13L538A  DD SYSOUT=8,DEST=IOM8                                               
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 4,5,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'4P',OR,                                                      
       4,2,CH,EQ,C'5P',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP06    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010AFN,DISP=(OLD,PASS)                                    
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 1,2 FLATS TO PRINT FLAT SUPPLY BEFORE ADJUST PA FLAT               
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K0104RM1,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE ADJUST PA FLAT SUPPLY            
//*-----------------------------------------------------------------            
//STEP08    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K0104RM1,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3P FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                   
//*---------------------------------------------------------------------        
//STEP09    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT   DD DSN=&&K0103PRM,DISP=(,PASS),                                     
//          UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                              
//          DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                  
//SYSIN     DD *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3P')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP10    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K0103PRM,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG AFTER PIGEONHOLING                 
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13L552 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BY REGN                                                                
//* INCLUDE ALL UNSUCCESSFUL APPLICATIONS                                       
//*-----------------------------------------------------------------            
//STEP12  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F520REGN,DISP=(,PASS),                                       
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,                                       
                 (210,1,CH,EQ,C' ',OR,210,1,CH,EQ,C'N'))                        
//*-----------------------------------------------------------------            
//* SORT BY REGN ON BALLOT FILE TO GET RESULT                                   
//*-----------------------------------------------------------------            
//STEP13  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                   
//        AMP=('BUFND=23')                                                      
//SORTOUT DD DSN=&&F520BALT,DISP=(,PASS),                                       
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OMIT COND=(245,1,CH,EQ,C'P',OR,245,1,CH,EQ,C'C')                            
//*---------------------------------------------------------------------        
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------------        
//STEP14   EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520REGN,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,PASS)                                    
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT REPORT ON TOTAL CUMULATIVE SUCC BY ALLOC-SCHEME                       
//*------------------------------------------------------------------           
//STEP16   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
AL5                                                                             
BP13APPF                                                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13SUCC,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT REPORT ON SUCC FOR THIS ROUND BY ALLOC-SCHEME                         
//*------------------------------------------------------------------           
//STEP18   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740SUCC,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
ALR                                                                             
BP13APPF                                                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* END BP13APP1                                                                
//*--------------------------------------------------------------------         
//*---------------------------------------------------------------------        
//* SORT OUT UNSUCC REQUEST CASES                                               
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.ARE2.R02,DISP=OLD                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,213,3,CH,NE,C'GRO',AND,                 
                 245,1,CH,EQ,C' ')                                              
//*---------------------------------------------------------------------        
//* PREPARE F740 FILE BEFORE OUTPUT REVISE SEQUENCE OF SHORTLISTING             
//*---------------------------------------------------------------------        
//STEP20A  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=BP13.F740.MATUREBA.ARE2.R02,DISP=SHR                          
//SORTJNF2 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//MATCH    DD DSN=&&F740M,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=501,BLKSIZE=0)                                
//UNMATCH  DD DSN=&&F740U,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(187,3,A,211,2,A)                                    
   JOINKEYS FILE=F2,FIELDS=(1,3,A,4,2,A)                                        
   JOIN UNPAIRED,F1,F2                                                          
   REFORMAT FIELDS=(?,F1:1,500,F2:378,1)                                        
   OPTION COPY                                                                  
   OUTFILE FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B'),BUILD=(1:2,501)                
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),BUILD=(1:2,500)              
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PROCESS MATCHED F740 RECORDS                                                
//* REMOVE AND OUTPUT RECORDS WITH NUM-CAP-UPGRADER = 'Y'                       
//*---------------------------------------------------------------------        
//STEP20B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740M,DISP=(OLD,DELETE)                                     
//SORTOUT1 DD DSN=&&F740M1,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(80,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SORTOUT2 DD DSN=BP13.F740.REMOVE.UPG.BP13APPF,DISP=SHR                        
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(501,1,CH,NE,C'Y')                            
   OUTFIL FNAMES=SORTOUT2,INCLUDE=(501,1,CH,EQ,C'Y')                            
//*---------------------------------------------------------------------        
//* MERGE BACK ALL F740 RECORDS                                                 
//*---------------------------------------------------------------------        
//STEP20C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740M1,DISP=(OLD,DELETE)                                    
//         DD DSN=&&F740U,DISP=(OLD,DELETE)                                     
//SORTOUT  DD DSN=&&F740ALL,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* TO OUTPUT REVISE SEQUENCE OF SHORTLISTING FOR SHORTFALL                     
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=BP13CF52,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F740 DD DSN=&&F740ALL,DISP=(OLD,DELETE)                                   
//BP13F74A DD DSN=&&BP13F74A,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74B DD DSN=&&BP13F74B,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74C DD DSN=&&BP13F74C,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74D DD DSN=&&BP13F74D,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74E DD DSN=&&BP13F74E,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74F DD DSN=&&BP13F74F,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74G DD DSN=&&BP13F74G,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74H DD DSN=&&BP13F74H,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74I DD DSN=&&BP13F74I,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74J DD DSN=&&BP13F74J,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74K DD DSN=&&BP13F74K,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74L DD DSN=&&BP13F74L,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - ELDERLY - SPS CASES                          
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74K,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - ELDERLY - NONSPS CASES                       
//*---------------------------------------------------------------------        
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74L,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL FT OUTPUT IN BP13CF52                                             
//* PPS           - BP13F74A                                                    
//* MCPS(FT) WITH - BP13F74B                                                    
//* MCPS(FT) NEAR - BP13F74C                                                    
//* FT            = BP13F74D                                                    
//*---------------------------------------------------------------------        
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74A,DISP=(OLD,DELETE)                                  
//         DD DSN=&&BP13F74B,DISP=(OLD,DELETE)                                  
//         DD DSN=&&BP13F74C,DISP=(OLD,DELETE)                                  
//         DD DSN=&&BP13F74D,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL ST OUTPUT IN BP13CF52                                             
//* AST           - BP13F74E                                                    
//* MCPS(ST) WITH - BP13F74F                                                    
//* MCPS(ST) NEAR - BP13F74G                                                    
//* ST            = BP13F74H                                                    
//*---------------------------------------------------------------------        
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74E,DISP=(OLD,DELETE)                                  
//         DD DSN=&&BP13F74F,DISP=(OLD,DELETE)                                  
//         DD DSN=&&BP13F74G,DISP=(OLD,DELETE)                                  
//         DD DSN=&&BP13F74H,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - FTS CASES                                    
//*---------------------------------------------------------------------        
//STEP26   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74I,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - SA CASES                                     
//*---------------------------------------------------------------------        
//*STEP27   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F74J,DISP=(OLD,DELETE)                                 
//*SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                  
//*            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                          
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//*SYSIN    DD *                                                                
//*   SORT FIELDS=(1,28,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR MATURE PA CASES, THE PROGRAM WI           
//* ONLY ALLOCATE THE PRIORITY SUPPLY QUOTA FOR ALL SCHEME                      
//*---------------------------------------------------------------------        
//STEP28   EXEC PGM=BP13U547,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F740 DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L547 DD SYSOUT=8,DEST=IOM8                                                
//P13L547A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------              
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------              
//STEP29   EXEC  PGM=BP13C713,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//   AMP=('BUFND=23')                                                           
//P13UNSUC DD DUMMY                                                             
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(32,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT SUCCESSFUL ELDERLY APPLICATIONS                                    
//*---------------------------------------------------------------------        
//STEP30A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13SUCC,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&SUCCSAP,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   INCLUDE COND=(210,1,CH,EQ,C'S',OR,210,1,CH,EQ,C'F')                          
//*---------------------------------------------------------------------        
//* TO UPDATE ALLOC-SCH TO SAP FOR ELIGIBLE ELDERLY APPLICATIONS                
//* WHICH HAVE BEEN SHORTLISTED.                                                
//*---------------------------------------------------------------------        
//STEP30B  EXEC PGM=BP13CB12,COND=(0,NE)                                        
//BP13F740 DD DSN=&&SUCCSAP,DISP=(OLD,DELETE)                                   
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------              
//*---------------------------------------------------------------              
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------              
//STEP31   EXEC  PGM=BP13C713,COND=(0,NE)                                       
//BP13F510 DD DSN=&&P13SUCC,DISP=(OLD,DELETE)                                   
//BP13K520 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//P13UNSUC DD DUMMY                                                             
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(32,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP32   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER(+1),DISP=(NEW,CATLG),                        
//            SPACE=(TRK,(5,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*--------------------------------------------------------------------         
//STEP33  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F525.APPL,DISP=SHR                                      
//OUTPUT1   DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY NT, FT, REGNO                                    
//* SHOW ALL THE APPLICATIONS SHORTLISTED                                       
//* SORT OUT RECORDS FOR ELDERLY (S1) & NON-ELDERLY (S2)                        
//*---------------------------------------------------------------------        
//STEP34   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT1 DD DSN=&&F740ELD,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(70,10),RLSE)                               
//SORTOUT2 DD DSN=&&F740NELD,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(70,10),RLSE)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,1,CH,EQ,C'2',AND,                        
              (210,1,CH,EQ,C'F',OR,210,1,CH,EQ,C'S'))                           
   OUTFIL FNAMES=SORTOUT2,INCLUDE=(211,1,CH,NE,C'2',OR,                         
              (210,1,CH,NE,C'F',AND,210,1,CH,NE,C'S'))                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON TOTAL CUMMULATIVE SUCC BY ALLOC-SCHEME (ELDERLY)            
//*---------------------------------------------------------------------        
//STEP35   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740ELD,DISP=(OLD,DELETE)                                   
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
EC1                                                                             
BP13APPF                                                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON TOTAL CUMMULATIVE SUCC BY ALLOC-SCHEME (NON-ELDERLY)        
//*---------------------------------------------------------------------        
//STEP36   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740NELD,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
NC1                                                                             
BP13APPF                                                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY NT, FT, REGNO                                    
//*---------------------------------------------------------------------        
//STEP37   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13SUCC,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY NT, FT, REGNO                                    
//* SHOW THE APPLICATIONS SHORTLISTED IN BP13APPZ                               
//* SORT OUT RECORDS FOR ELDERLY (S1) & NON-ELDERLY (S2)                        
//*---------------------------------------------------------------------        
//STEP38   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//SORTOUT1 DD DSN=&&F740ELD,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(70,10),RLSE)                               
//SORTOUT2 DD DSN=&&F740NELD,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(70,10),RLSE)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,1,CH,EQ,C'2',AND,                        
              (210,1,CH,EQ,C'F',OR,210,1,CH,EQ,C'S'))                           
   OUTFIL FNAMES=SORTOUT2,INCLUDE=(211,1,CH,NE,C'2',OR,                         
              (210,1,CH,NE,C'F',AND,210,1,CH,NE,C'S'))                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON SUCC WITHIN THIS ROUND BY ALLOC-SCHEME (ELDERLY)            
//*---------------------------------------------------------------------        
//STEP39   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740ELD,DISP=(OLD,DELETE)                                   
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
ER2                                                                             
BP13APPF                                                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON SUCC WITHIN THIS ROUND BY ALLOC-SCHEME (NON-ELDERLY)        
//*---------------------------------------------------------------------        
//STEP40   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740NELD,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
NER                                                                             
BP13APPF                                                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP41   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION FORM FOR COUNTER AND MAIL CASES                           
//* 3 DIFFERENT LETTERS DEPENDING ON MCPS OPTION                                
//*------------------------------------------------------------------           
//STEP42   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
ALC                                                                             
BP13APPF                                                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* PRINT REPORT ON SUCC FOR THIS COHORT BY ALLOC-SCHEME                        
//*------------------------------------------------------------------           
//STEP43   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
AR1                                                                             
BP13APPF                                                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT SUCCESSFUL APPLICATIONS SHORTLISTED IN BP13APPZ                    
//*---------------------------------------------------------------------        
//STEP44   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740SUCC,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.APPZ.SUCC,DISP=OLD                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
//****************************************************************              
//*            END OF BP13APPZ                                                  
//****************************************************************              
