//BP13M731 JOB (BP13P),'BP13M731',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*====================================================================         
//* RUN ON 4TH OF THE MONTH AFTER CLOSING OF SOC ACCOUNT                        
//* REPORT TO FINANCE DEPT ON LOAN GRANTED FOR DBSS FLAT                        
//*====================================================================         
//* PRINT MONTH END REPORT                                                      
//*====================================================================         
//* BP133131 230208 LSB  NEW JOB ON LOAN REPORT TO FIN                          
//*====================================================================         
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - FIN DEPT                     
//*-----------------------------------------------------------------            
//PRT02   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-FI1A CP-1',END;                                        
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=FI1A                                       
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* SORT BP13FD00 WITH LOAN GRANTED                                             
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FD04.DBSMAST.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13FD04,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=1700,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(22,3,A,1,8,CH,A),FORMAT=CH                                   
      INCLUDE COND=(289,7,CH,GT,C'0000000')                                     
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON LOAN GRANTED TO  HOUSING FINANCE                  *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13FD04 DD DSN=&&BP13FD04,DISP=(OLD,PASS)                                    
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13LC18 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC18),DISP=SHR                             
//*                                                                             
