//BP13D500 JOB (BP13P),'BP13D500',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*===================================================================*         
//* OBJECTIVE : UPLOAD AND PROCESS DAILY REQUEST                      *         
//*             - OMR, ADHOC                                          *         
//*             - BEBTO                                               *         
//*             - DBSS/ECS                                            *         
//*===================================================================*         
//* CHG-NO   BY   ON    - DESCRIPTION                                 *         
//* ---------------------------------                                 *         
//* BP130233 LSB 970213 - DO NOT PRINT BP13L793                       *         
//* BP130487 SSS 980507 - CHG UNIT=3480 TO UNIT=CART                  *         
//* BP130718 CLT 011099 - E-FAST INPLMENTATION                        *         
//*                       ADDED BP13C044, BP13C043, BP13C040, B1P3C057*         
//* BP130871 SSS 090600 - LISTING FOR EAALSS                          *         
//* BP130749 SB  150800 - CREATE MHA INTERFACE FILE FOR COUNTER CASES *         
//* BP131064 LSB 150901 - ADD STEP14A- STEP14G FOR MATURE ESTATE      *         
//* BP131064 CKK 150202 - COMMENT OUT STEP14A - STEP14G AFTER BE'02   *         
//* BP132162 ANC 250602 - DELETE COMMENTS IN STEP14A-STEP14G FOR BE   *         
//*                       TO CATER FOR RES-NRIC2                      *         
//* BP132171 CKK 251002 - CHECK FOR 'R' INSTEAD OF 'N' FOR OMR CASES  *         
//* BP132254 LSB 111202 - ADD IN STEP14H - STEP14N FOR BTO            *         
//* BP132266 CKK 271202 - ADD IN STEP14M - STEP14N FOR BTO            *         
//* BP132376 LSB 100703 - INTERFACE WITH CDB ON MHA DATA EXCHANGE     *         
//* BP132538 CKK 070504 - ADD RES-NRIC CHECKING FOR BTO               *         
//* BP132599 CLT 091004 - CHANGE DDNAME FOR BP13C806                  *         
//* BP132601 CKK 181004 - REMOVE BP13K750 PORTION                     *         
//* BP132646 CKK 261204 - CHECK FOR ELIG TAG FOR DAILY CASES          *         
//* BP132914 LSB 061006 - ADD DBS IN STEP17                           *         
//* BP132957 CKK 271106 - REMOVE DBSS STEPS. ADD EMAIL FOR C023       *         
//* BP133105 IL5 240707 - REMOVE STEP 18A AND 18C                     *         
//* BP133157 LSB 020108 - EFFECT DBSS FLAT BP13KB78                   *         
//* BP133323 LSB 220708 - ADD DTE-BALLOT IN C02B,TAKE OUR CB01 *                
//* BP133533 IL5 170409 - ADD STEPS FOR BP13KB20                      *         
//* BP133410 ZDD1110609 - ADD BP13C03A                                *         
//* BP133936 PCL3290610 - TO READ BP13K825 IN BP13C03A                *         
//* BP13XXXX IL5 210910 - CATER FOR EC                                *         
//* BP134091 JB8 210111 - ADD BP13.FB20.DBSBK.DAILY.BP18D200          *         
//* BP134229 IL5 190511 - REPL BP13C023 BY BP13C9CC WITH ENHANCED LOGIC         
//*          YCH 190511 - DROP BP13.F730.MATURERQ.DAILY               *         
//*          YCH 190511 - REPL BP13C02B BY BP13C9CB WITH ENHANCED LOGIC         
//* BP134356 YCH 130911 - INCLUDE LSE CHK FOR DBSS & EC CASES                   
//* BP134356 IL5 160911 - INCLUDE SUM FIELDS=NONE                               
//* BP134344 IL5 040112 - ENHANCE FOR D10 (SEND TO MHA)                         
//* BP134440 IL5 210212 - CLEAR CONTENTS OF BP13.F730.PREREQ                    
//* BP134474 IL5 230412 - EHANCE FOR D13, E12                                   
//* BP134523 IL5 220512 - REMOVE EXTRACTION OF RECORDS FROM                     
//*                       KB78 FOR D13 AND E12 (AFTER APPL PERIOD)              
//* BP134623 IL5 170912   EXTRACT E14                                           
//* BP134815 IL5 270413   EXTRACT E20                                           
//*                       REMOVE ADDITIONAL CREATION OF MCPS PARENT/            
//*                       CHILD TO BE01F500                                     
//* BP134929 ZDD 270313   EXTRACT E19 E20 E21 E22 E23 E24                       
//* BP135344 IL5 170914   EXTRACT E25 E28                                       
//*                       REMOVE E19 E20 E21 E22 E23 E24 AFT APPL PERIOD        
//* BP135505 IL5 151014   REMOVE E25 E28 - END OF APPLICATION PERIOD            
//* BP135552 IL5 101214   INCREASE SPACE ALLOCATED FOR                          
//*                       BP13.FB78.DBSREQ.BKUP(+1) FROM                        
//*                       SPACE=(CYL,(50,25),RLSE) TO                           
//*                       SPACE=(CYL,(150,50),RLSE) TO                          
//* BP137877 IL5 180619   EXCLUDE OBF CASES FROM F757 DAILY                     
//* BP137924 IL5 010719   WRITE OBF CASES TO F730/F825/F830/F857                
//*                       EXCLUDE OBF CASES FROM BE01F500                       
//*          IL5 010819   INCLUDE OBF CASES WITH APPT LE CURRENT DATE           
//* BP139673 AM25150923   CATER FOR HFE SUBMISSION DATE                         
//* BP139280 EAA2 031123  EXPAND FROM 3000 TO 4000 IN STEPS STEP200 &           
//*                       STEP250                                               
//* BP139280 YCH2 301123  CHANGE BLKSIZE IN STEP200                             
//* BP139778 YCH2 701123  CHANGE JCL TO DELETE BYPASS PAYMENT MODE 'CS'         
//*=====================================================================        
//* ((( PROCESS CASES FROM COUNTER & MAILED IN APPLICATION  ))))                
//*=====================================================================        
//*-------------------------------------------------------------------*         
//STEP100  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K500.PREREGN,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F500,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OMIT COND=(123,8,CH,EQ,C'        ')                                         
//*-------------------------------------------------------------------*         
//* SORT IN NRIC ORDER                                                          
//*--------------------------------------------------------------------         
//STEP110  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F825,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
//*--------------------------------------------------------------------*        
//*  CREATE THE MHA-INTERFACE FILE FOR COUNTER CASES.                           
//*--------------------------------------------------------------------*        
//STEP120 EXEC PGM=BP13C087,COND=(0,NE)                                         
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//BP13F825 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//BE01F500 DD DSN=BP13.F500.SENDID.OBTPRT.BE01,DISP=MOD                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=====================================================================        
//*   ((((((((((((     PROCESS BTO CASES     )))))))))))                        
//*=====================================================================        
//*-------------------------------------------------------------------*         
//* BACKUP BP13K757 INTERNET CASES                                    *         
//*-------------------------------------------------------------------*         
//STEP200  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INFILE   DD DSN=BP13.K757.BTO,DISP=SHR                                        
//OUTFILE  DD DSN=BP13.F757.BTO.BKUP(+1),DISP=(NEW,CATLG),                      
//          SPACE=(CYL,(300,50),RLSE),DATACLAS=MULTIVOL,                        
//          DCB=(BLKSIZE=24000,LRECL=4000,RECFM=FB)                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    REPRO INFILE(INFILE) OUTFILE(OUTFILE)                                       
//*-------------------------------------------------------------------*         
//* SORT OUT INTERNET APPLN WITH DTE-SOC-UPDATED = BLANK              *         
//* UPDATE DTE-SOC-UPDATED WITH CURRENT DATE                          *         
//*-------------------------------------------------------------------*         
//STEP210  EXEC PGM=BP13C806,COND=(0,NE)                                        
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//BP13F757 DD DSN=BP13.F757.BTO.DAILY,DISP=OLD                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT OUT CASES WITH EMPTY REF NO                                            
//*-------------------------------------------------------------------*         
//STEP220  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F757.BTO.DAILY,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F757.BTO.DAILY,DISP=SHR                                  
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH                                             
      OMIT COND=((1,8,CH,EQ,C'        ',OR,                                     
                 17,9,CH,EQ,C'         ',OR,                                    
                 17,1,CH,EQ,X'00'),OR,                                          
                (2918,3,CH,EQ,C'OBF',AND,                                       
                (2901,8,CH,GT,DATE1,OR,2901,1,CH,EQ,C' ',OR,                    
                 2901,1,CH,EQ,X'00')))                                          
//*-------------------------------------------------------------------*         
//*  CREATE THE REQUESTS FOR BE/BTO                                             
//*-------------------------------------------------------------------*         
//STEP230  EXEC PGM=BP13C9CC,COND=(0,NE)                                        
//BP13F757 DD DSN=BP13.F757.BTO.DAILY,DISP=SHR                                  
//BP13F730 DD DSN=BP13.F730.BTOREQ,DISP=OLD                                     
//BP13F830 DD DSN=BP13.F830.BTOADDR,DISP=OLD                                    
//BP13F825 DD DSN=BP13.F825.BTOOCCP,DISP=OLD                                    
//BP13F857 DD DSN=BP13.F857.BTOEMAIL,DISP=OLD                                   
//BE01F500 DD DSN=BP13.F500.SENDID.OBTPRT.BE01,DISP=MOD                         
//BP13L9CC DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORT OUT CASES WITH EMPTY REF NO                                            
//*-------------------------------------------------------------------*         
//STEP235  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F825.BTOOCCP,DISP=SHR                                    
//         DD DSN=BP13.BLANK.CHAR200,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F825.BTOOCCP,DISP=SHR                                    
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,17,A),FORMAT=CH                                            
//*--------------------------------------------------------------------         
//*   CREATE SOC TEMP REQOCCP FILE FOR MCPS                                     
//*--------------------------------------------------------------------         
//STEP240  EXEC   PGM=IDCAMS,COND=(0,NE)                                        
//INPUT    DD  DSN=BP13.F825.BTOOCCP,DISP=SHR                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
         DEL (BP13.K825.BTOOCCP) CL PURGE                                       
         DEF CL (NAME(BP13.K825.BTOOCCP)              -                         
                 CYL(80 40)                         -                           
                 UNIQUE                               -                         
                 SHR(2 3))                            -                         
                 DATA                                 -                         
                 (NAME(BP13.K825.BTOOCCP.DATA)        -                         
                 KEYS(17 0)                           -                         
                 RECSZ(200 200)                       -                         
                 FSPC(10 10)                          -                         
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                           -                         
           REPRO IFILE(INPUT)                         -                         
                 ODS(BP13.K825.BTOOCCP)                                         
           DEF AIX (NAME(BP13.K825.BTOOCCP.ALTX1)     -                         
               REL(BP13.K825.BTOOCCP)                 -                         
               CYL(8 5)                              -                          
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K825.BTOOCCP.ALTX1.DATA)     -                        
               KEYS(9 8)                              -                         
               CISZ(4096)                              -                        
               RECSZ(200 200)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K825.BTOOCCP.PATH1)      -                        
               PENT(BP13.K825.BTOOCCP.ALTX1))                                   
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K825.BTOOCCP)                  -                        
               ODS(BP13.K825.BTOOCCP.ALTX1)                                     
//*--------------------------------------------------------------------         
//*   CREATE SOC TEMP REQOCCP FILE FOR MCPS                                     
//*--------------------------------------------------------------------         
//STEP241  EXEC SORT,COND=(0,NE)                                                
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F730.BTOREQ,DISP=SHR                                      
//SORTOUT DD DSN=&&P13F730N,DISP=(NEW,PASS),                                    
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(80,40),RLSE)                                          
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 - INTERMEDIATE FILE                                 *         
//*-------------------------------------------------------------------*         
//STEP242  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.BTOOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&P13F825N,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A,107,2,A,9,9,A),FORMAT=CH                                 
    INCLUDE COND=(1,8,CH,GT,C'        ')                                        
//*-------------------------------------------------------------------*         
//* TO UPDATE LESSEE CHECK                                            *         
//*-------------------------------------------------------------------*         
//STEP243  EXEC PGM=BP13C834,COND=(0,NE)                                        
//BP13F730 DD DSN=&&P13F730N,DISP=(OLD,PASS)                                    
//BP13F825 DD DSN=&&P13F825N,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.BTOOCCP,DISP=SHR                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L834 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT OUT CASES WITH ALLOCATION SCHEME IS 'P' OR 'C'                         
//*------------------------------------------------------------------           
//STEP250  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F757.BTO.DAILY,DISP=SHR                                  
//SORTOUT  DD DSN=&&F757MCPS,DISP=(,PASS),                                      
//            SPACE=(CYL,(30,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=4000)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2536,3,CH,EQ,C'P  ',OR,                                         
                2536,3,CH,EQ,C'C  ',OR,                                         
                2536,3,CH,EQ,C'M  ')                                            
//*------------------------------------------------------------------           
//STEP260  EXEC PGM=BP13C03A,COND=(0,NE)                                        
//BP13F757 DD DSN=&&F757MCPS,DISP=(OLD,DELETE)                                  
//BP13K853 DD DSN=BP13.K853.MCPS,DISP=SHR                                       
//BP13K825 DD DSN=BP13.K825.BTOOCCP,DISP=SHR                                    
//BP13F853 DD DSN=BP13.F853.BTOMCPS,DISP=SHR                                    
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*=====================================================================        
//*((((((((((((     PROCESS DBSS CASES    )))))))))))                           
//*=====================================================================        
//*-------------------------------------------------------------------*         
//*  BACKUP BP13FB78 DAILY CASES TO GDG                               *         
//*-------------------------------------------------------------------*         
//STEP300  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.FB78.DBSREQ.BKUP(+1),DISP=(NEW,CATLG),                   
//            SPACE=(CYL,(150,50),RLSE),DATACLAS=MULTIVOL,                      
//            DCB=(BLKSIZE=26400,LRECL=3300,RECFM=FB)                           
//SYSIN     DD  *                                                               
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT OUT INTERNET APPLN WITH DTE-SOC-UPDATED = BLANK              *         
//* UPDATE DTE-SOC-UPDATED WITH CURRENT DATE                          *         
//*-------------------------------------------------------------------*         
//STEP310  EXEC PGM=BP13C819,COND=(0,NE)                                        
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//BP13FB78 DD DSN=BP13.FB78.DBSREQ.DAILY,DISP=OLD                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* OMIT CASES WITH EMPTY REF NO                                                
//* AND INCLUDE PROJECT CODE NOT = 'E05'                                        
//* ** STEP SHOULD BE IN USE DURING APPLICATION PERIOD FOR                      
//*    PROJECTS IN BALLOT MODE                                                  
//*-------------------------------------------------------------------*         
//*STEP320  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.FB78.DBSREQ.DAILY,DISP=SHR                              
//*SORTOUT  DD DSN=&&BP13FB78,DISP=(NEW,PASS),                                  
//*         DCB=(LRECL=3300,RECFM=FB,BLKSIZE=0),                                
//*         SPACE=(CYL,(10,10),RLSE)                                            
//*SYSIN    DD *                                                                
//*         SORT FIELDS=(1,13,A),FORMAT=CH                                      
//*         INCLUDE COND=(1,3,CH,EQ,C'E25',OR,                                  
//*                       1,3,CH,EQ,C'E28')                                     
//*-------------------------------------------------------------------*         
//* SORT OUT INTERNET APPLN WITH DTE-SOC-UPDATED = BLANK              *         
//*  AND BOOKED DBS/EC CASES                                          *         
//* ** STEP SHOULD BE IN USE DURING APPLICATION PERIOD FOR                      
//*    PROJECTS IN BALLOT MODE                                                  
//*-------------------------------------------------------------------*         
//STEP330  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB20.DBSBK,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13FB20,DISP=(,PASS),                                      
//         DCB=(LRECL=3300,RECFM=FB,BLKSIZE=0),                                 
//         SPACE=(CYL,(10,10),RLSE)                                             
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,13,A),FORMAT=CH                                                
  INCLUDE COND=(2847,8,CH,EQ,C'        ',AND,                                   
                3015,11,CH,NE,C'           ')                                   
//*------------------------------------------------------------------           
//* UPDATE DTE-SOC-UPDATED WITH CURRENT DATE                                    
//*------------------------------------------------------------------           
//STEP340  EXEC PGM=BP13C823,COND=(0,NE)                                        
//P13FB2OA  DD DSN=&&BP13FB20,DISP=(OLD,DELETE)                                 
//BP13FB20  DD DSN=BP13.FB20.DBSBK.DAILY,DISP=OLD                               
//SYSUDUMP  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
//*------------------------------------------------------------------           
//* BP13.FB20.DBSBK.DAILY.BP18D200 WILL BE EMPTYED IN BP18D200                  
//*                                WHICH NOT RUN ON SUNDAY                      
//*------------------------------------------------------------------           
//STEP350  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.FB20.DBSBK.DAILY,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB20.DBSBK.DAILY.BP18D200,DISP=MOD                       
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,13,A),FORMAT=CH                                             
//*------------------------------------------------------------------           
//* MERGE FB20 AND FB78 FOR PROCESSING OF BP13C02B                              
//*------------------------------------------------------------------           
//STEP360  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.FB20.DBSBK.DAILY,DISP=SHR                                
//*        DD DSN=&&BP13FB78,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&BP13MRGE,DISP=(,PASS),                                      
//         DCB=(LRECL=3300,RECFM=FB,BLKSIZE=0),                                 
//         SPACE=(CYL,(10,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,13,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
//*-------------------------------------------------------------------*         
//*  CREATE THE REQUESTS FOR DBSS                                     *         
//*-------------------------------------------------------------------*         
//STEP370  EXEC PGM=BP13C9CB,COND=(0,NE)                                        
//BP13FB78 DD DSN=&&BP13MRGE,DISP=(OLD,DELETE)                                  
//BP13F730 DD DSN=BP13.F730.DBSREQ,DISP=OLD                                     
//BP13F830 DD DSN=BP13.F830.DBSADDR,DISP=OLD                                    
//BP13F825 DD DSN=BP13.F825.DBSOCCP,DISP=OLD                                    
//BE01F500 DD DSN=BP13.F500.SENDID.OBTPRT.BE01,DISP=MOD                         
//BP13L9CB DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT OUT CASES WITH EMPTY REF NO                                            
//*-------------------------------------------------------------------*         
//STEP375  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F825.DBSOCCP,DISP=SHR                                    
//         DD DSN=BP13.BLANK.CHAR200,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F825.DBSOCCP,DISP=SHR                                    
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,17,A),FORMAT=CH                                            
//*--------------------------------------------------------------------         
//*   CREATE SOC TEMP REQOCCP FILE FOR MCPS                                     
//*--------------------------------------------------------------------         
//STEP380  EXEC   PGM=IDCAMS,COND=(0,NE)                                        
//INPUT    DD  DSN=BP13.F825.DBSOCCP,DISP=SHR                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
         DEL (BP13.K825.DBSOCCP) CL PURGE                                       
         DEF CL (NAME(BP13.K825.DBSOCCP)              -                         
                 CYL(20 10)                         -                           
                 UNIQUE                               -                         
                 SHR(2 3))                            -                         
                 DATA                                 -                         
                 (NAME(BP13.K825.DBSOCCP.DATA)        -                         
                 KEYS(17 0)                           -                         
                 RECSZ(200 200)                       -                         
                 FSPC(10 10)                          -                         
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                           -                         
           REPRO IFILE(INPUT)                         -                         
                 ODS(BP13.K825.DBSOCCP)                                         
           DEF AIX (NAME(BP13.K825.DBSOCCP.ALTX1)     -                         
               REL(BP13.K825.DBSOCCP)                 -                         
               CYL(8 5)                              -                          
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K825.DBSOCCP.ALTX1.DATA)     -                        
               KEYS(9 8)                              -                         
               CISZ(4096)                              -                        
               RECSZ(200 200)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K825.DBSOCCP.PATH1)      -                        
               PENT(BP13.K825.DBSOCCP.ALTX1))                                   
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K825.DBSOCCP)                  -                        
               ODS(BP13.K825.DBSOCCP.ALTX1)                                     
//*--------------------------------------------------------------------         
//*   CREATE SOC TEMP REQOCCP FILE FOR MCPS                                     
//*--------------------------------------------------------------------         
//STEP385  EXEC SORT,COND=(0,NE)                                                
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F730.DBSREQ,DISP=SHR                                      
//SORTOUT DD DSN=&&P13FDBSN,DISP=(NEW,PASS),                                    
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 - INTERMEDIATE FILE                                 *         
//*-------------------------------------------------------------------*         
//STEP390  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.DBSOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&P13FDBSN,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A,107,2,A,9,9,A),FORMAT=CH                                 
    INCLUDE COND=(1,8,CH,GT,C'        ')                                        
//*-------------------------------------------------------------------*         
//* TO UPDATE LESSEE CHECK                                            *         
//*-------------------------------------------------------------------*         
//STEP395  EXEC PGM=BP13C834,COND=(0,NE)                                        
//BP13F730 DD DSN=&&P13FDBSN,DISP=(OLD,PASS)                                    
//BP13F825 DD DSN=&&P13FDBSN,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.DBSOCCP,DISP=SHR                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L834 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*=====================================================================        
//*((((((((((((  COMBINE DAILY REQUEST FOR ONLINE INSERTION  )))))              
//*=====================================================================        
//STEP400  EXEC SORT,COND=(0,NE)                                                
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F730.BTOREQ,DISP=SHR                                      
//        DD DSN=BP13.F730.DBSREQ,DISP=SHR                                      
//SORTOUT DD DSN=BP13.F730.REQAPPN.DAY,DISP=OLD                                 
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 - INTERMEDIATE FILE CONTAIN LESSEE CHECK (BTO)      *         
//*-------------------------------------------------------------------*         
//STEP401  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.BTOOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F825.BTOOCCP.LSETAG,DISP=OLD                             
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
//*-------------------------------------------------------------------*         
//* SORT BP13K825 - INTERMEDIATE FILE CONTAIN LESSEE CHECK (DBS)      *         
//*-------------------------------------------------------------------*         
//STEP402  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.DBSOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F825.DBSOCCP.LSETAG,DISP=OLD                             
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
//*-------------------------------------------------------------------*         
//* SORT BP13K825 - INTERMEDIATE FILE CONTAIN LESSEE CHECK            *         
//*-------------------------------------------------------------------*         
//STEP410  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F825.BTOOCCP.LSETAG,DISP=SHR                             
//         DD DSN=BP13.F825.DBSOCCP.LSETAG,DISP=SHR                             
//SORTOUT  DD DSN=BP13.F825.REQOCCP.DAY,DISP=OLD                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
//*-------------------------------------------------------------------*         
//STEP420  EXEC SORT,COND=(0,NE)                                                
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F830.BTOADDR,DISP=SHR                                     
//        DD DSN=BP13.F830.DBSADDR,DISP=SHR                                     
//SORTOUT DD DSN=BP13.F830.REQADDR.DAY,DISP=OLD                                 
//SYSIN   DD  *                                                                 
    SORT FIELDS=(1,9,A),FORMAT=CH                                               
//*-------------------------------------------------------------------*         
//STEP430  EXEC SORT,COND=(0,NE)                                                
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F853.BTOMCPS,DISP=SHR                                     
//SORTOUT DD DSN=BP13.F853.REQMCPS.DAY,DISP=OLD                                 
//SYSIN   DD  *                                                                 
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
//*-------------------------------------------------------------------*         
//STEP440  EXEC SORT,COND=(0,NE)                                                
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F857.BTOEMAIL,DISP=SHR                                    
//SORTOUT DD DSN=BP13.F857.REQEMAIL.DAY,DISP=OLD                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
//*-------------------------------------------------------------------*         
//*  CREATE FILE FOR PRE-E CHECK                                      *         
//*   BP13.F730.PREREQ FOR ADHOC OR MISS OUT CASES                              
//*-------------------------------------------------------------------*         
//STEP450  EXEC SORT,COND=(0,NE)                                                
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F730.REQAPPN.DAY,DISP=SHR                                 
//        DD DSN=BP13.F730.PREREQ,DISP=SHR                                      
//SORTOUT DD DSN=BP13.F730.REQPREE.DAY,DISP=OLD                                 
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
//*-------------------------------------------------------------------*         
//*  SETUP FOR EXECPTIONAL REPORT AND THE FOLLOWING STEPS                       
//*-------------------------------------------------------------------*         
//STEP460  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F730.REQAPPN.DAY,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.F730.REQUEST.DAY,DISP=MOD                                
//SYSIN     DD  *                                                               
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*=====================================================================        
//*((((((((((((    BACKUP OF FILES        )))))))))))                           
//*=====================================================================        
//*--------------------------------------------------------------------*        
//*  BACKUP BP13K500/BP13K825 TO CART                                  *        
//*--------------------------------------------------------------------*        
//STEP900 EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K500.PREREGN,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F500.PREREGN.BFDAILY(+1),DISP=(NEW,PASS),                
//            UNIT=CART,LABEL=(1,SL),                                           
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT2   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F825.REQOCCP.BFDAILY(+1),DISP=(NEW,PASS),                
//            UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=200,RECFM=FB)                   
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CATALOG BACKUP                                                    *        
//*--------------------------------------------------------------------*        
//STEP910  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//INPUT1   DD DSN=BP13.F500.PREREGN.BFDAILY(+1),DISP=(OLD,CATLG),               
//             UNIT=(,,DEFER)                                                   
//INPUT2   DD DSN=BP13.F825.REQOCCP.BFDAILY(+1),DISP=(OLD,CATLG),               
//             UNIT=(,,DEFER)                                                   
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP FILE FROM F500                                             *         
//*-------------------------------------------------------------------*         
//STEP920   EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1  DD DSN=BP13.F500.SENDID.OBTPRT.BE01,DISP=SHR                          
//OUTPUT1 DD DSN=BP13.BE01.F500.MHAMTH,DISP=MOD                                 
//INPUT2  DD DSN=BP13.F730.REQPREE.DAY,DISP=SHR                                 
//OUTPUT2 DD DSN=BP13.F730.REQPREE.MBKP,DISP=MOD                                
//INPUT3  DD DSN=BP13.F825.REQOCCP.DAY,DISP=SHR                                 
//OUTPUT3 DD DSN=BP13.F825.REQOCCP.MBKP,DISP=MOD                                
//INPUT4  DD DUMMY                                                              
//OUTPUT4 DD DSN=BP13.F730.PREREQ,DISP=OLD                                      
//OUTPUT5 DD DSN=BP13.BE01.F500.DAILY,DISP=MOD                                  
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
      REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                    
      REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                    
      REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                    
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT5)                                    
//*-------------------------------------------------------------------*         
//* EXTRACT FLAT_ELGBTY_CASE                                          *         
//*-------------------------------------------------------------------*         
//STEP930  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F757 DD DSN=BP13.F757.BTO.DAILY,DISP=SHR                                  
//BP13FECA DD DSN=BP13.FECA.HFE.ACCUM,DISP=MOD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
 DSN SYSTEM(DSN)                                                                
 RUN PROGRAM(BP13C51E) PLAN(BP13PCC) -                                          
     LIB('BP13.BATCH.LOADCOB')                                                  
 END                                                                            
/*                                                                              
//*--------------------------------------------------------------------*        
//*                      END OF JOB                                    *        
//*--------------------------------------------------------------------*        
