//BP13D538 JOB (BP13P),'BP13D538',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//* 1. SFTP DAILY ACCUM FILE TO DEVELOPER                                       
//* 2. RUN AT 8.05 PM                                                           
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP132886 CKK  010706   NEW JCL FOR FTP FILE TO SIM LIAN                     
//* BP133157 IL5  210208   CHANGE OF FTP FOLDER NAME                            
//* BP133388 IL5  160908   CHANGE OF FTP FOLDER NAME                            
//* BP133388 IL5  101008   INCLUDE NEW INPUT FILE BP13KA30                      
//* BP133457 IL5  060109   ADD STEPS FOR FTP TO QINGJIAN (D04)                  
//* BP133533 IL5  240409   ADD STEPS FOR FTP TO D05 AND D06                     
//* BP134109 IL5  040411   ADD STEPS FOR FTP TO D07                             
//* BP134109 ZDD  110511   ADD BP13C12B FOR D07                                 
//* BP134211 IL5  110511   REMOVE D05                                           
//* BP134470 IL5  230412   ADD STEPS FOR D13                                    
//* BP135234 IL5  260214   REMOVE D06                                           
//* BP135738 HH17 230615   REMOVE D02,D03                                       
//* BP135609 HH17 230615   FTP MIGRATION TO LANSFTPP01                          
//* BP136718 ZDD1 280317   REMOVE D09                                           
//* BP137844 PP11 190719   REMOVE D01 TO D07 AND D09 TO D12                     
//*==================================================================           
//* TO SEND DJDE AHEAD OF THE PRINT DATASET                                     
//* PRT01 : FOR CONTROL LISTING                                                 
//*------------------------------------------------------------------           
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*------------------------------------------------------------------           
//* SORT BP13FB78 NEW AND UPDATED RECORD IN REGN-NO ORDER                       
//*------------------------------------------------------------------           
//D538S00A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB25.DBSELIG,DISP=SHR                                    
//SORTOUT  DD DSN=&&FB78,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=3300,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(6,8,A),FORMAT=CH                                                
   INCLUDE COND=(3245,1,CH,EQ,C'Y',AND,                                         
                 3246,8,CH,NE,C' ',AND,                                         
                 101,1,CH,EQ,C'D')                                              
   OUTREC FIELDS=(101,3300)                                                     
//*------------------------------------------------------------------           
//* READ NEW CASES, FORMAT RECORD FOR DEVELOPER FORMAT (BP13FB60)               
//*------------------------------------------------------------------           
//D538S00B EXEC PGM=BP13CD03,COND=(0,NE)                                        
//BP13FB20 DD DSN=&&FB78,DISP=(OLD,DELETE)                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//P13FB20A DD DSN=&&FB20,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=3300,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*------------------------------------------------------------------           
//* READ NEW CASES, FORMAT RECORD FOR DEVELOPER FORMAT (BP13FB60)               
//*------------------------------------------------------------------           
//D538S00C EXEC PGM=BP13C02E,COND=(0,NE)                                        
//BP13FB78 DD DSN=&&FB20,DISP=(OLD,PASS)                                        
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                    
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                              
//BP13KA30 DD DSN=BP13.KA30.UNIT,DISP=SHR                                       
//BP13KA31 DD DSN=BP13.KA30.UNIT.PATH1,DISP=SHR                                 
//BP13FB60 DD DSN=BP13.FB60.FTPREQ.DAILY.ASSESS,DISP=OLD                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* BACKUP FILE TO DISK                                                         
//*--------------------------------------------------------------------         
//D538S00D EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FB60.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//OUTPUT1  DD DSN=BP13.FB60.FTPREQ.ASSESS.BACKUP(+1),DISP=(NEW,CATLG),          
//         DCB=(BLKSIZE=0,LRECL=2843,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//* STEP1  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//D538S001 EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FB66.FTPREQ.ASSESS.D08')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.D08')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.D13')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.D13')                                       
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//*------------------------------------------------------------------           
//* SORT D07 CASES                                                              
//*------------------------------------------------------------------           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&FB20,DISP=(OLD,DELETE)                                      
//SORTOUT  DD DSN=&&BP13FB20,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=3300,BLKSIZE=),                        
//        SPACE=(CYL,(3,2),RLSE)                                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(6,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,3,CH,EQ,C'D08',OR,1,3,CH,EQ,C'D13')                           
/*                                                                              
//*------------------------------------------------------------------           
//* READ NEW CASES, FORMAT RECORD FOR DEVELOPER FORMAT (BP13FB66)               
//*------------------------------------------------------------------           
//D538S007 EXEC PGM=BP13C12B,COND=(0,NE)                                        
//BP13FB20 DD DSN=&&BP13FB20,DISP=(OLD,DELETE)                                  
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR                                      
//BP13KA30 DD DSN=BP13.KA30.UNIT,DISP=SHR                                       
//BP13KA31 DD DSN=BP13.KA30.UNIT.PATH1,DISP=SHR                                 
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                    
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                              
//BP13FB66 DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS.DBSS,DISP=OLD                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*--------------------------------------------------------------------         
//* BACKUP FILE TO DISK                                                         
//*--------------------------------------------------------------------         
//D538S008 EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS.DBSS,DISP=SHR                   
//OUTPUT1  DD DSN=BP13.FB66.FTPREQ.ASSESS.DBSS.BACKUP(+1),                      
//         DISP=(NEW,CATLG),                                                    
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//* FILE FOR PROJECT D08                                                        
//*------------------------------------------------------------------           
//D538S015 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS.DBSS,DISP=SHR                   
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.D08,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(6,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'D08')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D538S016 EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL2,                                        
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.D08)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.D08";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.D08";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D538S017 EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL2,DISP=SHR                                
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D538S018 EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL,                                         
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/DBSS/D08/MF';                     
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.D08' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D538S019 EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL,DISP=SHR                                 
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT D13                                                        
//*------------------------------------------------------------------           
//D538S131 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS.DBSS,DISP=SHR                   
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.D13,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(6,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'D13')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D538S132 EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL2,                                        
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.D13)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.D13";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.D13";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D538S133 EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL2,DISP=SHR                                
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D538S134 EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL,                                         
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/DBSS/D13/MF';                     
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.D13' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D538S135 EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL,DISP=SHR                                 
//*                                                                             
