//BP13Y101 JOB (BP13P),'BP13Y101',CLASS=I,MSGCLASS=N,                   JOB02137
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* HOUSEKEEP ROUTING/CHECKLIST FILES                                           
//* MATCH FB00 WITH BP13F800, EC BP18K300 FILES                                 
//*   IF FOUND, IF STATUS NOT = 'C', KEEP                                       
//*   IF FOUND, IF STATUS = 'C', CHECK DTE-CANCEL WITHIN 5-YEARS, KEEP          
//*                         ELSE DELETE                                         
//*   IF NOT FOUND,                                                             
//*      IF CHECK DTE-KEY-ISSUED WITHIN 5-YEARS, KEEP, ELSE DELETE              
//*                                                                             
//* BP134985 24/10/2016 LSB TO DELETE CHECKLIST, BEBTO,ROUTING HIST             
//*                         AND JOURNAL AFTER 5 YEARS FROM                      
//*                         KEY-ISSUED-DATE.                                    
//*                         (BEBTO - IS STATUS OF THE CASE)                     
//*=================================================================            
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KB00.BEBTO,DISP=OLD                                      
//INPUT2   DD DSN=BP13.KB02.ROUTE.HIST,DISP=OLD                                 
//INPUT3   DD DSN=BP13.KB05.JOURNAL,DISP=OLD                                    
//INPUT4   DD DSN=BP13.KB10.CHKLIST1,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//*-----------------------------------------------------------------    00000150
//* BACKUP VSAM FILE TO CARTRIDGE                                       00000160
//*-----------------------------------------------------------------    00000170
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00000180
//SYSPRINT DD  SYSOUT=*                                                 00000190
//INPUT1   DD  DSN=BP13.KB00.BEBTO,                                     00000200
//             DISP=SHR,                                                00000210
//             AMP=('BUFND=23')                                         00000220
//OUTPUT1  DD  DSN=BP13.FB00.BEBTO.YEAR(+1),                            00000230
//             DISP=(NEW,CATLG),                                        00000240
//             UNIT=CART,                                               00000250
//             LABEL=(1,SL),                                            00000260
//             DCB=(BP13.GDG,BLKSIZE=27800,LRECL=200,RECFM=FB)          00000270
//*                                                                     00000280
//INPUT2   DD  DSN=BP13.KB10.CHKLIST1,                                  00000290
//             DISP=SHR,                                                00000300
//             AMP=('BUFND=23')                                         00000310
//OUTPUT2  DD  DSN=BP13.FB10.CHKLIST1.YEAR(+1),                         00000320
//             DISP=(NEW,CATLG),                                        00000330
//             UNIT=CART,                                               00000340
//             LABEL=(2,SL),                                            00000350
//             VOL=REF=*.OUTPUT1,                                       00000360
//             DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)         00000370
//*                                                                     00000280
//INPUT3   DD  DSN=BP13.KB02.ROUTE.HIST,                                00000380
//             DISP=SHR                                                 00000390
//OUTPUT3  DD  DSN=BP13.FB02.ROUTE.HIST.YEAR(+1),                       00000400
//             DISP=(NEW,CATLG),                                        00000410
//             UNIT=CART,                                               00000420
//             LABEL=(3,SL),                                            00000430
//             VOL=REF=*.OUTPUT1,                                       00000440
//             DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)          00000450
//*                                                                     00000280
//INPUT4   DD  DSN=BP13.KB05.JOURNAL,                                   00000460
//             DISP=SHR                                                 00000470
//OUTPUT4  DD  DSN=BP13.FB05.JOURNAL.YEAR(+1),                          00000480
//             DISP=(NEW,CATLG),                                        00000490
//             UNIT=CART,                                               00000500
//             LABEL=(4,SL),                                            00000510
//             VOL=REF=*.OUTPUT1,                                       00000520
//             DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)          00000530
//*                                                                     00000280
//SYSIN    DD  *                                                        00000540
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
//*---------------------------------------------------------------------        
//* SORT K800, OUTREC REGN,DTE-CANCEL                                           
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=20),                                             
//         SPACE=(CYL,(210,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  OUTREC FIELDS=(4,8,185,8,4X)                                                  
//*---------------------------------------------------------------------        
//* SORT K893, OUTREC REGN,DTE-CANCEL                                           
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                              
//SORTOUT  DD DSN=&&BP13F800,DISP=(MOD,PASS),                                   
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=20),                                             
//         SPACE=(CYL,(210,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  OUTREC FIELDS=(4,8,185,8,4X)                                                  
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP18.K300.MASTER,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F800,DISP=(MOD,PASS),                                   
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=20),                                             
//         SPACE=(CYL,(250,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  OUTREC FIELDS=(1,8,12X)                                                       
//*=================================================================            
//* SORT REGN ORDER                                                             
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F800SORT,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=20),                                             
//         SPACE=(CYL,(210,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* SORT KB00, BY REGN                                                          
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB00.BEBTO,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13FB00,DISP=(,PASS),                                      
//        DCB=(RECFM=FB,LRECL=200),                                             
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(15,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* MATCH FB00 WITH F800                                                        
//*   IF FOUND, IF STATUS NOT = 'C', KEEP                                       
//*   IF FOUND, IF STATUS = 'C', CHECK DTE-CANCEL WITHIN 5-YEARS, KEEP          
//*                         ELSE DELETE                                         
//*   IF NOT FOUND,                                                             
//*      IF CHECK DTE-KEY-ISSUED WITHIN 5-YEARS, KEEP, ELSE DELETE              
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13C39M,COND=(0,NE)                                        
//BP13FB00 DD DSN=&&BP13FB00,DISP=(OLD,PASS)                                    
//BP13INP  DD DSN=&&F800SORT,DISP=(OLD,PASS)                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13FB00A DD DSN=BP13.FB00.KEEP,DISP=(,CATLG),                                 
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=200),                                            
//         SPACE=(CYL,(210,10),RLSE)                                            
//P13FB00B DD DSN=BP13.FB00.DELETE,DISP=(,CATLG),                               
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=200),                                            
//         SPACE=(CYL,(210,10),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------         
//* SORT IN KEY-FLD ORDER                                                       
//*--------------------------------------------------------------------         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB00.KEEP,DISP=SHR                                       
//SORTOUT  DD DSN=&&FB00,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                                 
//         SPACE=(CYL,(250,30),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(15,8,A,1,22,A),FORMAT=CH                                        
  SUM FIELDS=NONE                                                               
  OMIT COND=(15,8,CH,EQ,C'        ')                                            
//*--------------------------------------------------------------------         
//* DELETE/DEFINE BP13KB00                                                      
//*--------------------------------------------------------------------         
//STEP10    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=&&FB00,DISP=(SHR,DELETE)                                      
//SYSIN     DD  *                                                               
          DEL (BP13.KB00.BEBTO) CLUSTER PURGE                                   
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.KB00.BEBTO)                 -                  00810000
              CYL(50 8)                               -                 00830000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.KB00.BEBTO.DATA)            -                  00870000
              KEYS(8  14)                            -                  00880000
              RECSZ(200 200)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.KB00.BEBTO.INDEX)           -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.KB00.BEBTO)                                      00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.KB00.BEBTO.ALTX1) -                       00980000
               REL(BP13.KB00.BEBTO)                  -                  00990000
               REUSE                                 -                  01010000
               KEYS(22 0)                            -                  01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.KB00.BEBTO.ALTX1.DATA) -                      01070000
               CYL(80 10)                              -                01080000
               RECSZ(31 354)                         -                  01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.KB00.BEBTO.ALTX1.INDEX) -                     01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.KB00.BEBTO.PATH1) -                      01160000
               PENT(BP13.KB00.BEBTO.ALTX1))                             01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.KB00.BEBTO)                  -                  01190000
               ODS(BP13.KB00.BEBTO.ALTX1)                               01200000
//*=================================================================            
//* SORT BP13KB02 BY REGN                                                       
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB02.ROUTE.HIST,DISP=SHR                                 
//SORTOUT  DD DSN=&&BP13FB02,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=600),                                            
//         SPACE=(CYL,(250,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(12,25,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MATCH FB02 WITH F800                                                        
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13C39N,COND=(0,NE)                                        
//BP13FB02 DD DSN=&&BP13FB02,DISP=(OLD,PASS)                                    
//BP13INP  DD DSN=&&F800SORT,DISP=(OLD,PASS)                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13FB02A DD DSN=BP13.FB02.KEEP,DISP=(,CATLG),                                 
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=600),                                            
//         SPACE=(CYL,(180,80),RLSE)                                            
//P13FB02B DD DSN=BP13.FB02.DELETE,DISP=(,CATLG),                               
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=600),                                            
//         SPACE=(CYL,(180,80),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT IN KE-FLD ORDER                                                        
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB02.KEEP,DISP=SHR                                       
//SORTOUT  DD DSN=&&FB02KEEP,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=600),                                            
//         SPACE=(CYL,(250,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(12,25,A),FORMAT=CH                                               
  SUM FIELDS=NONE                                                               
  OMIT COND=(12,8,CH,EQ,C'        ')                                            
//*--------------------------------------------------------------------         
//* DELETE/DEFINE BP13KB02                                                      
//*--------------------------------------------------------------------         
//STEP14    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=&&FB02KEEP,DISP=(OLD,PASS)                                    
//SYSIN     DD  *                                                               
          DEL (BP13.KB02.ROUTE.HIST) CLUSTER PURGE                              
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.KB02.ROUTE.HIST)            -                  00810000
              CYL(100 50)                               -               00830000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.KB02.ROUTE.HIST.DATA)       -                  00870000
              KEYS(25 11)                            -                  00880000
              RECSZ(600 600)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.KB02.ROUTE.HIST.INDEX)      -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.KB02.ROUTE.HIST)                                 00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.KB02.ROUTE.HIST.ALTX1) -                  00980000
               REL(BP13.KB02.ROUTE.HIST)             -                  00990000
               REUSE                                 -                  01010000
               KEYS(36 0)                            -                  01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.KB02.ROUTE.HIST.ALTX1.DATA) -                 01070000
               CYL(80 20)                             -                 01080000
               RECSZ(31 354)                         -                  01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.KB02.ROUTE.HIST.ALTX1.INDEX) -                01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.KB02.ROUTE.HIST.PATH1) -                 01160000
               PENT(BP13.KB02.ROUTE.HIST.ALTX1))                        01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.KB02.ROUTE.HIST)             -                  01190000
               ODS(BP13.KB02.ROUTE.HIST.ALTX1)                          01200000
//*-====================================================================        
//* SORT KB05, BY REGN                                                          
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB05.JOURNAL,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FB05,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=400),                                            
//         SPACE=(CYL,(200,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,26,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* MATCH FB05 WITH F800                                                        
//*---------------------------------------------------------------------        
//STEP16   EXEC PGM=BP13C39O,COND=(0,NE)                                        
//BP13FB05 DD DSN=&&BP13FB05,DISP=(OLD,PASS)                                    
//BP13INP  DD DSN=&&F800SORT,DISP=(OLD,PASS)                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13FB05A DD DSN=BP13.FB05.KEEP,DISP=(,CATLG),                                 
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=400),                                            
//         SPACE=(CYL,(250,10),RLSE)                                            
//P13FB05B DD DSN=BP13.FB05.DELETE,DISP=(,CATLG),                               
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=400),                                            
//         SPACE=(CYL,(150,10),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT BY KEY-FLD ORDER                                                       
//*---------------------------------------------------------------------        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB05.KEEP,DISP=SHR                                       
//SORTOUT  DD DSN=&&FB05KEEP,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=400),                                            
//         SPACE=(CYL,(200,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,26,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* DELETE/DEFINE BP13KB05                                                      
//*---------------------------------------------------------------------        
//STEP18    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&FB05KEEP,DISP=(OLD,PASS)                                   
//SYSIN     DD  *                                                               
            DEL 'BP13.KB05.JOURNAL' CL PURGE                            00810000
            DEF CLUSTER                                     -           00800000
                (NAME(BP13.KB05.JOURNAL)                    -           00810000
                 CYL(80 20)                                   -         00830000
                 STORCLAS(PRODRLS)                          -                   
                 LOG(NONE)                                  -                   
                 UNIQUE                                     -           00840000
                 SHR(2 3))                                  -           00850000
                DATA                                        -           00860000
                (NAME(BP13.KB05.JOURNAL.DATA)               -           00870000
                 KEYS(26 0)                                 -           00880000
                 RECSZ(400 400)                             -           00890000
                 CISZ(4096)                                 -           00900000
                 FSPC(10 10))                               -           00910000
                INDEX                                       -           00920000
                (NAME(BP13.KB05.JOURNAL.INDEX)              -           00930000
                 CISZ(4096))                                            00940000
            IF MAXCC = 0  THEN                              -           00950000
               REPRO IFILE(INPUT1)                          -           00960000
               ODS(BP13.KB05.JOURNAL)                                   00720000
//*=================================================================            
//* SORT KB10, BY REGN                                                          
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB10.CHKLIST1,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FB10,DISP=(,PASS),                                      
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* MATCH FB10 WITH F800                                                        
//*---------------------------------------------------------------------        
//STEP20   EXEC PGM=BP13C39P,COND=(0,NE)                                        
//BP13FB10 DD DSN=&&BP13FB10,DISP=(OLD,PASS)                                    
//BP13INP  DD DSN=&&F800SORT,DISP=(OLD,PASS)                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13FB10A DD DSN=BP13.FB10.KEEP,DISP=(,CATLG),                                 
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=2000),                                           
//         SPACE=(CYL,(180,50),RLSE)                                            
//P13FB10B DD DSN=BP13.FB10.DELETE,DISP=(,CATLG),                               
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=2000),                                           
//         SPACE=(CYL,(180,50),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT IN KEY-FLD ORDER                                                       
//*---------------------------------------------------------------------        
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB10.KEEP,DISP=SHR                                       
//SORTOUT  DD DSN=&&FB10KEEP,DISP=(,PASS),                                      
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                                  
//        SPACE=(CYL,(250,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,25,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
  OMIT COND=(1,8,CH,EQ,C'        ')                                             
//*---------------------------------------------------------------------        
//* DELETE/DEFINE BP13KB10                                                      
//*---------------------------------------------------------------------        
//STEP22    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&FB10KEEP,DISP=(OLD,PASS)                                   
//SYSIN     DD  *                                                               
            DEL 'BP13.KB10.CHKLIST1' CLUSTER PURGE                              
            DEF CLUSTER                                     -           00800000
                (NAME(BP13.KB10.CHKLIST1)                   -           00810000
                 CYL(700 50)                                   -        00830000
                 STORCLAS(PRODRLS)                          -                   
                 LOG(NONE)                                  -                   
                 UNIQUE                                     -           00840000
                 SHR(2 3))                                  -           00850000
                DATA                                        -           00860000
                (NAME(BP13.KB10.CHKLIST1.DATA)              -           00870000
                 KEYS(25 0)                                 -           00880000
                 RECSZ(2000 2000)                           -           00890000
                 CISZ(4096)                                 -           00900000
                 FSPC(10 10))                               -           00910000
                INDEX                                       -           00920000
                (NAME(BP13.KB10.CHKLIST1.INDEX)             -           00930000
                 CISZ(4096))                                            00940000
            IF MAXCC = 0  THEN                              -           00950000
               REPRO IFILE(INPUT1)                          -           00960000
               ODS(BP13.KB10.CHKLIST1)                                  00720000
