//BP13MBK2 JOB (BP13P),'BP13MBK2',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//             NOTIFY=CSD0071                                           00000020
//*---------------------------------------------------------------------00000030
//* BP130487 SSS 19980507 - CHG UNIT=3480 TO UNIT=CART                  00000040
//* BP130418 SIA 19980922 - Y2K COMPLIANCE CHANGES                      00000040
//* BP130728 LLW 19990925 - TO BACKUP BP13E350 & BP13E640                       
//* BP130728 LLW 19991002 - TO REPRO BLANK RECORD TO BP13E350 & BP13E640        
//*                         DURING RE-DEFINE OF DATASETS.                       
//*                       - RENAME 'BP13.E605.CA.ACTION.LOG.DATA'               
//*                         TO     'BP13.E640.CA.ACTION.LOG.DATA'.              
//* BP130728 LLW 19991101 - TO CHANGE 'BP13T.BLANK.CHAR150' TO                  
//*                         'BP13.BLANK.CHAR150'.                               
//* BP130777 CLT 20000105 - TO REMOVE UPDATING STEPS                            
//* BP132025 CT2 20020304 - TO BACKUP BF02.F070.PROC.BP13.MONTH                 
//* BP132161 SSS 20021026 - BKUP BP13K834                                       
//* BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//* BP133858 LSB 230710 - DELETE SPIN                                           
//* BP134513 CK19 120418 - TO BACKUP KQ10, KP00 AND KP02                        
//* BP135039 LSB1 131126 - TO BACKUP FH10                                       
//* BP135836 LSB1 150611 - TO BACKUP F936                                       
//*---------------------------------------------------------------------00000030
//*  BACKUP SOC MASTER - 12 GDG                                         00000040
//*---------------------------------------------------------------------00000050
//STEP1    EXEC  PGM=IDCAMS,COND=(0,NE)                                 00000060
//SYSPRINT DD  SYSOUT=*                                                 00000070
//INPUT1   DD  DSN=BP13.K800.APPLN,                                     00000080
//             DISP=SHR,                                                00000090
//             AMP=('BUFND=13')                                         00000100
//OUTPUT1  DD  DSN=BP13.F800.APPLN.MONTH(+1),                           00000110
//             DISP=(,PASS),                                            00000120
//             UNIT=CART,                                               00000130
//             LABEL=(1,SL),                                            00000140
//             DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)         00000150
//INPUT2   DD  DSN=BP13.K820.OCCUP,                                     00000160
//             DISP=SHR,                                                00000170
//             AMP=('BUFND=13')                                         00000180
//OUTPUT2  DD  DSN=BP13.F820.OCCUP.MONTH(+1),                           00000190
//             DISP=(,PASS),                                            00000200
//             UNIT=CART,                                               00000210
//             LABEL=(2,SL),                                            00000220
//             VOL=REF=*.OUTPUT1,                                       00000230
//             DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)          00000240
//INPUT3   DD  DSN=BP13.K840.APPLHIST,                                  00000250
//             DISP=SHR,                                                00000260
//             AMP=('BUFND=13')                                         00000270
//OUTPUT3  DD  DSN=BP13.F840.APPLHIST.MONTH(+1),                        00000280
//             DISP=(,PASS),                                            00000290
//             UNIT=CART,                                               00000300
//             LABEL=(3,SL),                                            00000310
//             VOL=REF=*.OUTPUT2,                                       00000320
//             DCB=(BP13.GDG,BLKSIZE=23000,LRECL=500,RECFM=FB)          00000330
//*                                                                     00000340
//SYSIN    DD  *                                                        00000350
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
     REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                      
     REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                      
//*---------------------------------------------------------------------00000360
//*  CATALOG GDG                                                        00000370
//*---------------------------------------------------------------------00000380
//STEP2  EXEC    PGM=IEFBR14,COND=(0,NE)                                00000390
//INPUT1   DD  DSN=BP13.F800.APPLN.MONTH(+1),                           00000400
//             DISP=(OLD,CATLG),                                        00000410
//             UNIT=(,,DEFER)                                           00000420
//INPUT2   DD  DSN=BP13.F820.OCCUP.MONTH(+1),                           00000430
//             DISP=(OLD,CATLG),                                        00000440
//             UNIT=(,,DEFER)                                           00000450
//INPUT3   DD  DSN=BP13.F840.APPLHIST.MONTH(+1),                        00000460
//             DISP=(OLD,CATLG),                                        00000470
//             UNIT=(,,DEFER)                                           00000480
//*---------------------------------------------------------------------00000490
//*  BACKUP SOC BACKUP IMAGE FILE                                       00000500
//*---------------------------------------------------------------------00000510
//STEP3  EXEC    PGM=IDCAMS,COND=(0,NE)                                 00000520
//SYSPRINT DD  SYSOUT=*                                                 00000530
//INPUT4   DD  DSN=BP13.F848.BKIMAGE,                                   00000540
//             DISP=SHR                                                 00000550
//OUTPUT4  DD  DSN=BP13.F848.BKIMAGE.MONTH(+1),                         00000560
//             DISP=(,PASS),                                            00000570
//             UNIT=CART,                                               00000580
//             LABEL=(,SL),                                             00000590
//             DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)         00000600
//*                                                                     00000610
//SYSIN    DD  *                                                        00000620
     REPRO INFILE(INPUT4) OUTFILE(OUTPUT4)                                      
//*---------------------------------------------------------------------00000630
//*  CATALOG GDG                                                        00000640
//*---------------------------------------------------------------------00000650
//STEP4  EXEC    PGM=IEFBR14,COND=(0,NE)                                00000660
//INPUT4   DD  DSN=BP13.F848.BKIMAGE.MONTH(+1),                         00000670
//             DISP=(OLD,CATLG),                                        00000680
//             UNIT=(,,DEFER)                                           00000690
//*---------------------------------------------------------------------00000700
//*  DELETE IMAGE FILE RECORDS                                          00000710
//*---------------------------------------------------------------------00000720
//STEP5  EXEC    PGM=IDCAMS,COND=(0,NE)                                 00000730
//SYSPRINT DD  SYSOUT=*                                                 00000740
//INPUT4   DD  DSN=BP13.BLANK.CHAR2000,                                 00000750
//             DISP=SHR                                                 00000760
//OUTPUT4  DD  DSN=BP13.F848.BKIMAGE,                                   00000770
//             DISP=(OLD,PASS)                                          00000780
//*                                                                     00000790
//SYSIN    DD  *                                                        00000800
     REPRO INFILE(INPUT4) OUTFILE(OUTPUT4)                                      
//*---------------------------------------------------------------------00000810
//*  DELETE BP13.F800,APPLN.NEW                                         00000820
//*---------------------------------------------------------------------00000830
//STEP6  EXEC    PGM=IDCAMS,COND=(0,NE)                                 00000840
//SYSPRINT DD  SYSOUT=*                                                 00000850
//INPUT6   DD  DSN=BP13.BLANK.CHAR2000,                                 00000860
//             DISP=SHR                                                 00000870
//OUTPUT6  DD  DSN=BP13.F800.APPLN.NEW,                                 00000880
//             DISP=SHR                                                 00000890
//*                                                                     00000900
//SYSIN    DD  *                                                        00000910
     REPRO INFILE(INPUT6) OUTFILE(OUTPUT6)                                      
//*---------------------------------------------------------------------00000920
//*  BACKUP (1) OSCARS ADDRESS UPDATE LOG FILE                          00000930
//*         (2) SECURITY LOG FILES                                      00000940
//*---------------------------------------------------------------------00000950
//STEP7  EXEC    PGM=IDCAMS,COND=(0,NE)                                 00000960
//SYSPRINT DD  SYSOUT=*                                                 00000970
//INPUT7   DD  DSN=BP13.F868.USER.LOG.ACCUM,                            00000980
//             DISP=SHR                                                 00000990
//OUTPUT7  DD  DSN=BP13.F868.USER.LOG.MONTH(+1),                        00001000
//             DISP=(,PASS),                                            00001010
//             UNIT=CART,                                               00001020
//             LABEL=(,SL),                                             00001030
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=200,RECFM=FB)          00001040
//INPUT8   DD  DSN=BP13.F878.PANEL.LOG.ACCUM,                           00001050
//             DISP=SHR                                                 00001060
//OUTPUT8  DD  DSN=BP13.F878.PANEL.LOG.MONTH(+1),                       00001070
//             DISP=(,PASS),                                            00001080
//             UNIT=CART,                                               00001090
//             LABEL=(2,SL),                                            00001100
//             VOL=REF=*.OUTPUT7,                                       00001110
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)          00001120
//INPUT9   DD  DSN=BP13.F838.OSCARS.LOG.ACCUM,                          00001130
//             DISP=SHR                                                 00001140
//OUTPUT9  DD  DSN=BP13.F838.OSCARS.LOG.MONTH(+1),                      00001150
//             DISP=(,PASS),                                            00001160
//             UNIT=CART,                                               00001170
//             LABEL=(3,SL),                                            00001180
//             VOL=REF=*.OUTPUT7,                                       00001190
//             DCB=(BP13.GDG,BLKSIZE=23200,LRECL=400,RECFM=FB)          00001200
//INPUT10  DD  DSN=BP13.K834.CHGADDR.LOG,                               00000540
//             DISP=SHR                                                 00000550
//OUTPUT10 DD  DSN=BP13.K834.CHGADDR.LOG.MONTH(+1),                     00000560
//             DISP=(,PASS),                                            00000570
//             UNIT=CART,                                               00000580
//             LABEL=(4,SL),                                            00000590
//             VOL=REF=*.OUTPUT7,                                       00001190
//             DCB=(BP13.GDG,BLKSIZE=27750,LRECL=250,RECFM=FB)          00000600
//SYSIN    DD  *                                                        00001220
     REPRO INFILE(INPUT7) OUTFILE(OUTPUT7)                                      
     REPRO INFILE(INPUT8) OUTFILE(OUTPUT8)                                      
     REPRO INFILE(INPUT9) OUTFILE(OUTPUT9)                                      
     REPRO INFILE(INPUT10) OUTFILE(OUTPUT10)                                    
//*---------------------------------------------------------------------00001230
//*  CATALOG GDG                                                        00001240
//*---------------------------------------------------------------------00001250
//STEP8  EXEC    PGM=IEFBR14,COND=(0,NE)                                00001260
//INPUT10  DD  DSN=BP13.F868.USER.LOG.MONTH(+1),                        00001270
//             DISP=(OLD,CATLG),                                        00001280
//             UNIT=(,,DEFER)                                           00001290
//INPUT11  DD  DSN=BP13.F878.PANEL.LOG.MONTH(+1),                       00001300
//             DISP=(OLD,CATLG),                                        00001310
//             UNIT=(,,DEFER)                                           00001320
//INPUT12  DD  DSN=BP13.F838.OSCARS.LOG.MONTH(+1),                      00001330
//             DISP=(OLD,CATLG),                                        00001340
//             UNIT=(,,DEFER)                                           00001350
//INPUT13  DD  DSN=BP13.K834.CHGADDR.LOG.MONTH(+1),                     00001330
//             DISP=(OLD,CATLG),                                        00001340
//             UNIT=(,,DEFER)                                           00001350
//*---------------------------------------------------------------------00001360
//*  TO EMPTY LOG FILE                                                  00001370
//*---------------------------------------------------------------------00001380
//STEP9  EXEC    PGM=IDCAMS,COND=(0,NE)                                 00001390
//SYSPRINT DD  SYSOUT=*                                                 00001400
//INPUT13  DD  DSN=BP13.BLANK.CHAR200,                                  00001410
//             DISP=SHR                                                 00001420
//OUTPUT13 DD  DSN=BP13.F868.USER.LOG.ACCUM,                            00001430
//             DISP=OLD                                                 00001440
//INPUT14  DD  DSN=BP13.BLANK.CHAR100,                                  00001450
//             DISP=SHR                                                 00001460
//OUTPUT14 DD  DSN=BP13.F878.PANEL.LOG.ACCUM,                           00001470
//             DISP=OLD                                                 00001480
//INPUT15  DD  DSN=BP13.BLANK.CHAR400,                                  00001490
//             DISP=SHR                                                 00001500
//OUTPUT15 DD  DSN=BP13.F838.OSCARS.LOG.ACCUM,                          00001510
//             DISP=OLD                                                 00001520
//*                                                                     00001530
//SYSIN    DD  *                                                        00001540
     REPRO INFILE(INPUT13) OUTFILE(OUTPUT13)                                    
     REPRO INFILE(INPUT14) OUTFILE(OUTPUT14)                                    
     REPRO INFILE(INPUT15) OUTFILE(OUTPUT15)                                    
//*---------------------------------------------------------------------00001360
//*  DELETE & REDEFINE BP13K834                                         00001370
//*---------------------------------------------------------------------00001360
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.BLANK.CHAR250,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K834.CHGADDR.LOG) CL PURGE                                   
         DEF CL (NAME(BP13.K834.CHGADDR.LOG)     -                              
                 CYL(5 3)                      -                                
                 UNIQUE                          -                              
                 SPEED                           -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K834.CHGADDR.LOG.DATA)   -                          
                 KEYS(16 227)                    -                              
                 RECSZ(250 250)                  -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096))  -                                                 
                 INDEX                           -                              
                 (NAME(BP13.K834.CHGADDR.LOG.INDEX))                            
     IF LASTCC = 0 THEN                            -                            
       REPRO IFILE(INPUT)                          -                            
             ODS(BP13.K834.CHGADDR.LOG)                                         
//*---------------------------------------------------------------------00000030
//*  BACKUP PENDING DOC MODULE                                          00000040
//*---------------------------------------------------------------------00000050
//STEP11   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00000060
//SYSPRINT DD  SYSOUT=*                                                 00000070
//INPUT1   DD  DSN=BP13.KP02.DOCHIST,                                   00000080
//             DISP=SHR,                                                00000090
//             AMP=('BUFND=13')                                         00000100
//OUTPUT1  DD  DSN=BP13.FP02.DOCHIST.MONTH(+1),                         00000110
//             DISP=(,CATLG),                                           00000120
//             UNIT=CART,                                               00000130
//             LABEL=(1,SL),                                            00000140
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)              00000150
//INPUT2   DD  DSN=BP13.KQ10.DOC.TBL,                                   00000160
//             DISP=SHR,                                                00000170
//             AMP=('BUFND=13')                                         00000180
//OUTPUT2  DD  DSN=BP13.FQ10.DOC.TBL.MONTH(+1),                         00000190
//             DISP=(,CATLG),                                           00000200
//             UNIT=CART,                                               00000210
//             LABEL=(2,SL),                                            00000220
//             VOL=REF=*.OUTPUT1,                                       00000230
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=400,RECFM=FB)              00000240
//INPUT3   DD  DSN=BP13.KP00.DOC,                                       00000250
//             DISP=SHR,                                                00000260
//             AMP=('BUFND=13')                                         00000270
//OUTPUT3  DD  DSN=BP13.FP00.DOC.MONTH(+1),                             00000280
//             DISP=(,CATLG),                                           00000290
//             UNIT=CART,                                               00000300
//             LABEL=(3,SL),                                            00000310
//             VOL=REF=*.OUTPUT2,                                       00000320
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=3800,RECFM=FB)             00000330
//*                                                                     00000340
//SYSIN    DD  *                                                        00000350
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
     REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                      
     REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                      
//*---------------------------------------------------------------------00000030
//*  BACKUP BP13FH10 BEFORE DELETION                                            
//*---------------------------------------------------------------------00000050
//STEP12   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00000060
//SYSPRINT DD  SYSOUT=*                                                 00000070
//INPUT1   DD  DSN=BP13.FH10.NOTBKCNT.DELETE,DISP=SHR                   00000080
//OUTPUT1  DD  DSN=BP13.FH10.NOTBKCNT.DELBKUP(+1),                      00000110
//             DISP=(,CATLG),                                           00000120
//             DCB=(LRECL=2000,RECFM=FB,BLKSIZE=0),                             
//             SPACE=(CYL,(10,10),RLSE)                                         
//*                                                                     00000340
//SYSIN    DD  *                                                        00000350
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
//*---------------------------------------------------------------------00001360
//*  TO EMPTY BP13.FH10.NOTBKCNT.DELETE                                 00001370
//*---------------------------------------------------------------------00001380
//STEP13 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00001390
//SYSPRINT DD  SYSOUT=*                                                 00001400
//INPUT1   DD  DSN=BP13.BLANK.CHAR2000,DISP=SHR                         00001410
//OUTPUT1  DD  DSN=BP13.FH10.NOTBKCNT.DELETE,DISP=OLD                   00001430
//*                                                                     00001530
//SYSIN    DD  *                                                        00001540
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
//*---------------------------------------------------------------------00000030
//*  BACKUP BP13F963 BEFORE DELETION                                            
//*---------------------------------------------------------------------00000050
//STEP14   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00000060
//SYSPRINT DD  SYSOUT=*                                                 00000070
//INPUT1   DD  DSN=BP13.F936.DEBARLOG.ACCUM,DISP=SHR                    00000080
//OUTPUT1  DD  DSN=BP13.F936.DEBARLOG.MONTH(+1),                        00000110
//             DISP=(,CATLG),                                           00000120
//             DCB=(LRECL=2000,RECFM=FB,BLKSIZE=0),                             
//             SPACE=(CYL,(50,10),RLSE)                                         
//*                                                                     00000340
//SYSIN    DD  *                                                        00000350
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
//*---------------------------------------------------------------------00001360
//*  TO EMPTY BP13.F936.DEBARLOG.ACCUM                                  00001370
//*---------------------------------------------------------------------00001380
//STEP15 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00001390
//SYSPRINT DD  SYSOUT=*                                                 00001400
//INPUT1   DD  DSN=BP13.BLANK.CHAR2000,DISP=SHR                         00001410
//OUTPUT1  DD  DSN=BP13.F936.DEBARLOG.ACCUM,DISP=OLD                    00001430
//*                                                                     00001530
//SYSIN    DD  *                                                        00001540
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
