//BP13AEC1  JOB (BP13P),'BP13AEC1',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//*        TO DUPLICATE GRO APPLICATIONS FOR EC BALLOTING                       
//*=================================================================            
//* CHG REF  BY   ON     DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP134270 IL5 070711  NEW                                                    
//* BP135043 IL5 260812  REPLACE FILES                                          
//*                      BP13.K740.MATUREBA WITH BP13.K740.MATUREBA.EC          
//*                      BP13.KB78.DBSREQ.DUP WITH BP13.KB78.DBSREQ             
//*                      ADD FILE VERICATION STEP                               
//* BP135872 SMR 310715  CHANGE CLASS 2 TO CLASS J                              
//* BP138246 AM2 060320  ADD SYSIN FOR BP13C525                                 
//* BP139931 AM2 290224  CHANGE CLASS J TO CLASS 2                              
//*=================================================================            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KB95.ISSUENO,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K740.MATUREBA.EC,DISP=OLD                                
//INPUT3   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K830.ADDR,DISP=OLD                                       
//INPUT5   DD DSN=BP13.KB78.DBSREQ,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//*--------------------------------------------------------------------         
//*- SORT OUT ALL THE GRO CASES                                                 
//*--------------------------------------------------------------------         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SORTOUT  DD DSN=&&F740,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(2,3),RLSE)                                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(163,2,CH,NE,C'  ')                                             
//*--------------------------------------------------------------------         
//*   DUPLICATE GRO CASES TO HAVE ANOTHER CHANCE IN PRIO/PA SCHEME              
//*--------------------------------------------------------------------         
//STEP02 EXEC PGM=BP13C536,COND=(0,NE)                                          
//BP13F740 DD DSN=&&F740,DISP=(SHR,PASS)                                        
//BP13K740 DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//BP13KB95 DD DSN=BP13.KB95.ISSUENO,DISP=SHR                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//BP13L536 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT BY NT/FT/RANDOM-NO                                                     
//*------------------------------------------------------------------           
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SORTOUT  DD DSN=&&F740NTFT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION REPORT BEFORE BALLOTING                                   
//*------------------------------------------------------------------           
//STEP04   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740NTFT,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L525B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L525C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*                                                                             
