//BP13M050 JOB (BP13P),'BP13M050',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================*           
//* OBJECTIVE : THIS JOB PROCESSES THE SENDING OF S&P FILE FROM     *           
//*             HDB TO CPF THRU IDNET.                              *           
//*-----------------------------------------------------------------*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* ========  ==========  ==== ===========                          *           
//* BP132249  13/01/2003  CLT1 BANK ORIGINATION JOB                 *           
//* BP138339  03/09/2020  LSB1 EXPAND TEMP SPACE                    *           
//* BP139355  06/10/2022  LJL1 EXPAND TEMP SPACE                    *           
//* BP139423  02/03/2023  MRR5 EXPAND SPACE FOR BACKUP IN STEP02    *           
//*=================================================================*           
//*-------------------------------------------------------------------*         
//*  BACKUP S&P FILE BEFORE RUN                                       *         
//*-------------------------------------------------------------------*         
//STEP01 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT     DD DSN=BP13.K440.CPFSNP,DISP=SHR                                    
//OUTPUT    DD DSN=BP13.F440.CPFSNP.MBKUP(+1),DISP=(NEW,CATLG),                 
//          SPACE=(CYL,(500,100)),                                              
//          DCB=(BP13.GDG,BLKSIZE=0,LRECL=1000,RECFM=FB)                        
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13F105 TO MTHLY BKUP                                     *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F105.CPFSNP.SENT.MTH,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.F105.CPFSNP.SENT.MBKUP(+1),DISP=(NEW,CATLG),             
//         SPACE=(CYL,(150,15)),                                                
//         DCB=(BP13.GDG,BLKSIZE=0,LRECL=450,RECFM=FB)                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* CLEAR MTH ACCUM FILE FOR BP13F105                                 *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.F105.CPFSNP.SENT.MTH,DISP=SHR                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP BP13F106 TO MTHLY BKUP                                     *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F106.CPFSNP.RECV.MTH,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.F106.CPFSNP.RECV.MBKUP(+1),DISP=(NEW,CATLG),             
//         SPACE=(CYL,(80,30)),                                                 
//         DCB=(BP13.GDG,BLKSIZE=0,LRECL=250,RECFM=FB)                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* CLEAR MTH ACCUM FILE FOR BP13F106                                 *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.F106.CPFSNP.RECV.MTH,DISP=SHR                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//*   END OF BP13M050                                                 *         
//*-------------------------------------------------------------------*         
