//BP13A601 JOB (BP13P),'BP13A601',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//*THIS JCL WAS RUN AFTER BP13A500 FOR BE                                       
//*                 AFTER BP13A537 FOR BTO                                      
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP133142 IL5 050907 - NEW.  SIMILAR TO A537 EXCEPT FOR STEP08               
//* BP133248 IL5 100508 - ADD P13LB18 OUTPUT FOR BP13CB18                       
//* BP133511 IL5 300109 - ADD NEW PROGRAM BP13CH14 TO DETERMINE                 
//*                       BALLOT HOUSEHOLD                                      
//* BP133582 IL5 220409 - TO REMOVE UPDATING TO BP13K730 FOR BP13CH14           
//* BP133610 ESA1030609 - TO REPLACE BP13K767 WITH BP13K816                     
//* BP133882 IL5 090210 - ADD NEW PROGRAM BP13CB86 TO DETERMINE                 
//*                       CHACNCES FOR PAIRED UNITS                             
//* BP134036 IL5 121010 - UPDATE INPUT DD FOR BP13CH14                          
//* BP133847 ZDD 180311 - INCLUDE BP13K825 ON BP13CH14                          
//* BP134782 SMR 080213 - INCLUDE NEW PROGRAM BP13S570                          
//* BP134914 SMR 140613 - INCLUDE PREGNANT IN ELIGIBLE PPS                      
//* BP135028 SMR 070813 - INCLUDE BP13C525                                      
//* BP135254 SMR 210414 - TO REPLACE BP13K816 WITH BP13K813                     
//*                       REMOVE BP13CB86                                       
//* BP135392 IL5 040714 - CATER FOR SBF FLAT TYPE 3P BY                         
//*                       REMOVING OBSOLETE STEPS 4 AND 7                       
//* BP135708 SMR 310315 - CHANGE CLASS=2 TO CLASS=J                             
//* BP136107 SMR 180216 - ACCEPT PARAMETER FROM JCL IN BP13C525                 
//* BP137052 SMR 301017 - NEW PRE-BALLOT REPORTS                                
//* BP137052 SMR 150118 - REMOVE BP13K757 IN BP13CB57                           
//* BP138164 AM2 160120 - NEW OUTPUT FILE P13FH14A FOR BP13CH14                 
//* BP138301 AM2 040620 - HARDCOPY REPORTS CONVERSION                           
//* BP138495 AM2 021220 - ADD OMIT COND IN STEP06                               
//* BP139670 AM2 250823 - CATER FOR FT(PMC)                                     
//**************************************************************                
//*-------------------------------------------------------------------*         
//* STEP1  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//D538S001 EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.F500.NT.BACKUP.SP')                                             
     DEL ('BP13.REPORT.BP13A601.P13L525')                                       
     DEL ('BP13.REPORT.BP13A601.P13L569')                                       
     DEL ('BP13.REPORT.BP13A601.BP13LB58')                                      
     DEL ('BP13.FH14.BP13A601')                                                 
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT BTO MATURE REQUESTS TO SEQUENTIAL FILE                                 
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),DATACLAS=MULTIVOL,            
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(187,3,A,211,2,A,123,8,A),FORMAT=CH                            
//*-------------------------------------------------------------------*         
//* UPDATE BALLOT HOUSEHOLD TO 'G' IF 'H' APPLICATIONS HAVE 2 NON-              
//* SELECTION RECORDS                                                           
//* INPUT - BP13F730 BP13KH10 BP13K816                                          
//* I-O   - BP13K730                                                            
//* OUTPUT - P13F730A P13LH14A                                                  
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=BP13CH14,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//BP13KH12 DD DSN=BP13.KH12.NOTBKCNT.HISTORY,DISP=SHR,                          
//         AMP=('BUFND=23')                                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//BP13K826 DD DSN=BP13.K825.REQOCCP.PATH1,DISP=SHR,                             
//         AMP=('BUFND=23')                                                     
//BP13K730 DD DUMMY                                                             
//P13F730A DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),DATACLAS=MULTIVOL,            
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13LH14A DD SYSOUT=8,DEST=IOM8                                                
//P13FH14A DD DSN=BP13.FH14.BP13A601,DISP=(NEW,CATLG),                          
//            SPACE=(CYL,(80,10),RLSE),DATACLAS=MULTIVOL,                       
//            DCB=(BLKSIZE=0,LRECL=150,RECFM=FB)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS WITH PPS-ELIG-TAG = 'P' (PENDING CASES)                
//*-----------------------------------------------------------------            
//STEP02A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F74AL570,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(10,5),RLSE),                              
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,469,1,CH,EQ,C'P')                      
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS WITH PPS-ELIG-TAG = 'Y' AND                            
//* BALLOT-HOUSEHOLD = 'G' (SECOND TIMER CASES)                                 
//*-----------------------------------------------------------------            
//STEP02B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F74BL570,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(10,5),RLSE),                              
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,(469,1,CH,EQ,C'Y',OR,                  
                  469,1,CH,EQ,C'E',OR,469,1,CH,EQ,C'F'),AND,                    
                  461,1,CH,EQ,C'G')                                             
//*-----------------------------------------------------------------            
//* PRINT PPS EXCEPTION REPORTS                                                 
//*-----------------------------------------------------------------            
//STEP02C  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F74A DD DSN=&&F74AL570,DISP=(OLD,DELETE)                                  
//BP13F74B DD DSN=&&F74BL570,DISP=(OLD,DELETE)                                  
//P13L570A DD SYSOUT=8,DEST=IOM8                                                
//P13L570B DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S570),DISP=SHR                             
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS WITH PPS-ELIG-TAG = 'P' (PENDING CASES)                
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F500L525,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(10,5),RLSE),                              
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                             
    OMIT COND=(260,1,CH,EQ,C'C')                                                
//*------------------------------------------------------------------           
//* PRINT APPLICATION FORM FOR COUNTER AND MAIL CASES                           
//* 3 DIFFERENT LETTERS DEPENDING ON MCPS OPTION                                
//*------------------------------------------------------------------           
//STEP03A  EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F500L525,DISP=(OLD,PASS)                                    
//P13L525A DD DSN=BP13.REPORT.BP13A601.P13L525,DISP=(NEW,CATLG),                
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=27930),                          
//            SPACE=(CYL,(10,5),RLSE)                                           
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
AL6                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR PPS & NON-PPS APPLICANTS                                   
//*-----------------------------------------------------------------            
//STEP03B  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F500L525,DISP=(OLD,DELETE)                                  
//BP13L569 DD DSN=BP13.REPORT.BP13A601.P13L569,DISP=(NEW,CATLG),                
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=27930),                          
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*-----------------------------------------------------------------            
//* SEPARATE PRINTING FOR APPL MADE BEFORE 200710                               
//*-----------------------------------------------------------------            
//*STEP04   EXEC SORT,COND=(0,NE)                                               
//*SYSOUT   DD SYSOUT=*                                                         
//*SORTIN   DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                 
//*SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                  
//*            DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                      
//*            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE)                               
//*SYSIN    DD *                                                                
//*  SORT FIELDS=COPY                                                           
//*  INCLUDE COND=(212,1,CH,NE,C'P')                                            
//*-------------------------------------------------------------------* 00040000
//* DUPLICATE RECORDS FOR ADDITIONAL RANDOM NUMBERS ASSIGNMENT          00050000
//* FT MCPS - TOTAL 4 RECORDS                                                   
//* UG MCPS - TOTAL 2 RECORDS                                                   
//* FT PA   - TOTAL 2 RECORDS                                                   
//* UG PA   - TOTAL 1 RECORD                                                    
//*                                                                             
//* FOR APPLICANTS WITH > 4 UNSUCC ATTEMPTS                                     
//* + 4 ATTEMPTS - 1 ADDITIONAL RECORD                                          
//* + 5 ATTEMPTS - 2 ADDITIONAL RECORDS ETC.                                    
//*-------------------------------------------------------------------* 00060000
//STEP05   EXEC PGM=BP13CB18,COND=(0,NE)                                00070002
//BP13F730 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                          00080001
//BP13K593 DD DSN=BP13.K593.UNSUCCNT,DISP=SHR,                          00100001
//         AMP=('BUFND=23')                                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13F740 DD DSN=BP13.F500.NT,DISP=OLD                                 00090001
//BP13LB18 DD SYSOUT=8,DEST=IOM8                                        00110000
//P13LB18B DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                  00120000
//SYSDBOUT DD SYSOUT=*                                                  00130000
//SYSOUT   DD SYSOUT=*                                                  00140000
/*                                                                      00150000
//*-----------------------------------------------------------------            
//* SEPARATE PRINTING FOR APPL MADE BEFORE 200710                               
//*-----------------------------------------------------------------            
//*STEP07   EXEC SORT,COND=(0,NE)                                               
//*SYSOUT   DD SYSOUT=*                                                         
//*SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                        
//*SORTOUT1 DD DSN=BP13.F500.NT,DISP=OLD                                        
//*SORTOUT2 DD DSN=BP13.F500.NT.BACKUP.SP,DISP=(NEW,CATLG),                     
//*            DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                      
//*            SPACE=(CYL,(50,5),RLSE)                                          
//*SYSIN    DD *                                                                
//*SORT FIELDS=COPY                                                             
//*OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,2,CH,NE,C'SP')                           
//*OUTFIL FNAMES=SORTOUT2,INCLUDE=(211,2,CH,EQ,C'SP')                           
//*---------------------------------------------------------------------        
//* SORT BY DTE-BALLOT/ALLO-CAT/NT/FT - NO DUPLICATES                           
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=&&BP13F730,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(334,6,A,376,3,A,187,3,A,211,2,A),FORMAT=CH                     
    OMIT COND=(260,1,CH,EQ,C'C')                                                
    SUM FIELDS=NONE                                                             
//*---------------------------------------------------------------------        
//* SORT BY DTE-BALLOT/ALLO-CAT/NT/FT/REGNO                                     
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),DATACLAS=MULTIVOL,            
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(334,6,A,376,3,A,187,3,A,211,2,A,123,8,A),FORMAT=CH             
//*---------------------------------------------------------------------        
//* TOTAL NUMBER OF APPLICATIONS RECEIVED                                       
//* SORY BY NT/FT/REGNO                                                         
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.L54D.FNDRQST,DISP=SHR                                    
//         DD DSN=BP13.L54E.CANAPPL,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13L54D,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=133,RECFM=FB)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(33,3,A,43,2,A,11,8,A),FORMAT=CH                                
    INCLUDE COND=(11,1,CH,GE,C'3')                                              
//*---------------------------------------------------------------------        
//* NO. OF CANCELLED APPLICATIONS NOT INCLUDED IN THE BALLOT                    
//* SORY BY NT/FT/REGNO                                                         
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.L54G.CANEXCL,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13L54G,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=133,RECFM=FB)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(33,3,A,43,2,A,11,8,A),FORMAT=CH                                
    INCLUDE COND=(11,1,CH,GE,C'3')                                              
//*---------------------------------------------------------------------00040000
//* COUNTING RECORDS FOR PRE-BALLOT REPORTS                             00050000
//*---------------------------------------------------------------------00060000
//STEP10   EXEC PGM=BP13CB57,COND=(0,NE)                                00070002
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,DELETE)                          00080001
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                          00090001
//BP13L54D DD DSN=&&BP13L54D,DISP=(OLD,DELETE)                          00080001
//BP13L54G DD DSN=&&BP13L54G,DISP=(OLD,DELETE)                          00080001
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13K762 DD DSN=BP13.K762.BTO.DEMAND,DISP=SHR                         00100001
//BP13K769 DD DSN=BP13.K769.BE.DEMAND,DISP=SHR                          00100001
//BP13K766 DD DSN=BP13.K766.WIS.DEMAND,DISP=SHR                         00100001
//BP13LB57 DD DSN=&&BP13LB57,DISP=(NEW,PASS),                           00110000
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                
//SYSDBG   DD SYSOUT=*                                                  00120000
//SYSDBOUT DD SYSOUT=*                                                  00130000
//SYSOUT   DD SYSOUT=*                                                  00140000
//*---------------------------------------------------------------------        
//* GENERATE REPORTS ON PRE-BALLOT                                              
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13CB58,COND=(0,NE)                                        
//BP13LB57 DD DSN=&&BP13LB57,DISP=(OLD,DELETE)                                  
//BP13LB58 DD DSN=BP13.REPORT.BP13A601.BP13LB58,DISP=(NEW,CATLG),               
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=27930),                          
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* END BP13A601                                                                
//*---------------------------------------------------------------------        
