//BP13D90A JOB (BP13P),'BP13D90A',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*--------------------------------------------------------------------         
//*- CHG-NO   BY  ON  DESC                                                      
//*- --------------------------                                                 
//*- BP133292 LSB ADD 060308 - UPDATE BP13K580 FOR BOOKED DBSS FLAT             
//*-                           STEP14-15 IS COPY FROM BP13D200                  
//*- BP133389 IL5 UPD 061008 - ENHANCE STEPS FOR ASSIGNING OIC                  
//*- BP133425 IL5 UPD 121208 - REMOVE ASSIGNING OF OIC                          
//*- BP133427 PCL UPD 090109 - ADD PROGRAM BP13CD23                             
//*- BP133427 IL5 UPD 300609 - SWAP RUNNING SEQUENCE FOR BP13CD05 AND           
//*                            BP13C148                                         
//*- BP133647 JB8 UPD 060709 - TO ADD CP27K090 FOR BP13CA07                     
//*- BP133534 ZDD UPD 200509 - ADD PROGRAM BP13C54E                             
//*- BP133893 ZDD UPD 260410 - TO ADD BP13CF06                                  
//*- BP133936 IL5 UPD 020710 - ADD BM06 FILES IN VERIFY                         
//*- BP134025 IL5 UPD 300910 - CATER FOR EC                                     
//*- BP134229 ZDD UPD 250511 - ADD BP13CF32                                     
//*- BP134215 LSB UPD 270611 - ADD EC TO BP13KD15                               
//*- FB-2013-02685    199411 - INCREASE SORT SPACE FOR STEP 18                  
//*- BP135130 SMR UPD 131113 - INCLUDE BP13KB78 IN BP13CF32                     
//*- BP138645 KR13ADD 150421 - ADD BP13CZ3M - GET CUST_ID FROM BE01C808         
//*- BP138645 MRR5UPD 010721 - REMOVE P04K020 FROM BP13C54E STEP                
//*===================================================================*         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KA40.TRANS,DISP=OLD                                      
//INPUT2   DD DSN=BP13.K022.WISOIC,DISP=OLD                                     
//INPUT3   DD DSN=BP13.KB25.DBSELIG,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K025.CSM.DBSS,DISP=OLD                                   
//INPUT5   DD DSN=BP13.K580.ACCEPT,DISP=OLD                                     
//INPUT6   DD DSN=BP13.KD15.DBSSTP,DISP=OLD                                     
//INPUT7   DD DSN=BM06.K110.FLATINV,DISP=OLD                                    
//INPUT8   DD DSN=BM06.K100.BLOCK,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
//*---------------------------------------------------------------------        
//* BACKUP FILES                                                                
//*---------------------------------------------------------------------        
//STEP00 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.KB20.DBSBK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT1  DD  DSN=BP13.FB20.DBSBK.BACKUP(+1),                                  
//             DISP=(NEW,CATLG),                                                
//             UNIT=(DISK,20),                                                  
//             SPACE=(CYL,(150,25),RLSE),                                       
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=3300,RECFM=FB)                     
//INPUT2   DD  DSN=BP13.KA30.UNIT,                                              
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT2  DD  DSN=BP13.FA30.UNIT.BACKUP(+1),                                   
//             DISP=(NEW,CATLG),                                                
//             UNIT=(DISK,20),                                                  
//             SPACE=(TRK,(20,10),RLSE),                                        
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                      
//INPUT3   DD  DSN=BP13.KA20.BLOCK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT3  DD  DSN=BP13.FA20.BLOCK.BACKUP(+1),                                  
//             DISP=(NEW,CATLG),                                                
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                      
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT ACCEPTANCE CASES                                                   
//*-----------------------------------------------------------------            
//STEP04   EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD  DSN=BP13.KA40.TRANS,DISP=SHR,                                    
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=&&FA40AI,                                                    
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(17,11,A),FORMAT=CH                                               
  INCLUDE COND=(9,2,CH,EQ,C'AI')                                                
//*-----------------------------------------------------------------            
//* SORT OUT REJECTED   CASES                                                   
//*-----------------------------------------------------------------            
//STEP05   EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD  DSN=BP13.KA40.TRANS,DISP=SHR,                                    
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=&&FA40RI,                                                    
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(17,11,A),FORMAT=CH                                               
  INCLUDE COND=(9,2,CH,EQ,C'RI')                                                
//*-----------------------------------------------------------------            
//* SORT OUT REJECTED   CASES                                                   
//*-----------------------------------------------------------------            
//STEP05A  EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD  DSN=&&FA40RI,                                                    
//             DISP=(OLD,PASS),                                                 
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=BP13.FA40.TRANS.RI.BP18,DISP=OLD                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(17,11,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'6')                                                 
//*------------------------------------------------------------------           
//* MATCH SCHEME ACCT WITH RI AND AI TRANSACTION                                
//*------------------------------------------------------------------           
//STEP06   EXEC PGM=BP13CF06,COND=(0,NE)                                        
//BP13FA40 DD DSN=&&FA40AI,DISP=(OLD,DELETE)                                    
//P13FA40A DD DSN=&&FA40RI,DISP=(OLD,DELETE)                                    
//BP13KA40 DD DSN=BP13.KA40.TRANS,DISP=SHR                                      
//P13FA40B DD DSN=BP13.FA40.KIV.AI,DISP=OLD                                     
//P13FA40C DD DSN=&&P13FA40C,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT ONLY DBS RECORDS                                                   
//*-----------------------------------------------------------------            
//STEP6A   EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD  DSN=&&P13FA40C,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&FA40DBS,                                                   
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(17,11,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'5')                                                 
//**************************************************************                
//*TO CHECK CASES THAT WERE FOUND IN THE MASTER FILE                            
//**************************************************************                
//STEP6B  EXEC PGM=BP13CF32,REGION=1500K                                        
//BP13FA40 DD DSN=&&FA40DBS,DISP=(OLD,PASS)                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13FA40A DD DSN=&&FA40DBSF,DISP=(NEW,PASS),                                   
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//P13FA40B DD DSN=BP13.FA40.KIV.AI,DISP=MOD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT ONLY EC RECORDS                                                    
//*-----------------------------------------------------------------            
//STEP6C   EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD  DSN=&&P13FA40C,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&FA40ECF,                                                   
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(17,11,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,EQ,C'6')                                                 
//*-----------------------------------------------------------------            
//* DBS & EC CASES                                                              
//*-----------------------------------------------------------------            
//STEP6C   EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD  DSN=&&FA40DBSF,DISP=(OLD,PASS)                                   
//         DD  DSN=&&FA40ECF,DISP=(OLD,PASS)                                    
//SORTOUT  DD  DSN=&&BP13FA40,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(17,11,A),FORMAT=CH                                               
/*                                                                              
//*-------------------------------------------------------------------*         
//* TO UPDATE ACCEPTANCE TO SOC MASTER, FIS AND CIMS                            
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13CA07,COND=(0,NE)                                        
//BP13FA40 DD DSN=&&BP13FA40,DISP=(SHR,DELETE)                                  
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR                                      
//BP13KA30 DD DSN=BP13.KA30.UNIT,DISP=SHR                                       
//BP13KA31 DD DSN=BP13.KA30.UNIT.PATH1,DISP=SHR                                 
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13KD15 DD DSN=BP13.KD15.DBSSTP,DISP=SHR                                     
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//CP27K090 DD DSN=CP27.K090.HOLIDAY,DISP=SHR                                    
//P13FA40A DD DSN=&&P13FA40A,DISP=(,PASS),                                      
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* TO UPDATE BP13KB20 FOR REJECTED CASES                                       
//*---------------------------------------------------------------------        
//STEP07A  EXEC PGM=BP13CG01,COND=(0,NE)                                        
//BP13FA40 DD DSN=&&P13FA40A,DISP=(SHR,DELETE)                                  
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR                                      
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------- 00000150
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.BLANK.CHAR150,DISP=SHR                                   
//SYSIN    DD *                                                                 
         DEL (BP13.KA40.TRANS) CLUSTER PURGE                                    
         DEF CL (NAME(BP13.KA40.TRANS)      -                                   
                 CYL(8 5)                     -                                 
                 STORCLAS(PRODRLS)            -                                 
                 LOG(NONE)                    -                                 
                 SHR(2 3)                     -                                 
                 UNIQUE                       -                                 
                 KEYS(10 0)                   -                                 
                 FREESPACE(5 5)               -                                 
                 CISZ(4096)                   -                                 
                 RECSZ(150 150))                -                               
                 DATA(NAME(BP13.KA40.TRANS.DATA))-                              
                 INDEX(NAME(BP13.KA40.TRANS.INDEX))                             
         IF MAXCC = 0  THEN                        -                            
            REPRO IFILE(INPUT)                    -                             
            ODS(BP13.KA40.TRANS)                                                
//*-----------------------------------------------------------------            
//* SORT OUT ACCEPTANCE CASES                                                   
//*-----------------------------------------------------------------            
//STEP09   EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD  DSN=BP13.FA40.KIV.AI,DISP=SHR                                    
//SORTOUT  DD  DSN=&&FA40SORT,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,10,A),FORMAT=CH                                                
//*------------------------------------------------------------------           
//STEP10 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//INPUT01  DD DSN=&&FA40SORT,DISP=(OLD,DELETE)                                  
//OUTPUT01 DD DSN=BP13.KA40.TRANS,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
     REPRO INFILE(INPUT01) OUTFILE(OUTPUT01) REPLACE                            
//**********************************************************************        
//* TO MATCH BP13FA40 AND BP13KB20 AND WRITE TO BP13FB20 TEMPORARY FILE         
//* EXTRACT ALL BOOKED FLAT CASES                                               
//**********************************************************************        
//STEP11   EXEC PGM=BP13CD23,COND=(0,NE)                                        
//BP13FA40 DD DSN=&&P13FA40C,DISP=(SHR,DELETE)                                  
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR                                      
//BP13FB20 DD DSN=&&BP13FB20,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=3300)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//**********************************************************************        
//* SORT MATCHED RECORDS IN BP13FB20                                            
//**********************************************************************        
//STEP11A  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&BP13FB20,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&BP13FB20,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=3300)                                         
//SYSIN    DD *                                                                 
   SORT FIELDS=(6,8,A),FORMAT=CH                                                
   INCLUDE COND=(3015,11,CH,NE,C' ')                                            
//**********************************************************************        
//*             ADDITIONAL JOBS FOR REASSIGN DBSS CSM                           
//**********************************************************************        
//*******************************************************************           
//* SORT KB20 FILE TO F800 FORMAT FOR REASSIGNMENT OF CSM                       
//*------------------------------------------------------------------           
//STEP12A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FB20,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&F800DBS,DISP=(NEW,PASS),                                    
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
      SORT FIELDS=(6,8,A),FORMAT=CH                                             
      INCLUDE COND=(3015,11,CH,NE,C' ',AND,6,1,CH,EQ,C'5')                      
      OUTREC FIELDS=(3X,6,8,10X,3269,8,27,2,17X,2X,24,3,11X,1,3,                
                     856X,C'DBS',36X,2988,1,1036X)                              
//*******************************************************************           
//* SORT KB20 FILE TO F800 FORMAT FOR REASSIGNMENT OF CSM                       
//*------------------------------------------------------------------           
//STEP12B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FB20,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&F800EC,DISP=(NEW,PASS),                                     
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
      SORT FIELDS=(6,8,A),FORMAT=CH                                             
      INCLUDE COND=(3015,11,CH,NE,C' ',AND,6,1,CH,EQ,C'6')                      
      OUTREC FIELDS=(3X,6,8,10X,3269,8,27,2,17X,2X,24,3,11X,1,3,                
                     856X,C'EC ',36X,2988,1,1036X)                              
//*******************************************************************           
//* SORT KB20 FILE TO F800 FORMAT FOR REASSIGNMENT OF CSM                       
//*------------------------------------------------------------------           
//STEP12C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800DBS,DISP=(OLD,DELETE)                                   
//         DD DSN=&&F800EC,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=&&F800,DISP=(NEW,PASS),                                       
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
      SORT FIELDS=(4,8,A),FORMAT=CH                                             
//*-----------------------------------------------------------------            
//* REASSIGN CSM FOR DBSS CASES WHO BOOKED A FLAT                               
//*-----------------------------------------------------------------            
//STEP12D  EXEC PGM=BP13C148,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800,DISP=(OLD,DELETE)                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13KB25 DD DSN=BP13.KB25.DBSELIG,DISP=SHR,                                   
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13KB21 DD DSN=BP13.KB25.DBSELIG.PATH1,DISP=SHR,                             
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K025 DD DSN=BP13.K025.CSM.DBSS,DISP=SHR                                   
//P13L148A DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//**********************************************************************        
//* UPDATE KB25 DATA WITH KB20 DATA.                                            
//* WILL UPDATE ONLY THOSE THAT HAS NOT UPDATED                                 
//**********************************************************************        
//STEP13   EXEC  PGM=BP13CD05,COND=(0,NE)                                       
//BP13FB20 DD DSN=&&BP13FB20,DISP=(SHR,DELETE)                                  
//BP13KB25 DD DSN=BP13.KB25.DBSELIG,DISP=SHR                                    
//BP13KB21 DD DSN=BP13.KB25.DBSELIG.PATH2,DISP=SHR                              
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORT BP13FA40 BY REGN NO, CDE-TRANS, FA40 IS SIMILAR FROM F310    *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.FA40.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&F310CB34,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),DATACLAS=MULTIVOL,             
//            SPACE=(CYL,(30,20),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A,30,8,A,9,2,A),FORMAT=CH                                    
  INCLUDE COND=(1,1,CH,EQ,C'5')                                                 
//*-------------------------------------------------------------------*         
//* OUTPUT ACCEPT/REJECT RECORD TO BP13K580                           *         
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=BP13CB34,COND=(0,NE)                                        
//BP13F310 DD DSN=&&F310CB34,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=13')                                                  
//BP13K580 DD DSN=BP13.K580.ACCEPT,DISP=SHR,                                    
//            AMP=('BUFND=13')                                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13FA40 BY REGN NO, CDE-TRANS = 'AI' AND ALLOC-SCH = 'MCP'  *         
//*-------------------------------------------------------------------*         
//STEP16   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.FA40.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&FA40AI,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                               
//            SPACE=(CYL,(30,20),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(9,2,CH,EQ,C'AI',AND,127,3,CH,EQ,C'MCP')                         
//*-------------------------------------------------------------------*         
//* OUTPUT RECORD TO BP13F010                                         *         
//*-------------------------------------------------------------------*         
//STEP17   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13FA40 DD DSN=&&FA40AI,DISP=(OLD,DELETE)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//BP04K010 DD DSN=BP04.K010.DEBAR,DISP=SHR                                      
//BP13K853 DD DSN=BP13.K853.MCPS,DISP=SHR                                       
//BP13K665 DD DSN=BP13.K665.DEBARREF.SOC,DISP=SHR                               
//BP04F010 DD DSN=BP13.F010.MCPS.DEBAR.INSERT,DISP=MOD                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C54E) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT TO TEMP FILE                                                           
//*-----------------------------------------------------------------            
//STEP17A   EXEC PGM=IDCAMS                                                     
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F010.MCPS.DEBAR.INSERT,DISP=SHR                          
//OUTPUT1  DD DSN=&&P04F010,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=300),                                         
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* GET CUSTOMER ID FROM BE01C808                                               
//*-----------------------------------------------------------------            
//STEP17B  EXEC PGM=IKJEFT01,COND=(0,NE),DYNAMNBR=20                            
//P04F010  DD DSN=&&P04F010,DISP=(OLD,PASS)                                     
//BE01KMSG DD DSN=BE01.KMSG.ONLINE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BE01F003 DD DSN=BP13.BE01F003.CUSTUPD.LOGB,DISP=OLD                           
//BE01F903 DD DSN=BP13.BE01F903.INVUPD,DISP=OLD                                 
//BE01F400 DD DSN=BP13.BE01F400.SENDID.NEWID,DISP=OLD                           
//P04F010A DD DSN=BP13.F010.MCPS.DEBAR.INSERT,DISP=OLD                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CZ3M) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* REPRO THE BP13 DATASET AND MOD TO BE01 DATASET                    *         
//*-------------------------------------------------------------------*         
//STEP17C   EXEC PGM=IDCAMS                                                     
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1  DD DSN=BP13.BE01F003.CUSTUPD.LOGB,DISP=SHR                            
//OUTPUT1 DD DSN=BE01.F003.CUSTUPD.LOGB.BP13,DISP=MOD                           
//INPUT2  DD DSN=BP13.BE01F903.INVUPD,DISP=SHR                                  
//OUTPUT2 DD DSN=BE01.F903.INVUPD.BP13,DISP=MOD                                 
//INPUT3  DD DSN=BP13.BE01F400.SENDID.NEWID,DISP=SHR                            
//OUTPUT3 DD DSN=BE01.F400.SENDID.NEWID.BP13,DISP=MOD                           
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
      REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                    
      REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                    
//*---------------------------------------------------------------------00030311
//* SORT OUT CASES WITH DOC-RECEIVE-DATE                                00030311
//*---------------------------------------------------------------------00030311
//STEP18   EXEC SORT,CYL=30,COND=(0,NE)                                 00030411
//SORTIN   DD DSN=BP13.KB25.DBSELIG,DISP=SHR,                           00030511
//         AMP=('BUFND=4','BUFNI=8')                                    00030611
//SORTOUT  DD DSN=&&FB25DREV,DISP=(,PASS),                              00030711
//            UNIT=SYSDA,                                               00030811
//            DCB=(RECFM=FB,LRECL=3400,BLKSIZE=0),DATACLAS=MULTIVOL,    00030911
//            SPACE=(CYL,(50,10),RLSE)                                  00031011
//SYSIN    DD  *                                                        00031111
  SORT FIELDS=(6,8,A),FORMAT=CH                                         00031211
  INCLUDE COND=(3236,8,CH,GT,C'00000000')                               00031312
//*---------------------------------------------------------------------00030311
//* COMPUTE NUMBER DAYS FROM DTE-OPT, DTE-COMMIT                        00030311
//*---------------------------------------------------------------------00030311
//STEP19   EXEC PGM=BP13CD95,COND=(0,NE)                                00036002
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               00036112
//BP13FB25 DD DSN=&FB25DREV,DISP=(OLD,PASS)                             00037012
//BP13KB25 DD DSN=BP13.KB25.DBSELIG,DISP=SHR,                           00038012
//         AMP=('BUFND=4','BUFNI=8')                                    00030611
//SYSOUT   DD SYSOUT=*                                                  00039701
//SYSPRINT DD SYSOUT=*                                                  00039801
//SYSDBG   DD SYSOUT=*                                                  00039901
//SYSDBOUT DD SYSOUT=*                                                  00040001
//SYSABOUT DD SYSOUT=*                                                  00040101
//*                                                                     00040201
//*--------------------------------------------------------------------         
//*    END OF JOB BP13D90A                                                      
//*--------------------------------------------------------------------         
