//BP13A401 JOB (BP13P),'BP13A401',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010010
//             NOTIFY=CSD0071                                           00020010
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030010
//******************************************************************    00040010
//* IMPORTANT NOTE :                                                    00050010
//* THIS JCL IS FOR PCD NOTIFICATION (FORM OPTION C AND D ONLY)         00060010
//******************************************************************    00070010
//*CHG REF  OIC   DATE    DESCRIPTION                                   00080010
//*-------- ---- -------- -----------                                   00090010
//*BP136431 ZDD1 16092016 NEW JCL FOR PCD NOTIFICATION OPT C AND D      00100010
//*BP136431 ZDD1 30092016 CHANGE FORM ID                                00110010
//*BP137452 ZS13 08022019 ADD NEW FORM BP1381/82/83                     00120010
//*BP137452 ZS13 13022019 ADDED BP13K491 ON BP13C493                    00130010
//*BP137452 ZS13 14022019 ADDED VFY STEP                                00140010
//*BP137687 ZS13 04032019 ADDED NEW LISTING FOR BP13C493                00150010
//*BP137741 KV5  18032019 CREATING THE 'I','L' AND 'H' REPORTS          00160010
//*                       BASED ON SORT CONDTION.                       00170010
//*BP137741 KV5  24042019 CREATING FS,NOFS,SMS & NOSMS EMAIL REPORTS    00171010
//*BP138797 ZAR7 28072021 CATER FOR IOMS FOR BP13C493                   00171110
//*BP139376 IL5  12012023 CHANGE IOMS SERVER FROM HDBIOMNFS TO          00171211
//*                       HDBIOM3NFSP1                                  00171311
//******************************************************************    00171410
//*                   FOR CONTROL LIST                                  00171510
//******************************************************************    00171610
//PRT01    EXEC PGM=IEBGENER                                            00171710
//SYSUT1   DD *                                                         00171810
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                            00171910
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                         00172010
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1A                           00172110
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                      00172210
//SYSPRINT DD SYSOUT=*                                                  00173010
//SYSIN    DD DUMMY                                                     00174010
//*                                                                     00175010
//******************************************************************    00176010
//*                   FOR CONTROL LIST                                  00177010
//******************************************************************    00178010
//PRT1A    EXEC PGM=IEBGENER                                            00179010
//SYSUT1   DD *                                                         00180010
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1F CP-1',END;                            00190010
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                         00200010
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1F                           00210010
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                      00220010
//SYSPRINT DD SYSOUT=*                                                  00230010
//SYSIN    DD DUMMY                                                     00240010
//*                                                                     00250010
//******************************************************************    00260010
//*                   FOR CONTROL LIST                                  00270010
//******************************************************************    00280010
//PRT1B    EXEC PGM=IEBGENER                                            00290010
//SYSUT1   DD *                                                         00300010
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1G CP-1',END;                            00310010
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                         00320010
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1G                           00330010
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                      00340010
//SYSPRINT DD SYSOUT=*                                                  00350010
//SYSIN    DD DUMMY                                                     00360010
//*                                                                     00370010
//******************************************************************    00380010
//*            PRINTING OF PCD NOTIFICATION - OPT C                     00390010
//******************************************************************    00400010
//PRT02    EXEC PGM=IEBGENER                                            00410010
//SYSUT1   DD *                                                         00420010
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1B CP-1',END;                            00430010
1$DJDE$ JDE=13POT9,JDL=BP13,FORMS=BP13EN,END;                           00440010
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1B                           00450010
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                      00460010
//SYSPRINT DD SYSOUT=*                                                  00470010
//SYSIN    DD DUMMY                                                     00480010
//*                                                                     00490010
//******************************************************************    00500010
//*          DUPLICATE COPY OF PCD NOTIFICATION - OPT D                 00510010
//******************************************************************    00520010
//PRT03    EXEC PGM=IEBGENER                                            00530010
//SYSUT1   DD *                                                         00540010
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1C CP-1',END;                            00550010
1$DJDE$ JDE=13POT9,JDL=BP13,FORMS=BP13EP,END;                           00560010
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1C                           00570010
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                      00580010
//SYSPRINT DD SYSOUT=*                                                  00590010
//SYSIN    DD DUMMY                                                     00600010
//*                                                                     00610010
//******************************************************************    00620010
//*            PRINTING OF PCD NOTIFICATION  - OPT D (NOT USED)         00630010
//******************************************************************    00640010
//PRT04    EXEC PGM=IEBGENER                                            00650010
//SYSUT1   DD *                                                         00660010
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1D CP-1',END;                            00670010
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13EP,END;                           00680010
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1D                           00690010
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                      00700010
//SYSPRINT DD SYSOUT=*                                                  00710010
//SYSIN    DD DUMMY                                                     00720010
//*                                                                     00730010
//******************************************************************    00740010
//*          DUPLICATE COPY OF PCD NOTIFICATION -  OPT D (NOT USED)     00750010
//******************************************************************    00760010
//PRT05    EXEC PGM=IEBGENER                                            00770010
//SYSUT1   DD *                                                         00780010
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1E CP-1',END;                            00790010
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13EP,END;                           00800010
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1E                           00810010
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                      00820010
//SYSPRINT DD SYSOUT=*                                                  00830010
//SYSIN    DD DUMMY                                                     00840010
//*                                                                     00850010
//******************************************************************    00860010
//*  SEND DJDE AHEAD OF THE PRINT DATASET                               00870010
//******************************************************************    00880010
//PRT06    EXEC PGM=IEBGENER                                            00890010
//SYSUT1   DD *                                                         00900010
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1F CP-1',END;                            00910010
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                         00920010
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1F                           00930010
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                      00940010
//SYSPRINT DD SYSOUT=*                                                  00950010
//SYSIN    DD DUMMY                                                     00960010
//*-------------------------------------------------------------------- 00970010
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                       00980010
//*-------------------------------------------------------------------- 00990010
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                   01000010
//INPUT1   DD DSN=BP13.K491.EMAIL.PCD,DISP=OLD                          01010010
//INPUT2   DD DSN=BP13.KH55.PCD.SMS,DISP=OLD                            01020010
//SYSPRINT DD SYSOUT=*                                                  01030010
//SYSIN   DD *                                                          01040010
          VFY FILE(INPUT1)                                              01050010
          VFY FILE(INPUT2)                                              01060010
//*-----------------------------------------------------------------    01070010
//*  REPRO VSAM FILE TO CARTRIDGE                                       01080010
//*-----------------------------------------------------------------    01090010
//STEP00 EXEC    PGM=IDCAMS,COND=(0,NE)                                 01100010
//SYSPRINT DD  SYSOUT=*                                                 01110010
//INPUT1   DD  DSN=BP13.KH55.PCD.SMS,                                   01120010
//             DISP=SHR,                                                01130010
//             AMP=('BUFND=23')                                         01140010
//OUTPUT1  DD  DSN=BP13.FH55.PCD.SMS.BKP(+1),                           01150010
//             DISP=(NEW,PASS),                                         01160010
//             UNIT=CART,                                               01170010
//             LABEL=(1,SL),                                            01180010
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=500,RECFM=FB)              01190010
//*                                                                     01200010
//SYSIN    DD  *                                                        01210010
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                               01220010
//*---------------------------------------------------------------------01230010
//*  CATALOG GDG                                                        01240010
//*---------------------------------------------------------------------01250010
//STEP0A EXEC    PGM=IEFBR14,COND=(0,NE)                                01260010
//INPUT1   DD  DSN=BP13.FH55.PCD.SMS.BKP(+1),                           01270010
//             DISP=(OLD,CATLG),                                        01280010
//             UNIT=(,,DEFER)                                           01290010
//**********************************************************************01300010
//*    BACKUP TO MONTHLY FILE REPORTS 'I','L' & 'H'                    *01310010
//**********************************************************************01320010
//STEP0B   EXEC PGM=IDCAMS,COND=(0,NE)                                  01330010
//SYSPRINT DD SYSOUT=*                                                  01340010
//INPUT1   DD DSN=BP13.F491.EMAIL.PCDI,DISP=OLD                         01350010
//OUTPUT1  DD DSN=BP13.F491.EMAIL.PCDI.MONTH,DISP=MOD                   01360010
//INPUT2   DD DSN=BP13.F491.EMAIL.PCDL,DISP=OLD                         01370010
//OUTPUT2  DD DSN=BP13.F491.EMAIL.PCDL.MONTH,DISP=MOD                   01380010
//*INPUT3   DD DSN=BP13.F491.EMAIL.PCDH,DISP=OLD                        01390010
//*OUTPUT3  DD DSN=BP13.F491.EMAIL.PCDH.MONTH,DISP=MOD                  01400010
//INPUT4   DD DSN=BP13.F491.EMAIL.PCDZ,DISP=OLD                         01410010
//OUTPUT4  DD DSN=BP13.F491.EMAIL.PCDZ.MONTH,DISP=MOD                   01420010
//SYSIN    DD *                                                         01430010
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                             01440010
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                             01450010
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                             01460010
//**********************************************************************01470010
//*                SORT 'PC' OPTION IN BP13K205                        *01480010
//**********************************************************************01490010
//STEP01   EXEC  SORT,COND=(0,NE)                                       01500010
//SORTIN   DD  DSN=BP13.K205.CTLREC,DISP=SHR                            01510010
//SORTOUT  DD  DSN=&&BP13F205,DISP=(NEW,PASS),                          01520010
//         UNIT=SYSDA,                                                  01530010
//         DCB=(RECFM=FB,LRECL=80),                                     01540010
//         SPACE=(CYL,(5,2),RLSE)                                       01550010
//SYSIN    DD  *                                                        01560010
      SORT FIELDS=(1,15,A),FORMAT=CH                                    01570010
      INCLUDE COND=((14,2,CH,EQ,C'PC'),AND,                             01580010
                   (46,1,CH,EQ,C'C',OR,46,1,CH,EQ,C'D'))                01590010
//**********************************************************************01600010
//*                MATCH BP13F205 WITH BM06K110                        *01610010
//**********************************************************************01620010
//STEP02   EXEC PGM=BP13C490,COND=(0,NE)                                01630010
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                            01640010
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                            01650010
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                      01660010
//BM06F110 DD DSN=&&BM06F110,DISP=(NEW,PASS),                           01670010
//            UNIT=SYSDA,                                               01680010
//            DCB=(RECFM=FB,LRECL=500),                                 01690010
//            SPACE=(CYL,(40,10),RLSE)                                  01700010
//SYSPRINT DD SYSOUT=*                                                  01710010
//SYSUDUMP DD SYSOUT=*                                                  01720010
//SYSDBOUT DD SYSOUT=*                                                  01730010
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT06.FORMID),DEST=IOM2                01740010
//**********************************************************************01750010
//*             PRINTING OF PCD NOTIFICATION                           *01760010
//**********************************************************************01770010
//STEP03   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       01780010
//BM06F110 DD DSN=&&BM06F110,DISP=(OLD,PASS)                            01790010
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                            01800010
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                              01810010
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                             01820010
//BP13KH55 DD DSN=BP13.KH55.PCD.SMS,DISP=SHR                            01830010
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              01840010
//BP13K491 DD DSN=BP13.K491.EMAIL.PCD,DISP=SHR                          01850010
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                            01860010
//            AMP=('BUFND=4','BUFNI=8')                                 01870010
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                      01880010
//            AMP=('BUFND=4','BUFNI=8')                                 01890010
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                           01900010
//            AMP=('BUFND=4','BUFNI=8')                                 01910010
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             01920010
//            AMP=('BUFND=4','BUFNI=8')                                 01930010
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                             01940010
//            AMP=('BUFND=4','BUFNI=8')                                 01950010
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                              01960010
//            AMP=('BUFND=4','BUFNI=8')                                 01970010
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                        01980010
//            AMP=('BUFND=4','BUFNI=8')                                 01990010
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                          02000010
//            AMP=('BUFND=4','BUFNI=8')                                 02010010
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                            02020010
//            AMP=('BUFND=4','BUFNI=8')                                 02030010
//BP13P493 DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                02040010
//P13P493B DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02050010
//BP13L493 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                02060010
//P13L493A DD SYSOUT=2,OUTPUT=(*.PRT1A.FORMID),DEST=IOM2                02070010
//BP13493L DD SYSOUT=2,OUTPUT=(*.PRT1B.FORMID),DEST=IOM2                02080010
//P13P493C DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                02090010
//P13P493D DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02100010
//P13P493F DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02110010
//P13P493G DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02120010
//P13P493H DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02130010
//P13P493I DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02140010
//P13P493J DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02150010
//P13P493K DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02160010
//P13P493L DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02170010
//P13P493M DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02180010
//P13P493N DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02190010
//P13P493O DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02200010
//P13P493P DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                02210010
//P13BC493 DD DSN=BP13.FIOMSB10.A506C493.BP13CD,DISP=OLD                02220010
//P13HC493 DD DSN=BP13.FIOMSH10.A506C493.BP13CD,DISP=OLD                02230010
//BP13FTP  DD DSN=BP13.FIOMSFTP.A506C493,DISP=OLD                       02240010
//SYSOUT   DD SYSOUT=*                                                  02250010
//SYSTSPRT DD SYSOUT=*                                                  02260010
//SYSPRINT DD SYSOUT=*                                                  02270010
//SYSDBG   DD SYSOUT=*                                                  02280010
//SYSDBOUT DD SYSOUT=*                                                  02290010
//SYSTSIN  DD *                                                         02300010
  DSN SYSTEM(DSN)                                                       02310010
  RUN PROGRAM(BP13C493) PLAN(BP13PCC) -                                 02320010
      LIB('BP13.BATCH.LOADCOB')                                         02330010
  END                                                                   02340010
//SYSIN    DD *                                                         02350010
BP13W009                                                                02360010
BP13.FIOMSB10.A506C493                                                  02370010
BP13.FIOMSH10.A506C493                                                  02371010
//*                                                                     02372010
//*==================================================================== 02373010
//* STEP TO FTP SEQUENTIAL FILES TO IOMS SERVER                         02374010
//*==================================================================== 02375010
//*-------------------------------------------------------------------- 02376010
//* PRINT LETTER                                                        02377010
//*-------------------------------------------------------------------- 02378010
//PS0300A EXEC FTP,PARM='HDBIOM3NFSP1 (EXIT',COND=(0,NE)                02379011
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          02379110
//INPUT    DD DSN=BP13.FIOMSFTP.A506C493,DISP=SHR                       02379210
//*-----------------------------------------------------------------    02379310
//*  ADD &&BP13F205 REC INTO F205.ACCUM FILE                            02379410
//*-----------------------------------------------------------------    02379510
//STEP04   EXEC  PGM=IDCAMS,COND=(0,NE)                                 02379610
//SYSPRINT DD  SYSOUT=*                                                 02379710
//INPUT1   DD  DSN=&&BP13F205,DISP=(OLD,PASS)                           02379810
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,DISP=MOD                             02379910
//SYSIN    DD  *                                                        02380010
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                             02390010
//**********************************************************************02400010
//*                SORT 'I','L' & H TAG FORMS FROM BP13K491            *02410010
//**********************************************************************02420010
//STEP05   EXEC SORT,CYL=30,COND=(0,NE)                                 02430010
//SORTIN   DD DSN=BP13.K491.EMAIL.PCD,DISP=SHR                          02440010
//SORTOUT  DD DSN=&&BP13F491,DISP=(NEW,PASS),                           02450010
//         UNIT=SYSDA,                                                  02460010
//         DCB=(RECFM=FB,LRECL=200),                                    02470010
//         SPACE=(CYL,(5,2),RLSE)                                       02480010
//SYSIN    DD  *                                                        02490010
      SORT FIELDS=(1,8,A),FORMAT=CH                                     02500010
      INCLUDE COND=((154,1,CH,EQ,C'I',OR,154,1,CH,EQ,C'L',OR,           02510010
                    154,1,CH,EQ,C'J',OR,154,1,CH,EQ,C'Y',OR,            02520010
                    154,1,CH,EQ,C'H',OR,154,1,CH,EQ,C'Z'),AND,          02530010
                    193,8,ZD,EQ,DATE1P)                                 02540010
//**********************************************************************02550010
//*            CREATING THREE REPORTS 'I','L' & 'H'                    *02560010
//**********************************************************************02570010
//STEP05A  EXEC PGM=BP13C495,COND=(0,NE)                                02580010
//BP13F491 DD DSN=&&BP13F491,DISP=(OLD,DELETE)                          02590010
//OUTFILEI DD DSN=BP13.F491.EMAIL.PCDI,DISP=OLD                         02600010
//OUTFILEL DD DSN=BP13.F491.EMAIL.PCDL,DISP=OLD                         02610010
//OUTFILEH DD DSN=BP13.F491.EMAIL.PCDH,DISP=OLD                         02620010
//OUTFILEZ DD DSN=BP13.F491.EMAIL.PCDZ,DISP=OLD                         02630010
//SYSPRINT DD SYSOUT=*                                                  02640010
//SYSUDUMP DD SYSOUT=*                                                  02650010
//SYSDBOUT DD SYSOUT=*                                                  02660010
//**********************************************************************02670010
//*                SORT 'H' TAG FORM FROM BP13K491                     *02680010
//**********************************************************************02690010
//*STEP05B  EXEC SORT,CYL=30,COND=(0,NE)                                02700010
//*SORTIN   DD DSN=BP13.K491.EMAIL.PCD,DISP=SHR                         02710010
//*SORTOUT  DD DSN=&&BP13F491,DISP=(NEW,PASS),                          02720010
//*         UNIT=SYSDA,                                                 02730010
//*         DCB=(RECFM=FB,LRECL=200),                                   02740010
//*         SPACE=(CYL,(5,2),RLSE)                                      02750010
//*SYSIN    DD  *                                                       02760010
//*    SORT FIELDS=(77,11,A),FORMAT=CH                                  02770010
//*    INCLUDE COND=((154,1,CH,EQ,C'H',OR,                              02780010
//*                  154,1,CH,EQ,C'Y'),AND,                             02781010
//*                  193,8,ZD,EQ,DATE1P)                                02782010
//**********************************************************************02783010
//*            CREATING TWO FS & NO FS EMAIL REPORTS                   *02784010
//**********************************************************************02785010
//*STEP05C  EXEC PGM=BP13C496,COND=(0,NE)                               02786010
//*BP13F491 DD DSN=&&BP13F491,DISP=(OLD,DELETE)                         02787010
//*BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                             02788010
//*OUTFLFS  DD DSN=BP13.F491.EMAIL.PCD.HFS,DISP=OLD                     02789010
//*OUTFLNFS DD DSN=BP13.F491.EMAIL.PCD.HNOFS,DISP=OLD                   02789110
//*SYSPRINT DD SYSOUT=*                                                 02789210
//*SYSUDUMP DD SYSOUT=*                                                 02789310
//*SYSDBOUT DD SYSOUT=*                                                 02789410
//*-------------------------------------------------------------------* 02789510
//*  SEND MAINFRAME EMAIL FOR STEP05C                                   02789610
//*-----------------------------------------------------------------    02789710
//*STEP05D  EXEC SENDMAIL,COND=(4,LT)                                   02789810
//*INPUT    DD DSN=BP13.F491.EMAIL.PCD.HFS,DISP=SHR                     02789910
//*                                                                     02790010
//*-------------------------------------------------------------------* 02790110
//*  SEND MAINFRAME EMAIL FOR STEP05C                                   02790210
//*-----------------------------------------------------------------    02790310
//*STEP05E  EXEC SENDMAIL,COND=(4,LT)                                   02790410
//*INPUT    DD DSN=BP13.F491.EMAIL.PCD.HNOFS,DISP=SHR                   02790510
//*                                                                     02790610
//**********************************************************************02790710
//*                SORT 'I' TAG FORM FROM BP13K491                     *02790810
//**********************************************************************02790910
//STEP05F  EXEC SORT,CYL=30,COND=(0,NE)                                 02791010
//SORTIN   DD DSN=BP13.K491.EMAIL.PCD,DISP=SHR                          02791110
//SORTOUT  DD DSN=&&BP13F491,DISP=(NEW,PASS),                           02791210
//         UNIT=SYSDA,                                                  02791310
//         DCB=(RECFM=FB,LRECL=200),                                    02791410
//         SPACE=(CYL,(5,2),RLSE)                                       02791510
//SYSIN    DD  *                                                        02791610
      SORT FIELDS=(77,11,A),FORMAT=CH                                   02791710
      INCLUDE COND=((154,1,CH,EQ,C'I',OR,                               02791810
                    154,1,CH,EQ,C'J'),AND,                              02791910
                    193,8,ZD,EQ,DATE1P)                                 02792010
//**********************************************************************02792110
//*            CREATING TWO SMS & NO SMS EMAIL REPORTS                 *02792210
//**********************************************************************02792310
//STEP05G  EXEC PGM=BP13C497,COND=(0,NE)                                02792410
//BP13F491 DD DSN=&&BP13F491,DISP=(OLD,DELETE)                          02792510
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              02792610
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR                             02792710
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                           02792810
//OUTFSMS  DD DSN=BP13.F491.EMAIL.PCD.ISMS,DISP=OLD                     02792910
//OUTFNSMS DD DSN=BP13.F491.EMAIL.PCD.INOSMS,DISP=OLD                   02793010
//SYSPRINT DD SYSOUT=*                                                  02793110
//SYSUDUMP DD SYSOUT=*                                                  02793210
//SYSDBOUT DD SYSOUT=*                                                  02793310
//**********************************************************************02793410
//*                SORT 'L' TAG FORM FROM BP13K491                     *02793510
//**********************************************************************02793610
//STEP05H  EXEC SORT,CYL=30,COND=(0,NE)                                 02793710
//SORTIN   DD DSN=BP13.K491.EMAIL.PCD,DISP=SHR                          02793810
//SORTOUT  DD DSN=&&BP13F491,DISP=(NEW,PASS),                           02793910
//         UNIT=SYSDA,                                                  02794010
//         DCB=(RECFM=FB,LRECL=200),                                    02794110
//         SPACE=(CYL,(5,2),RLSE)                                       02794210
//SYSIN    DD  *                                                        02794310
      SORT FIELDS=(77,11,A),FORMAT=CH                                   02794410
      INCLUDE COND=((154,1,CH,EQ,C'L',OR,                               02794510
                    154,1,CH,EQ,C'L'),AND,                              02794610
                    193,8,ZD,EQ,DATE1P)                                 02794710
//**********************************************************************02794810
//*            CREATING TWO SMS & NO SMS EMAIL REPORTS                 *02794910
//**********************************************************************02795010
//STEP05I  EXEC PGM=BP13C49B,COND=(0,NE)                                02795110
//BP13F491 DD DSN=&&BP13F491,DISP=(OLD,DELETE)                          02795210
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              02795310
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR                             02795410
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                           02795510
//OTNFSSMS DD DSN=BP13.F491.EMAIL.PCD.INOSMS,DISP=MOD                   02795610
//SYSPRINT DD SYSOUT=*                                                  02795710
//SYSUDUMP DD SYSOUT=*                                                  02795810
//SYSDBOUT DD SYSOUT=*                                                  02795910
//*-------------------------------------------------------------------* 02796010
//*  SEND MAINFRAME EMAIL FOR STEP05G                                   02796110
//*-----------------------------------------------------------------    02796210
//STEP05H  EXEC SENDMAIL,COND=(4,LT)                                    02796310
//INPUT    DD DSN=BP13.F491.EMAIL.PCD.ISMS,DISP=SHR                     02796410
//*                                                                     02796510
//*-------------------------------------------------------------------* 02796610
//*  SEND MAINFRAME EMAIL FOR STEP05G                                   02796710
//*-----------------------------------------------------------------    02796810
//STEP05I  EXEC SENDMAIL,COND=(4,LT)                                    02796910
//INPUT    DD DSN=BP13.F491.EMAIL.PCD.INOSMS,DISP=SHR                   02797010
//*                                                                     02797110
//**********************************************************************02797210
//*                SORT 'Z' TAG FORM FROM BP13K491                     *02797310
//**********************************************************************02797410
//STEP05J  EXEC SORT,CYL=30,COND=(0,NE)                                 02797510
//SORTIN   DD DSN=BP13.K491.EMAIL.PCD,DISP=SHR                          02797610
//SORTOUT  DD DSN=&&BP13F491,DISP=(NEW,PASS),                           02797710
//         UNIT=SYSDA,                                                  02797810
//         DCB=(RECFM=FB,LRECL=200),                                    02797910
//         SPACE=(CYL,(5,2),RLSE)                                       02798010
//SYSIN    DD  *                                                        02798110
      SORT FIELDS=(77,11,A),FORMAT=CH                                   02798210
      INCLUDE COND=((154,1,CH,EQ,C'Z'),AND,                             02798310
                    193,8,ZD,EQ,DATE1P)                                 02798410
//**********************************************************************02798510
//*            CREATING TWO PPO &NO PPO EMAIL REPORTS                  *02798610
//**********************************************************************02798710
//STEP05K  EXEC PGM=BP13C49W,COND=(0,NE)                                02798810
//BP13F491 DD DSN=&&BP13F491,DISP=(OLD,DELETE)                          02798910
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              02799010
//OUTFZPP  DD DSN=BP13.F491.EMAIL.PCD.ZPPO,DISP=OLD                     02799110
//OUTFZNPP DD DSN=BP13.F491.EMAIL.PCD.ZNOPPO,DISP=OLD                   02799210
//SYSPRINT DD SYSOUT=*                                                  02799310
//SYSUDUMP DD SYSOUT=*                                                  02799410
//SYSDBOUT DD SYSOUT=*                                                  02799510
//*-------------------------------------------------------------------* 02799610
//*  SEND MAINFRAME EMAIL FOR STEP05C                                   02799710
//*-----------------------------------------------------------------    02799810
//STEP05L  EXEC SENDMAIL,COND=(4,LT)                                    02799910
//INPUT    DD DSN=BP13.F491.EMAIL.PCD.ZPPO,DISP=SHR                     02800010
//*                                                                     02800110
//*-------------------------------------------------------------------* 02800210
//*  SEND MAINFRAME EMAIL FOR STEP05C                                   02800310
//*-----------------------------------------------------------------    02800410
//STEP05M  EXEC SENDMAIL,COND=(4,LT)                                    02800510
//INPUT    DD DSN=BP13.F491.EMAIL.PCD.ZNOPPO,DISP=SHR                   02800610
//*                                                                     02800710
//*-------------------------------------------------------------------* 02800810
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            * 02800910
//*-------------------------------------------------------------------* 02801010
//STEP06   EXEC WTOG,COND=(0,NE)                                        02801110
   ----> ############################################                   02801210
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13A400                     02801310
   ---->    PLEASE OPEN BP13K491.                                       02801410
   ----> ############################################                   02801510
