//BP13A21B JOB (BP13P),'BP13A21B',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR UPDATING PARENT FLAT TYPE FOR MGPS CASES                    
//******************************************************************            
//*CHG REF  OIC   DATE    DESCRIPTION                                           
//*-------- ---- -------- ------------------------------------------            
//*BP135404 ESA1 09062014 NEW JCL FOR UPDATING OF PARENT FLAT TYPE              
//*=================================================================            
//*  SEND DJDE AHEAD OF THE PRINT DATASET                                       
//*  PRT01                                                                      
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*          VERIFY FILES BEFORE DAILY PRODUCTION RUN                           
//*-----------------------------------------------------------------            
//STEP01   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BP13.KQ50.GROUNIT,                                           
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 10  FROM BP13M289 PANEL                                 
//*--------------------------------------------------------------------         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13F205,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'GB',OR,                                           
                 14,2,CH,EQ,C'GS')                                              
/*                                                                              
//*****************************************************************             
//* SORT OUT ALL BTO/SBF UNITS IN BP13K230                                      
//*****************************************************************             
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K230.FLATLIST,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F230,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                             
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN    DD  *                                                                
        SORT FIELDS=(64,11,A),FORMAT=CH                                         
        INCLUDE COND=(108,3,CH,EQ,C'BTO',OR,                                    
                      108,3,CH,EQ,C'SBF')                                       
//*--------------------------------------------------------------------*        
//*  SORT BP13F230 ACCORDING TO BP13F205 INPUT                                  
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C24S,COND=(0,NE)                                        
//BP13F205 DD DSN=&&BP13F205,DISP=(SHR,PASS)                                    
//BP13F230 DD DSN=&&BP13F230,DISP=(OLD,DELETE)                                  
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13F230A DD DSN=&&P13F230A,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=450),                             
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//*--------------------------------------------------------------------*        
//*  UPDATE PARENT FLAT TYPE BASED FROM BP13KQ50                                
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13C24T,COND=(0,NE)                                        
//BP13F230 DD DSN=&&P13F230A,DISP=(OLD,DELETE)                                  
//BP13K230 DD DSN=BP13.K230.FLATLIST,DISP=SHR                                   
//BP13KQ50 DD DSN=BP13.KQ50.GROUNIT,DISP=SHR                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13L24T DD DSN=BP13.L24T.PFT.RPT,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP06 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13F205,DISP=(OLD,DELETE)                                 
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,DISP=MOD                                     
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A21B                                                                
//*---------------------------------------------------------------------        
