//BP13A246 JOB (BP13P),'BP13A246',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*-----------------------------------------------------------------            
//* CHG-NO   BY   DATE    DESCRIPTION                                           
//* -------- ---- ------ -------------------------------------------            
//* BP132501 MTD  070404 JCL FOR PRINTING OF APPMT LETTERS FOR WIS              
//*-----------------------------------------------------------------            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=13C007,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=W,                                                        
//             OUTPUT=(*.FORMID),DEST=IOMW                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* SORT OUT OPTION = 'WL' (WIS APPMT LETTER)                                   
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=80,RECFM=FB)                       
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'WL')                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* PRINT WIS APPOINTMENT LETTERS                                               
//*--------------------------------------------------------------------         
//STEP02 EXEC    PGM=BP13C007,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K225 DD  DSN=BP13.K225.QUEUE,                                             
//             DISP=SHR                                                         
//BP13K221 DD  DSN=BP13.K225.QUEUE.PATH1,                                       
//             DISP=SHR                                                         
//BP13L007 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMW                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  ACCUMULATE CONTROL REC INTO CTLREC-ACC FILE                                
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-----------------------------------------------------------------            
//* END OF BP13A246                                                             
//*-----------------------------------------------------------------            
