//BP13A50H JOB (BP13P),'BP13A50H',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),    JOB01200
//          NOTIFY=CSD0071                                              00020000
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                          00030000
//******************************************************************            
//* JOB RUN 1-DAY AFTER CLOSING OF BTO/SBF, SO THAT BP13K830 IS                 
//* UPDATED WITH MHA ADDRESS                                                    
//******************************************************************            
//* REPORT ON FTS -PRESENT ROLE=CL, OCCP, T, OT FROM RDB                        
//*                PRESENT SUB-TENANT FROM SUBLET FILE                          
//*                PRESENT ADDRESS FROM BP13K830 MHA RESIDENTIAL ADDR           
//*                PRESENT FT, NT, FLOOR AREA FROM PIDB                         
//******************************************************************            
//* CHG-NO   BY   ON    - NOTES                                                 
//* ---------------------------------                                           
//* BP135089 LSB 041013 - NEW JCL TO PRINT FTS PROFILE                          
//* BP135340 LSB 190514 - CHG CY67 TO CY5D                                      
//* BP135351 LSB 020614 - BP13.K716.DPREQ749.A50D                               
//* BP136005 LSB 021115 - JOB RUN FOR 2-ROOM FLEXI INSTEAD FTS                  
//* BP136262 LSB 170516 - REMOVE PPS, RUN ALL CASES FOR BP13CZ26                
//* BP137358 FNP 300518 - EXPAND BP13F55A FROM 800 TO 1200                      
//* BP138417 KR13 301120 - F55A RDB-HDB-REF COL 671                             
//* BP138565 KR13 280121 - ADD FT=1F                                            
//* BP139220 KR13 070622 - F55A RDB-HDB-REF COL 255                             
//*********************************************************************         
//*---------------------------------------------------------------------05130004
//* SORT RDBINFO FILE INTO SEQUENTIAL FILE                              05140004
//*---------------------------------------------------------------------05150004
//STEP0A  EXEC SORT,COND=(0,NE)                                         05160004
//SORTIN   DD DSN=BP13.BLANK.CHAR350,DISP=SHR                           05170004
//         DD DSN=BP13.F716.DPREQ749.ACCUM,DISP=SHR                             
//SORTOUT  DD DSN=&&F716F749,DISP=(,PASS),                              05190004
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=350),                          05200004
//        SPACE=(CYL,(10,12),RLSE)                                      05210004
//SYSIN   DD *                                                          05220004
     SORT FIELDS=(1,17,A),FORMAT=CH                                     05230004
     OMIT COND=(1,8,CH,LT,C'3020932Z',OR,                                       
                1,1,CH,EQ,C'5',OR,                                              
                1,1,CH,EQ,C'6')                                                 
     SUM FIELDS=NONE                                                    05240004
//*-------------------------------------------------------------------- 05250004
//*  DELETE/DEFINE BP13.K716.DPREQ749                                   05260004
//*-------------------------------------------------------------------- 05270004
//STEP0B    EXEC PGM=IDCAMS,COND=(0,NE)                                 05280004
//SYSPRINT  DD SYSOUT=*                                                 05290004
//INPUT1   DD DSN=&&F716F749,DISP=(OLD,PASS)                            05300004
//SYSIN     DD  *                                                       05310004
          DEL 'BP13.K716.DPREQ749.A50D' CL PURGE                        05340004
          DEF CLUSTER                                -                  05330004
              (NAME(BP13.K716.DPREQ749.A50D)         -                  05340004
              CYL(60 20)                           -                    05350004
              DATACLAS(MULTIVOL)                     -                  05360004
              STORCLAS(PRODRLS)                      -                  05370004
              LOG(NONE)                              -                  05380004
              SPEED                                  -                  05390004
              UNIQUE                                 -                  05400004
              SHR(2 3))                              -                  05410004
              DATA                                   -                  05420004
              (NAME(BP13.K716.DPREQ749.A50D.DATA)    -                  05430004
              KEYS(17 0)                             -                  05440004
              RECSZ(350 350)                         -                  05450004
              CISZ(4096)                             -                  05460004
              FSPC(10 10))                           -                  05470004
              INDEX                                  -                  05480004
              (NAME(BP13.K716.DPREQ749.A50D.INDEX)   -                  05490004
              CISZ(4096))                                               05500004
      IF MAXCC = 0  THEN                             -                  05510004
         REPRO IFILE(INPUT1)                         -                  05520004
              ODS(BP13.K716.DPREQ749.A50D)                              05530004
      IF MAXCC = 0  THEN                             -                  05540004
           DEF AIX (NAME(BP13.K716.DPREQ749.A50D.ALTX1) -               05550004
               REL(BP13.K716.DPREQ749.A50D)          -                  05560004
               REUSE                                 -                  05570004
               KEYS(9 8)                             -                  05580004
               SHR(2 3)                              -                  05590004
               NUNQK)                                -                  05600004
               DATA                                  -                  05610004
               (NAME(BP13.K716.DPREQ749.A50D.ALTX1.DATA) -              05620004
               CYL(8 3)                          -                      05630004
               RECSZ(31 354)                         -                  05640004
               FSPC(10 10)                           -                  05650004
               CISZ(4096))                           -                  05660004
               INDEX                                 -                  05670004
               (NAME(BP13.K716.DPREQ749.A50D.ALTX1.INDEX) -             05680004
               CISZ(4096))                                              05690004
         IF MAXCC = 0 THEN                           -                  05700004
           DEF PATH (NAME(BP13.K716.DPREQ749.A50D.PATH1) -              05710004
               PENT(BP13.K716.DPREQ749.A50D.ALTX1))                     05720004
         IF MAXCC = 0 THEN                                              05730004
           BIX IDS(BP13.K716.DPREQ749.A50D)          -                  05740004
               ODS(BP13.K716.DPREQ749.A50D.ALTX1)                       05750004
//*---------------------------------------------------------------------        
//* SORT OUT 2-ROOM FLEXI                                                       
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F55A.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&F55ACK20,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=1200),                                           
//         SPACE=(CYL,(80,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(9,2,CH,EQ,C'1F',OR,                                             
                9,2,CH,EQ,C'2F')                                                
//*--------------------------------------------------------------------*        
//* READ BP13K716                                                               
//* RDB ROLE 023(LESSEE), 024(CO-LESSEE) 025(OCCUPIER)                          
//* RDB ROLE 003(TENANT), 004(TANANT-OC)                                        
//*--------------------------------------------------------------------*        
//STEP02   EXEC PGM=BP13CK20,COND=(0,NE)                                        
//BP13F55A DD DSN=&&F55ACK20,DISP=(OLD,PASS)                                    
//BP13K716 DD DSN=BP13.K716.DPREQ749.A50D,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F55AA DD DSN=&&F55AK716,DISP=(,PASS),                                      
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=1200),                                            
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT BY NRIC1 IN BP13F55A                                                   
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F55AK716,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F55ANRIC,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=1200),                                           
//         SPACE=(CYL,(80,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(23,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* SORT SUBLET SYSTEM NRIC FILE                                                
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BR12.M100.FV07.SBTNT.MTHLY(0),DISP=SHR                        
//SORTOUT  DD DSN=&&BR12FV07,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=300),                                            
//         SPACE=(CYL,(100,50),RLSE)                                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(13,20,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* MATCH IF NRIC FOUND IN SUBLET SYSTEM, GET SUBLET-REF-NO                     
//* GET SUBLET-FLAT, SUBLET-ROOM                                                
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13CK21,COND=(0,NE)                                00180005
//BP13F55A DD DSN=&&F55ANRIC,DISP=(OLD,PASS)                            00190005
//BR12FV07 DD DSN=&&BR12FV07,DISP=(OLD,PASS)                            00190005
//BP13OUT  DD DSN=&&F55ACK21,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=1200),                                           
//         SPACE=(CYL,(80,30),RLSE)                                             
//SYSPRINT DD SYSOUT=*                                                  00270003
//SYSDBG   DD SYSOUT=*                                                  00280003
//SYSDBOUT DD SYSOUT=*                                                  00290003
//SYSOUT   DD SYSOUT=*                                                  00300005
//*---------------------------------------------------------------------        
//* SORT BY SUBLET REF-NO TO GET SCH-ACC-NO OF SUBLET FLAT                      
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F55ACK21,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F55AREF,DISP=(,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=1200),                                           
//         SPACE=(CYL,(80,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(255,12,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* SORT SUBLET MASTER BY SUBLET REF-NO                                         
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BR12.M100.FV05.SUBLET.MTHLY(0),DISP=SHR                       
//SORTOUT  DD DSN=&&BR12FV05,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=1200),                                           
//         SPACE=(CYL,(250,10),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(12,12,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MATCH BY SUBLET REF-NO TO GET SCH-ACC-NO OF SUBLET FLAT                     
//* BP13K80A - GET SUBLET NT                                                    
//* IF NOT FOPUN IN SUBLET, READ SOC ADDRESS FILE                               
//* READ BP13K830 - FROM RESEDENTIAL, GET HDB OR PPO ADDR                       
//* READ BM06K130 - FROM POSTAL CODE, GET NT, SOLD,RENTAL,MIXED BLOCK           
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13CK22,COND=(0,NE)                                00180005
//BP13F55A DD DSN=&&F55AREF,DISP=(OLD,PASS)                             00190005
//BR12FV05 DD DSN=&&BR12FV05,DISP=(OLD,PASS)                            00190005
//BP13K80A DD DSN=BP13.K80A.FLATINFO,DISP=SHR,                          00190005
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K130 DD DSN=BM06.K130.POST,DISP=SHR,                                      
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13OUT  DD DSN=&&F55ACK22,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=1200),                                           
//         SPACE=(CYL,(80,30),RLSE)                                             
//SYSPRINT DD SYSOUT=*                                                  00270003
//SYSDBG   DD SYSOUT=*                                                  00280003
//SYSDBOUT DD SYSOUT=*                                                  00290003
//SYSOUT   DD SYSOUT=*                                                  00300005
//*--------------------------------------------------------------------*        
//* PIDB - GET UNIT DATA                                                        
//*--------------------------------------------------------------------*        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BC16.FD11.MTH.PIDBINTR.TAPE(0),DISP=SHR                       
//SORTOUT  DD DSN=&&BC16FD11,DISP=(,PASS),                                      
//         LRECL=32,RECFM=FB,DSORG=PS,DATACLAS=MULTIVOL,                        
//         SPACE=(1,(100,5),RLSE),AVGREC=M,BLKSIZE=0                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,9,CH,A)                                                       
   INCLUDE COND=(191,1,CH,EQ,C'A',AND,208,1,CH,EQ,C'A',AND,                     
                 248,1,CH,EQ,C'A',AND,245,1,CH,EQ,C'1',AND,                     
                 263,1,CH,EQ,C'S')                                              
   OUTREC FIELDS=(1,18,217,9,19,5)                                              
   SUM FIELDS=NONE                                                              
/*                                                                              
//*--------------------------------------------------------------------*        
//* PIDB - GET AREA COMPONENT FILE                                              
//*--------------------------------------------------------------------*        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BC16.FD02.MTH.AREACMPT.TAPE(0),DISP=SHR                       
//SORTOUT  DD DSN=&&BC16FD02,DISP=(,PASS),                                      
//         LRECL=18,RECFM=FB,DSORG=PS,DATACLAS=MULTIVOL,                        
//         SPACE=(1,(100,5),RLSE),AVGREC=M,BLKSIZE=0                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,9,CH,A)                                                       
   INCLUDE COND=(10,1,CH,EQ,C'Q')                                               
   OUTREC FIELDS=(1,9,28,9)                                                     
   SUM FIELDS=NONE                                                              
/*                                                                              
//*--------------------------------------------------------------------*        
//* PIDB - HET BUILDING FILE                                                    
//*--------------------------------------------------------------------*        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BC16.FD06.MTH.BLDGWORK.TAPE(0),DISP=SHR                       
//SORTOUT  DD DSN=&&BC16FD06,DISP=(,PASS),                                      
//         LRECL=15,RECFM=FB,DSORG=PS,DATACLAS=MULTIVOL,                        
//         SPACE=(1,(100,5),RLSE),AVGREC=M,BLKSIZE=0                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,CH,A)                                                       
   INCLUDE COND=(6,15,CH,EQ,C'FIRST HAND-OVER')                                 
   OUTREC FIELDS=(1,5,21,10)                                                    
   SUM FIELDS=NONE                                                              
/*                                                                              
//*--------------------------------------------------------------------*        
//* PROGRAM TO GET PIDB SCH-ACC-NO, NET FLOOR AREA, HANDOVER DATE               
//*--------------------------------------------------------------------*        
//STEP13   EXEC SAS,OPTIONS='MACRO',COND=(0,NE)                                 
//BC16FD11 DD DSN=&&BC16FD11,DISP=(OLD,PASS)                                    
//BC16FD02 DD DSN=&&BC16FD02,DISP=(OLD,PASS)                                    
//BC16FD06 DD DSN=&&BC16FD06,DISP=(OLD,PASS)                                    
//BC16OUT  DD DSN=&&BC16OUT,DISP=(,PASS),                                       
//         LRECL=37,RECFM=FB,DSORG=PS,DATACLAS=MULTIVOL,                        
//         SPACE=(1,(20,10),RLSE),AVGREC=M,BLKSIZE=0                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S527),DISP=SHR                             
//*------------------------------------------------------------------           
//* SORT BY SCH-ACC-NO                                                          
//*------------------------------------------------------------------           
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=&&BC16OUT,DISP=(OLD,PASS)                                      
//SORTOUT DD DSN=&&BC16AREA,DISP=(,PASS),                                       
//        DCB=(RECFM=FB,LRECL=37),                                              
//        SPACE=(CYL,(20,10),RLSE)                                              
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,9,A),FORMAT=CH                                                
//*-------------------------------------------------------------------*         
//* SORT BY RDB-SCH-ACC-NO                                                      
//*------------------------------------------------------------------           
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=&&F55ACK22,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=&&F55APIDB,DISP=(,PASS),                                       
//        DCB=(RECFM=FB,LRECL=1200),                                            
//        SPACE=(CYL,(10,10),RLSE)                                              
//SYSIN   DD  *                                                                 
   SORT FIELDS=(255,9,A),FORMAT=CH                                              
//*-------------------------------------------------------------------*         
//* MATCH PIDB FLOOR AREA TO SOC BP13F55A                                       
//*-------------------------------------------------------------------*         
//STEP016  EXEC PGM=BP13CK23,COND=(0,NE)                                        
//BP13F55A DD DSN=&&F55APIDB,DISP=(OLD,PASS)                                    
//BC164488 DD DSN=&&BC16AREA,DISP=(OLD,PASS)                                    
//BP13OUT  DD DSN=&&F55ACK23,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=1200),                                           
//         SPACE=(CYL,(80,10),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REGN-NO                                                                
//*---------------------------------------------------------------------        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F55ACK23,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F55ACY5D,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1200),                                
//         SPACE=(CYL,(80,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* FORMAT ADD IN HEADER FOR MPU, FTS REPORT WITH RDB, SUBLET, PIDB             
//*-----------------------------------------------------------------            
//STEP18   EXEC PGM=BP13CY5D,COND=(0,NE)                                        
//BP13F55A DD DSN=&&F55ACY5D,DISP=(OLD,DELETE)                                  
//BP13L55A DD DSN=BP13.L55A.APPLN.FTS,DISP=OLD                                  
//BP13L55B DD DSN=BP13.L55A.APPLN.FTS.NEW,DISP=OLD                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT IN BP13K515 KEY ORDER                                                  
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.BE01.F515.MHAMTH,DISP=SHR                               
//         DD  DSN=BP13.BE01.F515.MHAMTH.BACKUP(0),DISP=SHR                     
//SORTOUT  DD  DSN=&&BP13F515,DISP=(,PASS),                                     
//             UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                             
//             DCB=(RECFM=FB,LRECL=580)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(11,9,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* DEFINE DATA RETURN FROM MHA/CDB                                             
//*-----------------------------------------------------------------            
//STEP19 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT    DD  DSN=&&BP13F515,DISP=(OLD,PASS)                                   
//SYSIN    DD  *                                                                
  DEL 'BP13.K515.MHADATA' CL PURGE                                              
  DEF CLUSTER                                          -                        
        (NAME(BP13.K515.MHADATA)                       -                        
        SHR(2,3)                                       -                        
        KEYS(9 10)                                     -                        
        CYL(30 10)                                    -                         
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        SPEED                                          -                        
        RECSZ(580 580)                                 -                        
        FREESPACE(10 10)                               -                        
        CISZ(4096)                                     -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K515.MHADATA.DATA))                 -                        
      INDEX                                            -                        
        (NAME(BP13.K515.MHADATA.INDEX))                                         
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K515.MHADATA)                                            
//*---------------------------------------------------------------------        
//* RUN FOR ALL APPLICATIONS                                                    
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR                               
//SORTOUT  DD DSN=&&F730PPS,DISP=(,PASS),                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(30,20),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*------------------------------------------------------------------           
//* COMPUTE YEAR-OBTAIN CTIZEN AND YOUNGEST-CHILD AGE                           
//*------------------------------------------------------------------           
//STEP21   EXEC PGM=BP13CZ26,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730PPS,DISP=(OLD,PASS)                                     
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K515 DD DSN=BP13.K515.MHADATA,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13F595 DD DSN=&&F595CZ26,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(30,10),RLSE)                                          
//BP13LZ26 DD DSN=BP13.LZ26.BP13CZ26,DISP=OLD                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT BTO/SBF PPS APPLICATION AGE/YEAR-OBTAIN CITIZENSHIP                   
//*-----------------------------------------------------------------            
//STEP22   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F730 DD DSN=&&F595CZ26,DISP=(OLD,PASS)                                    
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13L055 DD DSN=BP13.L055.BP13S055,DISP=OLD                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S055),DISP=SHR                             
