//BP13A540 JOB (BP13P),'BP13A540',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//       NOTIFY=CSD0071,TYPRUN=HOLD                                     00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//*=================================================================    00040000
//* CHG REF  DATE     BY   DESCRIPTION                                  00050000
//* -------- -------- ---  -----------                                  00060000
//* BP130652 19990824 NOR  EXPAND F520,K740,K740 RECL 300 TO 500        00070000
//* BP130778 19991215 YCH  TO INCLUDE BP13F713.PIGEON.PA                00080000
//* BP130871 20000609 SSS  LISTING FOR EAALSS                           00090000
//* BP130897 20000807 AKT  EXPAND F558 RECL FROM 400 TO 600             00100000
//* BP132283 20021226 ANC1 ADD STEPS TO DETERMINE LOAN TAG & PREM CDE   00110000
//* BP132352 20030625 SK   ADD BP13C145,BP13C144                        00120000
//* BP132384 20030731 ANC1 ADD STEPS TO CAPTURE EXISTING/EX-DP FLATS    00130000
//* BP132432 20031021 MJ16 REMOVE PROCESSING OF NON BANK LOAN CASES     00140000
//* BP132451 20031202 SK   ADD BP13L520 FOR BP13C520                    00150000
//* BP132496 20040412 CKK  ADD STEPS TO UPDATE JB-REF TO JB-REGN        00160000
//* BP132555 20040719 CKK  REMOVE CLASS 2 FROM BP13C754 SYSOUT          00170000
//* BP132618 20000104 ROM1 READ BP04.K010 INSTEAD OF BP04.F010          00180000
//* BP132862 20060615 CKK7 INCLUDE BP13K648 IN BP13C528                 00190000
//* BP133527 20090331 YCH2 INCLUDE UPDATE OF RESALE LEVY 'LN' OR 'LNS'  00200000
//* BP133639 20090708 ZDD1 INCLUDE BP13K595 ON BP13C145                 00210000
//*                        INCLUDE ALTERNATE FILE OF BP13K595           00220000
//*          20090908 ZDD1 INCLUDE BP13K730 ON BP13C145                 00221000
//* BP134024 20100930 ZDD1 INCLUDE BP13K813 ON BP13C528                 00222000
//* BP135171 20140210 RJE1 TO CATER FOR DB2 UPGRADE                     00226000
//*=================================================================    00230000
//*- TO LOAD BALLOTED RECORD TO SOC MASTER / SOC OCCUP FILE             00240000
//*-----------------------------------------------------------------    00250000
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                            00260000
//*  PRT01                                                              00270000
//*-----------------------------------------------------------------    00280000
//PRT01    EXEC PGM=IEBGENER                                            00290000
//SYSUT1   DD *                                                         00300000
$DJDE$ JDE=BP13D,JDL=BP13,END;                                          00310000
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                           00320000
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00330000
//SYSPRINT DD SYSOUT=*                                                  00340000
//SYSIN    DD DUMMY                                                     00350000
//*-----------------------------------------------------------------    00360000
//*- BACKUP SOC MASTER                                                  00370000
//*-----------------------------------------------------------------    00380000
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                  00390000
//SYSPRINT DD SYSOUT=*                                                  00400000
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=SHR,                             00410000
//            AMP=('BUFND=13')                                          00420000
//OUTPUT1  DD DSN=BP13.F800.APPLN,DISP=OLD                              00430000
//SYSIN    DD  *                                                        00440000
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                               00450000
//*-----------------------------------------------------------------    00460000
//* SORT THE REGN NO ORDER                                              00470000
//*-----------------------------------------------------------------    00480000
//STEP02   EXEC SORT,COND=(0,NE)                                        00490000
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                            00500000
//            AMP=('BUFND=22')                                          00510000
//SORTOUT  DD DSN=&&BP13F520,DISP=(NEW,PASS),                           00520000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   00530000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       00540000
//SYSIN DD *                                                            00550000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      00560000
   OMIT    COND=(226,3,CH,EQ,C'   ')                                    00570000
//*---------------------------------------------------------------------00580000
//* OUTPUT LESSEE-CHECK = 'Y'                                           00590000
//*---------------------------------------------------------------------00600000
//STEP03   EXEC SORT,COND=(0,NE)                                        00610000
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                           00620000
//            AMP=('BUFND=23')                                          00630000
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                           00640000
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                       00650000
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                        00660000
//SYSIN    DD *                                                         00670000
  SORT FIELDS=(1,8,A),FORMAT=CH                                         00680000
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                       00690000
  OUTREC FIELDS=(1,200,200X)                                            00700000
/*                                                                      00710000
//*---------------------------------------------------------------------00720000
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY   00730000
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                 00740000
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"         00750000
//*---------------------------------------------------------------------00760000
//STEP04   EXEC PGM=BP13C577,COND=(0,NE)                                00770000
//BP13F500 DD DSN=&&BP13F520,DISP=(OLD,PASS)                            00780000
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,PASS)                            00790000
//BP13F558 DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   00800000
//SYSDBG   DD SYSOUT=*                                                  00810000
//SYSDBOUT DD SYSOUT=*                                                  00820000
//SYSOUT   DD SYSOUT=*                                                  00830000
//*                                                                     00840000
//*---------------------------------------------------------------------00850000
//* SORT BY NRIC SEQUENCE                                               00860000
//*---------------------------------------------------------------------00870000
//STEP05   EXEC SORT,COND=(0,NE)                                        00880000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   00890000
//SORTOUT  DD DSN=&&P13F558B,DISP=(NEW,PASS),                           00900000
//            DCB=(BLKSIZE=27600,LRECL=600,RECFM=FB),                   00910000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      00920000
//SYSIN    DD *                                                         00930000
   SORT FIELDS=(9,9,A),FORMAT=CH                                        00940000
//*---------------------------------------------------------------------00950000
//* BASED ON THE NRIC IN REQUEST, SOC-OCCUPIER FILE                     00960000
//* MATCH NRIC IN SMS FILE, IF MATCH UPDATE AS UPGRADER                 00970000
//*---------------------------------------------------------------------00980000
//STEP06   EXEC PGM=BP13U706,COND=(0,NE)                                00990000
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                    01000000
//BP13F558 DD DSN=&&P13F558B,DISP=(OLD,PASS)                            01010000
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                          01020000
//            AMP=('BUFND=8','BUFNI=4')                                 01030000
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                            01040000
//            AMP=('BUFND=8','BUFNI=4')                                 01050000
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                             01060000
//            AMP=('BUFND=8','BUFNI=4')                                 01070000
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                          01080000
//            AMP=('BUFND=8','BUFNI=4')                                 01090000
//P13F558O DD DSN=&&P13F558C,DISP=(NEW,PASS),                           01100000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01110000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01120000
//BP13F559 DD DUMMY                                                     01130000
//BP13L706 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          01140000
//SYSPRINT DD SYSOUT=*                                                  01150000
//SYSDBG   DD SYSOUT=*                                                  01160000
//SYSDBOUT DD SYSOUT=*                                                  01170000
//SYSOUT   DD SYSOUT=*                                                  01180000
//*-----------------------------------------------------------------    01190000
//* MATCH NRIC WITH TRANSFER HISTORY ONLY FOR TRF-APPLN-DTE  AFTER      01200000
//* '19970901' OR FOR DIVORCE CASES TRF-APPLN-DATE > 19970709           01210000
//* AND TRF-SCH-ACC IS NOT THE SAME AS SMS-SCH-ACC                      01220000
//* AS ONE NRIC TRANSFER, ALL FOUR LESSEE WILL BE FOUND IN TRANSFER     01230000
//* BP13.F558.UPGOCCP CONTAINS TRANSFER HISTORY DATA                    01240000
//*-----------------------------------------------------------------    01250000
//STEP07   EXEC PGM=BP13C619,COND=(0,NE)                                01260000
//BB13K510 DD DSN=BB13.K510.UINHIST,DISP=SHR,                           01270000
//            AMP=('BUFND=4','BUFNI=8')                                 01280000
//BB13K500 DD DSN=BB13.K500.HISTORY,DISP=SHR,                           01290000
//            AMP=('BUFND=4','BUFNI=8')                                 01300000
//BP13F558 DD DSN=&&P13F558C,DISP=(OLD,PASS)                            01310000
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   01320000
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          01330000
//SYSPRINT DD SYSOUT=*                                                  01340000
//SYSDBG   DD SYSOUT=*                                                  01350000
//SYSDBOUT DD SYSOUT=*                                                  01360000
//SYSABOUT DD SYSOUT=*                                                  01370000
//SYSIN    DD *                                                         01380000
/*                                                                      01390000
//*---------------------------------------------------------------------01400000
//* SORT IN SCH-ACC-NI ORDER FOR RETRIEVING FLAT TYPE FROM PBF          01410000
//*---------------------------------------------------------------------01420000
//STEP08   EXEC SORT,COND=(0,NE)                                        01430000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   01440000
//SORTOUT  DD DSN=&&F558SORT,DISP=(NEW,PASS),                           01450000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01460000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01470000
//SYSIN     DD  *                                                       01480000
   SORT FIELDS=(101,11,A),FORMAT=CH                                     01490000
//*---------------------------------------------------------------------01500000
//* FLAT TYPE  IS NOT AVAILABLE IN SMS                                  01510000
//* BASED ON THE SCHEME ACCOUNT FR SMS EXTRACT FLAT TYPE FROM PBF       01520000
//*---------------------------------------------------------------------01530000
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       01540000
//BP13F558 DD DSN=&&F558SORT,DISP=(OLD,PASS)                            01550000
//BP13OUT  DD DSN=&&F558PBF,DISP=(NEW,PASS),                            01560000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01570000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01580000
//SYSTSPRT DD SYSOUT=*                                                  01590000
//SYSPRINT DD SYSOUT=*                                                  01600000
//SYSUDUMP DD SYSOUT=*                                                  01610000
//SYSOUT   DD SYSOUT=*                                                  01620000
//SYSDBOUT DD SYSOUT=*                                                  01630000
//SYSTSIN  DD *                                                         01640000
  DSN SYSTEM(DSN)                                                       01650000
  RUN PROGRAM(BP13C742) PLAN(BP13PCC) -                                 01660000
      LIB('BP13.BATCH.LOADCOB')                                         01670000
  END                                                                   01680000
/*                                                                      01690000
//*---------------------------------------------------------------------01700000
//* SORT OUT BP13F558 IN NRIC ORDER, IF ONE NRIC WITH MULTIPLE SMS REC  01710000
//* PROGRAM WILL SELECT THE BIGGER FLAT TYPE                            01720000
//*---------------------------------------------------------------------01730000
//STEP10   EXEC SORT,COND=(0,NE)                                        01740000
//SORTIN   DD DSN=&&F558PBF,DISP=(OLD,PASS)                             01750000
//SORTOUT  DD DSN=&&F558SMSF,DISP=(NEW,PASS),                           01760000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01770000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01780000
//SYSIN    DD  *                                                        01790000
   SORT FIELDS=(1,17,A),FORMAT=CH                                       01800000
//*---------------------------------------------------------------------01810000
//* SELECT THE LEAST PRIORITY IF FOUND TO HAVE MULTIPLE SMS RECORDS     01820000
//* SELECT BIGGER FLAT TYPE, DIRENT PURCHASE OVER OPEN MARKET           01830000
//*---------------------------------------------------------------------01840000
//STEP11   EXEC PGM=BP13C734,COND=(0,NE)                                01850000
//BP13F558 DD DSN=&&F558SMSF,DISP=(OLD,PASS)                            01860000
//P13F558A DD DSN=&&F558FLAT,DISP=(NEW,PASS),                           01870000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01880000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01890000
//SYSPRINT DD SYSOUT=*                                                  01900000
//SYSDBG   DD SYSOUT=*                                                  01910000
//SYSDBOUT DD SYSOUT=*                                                  01920000
//SYSOUT   DD SYSOUT=*                                                  01930000
//*---------------------------------------------------------------------01940000
//* SORT OUT BY NRIC SEQUENCE                                           01950000
//*---------------------------------------------------------------------01960000
//STEP12   EXEC SORT,COND=(0,NE)                                        01970000
//SORTIN   DD DSN=&&F558FLAT,DISP=(OLD,PASS)                            01980000
//SORTOUT  DD DSN=&&F558RESL,DISP=(NEW,PASS),                           01990000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   02000000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      02010000
//SYSIN    DD  *                                                        02020000
   SORT FIELDS=(9,9,A),FORMAT=CH                                        02030000
//*---------------------------------------------------------------------02040000
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                    02050000
//* MATCH NRIC IN RESALE FILE, IF MATCH UPDATE AS UPGRADER              02060000
//*---------------------------------------------------------------------02070000
//STEP13   EXEC PGM=BP13U702,COND=(0,NE)                                02080000
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                    02090000
//BP13F558 DD DSN=&&F558RESL,DISP=(OLD,PASS)                            02100000
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                          02110000
//            AMP=('BUFND=8','BUFNI=4')                                 02120000
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                           02130000
//            AMP=('BUFND=8','BUFNI=4')                                 02140000
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   02150000
//BP13L702 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          02160000
//SYSPRINT DD SYSOUT=*                                                  02170000
//SYSDBG   DD SYSOUT=*                                                  02180000
//SYSDBOUT DD SYSOUT=*                                                  02190000
//SYSOUT   DD SYSOUT=*                                                  02200000
//*---------------------------------------------------------------------02210000
//* SORT REQUEST OCCUPIER BY NRIC                                       02220000
//*---------------------------------------------------------------------02230000
//STEP14A  EXEC SORT,COND=(0,NE)                                        02240000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   02250000
//SORTOUT  DD DSN=&&F558NRIC,DISP=(NEW,PASS),                           02260000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                     02270000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                    02280000
//SYSIN    DD  *                                                        02290000
      SORT FIELDS=(9,9,A),FORMAT=CH                                     02300000
//*---------------------------------------------------------------------02310000
//* SORT DEBARMENT FILE BY PRIMARY KEY                                  02320000
//*---------------------------------------------------------------------02330000
//STEP14B  EXEC SORT,COND=(0,NE)                                        02340000
//SORTIN   DD DSN=BP04.K010.DEBAR,DISP=SHR,                             02350000
//            AMP=('BUFND=8','BUFNI=4')                                 02360000
//SORTOUT  DD DSN=&&BP04K010,DISP=(NEW,PASS),                           02370000
//            UNIT=(SYSDA,2),SPACE=(CYL,(1000,150),RLSE),               02380000
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                    02390000
//SYSIN    DD  *                                                        02400000
      SORT FIELDS=(1,44,A),FORMAT=CH                                    02410000
//*---------------------------------------------------------------------02420000
//* MATCH SOC OCCUPIER REC WITH DEBARMENT REC FD IN                     02430000
//*---------------------------------------------------------------------02440000
//STEP15   EXEC PGM=BP13C690,COND=(0,NE)                                02450000
//BP13F558 DD DSN=&&F558NRIC,DISP=(OLD,PASS)                            02460000
//P04K010  DD DSN=&&BP04K010,DISP=(OLD,PASS)                            02470000
//P13F558A DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   02480000
//P13F558B DD DUMMY                                                     02490000
//P13F558C DD DUMMY                                                     02500000
//P13F558D DD DUMMY                                                     02510000
//P13F558E DD DUMMY                                                     02520000
//SYSPRINT DD SYSOUT=*                                                  02530000
//SYSDBG   DD SYSOUT=*                                                  02540000
//SYSDBOUT DD SYSOUT=*                                                  02550000
//SYSOUT   DD SYSOUT=*                                                  02560000
/*                                                                      02570000
//*-----------------------------------------------------------------    02580000
//* SORT BY REGN NO                                                     02590000
//*-----------------------------------------------------------------    02600000
//STEP16   EXEC SORT,COND=(0,NE)                                        02610000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   02620000
//SORTOUT  DD DSN=&&BP13F558,DISP=(NEW,PASS),                           02630000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                     02640000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                    02650000
//SYSIN    DD  *                                                        02660000
    SORT FIELDS=(1,17,A),FORMAT=CH                                      02670000
//*=====================================================================02680000
//* RDB INFO                                                            02690000
//*=====================================================================02700000
//*---------------------------------------------------------------------02710000
//* SPLIT F558 FILE FROM THE OUTPUT OF DETERMINE THE HOUSEHOLD TYPE     02720000
//* IF - HHTYPE='G' OR '3' OR                                           02730000
//*      (HHTYPE='H' AND FILE-STATUS-SMS OR FILE-STATUS-RSL = 'OM')     02740000
//*          OUTPUT TO BP13F716                                         02750000
//* ELSE                                                                02760000
//*      OUTPUT TO BP13F716 TO CHECK RDB                                02770000
//*---------------------------------------------------------------------02780000
//* 1)  P13F716A - TO FURTHER CHECK WITH RDB                            02790000
//* 2)  BP13F716 - INFO ALREADY FOUND IN SMS & RESALE                   02800000
//*---------------------------------------------------------------------02810000
//STEP16A  EXEC PGM=BP13C788,COND=(0,NE)                                02820000
//BP13F558 DD DSN=&&BP13F558,DISP=(OLD,PASS)                            02830000
//P13F716A DD DSN=&&P13F716A,DISP=(NEW,PASS),                           02840000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                   02850000
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                       02860000
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                           02870000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                   02880000
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                       02890000
//SYSPRINT DD SYSOUT=*                                                  02900000
//SYSDBG   DD SYSOUT=*                                                  02910000
//SYSDBOUT DD SYSOUT=*                                                  02920000
//SYSOUT   DD SYSOUT=*                                                  02930000
//*---------------------------------------------------------------------02940000
//* SORT OUT IN NRIC SEQUENCE                                           02950000
//*---------------------------------------------------------------------02960000
//STEP16B  EXEC SORT,COND=(0,NE)                                        02970000
//SORTIN   DD DSN=&&P13F716A,DISP=(OLD,PASS)                            02980000
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                           02990000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03000000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03010000
//SYSIN    DD *                                                         03020000
   SORT FIELDS=(9,9,A),FORMAT=CH                                        03030000
//*---------------------------------------------------------------------03040000
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                     03050000
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED       03060000
//*---------------------------------------------------------------------03070000
//STEP16C  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                    03080000
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                            03090000
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                            03100000
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                           03110000
//P13F716A DD DSN=&&F716Q748,DISP=(NEW,PASS),                           03120000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03130000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03140000
//SYSPRINT DD SYSOUT=*                                                  03150000
//SYSTSPRT DD SYSOUT=*                                                  03160000
//SYSOUT   DD SYSOUT=*                                                  03170000
//SYSDBOUT DD SYSOUT=*                                                  03180000
//SYSABOUT DD SYSOUT=*                                                  03190000
//SYSTSIN DD *                                                          03200000
 DSN SYSTEM(DSN)                                                        03210000
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                 03220000
      LIB('BP13.BATCH.LOADCOB')                                         03230000
 END                                                                    03240000
/*                                                                      03250000
//*---------------------------------------------------------------------03260000
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                            03270000
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                03280000
//*---------------------------------------------------------------------03290000
//STEP16D  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       03300000
//BP13F716 DD DSN=&&F716Q748,DISP=(OLD,PASS)                            03310000
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                             03320000
//BP13OUT  DD DSN=&&F716C754,DISP=(NEW,PASS),                           03330000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03340000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03350000
//SYSTSPRT DD SYSOUT=*                                                  03360000
//SYSPRINT DD SYSOUT=*                                                  03370000
//SYSUDUMP DD SYSOUT=*                                                  03380000
//SYSOUT   DD SYSOUT=*                                                  03390000
//SYSDBOUT DD SYSOUT=*                                                  03400000
//SYSTSIN  DD *                                                         03410000
  DSN SYSTEM(DSN)                                                       03420000
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                 03430000
      LIB('BP13.BATCH.LOADCOB')                                         03440000
  END                                                                   03450000
/*                                                                      03460000
//*---------------------------------------------------------------------03470000
//* SORT OUT IN REGN NO SEQUENCE                                        03480000
//*---------------------------------------------------------------------03490000
//STEP16E  EXEC SORT,COND=(0,NE)                                        03500000
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                            03510000
//         DD DSN=&&F716C754,DISP=(OLD,PASS)                            03520000
//SORTOUT  DD DSN=&&F716REGN,DISP=(NEW,PASS),                           03530000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03540000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03550000
//SYSIN    DD *                                                         03560000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        03570000
//*---------------------------------------------------------------------03580000
//*  TO DETERMINE SMS FT/STATUS, RSL FT/STATUS, RDB FT/STATUS           03590000
//*---------------------------------------------------------------------03600000
//STEP16F   EXEC PGM=BP13C519,COND=(0,NE)                               03610000
//BP13F716  DD DSN=&&F716REGN,DISP=(OLD,PASS)                           03620000
//BP13F520  DD DSN=&&BP13F520,DISP=(OLD,PASS)                           03630000
//P13F520A  DD DSN=&&F520C519,DISP=(NEW,PASS),                          03640000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   03650000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       03660000
//SYSPRINT  DD SYSOUT=*                                                 03670000
//SYSDBG    DD SYSOUT=*                                                 03680000
//SYSDBOUT  DD SYSOUT=*                                                 03690000
//SYSOUT    DD SYSOUT=*                                                 03700000
//*                                                                     03710000
//*-----------------------------------------------------------------    03720000
//* SORT THE REGN NO ORDER                                              03730000
//*-----------------------------------------------------------------    03740000
//STEP16G  EXEC SORT,COND=(0,NE)                                        03750000
//SORTIN   DD DSN=&&F520C519,DISP=(OLD,PASS)                            03760000
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                           03770000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   03780000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       03790000
//SYSIN DD *                                                            03800000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      03810000
//*---------------------------------------------------------------------03820000
//*  TO DETERMINE LOAN TAG & PREMIUM CODE                               03830000
//*---------------------------------------------------------------------03840000
//STEP17    EXEC PGM=BP13C520,COND=(0,NE)                               03850000
//BP13F520  DD DSN=&&F520SORT,DISP=(OLD,PASS)                           03860000
//BP13F558  DD DSN=&&BP13F558,DISP=(OLD,PASS)                           03870000
//BR10K010  DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                          03880000
//             AMP=('BUFNI=8','BUFND=4')                                03890000
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                         03900000
//             AMP=('BUFNI=8','BUFND=4')                                03910000
//P13F520A  DD DSN=&&P13F520,DISP=(NEW,PASS),                           03920000
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                  03930000
//             UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                      03940000
//BP13L520  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                         03950000
//SYSPRINT  DD SYSOUT=*                                                 03960000
//SYSDBG    DD SYSOUT=*                                                 03970000
//SYSDBOUT  DD SYSOUT=*                                                 03980000
//SYSOUT    DD SYSOUT=*                                                 03990000
//*                                                                     04000000
//*-----------------------------------------------------------------    04010000
//* SORT F520 IN REGN NO ORDER                                          04020000
//*-----------------------------------------------------------------    04030000
//STEP18   EXEC SORT,COND=(0,NE)                                        04040000
//SORTIN   DD DSN=&&P13F520,DISP=(OLD,PASS)                             04050000
//SORTOUT  DD DSN=&&P13F520A,DISP=(NEW,PASS),                           04060000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   04070000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       04080000
//SYSIN DD *                                                            04090000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      04100000
//*---------------------------------------------------------------------04110000
//* TO EXTRACT THE SUCCESSFUL BALLOTED APPLICANT'S & OCCUPIER INFOR     04120000
//* TO UPDATE THE SOC MASTER AND SOC OCCUPIER FILE                      04130000
//* TO PASS RECORDS TO CFS FOR PRE-ELIGIBILITY CHECK                    04140000
//*---------------------------------------------------------------------04150000
//STEP19    EXEC PGM=BP13C528,COND=(0,NE)                               04160000
//BP13F800  DD DSN=&&BP13F800,DISP=(NEW,PASS),                          04170000
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                     04180000
//             UNIT=SYSDA,SPACE=(CYL,(40,20),RLSE)                      04190000
//BP13F520  DD DSN=&&P13F520A,DISP=(OLD,PASS)                           04200000
//BP13K530  DD DSN=BP13.K530.ISSUENO,DISP=SHR                           04210000
//BP13K825  DD DSN=BP13.K825.REQOCCP,DISP=SHR                           04220000
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                            04230000
//             AMP=('BUFNI=8','BUFND=4')                                04240000
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                            04250000
//             AMP=('BUFNI=8','BUFND=4')                                04260000
//BP13K840  DD DSN=BP13.K840.APPLHIST,DISP=SHR,                         04270000
//             AMP=('BUFNI=8','BUFND=4')                                04280000
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                         04290000
//             AMP=('BUFNI=8','BUFND=4')                                04300000
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR,                            04301000
//             AMP=('BUFNI=8','BUFND=4')                                04302000
//BP13F310  DD DSN=BP13.F310.APPOINT,DISP=MOD                           04310000
//SYSPRINT  DD SYSOUT=*                                                 04320000
//SYSDBG    DD SYSOUT=*                                                 04330000
//SYSDBOUT  DD SYSOUT=*                                                 04340000
//SYSOUT    DD SYSOUT=*                                                 04350000
//*-----------------------------------------------------------------    04360000
//* ASSIGNING RESISTRATION NUMBER TO OIC                                04370000
//*-----------------------------------------------------------------    04380000
//STEP19A  EXEC PGM=BP13C144,COND=(0,NE)                                04390000
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                            04400000
//BP13F520 DD DSN=&&P13F520A,DISP=(OLD,PASS)                            04410000
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                           04420000
//         AMP=('BUFNI=8','BUFND=4')                                    04430000
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                            04440000
//         AMP=('BUFNI=8','BUFND=4')                                    04450000
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                      04460000
//         AMP=('BUFND=8','BUFNI=4')                                    04470000
//BP13L144 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          04480000
//SYSOUT   DD SYSOUT=*                                                  04490000
//SYSUDUMP DD SYSOUT=*                                                  04500000
//SYSABEND DD SYSOUT=*                                                  04510000
//SYSDBUG  DD SYSOUT=*                                                  04520000
//SYSABOUT DD SYSOUT=*                                                  04530000
//SYSDBOUT DD SYSOUT=*                                                  04540000
//*-----------------------------------------------------------------    04550000
//* SKIP F800 CASES WHERE DTE-REGN IS NOT = F001-CURR-DTE               04560000
//*-----------------------------------------------------------------    04570000
//STEP19B  EXEC PGM=BP13C145,COND=(0,NE)                                04580000
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                          04590000
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                            04600000
//         AMP=('BUFNI=8','BUFND=4')                                    04610000
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                      04620000
//         AMP=('BUFND=8','BUFNI=4')                                    04630000
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                            04640000
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                         04650000
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR                   04660000
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR                   04670000
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR                   04680000
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR                   04690000
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                           04691000
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                     04692000
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                     04693000
//P13L145A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          04700000
//SYSOUT   DD SYSOUT=*                                                  04710000
//SYSUDUMP DD SYSOUT=*                                                  04720000
//SYSABEND DD SYSOUT=*                                                  04730000
//SYSDBUG  DD SYSOUT=*                                                  04740000
//SYSABOUT DD SYSOUT=*                                                  04750000
//SYSDBOUT DD SYSOUT=*                                                  04760000
//*-----------------------------------------------------------------    04770000
//* SORT OUT JB CASES IN BP13K800 - BTO CASES WITH REF NO AS JB-REGN    04780000
//*-----------------------------------------------------------------    04790000
//STEP19C  EXEC SORT,COND=(0,NE)                                        04800000
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                              04810000
//SORTOUT  DD DSN=&&F800,DISP=(NEW,PASS),                               04820000
//            UNIT=SYSDA,SPACE=(CYL,(10,2),RLSE),                       04830000
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                       04840000
//SYSIN   DD *                                                          04850000
   SORT FIELDS=(4,8,A),FORMAT=CH                                        04860000
   INCLUDE COND=(73,1,CH,EQ,C'B',OR,                                    04870000
                 73,1,CH,EQ,C'R')                                       04880000
//*-----------------------------------------------------------------    04890000
//* SORT CASES IN JB-REGN SEQUENCE                                      04900000
//*-----------------------------------------------------------------    04910000
//STEP19D  EXEC SORT,COND=(0,NE)                                        04920000
//SORTIN   DD DSN=&&F800,DISP=(SHR,DELETE)                              04930000
//SORTOUT  DD DSN=&&P13F800,DISP=(NEW,PASS),                            04940000
//            UNIT=SYSDA,SPACE=(CYL,(10,2),RLSE),                       04950000
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                       04960000
//SYSIN   DD *                                                          04970000
   SORT FIELDS=(73,8,A),FORMAT=CH                                       04980000
//*-----------------------------------------------------------------    04990000
//* SORT OUT JB CASES IN BP13K500                                       05000000
//*-----------------------------------------------------------------    05010000
//STEP19E  EXEC SORT,COND=(0,NE)                                        05020000
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR                             05030000
//SORTOUT  DD DSN=&&F520JB,DISP=(NEW,PASS),                             05040000
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                      05050000
//            SPACE=(CYL,(32,5),RLSE)                                   05060000
//SYSIN   DD *                                                          05070000
    SORT FIELDS=(35,6,A),FORMAT=CH                                      05080000
    INCLUDE COND=(213,2,CH,EQ,C'JB',AND,                                05090000
                  226,3,CH,NE,C'   ')                                   05100000
//*-----------------------------------------------------------------    05110000
//* CONVERT JB-REGN IN BP13K800 FROM REF NO TO REGN NO                  05120000
//*-----------------------------------------------------------------    05130000
//STEP19F   EXEC PGM=BP13C022,COND=(0,NE)                               05140000
//BP13F800  DD DSN=&&P13F800,DISP=(SHR,PASS)                            05150000
//BP13F520  DD DSN=&&F520JB,DISP=(SHR,PASS)                             05160000
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR                             05170000
//SYSDBG    DD SYSOUT=*                                                 05180000
//SYSDBOUT  DD SYSOUT=*                                                 05190000
//SYSOUT    DD SYSOUT=*                                                 05200000
//*-------------------------------------------------------------------- 05210000
//*      TO CREATE PATH/ALTX FOR MATURENT BALLOT FILE                   05220000
//*-------------------------------------------------------------------- 05230000
//STEP19G  EXEC PGM=IDCAMS,COND=(0,NE)                                  05240000
//SYSPRINT DD SYSOUT=*                                                  05250000
//INPUT1   DD DSN=BP13.K520.BALLOT,DISP=SHR                             05260000
//SYSIN    DD  *                                                        05270000
           DEF AIX (NAME(BP13.K520.BALLOT.ALTX1)     -                  05280000
               REL(BP13.K520.BALLOT)                 -                  05290000
               REUSE                                 -                  05300000
               KEYS(6 34)                            -                  05310000
               SHR(2 3)                              -                  05320000
               NUNQK)                                -                  05330000
               DATA                                  -                  05340000
               (NAME(BP13.K520.BALLOT.ALTX1.DATA) -                     05350000
               CYL(10 5)                              -                 05360000
               RECSZ(31 354)                         -                  05370000
               FSPC(10 10)                           -                  05380000
               CISZ(4096))                           -                  05390000
               INDEX                                 -                  05400000
               (NAME(BP13.K520.BALLOT.ALTX1.INDEX) -                    05410000
               CISZ(4096))                                              05420000
         IF MAXCC = 0 THEN                           -                  05430000
           DEF PATH (NAME(BP13.K520.BALLOT.PATH1) -                     05440000
               PENT(BP13.K520.BALLOT.ALTX1))                            05450000
         IF MAXCC = 0 THEN                                              05460000
           BIX IDS(BP13.K520.BALLOT)                 -                  05470000
               ODS(BP13.K520.BALLOT.ALTX1)                              05480000
//*-----------------------------------------------------------------    05490000
//* CONVERT JB-REGN IN BP13K520 FROM REF NO TO REGN NO                  05500000
//*-----------------------------------------------------------------    05510000
//STEP19H   EXEC PGM=BP13C029,COND=(0,NE)                               05520000
//BP13F520  DD DSN=&&F520JB,DISP=(SHR,DELETE)                           05530000
//BP13K520  DD DSN=BP13.K520.BALLOT,DISP=SHR                            05540000
//BP13K521  DD DSN=BP13.K520.BALLOT.PATH1,DISP=SHR                      05550000
//SYSDBG    DD SYSOUT=*                                                 05560000
//SYSDBOUT  DD SYSOUT=*                                                 05570000
//SYSOUT    DD SYSOUT=*                                                 05580000
//*-----------------------------------------------------------------    05590000
//* SORT OUT SUCC CASES IN BP13K520                                     05600000
//*-----------------------------------------------------------------    05610000
//STEP19I  EXEC SORT,COND=(0,NE)                                        05620000
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR                             05630000
//SORTOUT  DD DSN=&&F520,DISP=(NEW,PASS),                               05640000
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                      05650000
//            SPACE=(CYL,(32,5),RLSE)                                   05660000
//SYSIN   DD *                                                          05670000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      05680000
   OMIT    COND=(226,3,CH,EQ,C'   ')                                    05690000
//*----------------------------------------------------------------*    05700000
//* TO EXTRACT SUCCESSFUL APPLICANTS FROM REQUEST FILE             *    05710000
//*----------------------------------------------------------------*    05720000
//STEP20   EXEC PGM=BP13C579,COND=(0,NE)                                05730000
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                          05740000
//BP13F520 DD DSN=&&F520,DISP=(SHR,PASS)                                05750000
//BP13F200 DD DSN=&&P13F200A,DISP=(NEW,PASS),                           05760000
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=23400),                   05770000
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE)                         05780000
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          05790000
//SYSPRINT DD SYSOUT=*                                                  05800000
//SYSABOUT DD SYSOUT=*                                                  05810000
//SYSDBOUT DD SYSOUT=*                                                  05820000
/*                                                                      05830000
//*-------------------------------------------------------------------- 05840000
//* TO APPEND BP13F200 RECORDS TO BOOKING APPOINTMENT FILE              05850000
//*---------------------------------------------------------------------05860000
//STEP21    EXEC PGM=IDCAMS,COND=(0,NE)                                 05870000
//SYSPRINT  DD SYSOUT=*                                                 05880000
//INPUT1    DD DSN=&&P13F200A,DISP=(SHR,PASS)                           05890000
//OUTPUT1   DD DSN=BP13.F200.BKAPPMT,DISP=MOD                           05900000
//SYSIN     DD  *                                                       05910000
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                05920000
/*                                                                      05930000
//*---------------------------------------------------------------------05940000
//* TO UPDATE RESALE STATUS = 'LN' OR 'LNS' TO MASTER                   05950000
//* AFTER DETAIL UPDATED TO MASTER                                      05960000
//*---------------------------------------------------------------------05970000
//STEP22    EXEC PGM=BP13C71N,COND=(0,NE)                               05980000
//BP13F520  DD DSN=&&P13F520A,DISP=(OLD,PASS)                           05990000
//BP13K825  DD DSN=BP13.K825.REQOCCP,DISP=SHR                           06000000
//BB24K510  DD DSN=BB24.K510.UINHIST,DISP=SHR,                          06010000
//             AMP=('BUFNI=8','BUFND=4')                                06020000
//BB24K500  DD DSN=BB24.K500.RESLHIST,DISP=SHR,                         06030000
//             AMP=('BUFNI=8','BUFND=4')                                06040000
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                            06050000
//             AMP=('BUFNI=8','BUFND=4')                                06060000
//SYSPRINT  DD SYSOUT=*                                                 06070000
//SYSDBG    DD SYSOUT=*                                                 06080000
//SYSDBOUT  DD SYSOUT=*                                                 06090000
//SYSOUT    DD SYSOUT=*                                                 06100000
//*---------------------------------------------------------------------06110000
//*---------------------------------------------------------------------06120000
//* END BP13A540                                                        06130000
//*---------------------------------------------------------------------06140000
