//BP13ASU2 JOB (BP13P),'BP13ASU2',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*------------------------------------------------------------------           
//* FOR CDE-REQUEST-STATUS = W (UNSUCC)                                         
//* UPDATE '02' FOR ROUND 2 TO CDE-COHORT                                       
//*---------------------------------------------------------------------        
//*- UNSUCC ROUND 2                                                             
//*---------------------------------------------------------------------        
//**********************************************************************        
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- --------------------------------------------         
//* BP133316 IL5  11042008 NEW                                                  
//* BP134038 IL5  03112010 ADD PROGRAM BP13C71J                                 
//*-------------------------------------------------------------------          
//* RE-TAG SHORTLISTED APPLICATIONS AS 'W'.                                     
//* APPLICATIONS HAVE BEEN TAGGED AS U UNDER ASU1                               
//*--------------------------------------------------------------------         
//STEP01   EXEC  PGM=BP13C71J,COND=(0,NE)                                       
//BP13F740 DD DSN=BP13.F740.MATUREBA.ARE2.R02,DISP=SHR                          
//BP13F713 DD DSN=BP13.F713.PIGEON.COHORT02,DISP=SHR                            
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------          
//* UPDATE '02' FOR ROUND 2 TO CDE-COHORT                                       
//*--------------------------------------------------------------------         
//STEP02   EXEC  PGM=BP13C71H,COND=(0,NE)                               00002680
//BP13F740 DD DSN=BP13.F740.MATUREBA.ARE2.R02,DISP=SHR                          
//BP13F713 DD DSN=BP13.F713.PIGEON.COHORT02,DISP=SHR                            
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
