//BP13DBK3  JOB (BP13P),'BP13DBK3',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : DAILY BACKUP                                          *         
//*                                                                   *         
//*===================================================================*         
//*-------------------------------------------------------------------*         
//* CHG-NO   BY   ON    - DESCRIPTION                                 *         
//* ---------------------------------                                 *         
//* BP130487 SSS 980507 - CHG UNIT=3480 TO UNIT=CART                  *         
//* BP130418 SIA 980923 - Y2K COMPLIANCE CHANGES                      *         
//* BP130718 CLT 011099 - REMOVE BACKUP OF BP13K825                   *         
//* BP130956 AKT 231100 - CHGE BP13K230/BP13K240 LRECL FROM 130 TO 250*         
//* BP132168 CLT 160902 - MOVE BKUP OF K800/K820/K840 TO BP13DBK6     *         
//* BP132278 JF4 280303 - CHGE BP13F230/F240 LRECL TO 450.            *         
//* BP134769 SMR 040313 - ADD BACKUP FOR BP13K249                     *         
//* BP135363 ESA1120814 - EXTEND THE BACKUP FILE OF BP13K249 TO 450   *         
//*-------------------------------------------------------------------*         
//*                                                                             
//*--------------------------------------------------------------------*        
//*  BACKUP OF DATAFILES                                               *        
//*--------------------------------------------------------------------*        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFND=13')                                                 
//OUTPUT1   DD DSN=BP13.F830.ADDR.DAILY(+1),DISP=(,PASS),                       
//             UNIT=CART,LABEL=(1,SL),                                          
//             DCB=(BP13.GDG,BLKSIZE=23250,LRECL=250,RECFM=FB)                  
//INPUT2    DD DSN=BP13.K230.FLATLIST,DISP=SHR,                                 
//             AMP=('BUFND=13')                                                 
//OUTPUT2   DD DSN=BP13.F230.FLATLIST.DAILY(+1),DISP=(,PASS),                   
//             UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=450,RECFM=FB)                      
//INPUT3    DD DSN=BP13.K240.HEADFLAT,DISP=SHR,                                 
//             AMP=('BUFND=13')                                                 
//OUTPUT3   DD DSN=BP13.F240.HEADFLAT.DAILY(+1),DISP=(,PASS),                   
//             UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=450,RECFM=FB)                      
//INPUT4    DD DSN=BP13.K249.NT.FT,DISP=SHR,                                    
//             AMP=('BUFND=13')                                                 
//OUTPUT4   DD DSN=BP13.F249.NT.FT.DAILY(+1),DISP=(,PASS),                      
//             UNIT=CART,LABEL=(4,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=450,RECFM=FB)                      
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
     REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                      
     REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                      
     REPRO INFILE(INPUT4) OUTFILE(OUTPUT4)                                      
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CATALOG GDG                                                       *        
//*--------------------------------------------------------------------*        
//STEP02    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT1    DD DSN=BP13.F830.ADDR.DAILY(+1),DISP=(OLD,CATLG),                   
//             UNIT=(,,DEFER)                                                   
//INPUT2    DD DSN=BP13.F230.FLATLIST.DAILY(+1),DISP=(OLD,CATLG),               
//             UNIT=(,,DEFER)                                                   
//INPUT3    DD DSN=BP13.F240.HEADFLAT.DAILY(+1),DISP=(OLD,CATLG),               
//             UNIT=(,,DEFER)                                                   
//INPUT4    DD DSN=BP13.F249.NT.FT.DAILY(+1),DISP=(OLD,CATLG),                  
//             UNIT=(,,DEFER)                                                   
//*                                                                             
//*--------------------------------------------------------------------*        
//*  BACKUP BP13.F380.CDREFUND - 7 GDG                                 *        
//*--------------------------------------------------------------------*        
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.F380.CDREFUND,DISP=SHR                                   
//OUTPUT3  DD DSN=BP13.F380.CDREFUND.DAILY(+1),DISP=(,PASS),                    
//            UNIT=CART,LABEL=(,SL),                                            
//            DCB=(BP13.GDG,BLKSIZE=22500,LRECL=150,RECFM=FB)                   
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                      
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CATALOG GDG                                                       *        
//*--------------------------------------------------------------------*        
//STEP04    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT4    DD DSN=BP13.F380.CDREFUND.DAILY(+1),DISP=(OLD,CATLG),               
//             UNIT=(,,DEFER)                                                   
//*                                                                             
//*--------------------------------------------------------------------*        
//*                         END OF JOB                                 *        
//*--------------------------------------------------------------------*        
