//BP13D419  JOB (BP13P),'BP13D419',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*==================================================================           
//* THIS JOB IS RUN AT 6.30 AM EVERYDAY TO NOTIFY SALES ON THE                  
//* RESALE LEVY CASES WHO HAS NOT PAID AND COLLECTING KEYS.                     
//*==================================================================           
//*                                                                             
//* NOTE: IF SENDMAIL STEP NO CHANGES, PLS UPDATE RUNSHEET                      
//*                                                                             
//*==================================================================           
//* CHG REF  DATE     BY   DESC                                                 
//* -------- -------- ---- -----                                                
//* BP137090 20171205 LJL1 TO RUN BP13C38C AT 6.30 AM EVERYDAY        *         
//*==================================================================           
//* SORT BP13K454 (MOVED FROM BP13D305)                                         
//*-----------------------------------------------------------------*           
//STEP18  EXEC SORT,COND=(4,LT)                                                 
//SORTIN   DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F454,DISP=(NEW,PASS),                                   
//            SPACE=(TRK,(10,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=10000)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=COPY                                                          
//*-----------------------------------------------------------------*           
//*RUN BP13C38C TO CREATE MAIL REPORT (MOVED FROM BP13D305)                     
//*                            MOVE BP13C38C FROM BP13D108.           *         
//*-----------------------------------------------------------------*           
//STEP18A  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BP13F454 DD DSN=&&BP13F454,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR                                   
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR                                      
//P04K0101 DD DSN=BP04.K010.DEBAR.PATH,DISP=SHR                                 
//MAILC38C DD DSN=BP13.MAILRPT.RESALE.LEVY,DISP=SHR                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C38C) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP18B  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.RESALE.LEVY,DISP=SHR                             
//*------------------------------------------------------------*                
//*                  END OF BP13D419                                            
//*------------------------------------------------------------*                
//*-----------------------------------------------------------------*           
//*          E N D      O F     J O B                                 *         
//*-------------------------------------------------------------------*         
