//BP13D222 JOB (BP13P),'BP13D222',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB01423
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-------------------------------------------------------------------*         
//*- THIS JOB IS SIMILAR TO BP13AY0F                                            
//*- BP13AY0A - GIVE PRIOROTY TO FIRST TIMER (FT) >=4 UNSUCC ATTEMPT            
//*- BP13AY0H - GIVE PRIOROTY TO FIRST TIMER (FT) >=4 UNSUCC ATTEMPT            
//*- BP13AY0F - GIVE PRIOROTY TO FT/2T COMBINATION>=6 UNSUCC ATTEMPT            
//*- BP13AY0J - GIVE PRIOROTY TO FT/2T COMBINATION>=6 UNSUCC ATTEMPT            
//*=================================================================            
//*-CHG-NO   BY   ON    DESCRIPTION                                             
//*------------------------------------                                         
//*-BP134205 LSB 110555 ADD BP13K813 FOR BP13CB91                               
//*-BP134247 LSB 110610 ADD PPOS/EC CHECK,CY82 CHK MATURE-TAG                   
//*-BP134255 LSB 110615 CHG BP13CY64 TO BP13CY82 BYPASS MATURE EST              
//*-BP134255 LSB 110711 CHG BP13CB71, DELETE CB90, ICNLUDE REQUEST-S            
//*                     IN BP13CB91, ADD FN/NE/HARDLUCK COUNT                   
//*                     BP13CY89,BYAPSS STATUS=S, BTO COUNT>00                  
//*-BP135635 LSB 150120 ADD FTS                                                 
//*-BP135785 LSB 150729 EXPAND KEY-FLD BP13K585                                 
//* BP139512 LSB 280223 ADD DATACLAS=MULTIVOL                                   
//*-------------------------------------------------------------------*         
//* 1) DETERMINE APPLICATION WITH COMBINATION OF FIRST TIMER AND                
//* SECOND TIMER, HUSBAND + SPOUSE OR FS CASES                                  
//* 2) >= 6 UNSUCC ATTEMPTS                                                     
//*-------------------------------------------------------------------*         
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K585.HARDLUCK,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------            
//*-------------------------------------------------------------------*         
//*  BACKUP HARDLUCK FILE                                                       
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K585.HARDLUCK,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F585.FT2T.BKUP(+1),DISP=(NEW,CATLG),                     
//            SPACE=(CYL,(80,50)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=2000,RECFM=FB)                      
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BP13.F585.HARDLUCK                                                     
//*---------------------------------------------------------------------        
//STEP49   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F585.FT2T,DISP=SHR                                       
//         DD DSN=BP13.F585.HARDLUCK,DISP=SHR                                   
//         DD DSN=BP13.F585.PURE2T,DISP=SHR                                     
//         DD DSN=BP13.F585.HARDLUCK.FTS,DISP=SHR                               
//SORTOUT  DD DSN=&&F585SORT,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        DATACLAS=MULTIVOL,                                                    
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,10,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
  INCLUDE COND=(22,2,CH,GT,C'00')                                               
//*---------------------------------------------------------------------        
//* DEFINE BP13K585 VSAM                                                -----   
//*--------------------------------------------------------------------------   
//STEP20   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&F585SORT,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
  DEL 'BP13.K585.HARDLUCK' CL PURGE                                       001   
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K585.HARDLUCK)                      -                  001   
        SHR(2,3)                                       -                  001   
        KEYS(10 0)                                     -                  001   
        CYL(150 30)                                    -                  001   
        RECSZ(2000 2000)                                 -                001   
        FREESPACE(10 10)                               -                  001   
        CISZ(4096)                                     -                  001   
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                  001   
        UNQ)                                           -                  001   
      DATA                                             -                      00
        (NAME(BP13.K585.HARDLUCK.DATA))                -                  001   
      INDEX                                            -                      00
        (NAME(BP13.K585.HARDLUCK.INDEX))                                  001   
      IF MAXCC = 0 THEN                               -                         
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K585.HARDLUCK)                                           
//*--------------------------------------------------------------------         
