//BP13YBK1  JOB (BP13P),'BP13MBK1',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*--------------------------------------------------------------------         
//* BP131000 LSB  20010523 - BACKUP AMPRTISE SA FILE                            
//* BP136420 LSB  20160821 - EXPAND FILE                                        
//* BP136897 LSB  20171114 - BACKUP F600 MONTH DATASET TO YEARLY                
//* BP137480 LSB  20190601 - BACKUP F40C                                        
//* BP138944 LSB  20211022 - CLEAR BP13.F40C.SALEORD.RSV.YEAR,EXP F690          
//*--------------------------------------------------------------------         
//*  REPRO VSAM FILE TO CARTRIDGE                                               
//*--------------------------------------------------------------------         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K690.AMORTISE,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F690.AMORTISE.YEAR(+1),                                  
//            DISP=(NEW,CATLG),                                         00000120
//            UNIT=CART,LABEL=(1,SL),                                           
//            DCB=(BP13.GDG,BLKSIZE=18400,LRECL=800,RECFM=FB)                   
//*                                                                             
//INPUT2   DD  DSN=BP13.F120.SATRAN.SA.MTH,DISP=SHR                     00000080
//         DD  DSN=BP13.F120.SATRAN.SA.MTHBKUP,DISP=SHR                 00000080
//         DD  DSN=BP13.F120.SATRAN.AMORT,DISP=SHR                      00000080
//         DD  DSN=BP13.F120.SATRAN.AMORT.MTHBKUP,DISP=SHR              00000080
//OUTPUT2  DD  DSN=BP13.F120.SATRAN.SA.YEAR(+1),                        00000110
//             DISP=(NEW,CATLG),                                        00000120
//             UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=27900,LRECL=150,RECFM=FB)          00000150
//*                                                                             
//INPUT3   DD  DSN=BP13.F136.BACKUP(0),DISP=SHR                         00000080
//         DD  DSN=BP13.F136.BACKUP(-1),DISP=SHR                        00000080
//         DD  DSN=BP13.F136.BACKUP(-2),DISP=SHR                        00000080
//         DD  DSN=BP13.F136.BACKUP(-3),DISP=SHR                        00000080
//         DD  DSN=BP13.F136.BACKUP(-4),DISP=SHR                        00000080
//         DD  DSN=BP13.F136.BACKUP(-5),DISP=SHR                        00000080
//         DD  DSN=BP13.F136.BACKUP(-6),DISP=SHR                        00000080
//         DD  DSN=BP13.F136.BACKUP(-7),DISP=SHR                        00000080
//         DD  DSN=BP13.F136.BACKUP(-8),DISP=SHR                        00000080
//         DD  DSN=BP13.F136.BACKUP(-9),DISP=SHR                        00000080
//         DD  DSN=BP13.F136.BACKUP(-10),DISP=SHR                       00000080
//         DD  DSN=BP13.F136.BACKUP(-11),DISP=SHR                       00000080
//OUTPUT3  DD  DSN=BP13.F136.YEAR(+1),                                  00000110
//             DISP=(NEW,CATLG),                                        00000120
//             UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=27900,LRECL=150,RECFM=FB)          00000150
//*                                                                             
//INPUT4   DD  DSN=BP13.K130.SOCHIST,DISP=SHR                           00000080
//OUTPUT4  DD  DSN=BP13.F130.SOCHIST.YEAR(+1),                          00000110
//             DISP=(NEW,CATLG),                                        00000120
//             UNIT=CART,LABEL=(4,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=27900,LRECL=150,RECFM=FB)          00000150
//*                                                                             
//INPUT5   DD  DSN=BP13.F600.CPFWDL.SENT.ACCUM.YEAR,DISP=SHR            00000080
//OUTPUT5  DD  DSN=BP13.F600.CPFWDL.SENT.YEAR.BKUP(+1),                 00000110
//             DISP=(NEW,CATLG),                                        00000120
//             UNIT=CART,LABEL=(5,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=27000,LRECL=1800,RECFM=FB)         00000150
//INPUT6   DD  DSN=BP13.F600.CPFWDL.SENT.ACCUM.YEAR,DISP=SHR            00000080
//OUTPUT6  DD  DSN=BP13.F600.CPFWDL.SENT.YEAR(+1),                      00000110
//             DISP=(NEW,CATLG),                                        00000120
//             SPACE=(CYL,(200,50)),                                            
//             DCB=(BP13.GDG,BLKSIZE=27000,LRECL=1800,RECFM=FB)         00000150
//INPUT7    DD DSN=BP13.F40C.SALEORD.RSV.YEAR,DISP=SHR                          
//OUTPUT7   DD DSN=BP13.F40C.SALEORD.RSV.YEAR.BKUP(+1),                         
//             DISP=(NEW,CATLG),                                        00000120
//             UNIT=CART,LABEL=(6,SL),VOL=REF=*.OUTPUT1,                        
//             SPACE=(CYL,(200,50)),                                            
//             DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)         00000150
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                        
   REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                        
   REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                        
   REPRO INFILE(INPUT4) OUTFILE(OUTPUT4)                                        
   REPRO INFILE(INPUT5) OUTFILE(OUTPUT5)                                        
   REPRO INFILE(INPUT6) OUTFILE(OUTPUT6)                                        
   REPRO INFILE(INPUT7) OUTFILE(OUTPUT7)                                        
//*-------------------------------------------------------------------*         
//* CLEAR ACCUM SO FILE FOR START OF NEXT MONTH                       *         
//*-------------------------------------------------------------------*         
//STEP02    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DUMMY                                                            
//OUTPUT1   DD DSN=BP13.F40C.SALEORD.RSV.YEAR,DISP=OLD                          
//SYSIN     DD *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
