//BP13A218 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* CHG-NO    BY   ON   - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130418 LSB 981015 - Y2K CHANGES                                           
//**********************************************************************        
//*  STEP 01: SORT BP13K205 TO INCLUDE ALL "CA"                                 
//**********************************************************************        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS,DELETE),                            
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=23200),                            
//            SPACE=(TRK,(5,5),RLSE),UNIT=SYSDA                                 
//SYSIN    DD *                                                                 
    OPTION COPY                                                                 
    INCLUDE COND=(14,2,CH,EQ,C'CA')                                             
/*                                                                              
//**********************************************************************        
//* SORT BP13K800 TO INCLUDE ALL CASES WHO DID NOT SELECT FLATS                 
//**********************************************************************        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS,DELETE),                            
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                              
//            SPACE=(CYL,(30,5),RLSE),UNIT=SYSDA                                
//SYSIN    DD *                                                                 
     OPTION COPY                                                                
     INCLUDE COND=(155,11,CH,EQ,C'           ',AND,                             
                   785,6,CH,NE,C'      ')                                       
/*                                                                              
//**********************************************************************        
//*  STEP 03: TO EXTRACT CASES THAT DID NOT SELECT FLATS                        
//**********************************************************************        
//STEP03   EXEC PGM=BP13C870,COND=(0,NE)                                        
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13FOUT DD DSN=&&P13F800A,DISP=(NEW,KEEP),                                   
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                              
//            SPACE=(CYL,(10,5),RLSE),UNIT=SYSDA                                
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//**********************************************************************        
//* SORT RECORD                                                                 
//**********************************************************************        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F800A,DISP=SHR                                           
//SORTOUT  DD DSN=&&P13F800B,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(30,10),RLSE),                          
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                               
//SYSIN    DD *                                                                 
     SORT FIELDS=(49,2,A,30,2,A,785,6,A,525,1,D),FORMAT=CH                      
/*                                                                              
//**********************************************************************        
//* PRINT SUMMARY REPORT                                                        
//**********************************************************************        
//STEP05   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13K800 DD DSN=&&P13F800B,DISP=(OLD,PASS)                                    
//FT18F001 DD SYSOUT=A,DEST=L434                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S788),DISP=SHR                             
/*                                                                              
//**********************************************************************        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//**********************************************************************        
//STEP06    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&BP13F205,DISP=SHR                                          
//OUTPUT1   DD DSN=BP13.F205.ACCUM,DISP=MOD                                     
//SYSIN     DD *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//**********************************************************************        
//* END OF JOB BP13A218                                                         
//**********************************************************************        
