//BP13D507 JOB (BP13P),'BP13D507',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : EXTRACT NEW REQUEST FOR HHTY CHECK                    *         
//*             JB BROKEN LINK CHECK                                  *         
//*                                                                   *         
//*===================================================================*         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//* CHGE NO  BY  DATE     DESCRIPTION                                           
//* -------- --- ------  ------------                                           
//* BP130445 LSB 980224   EXPAND F558 TO X(400)                                 
//* BP130652 SRA 991016   EXPAND F500,F730 RECL FROM 300 TO 500                 
//* BP130718 CLT 011099   E-FAST INPLMENTATION                                  
//*                       JOB RENAMED FROM BP13W102 TO BP13D507                 
//* BP130871 SSS 090600   LISTING FOR EAALSS                                    
//* BP130749 SB  150800   INITIALIZE 10-YR INFO BEFORE PROCESS -ORSA            
//* BP130978 LSB 110401   REMOVE C502, C590                                     
//* BP131064 LSB 150901   ADD F730 WITH NO HHTY CASES TO F500/F558              
//*                       STEP09 - STEP12                                       
//* BP131064 CKK 150202   COMMENT OUT STEP09-12 AFTER BE'02                     
//* BP132171 CKK 311002   REMOVE COMMENT OF STEP09-12 FOR BE                    
//* BP132583 CKK 280803   CHECK ALL OCCUPIERS FOR MATURE ESTATE CASES           
//* BP132646 CKK 261204   CHECK FOR ELIG TAG FOR NEW CASES                      
//* BP132688 LSB 300605   ADD BP13K730 TO BP13C057                              
//* BP133234 IL5 070408   ADD STEP11B                                           
//* BP133419 IL5 030908   ADD STEP15 MOD PREVDAY FILE TO F500/F558              
//* BP133452 YCH 291008   REDETERMINE HOUSEHOLD TYPE IF BLANK &                 
//*                       ELIG-TAG = BLANK AND NOT 'SB'                         
//* BP134229 YCH 230511   CLEAR BP13.F730.REQUEST.DAY                           
//*                       DROP SORT HH TYPE BLANK AND ELIG-TAG='SB'             
//* BP139875 AM2 130224   REMOVE CLASS 2 PRINTING                               
//*===================================================================*         
//*-------------------------------------------------------------------*         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                          *         
//*-------------------------------------------------------------------*         
//STEP02  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K500.PREREGN,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//INPUT5   DD DSN=BP13.K840.APPLHIST,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT5)                                                      
//*-------------------------------------------------------------------*         
//* CHECK FOR EMPTY REQUEST FILE BP13K500                             *         
//*-------------------------------------------------------------------*         
//STEP03  EXEC PGM=BP13C057,COND=(0,NE)                                         
//BP13K500 DD DSN=BP13.K500.PREREGN,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* C950230  SYSTEM TO TAG THE ESSENTIAL FAMILY NUCLEUS IN APPLICATION*         
//*          BASED ON RELATIONSHIP CODES                              *         
//*          (FOR PURPOSE OF MATCHING NRIC WITH SMS AND RESALE HIST)  *         
//*-------------------------------------------------------------------*         
//* SORT NEW REGISTERED CASES BY REGN                                 *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K500.PREREGN,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&NEWREGN,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&OCCP,DISP=(NEW,PASS),                                       
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A,107,2,A,9,9,A),FORMAT=CH                                 
    INCLUDE COND=(1,8,CH,GT,C'        ')                                        
//*-------------------------------------------------------------------*         
//* TO UPDATE LESSEE CHECK                                            *         
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=BP13C834,COND=(0,NE)                                        
//BP13F730 DD DSN=&&NEWREGN,DISP=(OLD,PASS)                                     
//BP13F825 DD DSN=&&OCCP,DISP=(OLD,PASS)                                        
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L834 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* FOR NON-MATURE NT - EXTRACT NEW REQUESTS, BYPASS RELOCATION EXE   *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K500.PREREGN,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
//*--------------------------------------------------------------------         
//* INITIALISE 10-YR INFOR BEFORE PROCESS                                       
//* OUTREC MTH-RESIDE, MTH-RES-JB-IND, 5YR-OCCUPN = ZEROS                       
//*---------------------------------------------------------------------        
//STEP7A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//SORTOUT  DD DSN=&&F500BLAN,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                                
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      OUTREC FIELDS=(1,67,C'000',71,104,C' ',176,41,C'000',220,281)             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP7B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F825LESS,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(131,1,CH,EQ,C'Y')                                             
//*-------------------------------------------------------------------*         
//* OUTREC BP13F558 FROM BP13K825 REQUEST OCCUPIER FILE               *         
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE               *         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"       *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC  PGM=BP13C059,COND=(0,NE)                                       
//BP13F500 DD  DSN=&&F500BLAN,DISP=(OLD,PASS)                                   
//BP13F825 DD  DSN=&&F825LESS,DISP=(OLD,DELETE)                                 
//BP13F558 DD  DSN=BP13.F558.UPGOCCP,DISP=OLD                                   
//BP13K703 DD  DSN=BP13.K703.SOCDATE,DISP=SHR                                   
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT OUT MARURE ESTATE CASES                                                
//* INCLUDE COND=(116,1,CH,EQ,C' ',AND,(258,2,CH,NE,C'SB'))                     
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&F730MAT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* TO UPDATE LESSEE CHECK                                            *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=BP13C834,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730MAT,DISP=(OLD,PASS)                                     
//BP13F825 DD DSN=&&OCCP,DISP=(OLD,PASS)                                        
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L834 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* FOR MATURE NT - WITHOUT HHTY                                                
//* INCLUDE COND=(116,1,CH,EQ,C' ',AND,(258,2,CH,NE,C'SB'))                     
//*-------------------------------------------------------------------*         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=BP13.F500.SEQUENCE,DISP=MOD                                   
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP11B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F825LESS,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(131,1,CH,EQ,C'Y')                                             
//*-------------------------------------------------------------------*         
//* OUTREC BP13F558 FROM BP13K825 REQUEST OCCUPIER FILE               *         
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE               *         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"       *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC  PGM=BP13C059,COND=(0,NE)                                       
//BP13F500 DD  DSN=&&F730MAT,DISP=(OLD,PASS)                                    
//BP13F825 DD  DSN=&&F825LESS,DISP=(OLD,PASS)                                   
//BP13F558 DD  DSN=BP13.F558.UPGOCCP,DISP=MOD                                   
//BP13K703 DD  DSN=BP13.K703.SOCDATE,DISP=SHR                                   
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F825ALL,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
//*-------------------------------------------------------------------*         
//* OUTREC BP13F558 FROM BP13K825 REQUEST OCCUPIER FILE               *         
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE               *         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"       *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC  PGM=BP13C059,COND=(0,NE)                                       
//BP13F500 DD  DSN=&&F730MAT,DISP=(OLD,PASS)                                    
//BP13F825 DD  DSN=&&F825ALL,DISP=(OLD,PASS)                                    
//BP13F558 DD  DSN=BP13.F558.UPGOCCP.BTO,DISP=OLD                               
//BP13K703 DD  DSN=BP13.K703.SOCDATE,DISP=SHR                                   
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* MOD PREVDAY FILE IF MHA DID NOT RETURN FILE TO SOC                          
//*-----------------------------------------------------------------            
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F500.SEQUENCE.PREVDAY,DISP=SHR                           
//OUTPUT1  DD DSN=BP13.F500.SEQUENCE,DISP=MOD                                   
//INPUT2   DD DSN=BP13.F558.UPGOCCP.PREVDAY,DISP=SHR                            
//OUTPUT2  DD DSN=BP13.F558.UPGOCCP,DISP=MOD                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*-------------------------------------------------------------------*         
//* EMPTY PREVIOUS DAY FILES                                          *         
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F500.SEQUENCE.PREVDAY,DISP=OLD                           
//OUTPUT2  DD DSN=BP13.F558.UPGOCCP.PREVDAY,DISP=OLD                            
//OUTPUT3  DD DSN=BP13.F730.REQUEST.DAY,DISP=OLD                                
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                  
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT3)                                  
//*                                                                             
