//BP13A263 JOB (BP13P),'BP13A263',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*-------------------------------------------------------------------*         
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP132919 LMS 09/07/07 NEW JCL                                               
//*-------------------------------------------------------------------*         
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* PRINT REPORT BY TEAM ID                                                     
//*---------------------------------------------------------------------        
//STEP03  EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE, TEXT82'                   
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(500,500),,,ROUND)                         
//BP13F870 DD  DSN=BP13.K870.PANEL,DISP=SHR                                     
//BP13K875 DD  DSN=BP13.K875.PNAME,DISP=SHR                                     
//SY08K010 DD  DSN=SY08.K010.USERID,DISP=SHR                                    
//FT18F001 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S251),DISP=SHR                            
