//BP13D512 JOB (BP13P),'BP13D512',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,REGION=4096K                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//* THIS JOB IS SIMILAR TO BP13A553, EXCEPT IT IS RUN WEEKLY          *         
//* NO REPORT WILL BE PRINTED, THE PURPOSE IS TO BACKUP THE PROFILE   *         
//*                                                                   *         
//*===================================================================*         
//*                                                                   *         
//*   1) LASER PRINTER                                                *         
//*   2) BP13C788 - SPLIT FILE AND TAG RDB-DP-OM WHEN FOUND WITH SMS  *         
//*                 OR RESALE INFO                                    *         
//*   3) BP13X748 - EXTRACT RESIDE DATE FOR OTHERS INFO FROM RDB      *         
//*   4) BP13C818 - EXTRACT OTHER RECORDS NOT FOUND IN RDB            *         
//*   5) BP13C754 - EXTRACT NT-RESIDE AND FLAT-TYPE RESIDE FROM PIDB  *         
//*   6) BP13C872 - COMPUTE LENGTH OF OCCUPATION FOR EXISTING LESSEE  *         
//*                 AND OCCUPIER ONLY                                 *         
//*   7) BP13C715 - COMPUTE LENTH OF OCCPUATION FOR EX-LESSEE CASES   *         
//*   8) BP13C699 - COMPUTE HHSIZE BASE ON REGISTRATION NUMBER        *         
//*   9) SORT     - SORT MULITPLE RECORD BY REGNO, RDB-DP-OM,         *         
//*                 CDE-HSEHOLD, RELATIONSHIP AND NRIC SEQUENCE       *         
//*  10) BP13C789 - DETERMINE THE HOUSEHOLD TYPE BASED ON RDB-DP-OM   *         
//*                 AND DROP MULTIPLE RECORDS                         *         
//*===================================================================*         
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130441 YCH 200298 - PROFILE BREAKDWON                                     
//* BP130534 LSB 300199 - UPDATE CO-LESSEE-CODEM WHEN FOUND WITH SMS            
//* BP130652 SRA 161099 - EXPAND F500 RECL FROM 300 TO 500                      
//* BP130718 CLT 171099 - E-FAST IMPLEMENTATION                                 
//*                       JOB NAME CHANGED FR BP13W105 TO BP13D510              
//* BP130871 SSS 090600 - LISTING FOR EAALSS                                    
//* BP135171 RJE 110214 - TO CATER FOR DB2 UPGRADE                              
//*===================================================================*         
//* TO SEND DJDE AHEAD OF THE PRINT DATASET                           *         
//* PRT01 : 1 COPY                                                    *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* REPRO TO MONTH ACCUM FILE                                         *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F500.SEQUENCE.PROFILE.MONTH,DISP=MOD                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* REPRO TO MONTH ACCUM FILE                                         *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//OUTPUT2  DD DSN=BP13.F558.UPGOCCP.PROFILE.MONTH,DISP=MOD                      
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* SPLIT F558 FILE FROM THE OUTPUT OF DETERMINE THE HOUSEHOLD TYPE   *         
//* IF - (HHTYPE='G' OR '3') OR                                       *         
//*      (HHTYPE='H' AND (FILE-STATUS-SMS OR FILE-STATUS-RSL = 'OM')) *         
//*      OUTPUT TO BP13F716LE                                         *         
//* ELSEO TO MONTH ACCUM FILE                                         *         
//*      OUTPUT TO P13F716A TO CHECK RDB                              *         
//*-------------------------------------------------------------------*         
//* 1)  P13F716A - TO FURTHER CHECK WITH RDB                          *         
//* 2)  BP13F716 - INFO ALREADY FOUND IN SMS & RESALE                 *         
//*-------------------------------------------------------------------*         
//STEP100  EXEC PGM=BP13C788,COND=(0,NE)                                        
//BP13F558 DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//P13F716A DD DSN=&&P13F716A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT OUT IN NRIC SEQUENCE                                         *         
//*-------------------------------------------------------------------*         
//STEP110  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F716A,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*                                                                             
//*-------------------------------------------------------------------*         
//* EXTRACT SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE PURCHASE       *         
//* FROM RDB FOR THOSE WHICH ARE NOT EXISTING LESSEE(S) OR            *         
//* EX-LESSEE(S)                                                      *         
//*-------------------------------------------------------------------*         
//STEP120  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                                   
//P13F716A DD DSN=BP13.F716.W105Q748,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BY SCH-ACC AND DATE OF PURCHASE IN DESCENDING ORDER          *         
//*-------------------------------------------------------------------*         
//STEP130  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.W105Q748,DISP=SHR                                   
//SORTOUT  DD DSN=&&F716RDB,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(9,9,A,107,8,D),FORMAT=CH                                      
//*                                                                             
//*-------------------------------------------------------------------*         
//* OUTPUT RECORDS FROM EXTRACTED RDB RECORDS AND F716 ORDER          *         
//*        DROP MUTLITPLE REC                                         *         
//*-------------------------------------------------------------------*         
//STEP140  EXEC PGM=BP13C818,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716RDB,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//P13F716O DD DSN=&&ALLNHH,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),SPACE=(CYL,(90,30),RLSE),                          
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT IN SCHEME/ACCOUNT SEQUENCE                                   *         
//* INCLUDE SCHEME/ACCOUNT NOT EQUAL SPACES                           *         
//* FOR EXTRACTION OF NEW TOWN RESIDE AND FLAT TYPE RESIDE            *         
//*-------------------------------------------------------------------*         
//STEP150  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&ALLNHH,DISP=(OLD,PASS)                                      
//         DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13NHH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(51,9,A),FORMAT=CH                                               
   INCLUDE COND=(51,9,CH,NE,C'         ')                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* USE SCH-ACC-NO TO GET ESTATE AND FLAT TYPE FROM PBF FILE AND      *         
//*     USE ESTATE TO GET FROM BM06K510 ON NEW TOWN RESIDE            *         
//*-------------------------------------------------------------------*         
//STEP160  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&BP13NHH,DISP=(OLD,PASS)                                     
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=&&P13NHHNT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SORT IN SCHEME/ACCOUNT SEQUENCE                                  *         
//*-------------------------------------------------------------------*         
//STEP170  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&ALLNHH,DISP=(OLD,PASS)                                      
//         DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&NOTINRDB,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(51,9,A),FORMAT=CH                                               
   INCLUDE COND=(51,9,CH,EQ,C'         ')                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SORT BY NRIC NO/SCH-ACC-NO,DTE AND RELATIONSHIP SEQUENCE         *         
//*  TO COMPUTE LENGTH OF RESIDE BASE ON DATE RUN                     *         
//*-------------------------------------------------------------------*         
//STEP180  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13NHHNT,DISP=(OLD,PASS)                                    
//         DD DSN=&&NOTINRDB,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716RDBS,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(9,9,A,51,9,A,107,8,A,99,2,A),FORMAT=CH                        
//*                                                                             
//*-------------------------------------------------------------------*         
//* COMPUTE THE LENGTH RESIDE BASED ON MOVE-IN-DATE AND CURRENT DATE  *         
//*   FOR THOSE NUM-RDB-DP-OM =E BASE ON DATE RUN                     *         
//*    'D' => UPG - EXISTING FLAT BOUGHT DIRECTLY FROM BOARD          *         
//*    'M' => UPG - EXISTING FLAT BOUGHT FROM OM                      *         
//*    'S' => NHH - EXISTING FLAT BOUGHT FROM OM                      *         
//*    'Z' => OCCUPIER OF THE FLAT                                    *         
//* &&&===> NOTES : SIMILAR AS BP13C805                               *         
//*-------------------------------------------------------------------*         
//STEP190  EXEC PGM=BP13C872,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716RDBS,DISP=(OLD,PASS)                                    
//P13F716A DD DSN=&&F716LEN,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* COMPUTE THE LENGTH RESIDE BASED ON DTE-SOLD-TO-SELLER AND CURRENT *         
//*   DATE FOR THOSE NUM-RDB-DP-OM =                                  *         
//*    'O' => UPG - EX-LESSEE AND EXISTING FLAT BOUGHT FROM OM        *         
//*    'R' => UPG - EX-LESSEE AND NOT EXISTING LESSEE                 *         
//*    'X' => NHH - PREVIOUS FLAT BOUGHT FROM OM                      *         
//*-------------------------------------------------------------------*         
//STEP200  EXEC PGM=BP13C715,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716LEN,DISP=(OLD,PASS)                                     
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F716O DD DSN=&&F716COMP,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(45,9),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BY NRIC NO/SCH-ACC-NO,DTE AND RELATIONSHIP SEQUENCED CURRENT *         
//* TO COMPUTE LENGTH OF RESIDE BASE ON DATE RUN                      *         
//*-------------------------------------------------------------------*         
//STEP210  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716COMP,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716REG,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO COMPUTE THE HOUSEHOLD SIZE OF THE APPLICATION                  *         
//*-------------------------------------------------------------------*         
//STEP220  EXEC PGM=BP13C699,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716REG,DISP=(OLD,PASS)                                     
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F716O DD DSN=&&F716HHSZ,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BY REG-NO ,RDB-DP-OM IN ASCENDING                            *         
//*         CDE-FILE AND FLAT TYPE IN DESCENDING                      *         
//*         NRIC IN ASCENDING                                         *         
//*-------------------------------------------------------------------*         
//STEP230  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716HHSZ,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716NTFT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A,18,1,A,91,1,D,82,2,D,9,9,A),FORMAT=CH                   
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BY REG-NO                                                    *         
//*-------------------------------------------------------------------*         
//STEP220  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F520,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),SPACE=(CYL,(50,10),RLSE),                          
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//* OUTPUT RECORD FROM UPGRADER FILE AND                              *         
//*        DROP MUTLITPLE REC AND MATCH K500 TO EXTRACT NT-REQ        *         
//*        AND FLAT-TYPE-REQ AND DTE-BALLOT                           *         
//* SIMILAR PROGRAM AS BP13C789 EXCEPT TO INCLUDE CHECK ON DTE-REGN   *         
//*        REGISTRATION ON THE RUN MONTH CASES ARE NOT INCLUDED       *         
//*-------------------------------------------------------------------*         
//STEP230  EXEC PGM=BP13C789,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716NTFT,DISP=(OLD,PASS)                                    
//BP13F500 DD DSN=&&P13F520,DISP=(OLD,PASS)                                     
//P13F716O DD DSN=&&F716WEEK,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM WEEKLY BP13F716 TO MONTH FILE                               *         
//*-------------------------------------------------------------------*         
//STEP231  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1  DD DSN=&&F716WEEK,DISP=(OLD,PASS)                                     
//OUTPUT1 DD DSN=BP13.F716.PROFILE.MONTH,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//*                   END OF JOB                                      *         
//*-------------------------------------------------------------------*         
