//BP13M403  JOB (BP13P),'BP13M403',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : MONTHLY APPOINTMENT FILES MAINTENANCE                 *         
//* FREQUENCY : LAST DAY OF MONTH. RUN AFTER BP13D701.                *         
//*                                                                   *         
//*===================================================================*         
//* CHGE REQ  DATE        BY   DESCRIPTION                            *         
//* --------  ----        ---  -----------                            *         
//* BP132330  24/04/2003  CLT  ADD NEW REPORT FOR BTO CASE            *         
//* BP13XXXX  31/07/2008  LSB  INCREASE SPACES IN STEP10              *         
//* BP134212  31/05/2011  ESD1 CATER TO PROCESS THE NEW BP13K452 FILE.*         
//* BP134814  31/03/2013  LJL1 CATER TO VERIFY BP13K452 AND BP13K454. *         
//* BP135171  11/02/2014  RJE1 TO CATER FOR DB2 UPGRADE                         
//* BP135228  29/10/2014  JGO1 NEW STEPS FOR TOL APPOINTMENT                    
//* BP136430  19/11/2016  KSJ3 CHANGE WORKPLAN LENGTH TO 1000                   
//* BP136580  12/01/2017  KSJ3 INCL NEW PGMS FOR SELF BOOKING                   
//* BP136561  19/01/2017  KSJ3 INCL BACK-UP FOR FC20.SELFLIST.AUTO              
//* BP136561  31/01/2017  KSJ3 SORT OUT KC30 FOR FC30 IN C45K                   
//* BP138334  03/06/2020  LJL1 TO STOP CREATION OF KC30 FOR JULY,AUG,           
//*                            SEPT OUT KC30 FOR FC30 IN C45K                   
//* BP138334  27/06/2020  LJL1 TO STOP CREATION OF WORKPLAN(OCT EXIST).         
//*                            AND SELFBOOK0 FOR FC30 IN C45K                   
//* BP138339  29/06/2020  KR13 REMOVED BP13C349 - IOM8 CONVERSION.              
//* BP138334  28/07/2020  LJL1 TO RESTORE TO STEADY STAGE                       
//*===================================================================*         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K452.WORKPLAN,DISP=OLD                                   
//INPUT2   DD DSN=BP13.K454.APPTABLE,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K45B.TOL.WORKPLAN,DISP=OLD                               
//INPUT4   DD DSN=BP13.K45H.TOL.APPTABLE,DISP=OLD                               
//INPUT5   DD DSN=BP13.KC30.SELFAPPT,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
           VFY FILE(INPUT1)                                                     
           VFY FILE(INPUT2)                                                     
           VFY FILE(INPUT3)                                                     
           VFY FILE(INPUT4)                                                     
           VFY FILE(INPUT5)                                                     
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                   *         
//* PRT01 : COPIES = 1               (SALES - AGM TEAM)               *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-N',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP APPT FILES BEFORE RUN                                     *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K452.WORKPLAN,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F452.WORKPLAN.BFMTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=1000,RECFM=FB)                      
//*                                                                             
//INPUT2   DD DSN=BP13.K454.APPTABLE,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F454.APPTABLE.BFMTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                   
//INPUT3   DD DSN=BP13.K45B.TOL.WORKPLAN,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F45B.WORKPLAN.BFMTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                       
//*                                                                             
//INPUT4   DD DSN=BP13.K45H.TOL.APPTABLE,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//OUTPUT4  DD DSN=BP13.F45H.APPTABLE.BFMTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                   
//*                                                                             
//INPUT5   DD DSN=BP13.KC30.SELFAPPT,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT5  DD DSN=BP13.FC30.SELFAPPT.BFMTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//*  REPRO  BP13K452                                                  *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT8   DD DSN=BP13.K452.WORKPLAN,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT8  DD DSN=BP13.F452.WORKPLAN,DISP=OLD                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT8)  OUTFILE(OUTPUT8)                                       
//*                                                                             
//**********************************************************************        
//*           C R E A T E   W O R K   P L A N                          *        
//**********************************************************************        
//*--------------------------------------------------------------------*        
//*  CREATE NEXT MONTH'S WORKPLAN BASED ON LAST DAY OF APPT            *        
//*--------------------------------------------------------------------*        
//STEP03   EXEC PGM=BP13C451,COND=(0,NE)                                        
//CP27K090 DD DSN=CP27.K090.HOLIDAY,DISP=SHR                                    
//BP13K458 DD DSN=BP13.K458.TIMESLOT,DISP=SHR                                   
//BP13K452 DD DSN=BP13.F452.WORKPLAN,DISP=SHR                                   
//BP13F452 DD DSN=BP13.F452.WORKPLAN,DISP=MOD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CREATE TEMP FILE OF BP13K452 - WORKPLAN    FILE (1)               *        
//*--------------------------------------------------------------------*        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K452.WORKPLAN,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F452,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=1000,BLKSIZE=0),                                
//          SPACE=(CYL,(5,1),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E50000                                   
   SUM FIELDS=NONE                                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CREATE TEMP FILE OF BP13K452 - WORKPLAN    FILE (2)               *        
//*--------------------------------------------------------------------*        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F452,DISP=(OLD,PASS)                                    
//         DD DSN=BP13.F452.WORKPLAN,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F453,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=1000,BLKSIZE=0),                                
//          SPACE=(CYL,(5,1),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E50000                                   
   SUM FIELDS=NONE                                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//*  DEFINE WORKPLAN TABLE VSAM FILE BP13K452                          *        
//*--------------------------------------------------------------------*        
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13F453,DISP=(OLD,PASS)                                     
//SYSIN    DD *                                                                 
         DEL 'BP13.K452.WORKPLAN' CLUSTER PURGE                                 
         DEF CL (NAME(BP13.K452.WORKPLAN) -                                     
                 TRK(5 3)                 -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 SHR(2 3)                 -                                     
                 KEYS(8 0)                -                                     
                 RECSZ(1000 1000)         -                                     
                 CISZ(4096)               -                                     
                 IXD                      -                                     
                 UNQ)                     -                                     
              DATA                        -                                     
              (NAME(BP13.K452.WORKPLAN.DATA)) -                                 
              INDEX                           -                                 
              (NAME (BP13.K452.WORKPLAN.INDEX))                                 
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K452.WORKPLAN)                                             
/*                                                                              
//*--------------------------------------------------------------------*        
//*  CREATE TEMP FILE OF BP13KC30                                      *        
//*--------------------------------------------------------------------*        
//STEP06A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KC30.SELFAPPT,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13FC30,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                                 
//          SPACE=(CYL,(20,10),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//* POPULATE BP13KC30 FOR NEW MONTH APPOINTMENT                        *        
//*--------------------------------------------------------------------*        
//STEP06B  EXEC PGM=BP13C45B,COND=(0,NE)                                        
//CP27K090 DD DSN=CP27.K090.HOLIDAY,DISP=SHR                                    
//BP13FC30 DD DSN=&&BP13FC30,DISP=(OLD,DELETE)                                  
//BP13KC35 DD DSN=BP13.KC35.SELFSLOT,DISP=SHR                                   
//BP13K452 DD DSN=BP13.K452.WORKPLAN,DISP=SHR                                   
//BP13KC30 DD DSN=BP13.KC30.SELFAPPT,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------*        
//* PROGRAM TO COMPARE MANPOWER SUPPLY TO MANPOWER DEMAND              *        
//* UPDATE WORKPLAN MAX TOTAL FOR SELFBOOK                             *        
//*--------------------------------------------------------------------*        
//STEP06C  EXEC PGM=BP13C45C,COND=(0,NE)                                        
//BP13F452 DD DSN=&&P13F453,DISP=(OLD,DELETE)                                   
//BP13KC30 DD DSN=BP13.KC30.SELFAPPT,DISP=SHR                                   
//BP13KC31 DD DSN=BP13.KC30.SELFAPPT.PATH1,DISP=SHR                             
//BP13K452 DD DSN=BP13.K452.WORKPLAN,DISP=OLD                                   
//BP13L45C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//**********************************************************************        
//*       D E L E T E  /  D E F I N E   D E T A I L   P L A N          *        
//**********************************************************************        
//*-------------------------------------------------------------------*         
//* CREATE TEMP FILE OF BP13K454 - APPT FILE                          *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K454.APPTABLE,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&BP13F454,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=23400),                              
//         SPACE=(TRK,(150,10),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,22,A),FORMAT=CH,FILSZ=E50000                                  
   SUM FIELDS=NONE                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* DEFINE APPTABLE TABLE VSAM FILE BP13K454                          *         
//* BP13K454  = BP13.K454.APPTABLE                                    *         
//* BP13K455  = BP13.K454.APPTABLE.PATH1                              *         
//*-------------------------------------------------------------------*         
//STEP08    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=&&BP13F454,DISP=(OLD,PASS)                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL 'BP13.K454.APPTABLE' CLUSTER PURGE                                 
         DEF CL (NAME(BP13.K454.APPTABLE) -                                     
                 CYL(4 1)                 -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 SHR(2 3)                 -                                     
                 KEYS(22 0)              -                                      
                 RECSZ(100 100)           -                                     
                 CISZ(4096)               -                                     
                 IXD                      -                                     
                 UNQ)                     -                                     
              DATA                        -                                     
              (NAME(BP13.K454.APPTABLE.DATA)) -                                 
              INDEX                           -                                 
              (NAME (BP13.K454.APPTABLE.INDEX))                                 
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K454.APPTABLE)                                             
         IF MAXCC = 0 THEN                        -                             
           DEF AIX (NAME(BP13.K454.APPTABLE.ALTX1) -                            
               REL(BP13.K454.APPTABLE)            -                             
               CYL(2 1)                    -                                    
               UNIQUE                         -                                 
               SHR(2 3))                -                                       
               DATA                       -                                     
               (NAME(BP13.K454.APPTABLE.ALTX1.DATA) -                           
               KEYS(10 12)                      -                               
               CISZ(4096)                    -                                  
               RECSZ(60 300)           -                                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                   -                                  
           DEF PATH(NAME(BP13.K454.APPTABLE.PATH1)-                             
               PENT(BP13.K454.APPTABLE.ALTX1))                                  
         IF MAXCC = 0 THEN                   -                                  
           BIX IDS(BP13.K454.APPTABLE) -                                        
               ODS(BP13.K454.APPTABLE.ALTX1)                                    
         IF MAXCC = 0 THEN                        -                             
           DEF AIX (NAME(BP13.K454.APPTABLE.ALTX2) -                            
               REL(BP13.K454.APPTABLE)            -                             
               CYL(1 1)                    -                                    
               UNIQUE                         -                                 
               SHR(2 3))                -                                       
               DATA                       -                                     
               (NAME(BP13.K454.APPTABLE.ALTX2.DATA) -                           
               KEYS(22 22)                     -                                
               CISZ(4096)                    -                                  
               RECSZ(60 300)           -                                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                   -                                  
           DEF PATH(NAME(BP13.K454.APPTABLE.PATH2)-                             
               PENT(BP13.K454.APPTABLE.ALTX2))                                  
         IF MAXCC = 0 THEN                   -                                  
           BIX IDS(BP13.K454.APPTABLE) -                                        
               ODS(BP13.K454.APPTABLE.ALTX2)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP APPT FILES AFTER RUN                                      *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.K452.WORKPLAN,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F452.WORKPLAN.AFMTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=1000,RECFM=FB)                      
//*                                                                             
//INPUT4   DD DSN=BP13.K454.APPTABLE,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT4  DD DSN=BP13.F454.APPTABLE.AFMTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                   
//*                                                                             
//INPUT5   DD DSN=BP13.KC30.SELFAPPT,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT5  DD DSN=BP13.FC30.SELFAPPT.AFMTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//*                                                                             
//INPUT6   DD DSN=BP13.FC25.SELFLIST.Q.ACCUM,DISP=SHR                           
//OUTPUT6  DD DSN=BP13.FC25.SELFLIST.Q.MTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                       
//*                                                                             
//INPUT7   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT7  DD DSN=BP13.FC25.SELFLIST.Q.ACCUM,DISP=OLD                           
//*                                                                             
//INPUT8   DD DSN=BP13.FC20.SELFLIST.AUTO.ACCUM,DISP=SHR                        
//OUTPUT8  DD DSN=BP13.FC20.SELFLIST.AUTO.MTHLY(+1),DISP=(NEW,CATLG),           
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                       
//*                                                                             
//INPUT9   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT9  DD DSN=BP13.FC20.SELFLIST.AUTO.ACCUM,DISP=OLD                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
   REPRO INFILE(INPUT7)  OUTFILE(OUTPUT7)                                       
   REPRO INFILE(INPUT8)  OUTFILE(OUTPUT8)                                       
   REPRO INFILE(INPUT9)  OUTFILE(OUTPUT9)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//*  REPRO  BP13K45B                                                  *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT8   DD DSN=BP13.K45B.TOL.WORKPLAN,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//OUTPUT8  DD DSN=BP13.F45B.TOL.WORKPLAN,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT8)  OUTFILE(OUTPUT8)                                       
//*                                                                             
//**********************************************************************        
//*           C R E A T E   W O R K   P L A N                          *        
//**********************************************************************        
//*--------------------------------------------------------------------*        
//*  CREATE NEXT MONTH'S WORKPLAN BASED ON LAST DAY OF APPT (TOL)      *        
//*--------------------------------------------------------------------*        
//STEP13   EXEC PGM=BP13C45A,COND=(0,NE)                                        
//CP27K090 DD DSN=CP27.K090.HOLIDAY,DISP=SHR                                    
//BP13K45F DD DSN=BP13.K45F.TOL.TIMESLOT,DISP=SHR                               
//BP13K45B DD DSN=BP13.F45B.TOL.WORKPLAN,DISP=SHR                               
//BP13F45B DD DSN=BP13.F45B.TOL.WORKPLAN,DISP=MOD                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CREATE TEMP FILE OF BP13K452 - WORKPLAN    FILE (1)               *        
//*--------------------------------------------------------------------*        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K45B.TOL.WORKPLAN,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13F45B,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                                 
//          SPACE=(CYL,(5,1),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E50000                                   
   SUM FIELDS=NONE                                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CREATE TEMP FILE OF BP13K452 - WORKPLAN    FILE (2)               *        
//*--------------------------------------------------------------------*        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F45B,DISP=(OLD,PASS)                                    
//         DD DSN=BP13.F45B.TOL.WORKPLAN,DISP=SHR                               
//SORTOUT  DD DSN=&&P13F45H,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                                 
//          SPACE=(CYL,(5,1),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E50000                                   
   SUM FIELDS=NONE                                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//*  DEFINE WORKPLAN TABLE VSAM FILE BP13K45B                          *        
//*--------------------------------------------------------------------*        
//STEP16   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13F45H,DISP=(OLD,PASS)                                     
//SYSIN    DD *                                                                 
         DEL 'BP13.K45B.TOL.WORKPLAN' CLUSTER PURGE                             
         DEF CL (NAME(BP13.K45B.TOL.WORKPLAN) -                                 
                 TRK(5 3)                 -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 SHR(2 3)                 -                                     
                 KEYS(8 0)                -                                     
                 RECSZ(600 600)           -                                     
                 CISZ(4096)               -                                     
                 IXD                      -                                     
                 UNQ)                     -                                     
              DATA                        -                                     
              (NAME(BP13.K45B.TOL.WORKPLAN.DATA)) -                             
              INDEX                           -                                 
              (NAME (BP13.K45B.TOL.WORKPLAN.INDEX))                             
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K45B.TOL.WORKPLAN)                                         
/*                                                                              
//**********************************************************************        
//*       D E L E T E  /  D E F I N E   D E T A I L   P L A N          *        
//**********************************************************************        
//*-------------------------------------------------------------------*         
//* CREATE TEMP FILE OF BP13K45H - APPT FILE  ( TOL )                 *         
//*-------------------------------------------------------------------*         
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K45H.TOL.APPTABLE,DISP=SHR,                              
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&BP13F45H,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=23400),                              
//         SPACE=(TRK,(150,10),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,22,A),FORMAT=CH,FILSZ=E50000                                  
   SUM FIELDS=NONE                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* DEFINE APPTABLE TABLE VSAM FILE BP13K454                          *         
//* BP13K45H  = BP13.K45H.TOL.APPTABLE                                *         
//* BP13K45D  = BP13.K45H.TOL.APPTABLE.PATH1                          *         
//*-------------------------------------------------------------------*         
//STEP18    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=&&BP13F45H,DISP=(OLD,PASS)                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL 'BP13.K45H.TOL.APPTABLE' CLUSTER PURGE                             
         DEF CL (NAME(BP13.K45H.TOL.APPTABLE) -                                 
                 CYL(4 1)                 -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 SHR(2 3)                 -                                     
                 KEYS(22 0)              -                                      
                 RECSZ(100 100)           -                                     
                 CISZ(4096)               -                                     
                 IXD                      -                                     
                 UNQ)                     -                                     
              DATA                        -                                     
              (NAME(BP13.K45H.TOL.APPTABLE.DATA)) -                             
              INDEX                           -                                 
              (NAME (BP13.K45H.TOL.APPTABLE.INDEX))                             
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K45H.TOL.APPTABLE)                                         
         IF MAXCC = 0 THEN                        -                             
           DEF AIX (NAME(BP13.K45H.TOL.APPTABLE.ALTX1) -                        
               REL(BP13.K45H.TOL.APPTABLE)        -                             
               CYL(2 1)                    -                                    
               UNIQUE                         -                                 
               SHR(2 3))                -                                       
               DATA                       -                                     
               (NAME(BP13.K45H.TOL.APPTABLE.ALTX1.DATA) -                       
               KEYS(10 12)                      -                               
               CISZ(4096)                    -                                  
               RECSZ(60 300)           -                                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                   -                                  
           DEF PATH(NAME(BP13.K45H.TOL.APPTABLE.PATH1)-                         
               PENT(BP13.K45H.TOL.APPTABLE.ALTX1))                              
         IF MAXCC = 0 THEN                   -                                  
           BIX IDS(BP13.K45H.TOL.APPTABLE) -                                    
               ODS(BP13.K45H.TOL.APPTABLE.ALTX1)                                
//*                                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP APPT FILES AFTER RUN                                      *         
//*-------------------------------------------------------------------*         
//STEP19   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.K45B.TOL.WORKPLAN,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F45B.WORKPLAN.AFMTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                       
//*                                                                             
//INPUT4   DD DSN=BP13.K45H.TOL.APPTABLE,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//OUTPUT4  DD DSN=BP13.F45H.APPTABLE.AFMTHLY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(2,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
//*                                                                             
//*----------------------------------------------------------------*            
//*            END OF JOB                                          *            
//*----------------------------------------------------------------*            
