//BP13A219 JOB (BP13P),'BP13A219',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*------------------------------------------------------------------           
//* JOB TO PASS ACCUMMULATIVE UPDATE TO INTV. THIS JOB IS                       
//* RUN AS AN ETT JOB (USER SUBMITS THE JOB THRU CICSP ONLINE PANEL).           
//*                                                                             
//* THIS JOB WILL EXTRACT THE UPDATE FROM THE DATE SPECIFIED BY USER            
//* UNTIL THE TIME THE JOB IS RUN.                                              
//* ====================================================================        
//* CHG-NO   BY    ON        DESCRIPTION                                        
//* ======== === ==========  ===========                                        
//* BP130956 AKT 23-11-2000  CHGE BP13F230 LRECL TO 250                         
//* BP132278 JF4 28-03-2003  CHGE BP13F230/F240 LRECL TO 450.                   
//* BP134086 ESD1 30-12-2010 CATER TO STOP SENDING TXT TO MEDIACORP             
//*                          PERMANENTLY.                                       
//* BP13XXXX EL27 20-05-2022 STOP SENDING TO XQBR (AA11)                        
//* ====================================================================        
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*---------------------------------------------------------------------        
//STEP00   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.DATEREC,DISP=OLD                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'ID')                                              
/*                                                                              
//*******************************************************************           
//* STEP01  TO BACKUP BP13.F230.ACCUM                                           
//*******************************************************************           
//STEP01   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F230.ACCUM,DISP=SHR                                     
//OUTPUT1  DD  DSN=BP13.F230.ACCUM.BKUP(+1),                                    
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=130,RECFM=FB)                      
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*******************************************************************           
//* STEP02  TO SORT DETAIL REC IN DECENDING ORDER OF ACCEPTANCE DATE            
//*******************************************************************           
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SORTOUT  DD  DSN=&&P13F230A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(LRECL=450,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT  FIELDS=(15,8,D),FORMAT=CH                                               
  INCLUDE COND=(15,8,CH,NE,C'        ',AND,214,1,CH,NE,C'Y')                    
/*                                                                              
//*******************************************************************           
//* STEP03  TO SORT SUMMARY REC IN DECENDING ORDER OF DATE-UPDATE               
//*******************************************************************           
//STEP03   EXEC  SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SORTOUT  DD  DSN=&&P13F240A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(LRECL=450,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT  FIELDS=(82,8,CH,D)                                                      
  INCLUDE COND=(82,8,CH,NE,C'        ',AND,229,1,CH,NE,C'Y')                    
/*                                                                              
//*******************************************************************           
//* STEP04  TO SORT OUT ACCUM UPDATE FOR THE DAY                                
//*******************************************************************           
//STEP04   EXEC  PGM=BP13C259,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.DATEREC,DISP=SHR                                   
//BP13F230 DD  DSN=&&P13F230A,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F240 DD  DSN=&&P13F240A,                                                  
//             DISP=(SHR,DELETE)                                                
//P13F230A DD  DSN=&&P13F230B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(30,15),RLSE),                                        
//             DCB=(LRECL=450,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*******************************************************************           
//* STEP05  TO SORT OUT ACCUM UPDATE FOR THE DAY                                
//*******************************************************************           
//STEP05   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F230B,                                                  
//             DISP=(SHR,DELETE)                                                
//SORTOUT  DD  DSN=&&P13F230C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(30,15),RLSE),                                        
//             DCB=(LRECL=450,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT  FIELDS=(7,8,A,97,10,A,30,27,A,5,2,A),FORMAT=CH                          
/*                                                                              
//*********************************************************************         
//* STEP06  TO CALCULATE THE TOTAL NUMBER OF DETAIL REC SENT                    
//*********************************************************************         
//STEP06   EXEC  PGM=BP13C252,COND=(0,NE)                                       
//P13F230A DD  DSN=&&P13F230C,                                                  
//             DISP=(SHR,DELETE)                                                
//P13F230B DD  DSN=&&P13F230D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(30,15),RLSE),                                        
//             DCB=(LRECL=450,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                           
//*---------------------------------------------------------------------        
//STEP07 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F230D,                                                  
//             DISP=(SHR,DELETE)                                                
//SORTOUT  DD  DSN=&&P13F230E,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(15,3),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(7,8,A,97,10,A,30,27,A,5,2,A,59,5,A,57,2,A),FORMAT=CH          
/*                                                                              
//*---------------------------------------------------------------------        
//* EDIT RECORDS WITH NUM-SELECTION = '3R ' (FOR RECID = '05')                  
//*---------------------------------------------------------------------        
//STEP08 EXEC    PGM=BP13C279,COND=(0,NE)                                       
//BP13F230 DD  DSN=&&P13F230E,                                                  
//             DISP=(SHR,PASS)                                                  
//P13F230O DD  DSN=BP13.F230.ACCUM,                                             
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO REPLACE RECORDS IN FILE                                                 
//*--------------------------------------------------------------------         
//STEP09 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F230.ACCUM,                                             
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F230.FLATLIST.START,                                    
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*     TO CLEAR FILE                                                           
//*---------------------------------------------------------------------        
//STEP10 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             DCB=BP13.F230.FLATLIST.SENDALL                                   
//SYSUT2   DD  DSN=BP13.F230.FLATLIST.SENDALL,                                  
//             DISP=OLD                                                         
//SYSIN    DD  DUMMY                                                            
//IFTEST IF (STEP08.RC = 0) THEN                                                
//*********************************************************************         
//*     ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                         
//*********************************************************************         
//STEP13    EXEC PGM=IDCAMS                                                     
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F205.DATEREC,DISP=SHR                                   
//OUTPUT1   DD DSN=BP13.F205.ACCUM,DISP=MOD                                     
//SYSIN     DD *                                                                
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
/*                                                                              
//*--------------------------------------------------------------------         
//*   SEND INTV FILE TO PRINTER PORT HQMS                                       
//*--------------------------------------------------------------------         
//STEP14 EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=BP13.F230.ACCUM,                                             
//             DISP=SHR                                                         
//SYSUT2   DD SYSOUT=A,DEST=XCBQ                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//ENDTEST  ENDIF                                                                
//*********************************************************************         
//* END OF JOB BP13A219                                                         
//*********************************************************************         
