//BP13D211 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//             NOTIFY=CSD0071                                                   
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K295.FLATLOG,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          IF LASTCC=12 THEN DO                                                  
             SET MAXCC=0                                                        
             VFY FILE(INPUT1)                                                   
          END                                                                   
/*                                                                              
//*---------------------------------------------------------------------        
//* BACKUP FILES BEFORE UPDATE                                                  
//*---------------------------------------------------------------------        
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K295.FLATLOG,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT1  DD  DSN=BP13.F295.FLATLOG.DAILY(+1),                                 
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(1000,100),RLSE),                                     
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=4000,RECFM=FB)                     
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*---------------------------------------------------------------------        
//* DEFINE FLATLOG VSAM FILE BP13K295                                           
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.BLANK.CHAR4000,                                         
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL 'BP13.K295.FLATLOG' CLUSTER PURGE                                 
          DEF CLUSTER                                -                          
              (NAME(BP13.K295.FLATLOG)               -                          
              CYL(200 50)                            -                          
              DATACLAS(VSAMEXTA)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K295.FLATLOG.DATA)          -                          
              KEYS(16 0)                             -                          
              RECSZ(4000 4000)                       -                          
              CISZ(12288)                            -                          
              FSPC(0 0))                             -                          
              INDEX                                  -                          
              (NAME(BP13.K295.FLATLOG.INDEX))                                   
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K295.FLATLOG)                                              
//*---------------------------------------------------------------------        
//*   S99   SEND MESSAGE TO OPERATOR TO OPEN FILES                              
//*---------------------------------------------------------------------        
//S99      EXEC WTOG,COND=(0,NE)                                                
   ----> ###################################################                    
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13D211                             
   ---->    PLEASE OPEN BP13K295                                                
   ----> ###################################################                    
//*--------------------------------------------------------------------         
//*    END OF JOB BP13D211                                                      
//*--------------------------------------------------------------------         
