//BP13A280 JOB (BP13P),'BP13A280',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* PASS INTERFACE FILE TO HOMMAS                                               
//*=================================================================            
//* BP133846 20100319 DW5  NEW JCL TO PASS INTERFACE TO HOMMAS          00000100
//* BP133997 20101007 DW5  ADD BP13F205 TO ACCUM                        00000100
//*=================================================================    00000120
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = HO                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'HO')                                               
//*---------------------------------------------------------------------        
//* SORTOUT  BM06K110 BY KEY WITH KEY AVAILABLE DATE                            
//*                           OR  HANDOVER DATE                                 
//*---------------------------------------------------------------------        
//STEP02  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BM06.K110.FLATINV,DISP=SHR                                     
//SORTOUT DD DSN=&&BM06F110,DISP=(,PASS),                                       
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=500),                                             
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
  INCLUDE COND=(275,8,CH,GT,C'00000000',OR,                                     
                251,8,CH,GT,C'00000000')                                        
//*-----------------------------------------------------------------            
//* TO PRINT LIST OF FLATS FOR HOMMAS                                           
//* USER ID: HMFL                                                               
//*-----------------------------------------------------------------            
//STEP03  EXEC SAS,COND=(4,LT)                                                  
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(500,300))                                  
//K110     DD DSN=&&BM06F110,DISP=(OLD,PASS)                                    
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//OUTFILE1 DD DSN=BM06.F050.HOMMAS.FLATLIST.NPL,DISP=MOD                        
//OUTFILE2 DD DSN=BM06.F050.HOMMAS.FLATLIST,DISP=MOD                            
//OUTFILE3 DD DSN=BP13.L90Y.BP13S90Y.HMFL,DISP=SHR                              
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S90Y),DISP=SHR                             
//*********************************************************************         
//* STEP04  TO BACKUP HOMMAS INTERFACE FILE                                     
//*********************************************************************         
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BM06.F050.HOMMAS.FLATLIST.NPL,                               
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BM06.F050.HOMMAS.FLATLIST.NPL.BKUP(+1),                      
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(4,2),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=80,RECFM=FB)                       
//INPUT2   DD  DSN=BM06.F050.HOMMAS.FLATLIST,                                   
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BM06.F050.HOMMAS.FLATLIST.BKUP(+1),                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(4,2),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=80,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
/*                                                                              
//*-----------------------------------------------------------------    00002300
//*  ACCUMULATE CONTROL REC INTO CTLREC-ACC FILE                        00002310
//*-----------------------------------------------------------------    00002320
//STEP05   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00002330
//SYSPRINT DD  SYSOUT=*                                                 00002340
//INPUT1   DD  DSN=&&BP13F205,DISP=(OLD,PASS)                           00002350
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                     00002370
//             DISP=MOD                                                 00002380
//SYSIN    DD  *                                                        00002430
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                      00002440
