//BP13ACCA JOB (BP13P),'BP13ACCA',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=====================================================================        
//* SHORTLIST 100% - PRIORITY (FOR CCA APPLICATIONS WITH CARE NEEDS)            
//*=====================================================================        
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- ---------------------------------------------        
//* BP138600 IL5  10022021 NEW JCL FOR CCA                                      
//* BP138600 IL5  15032021 REPLACE BP13.BATCH.LOADCOB WITH                      
//*                        BP13.BATCH.LOADCOB.BALLOT FOR BP13U549               
//*=====================================================================        
//* VERIFY FILES BEFORE JOB RUN                                                 
//*---------------------------------------------------------------------        
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*=====================================================================        
//* REPRO VSAM FILE TO SEQUENTIAL FILE                                          
//*---------------------------------------------------------------------        
//STEP0B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.ACCA,DISP=OLD                                
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F740.MATUREBA.ACCA,DISP=OLD                              
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*---------------------------------------------------------------------        
//* TO PREPARE FLAT AND ETHINIC QUOTA FOR SHORTLISTING 200%                     
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=BP13CF79,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13F010 DD DSN=BP13.F010.TENDER.PA,DISP=OLD                                  
//P13F010A DD DSN=BP13.F010.TENDER.PA.MAXCAT,DISP=OLD                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=====================================================================        
//* SORT OUT JB APPLICATIONS TO REPLACE RANDOM NO                               
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F740.MATUREBA.ACCA.JB,DISP=OLD                           
//SYSIN DD *                                                                    
   SORT FIELDS=(187,3,A,211,2,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=(211,2,CH,EQ,C'1F',AND,177,1,CH,NE,C' ')                        
//*=====================================================================        
//* GET THE LARGER REGNO BETWEERN REGNO AND JB REGNO + THE                      
//* RANDOM NUMBER OF THE SMALLER REGNO                                          
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13CZ4A,COND=(0,NE)                                        
//BP13F740 DD DSN=BP13.F740.MATUREBA.ACCA.JB,DISP=SHR                           
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//BP13K741 DD DSN=BP13.K740.MATUREBA.PATH1,DISP=SHR                             
//BP13LZ4A DD DSN=BP13.LZ4A.JB.UPDATE,DISP=OLD                                  
//BP13F74A DD DSN=BP13.F740.MATUREBA.ACCA.JB.BACKUP,DISP=OLD                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*=====================================================================        
//* UPDATE RN AND PRINT REPORT ON CA JB APPL WITH ORIG AND UPD RN               
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13CZ4B,COND=(0,NE)                                        
//BP13LZ4A DD DSN=BP13.LZ4A.JB.UPDATE,DISP=SHR                                  
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//BP13K741 DD DSN=BP13.K740.MATUREBA.PATH1,DISP=SHR                             
//BP13LZ4B DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*=====================================================================        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*---------------------------------------------------------------------        
//STEP05A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740ALL,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*=====================================================================        
//* PROFILE OF CCA APPLICATIONS BEFORE PIGEONHOLING                             
//*---------------------------------------------------------------------        
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR CCA APPLICATIONS                                           
//*-----------------------------------------------------------------            
//STEP05B  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740ALL,DISP=(OLD,DELETE)                                   
//BP13L576 DD SYSOUT=8,DEST=IOM8                                                
//BP13F001 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S576),DISP=SHR                             
/*                                                                              
//*=====================================================================        
//* SORT OUT PRIMARY PRIORITY (CCA TAG = 'P') BY RANDOM NUMBER                  
//*---------------------------------------------------------------------        
//STEP06A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740CCAP,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN DD *                                                                    
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   INCLUDE COND=(211,2,CH,EQ,C'1F',AND,202,1,CH,EQ,C'P')                        
//*=====================================================================        
//* SORT OUT SECONDARY PRIORITY (CCA TAG = 'S') BY RANDOM NUMBER                
//*---------------------------------------------------------------------        
//STEP06B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740CCAS,DISP=(MOD,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN DD *                                                                    
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   INCLUDE COND=(211,2,CH,EQ,C'1F',AND,202,1,CH,EQ,C'S')                        
//*------------------------------------------------------------------*          
//* SORT OUT CCA=S CASES PAIRED WITH CCA=P CASES                     *          
//*------------------------------------------------------------------*          
//STEP06C  EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=&&F740CCAP,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=&&F740CCAS,DISP=(OLD,DELETE)                                  
//MATCH    DD DSN=&&F740PAIR,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(20,10),RLSE)                                          
//F2ONLY   DD DSN=&&F740OLYS,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(177,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(123,8,A)                                            
   JOIN UNPAIRED,F1,F2                                                          
   REFORMAT FIELDS=(F2:1,500,?)                                                 
   OPTION COPY                                                                  
   OUTFILE FNAMES=MATCH,INCLUDE=(501,1,CH,EQ,C'B'),                             
   BUILD=(1,500)                                                                
   OUTFILE FNAMES=F2ONLY,INCLUDE=(501,1,CH,EQ,C'2'),                            
   BUILD=(1,500)                                                                
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*=====================================================================        
//* SORT OUT PRIMARY PRIORITY (CCA TAG = 'P')  AND PAIRED SECONDARY             
//* PRIORITY (CCA TAG = 'S') CASES BY RANDOM NUMBER                             
//*---------------------------------------------------------------------        
//STEP06D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740CCAP,DISP=(OLD,DELETE)                                  
//         DD DSN=&&F740PAIR,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F740U549,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN DD *                                                                    
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*=====================================================================        
//* SORT OUT SECONDARY PRIORITY (CCA TAG = 'S') BY RANDOM NUMBER                
//*---------------------------------------------------------------------        
//STEP06E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740OLYS,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F740U549,DISP=(MOD,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN DD *                                                                    
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*=====================================================================        
//* TO PROCESS THE PIGEON-HOLDING FOR CCA APPLICATIONS WITH CARE NEEDS          
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13U549,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F740 DD DSN=&&F740U549,DISP=(OLD,DELETE)                                  
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L549 DD SYSOUT=8,DEST=IOM8                                                
//P13L549A DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
PR                                                                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=====================================================================        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*---------------------------------------------------------------------        
//STEP08A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740ALL,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*=====================================================================        
//* PROFILE OF CCA APPLICATIONS BEFORE PIGEONHOLING                             
//*---------------------------------------------------------------------        
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR CCA APPLICATIONS                                           
//*-----------------------------------------------------------------            
//STEP08B  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740ALL,DISP=(OLD,DELETE)                                   
//BP13L576 DD SYSOUT=8,DEST=IOM8                                                
//BP13F001 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S576),DISP=SHR                             
/*                                                                              
