//BP13A539 JOB (BP13P),'BP13A539',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* ASSIGN HHTY QUEUE/ZONE-FT QUEUE POSITION                                    
//**********************************************************************        
//*BP130652     990825   EXPAND F500,F510,F520,K520 RECL 300 TO 500             
//*BP130871 SSS 000609   LISTING FOR EAALSS                                     
//*BP130902 AKT 000905   TO CATER FOR QUEUE PRIORITY.                           
//*BP131048 LSB 010724   SORT BY SUCC-ZONE IN STEP33                            
//*BP132317 LSB 030321   BTO CHANGES                                            
//*BP132412 MJ16031015   INCLUDED FILE BP13K703 IN PGM BP13C514                 
//*BP132496 CKK 040504   TO UPDATE FILE LAYOUT FOR BP13C745                     
//*=================================================================            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT02 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=IA1A                                       
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K830.ADDR,DISP=OLD                                       
//INPUT5   DD DSN=BP13.K520.BALLOT,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
//*---------------------------------------------------------------------        
//* SORT OUT THE RECORDS OUTPUT FROM THE ONLINE UPDATE AFTER BALLOT             
//* PANEL OR UPDATE AFTER ASSIGNED WEIGHTAGE PANEL                              
//* INCLUDE UPDATE DATE >= 950101                                               
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F595,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(13,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(477,8,A),FORMAT=CH                                              
   INCLUDE COND=(300,1,CH,EQ,C'T',AND,485,8,CH,GE,C'20030101')                  
//*---------------------------------------------------------------------        
//* NOTE : COL 123, WILL BE UPDATE BY REGN-NO FOR SUCC CASES, RUN THIS          
//*        STEP BEFORE ASSIGN REGN-NO                                           
//* PRINT REPORT ON BEFORE AND AFTER IMAGE OF UPDATE AFTER BALLOTING            
//* FOR INTERNAL AUDIT                                                          
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13C745,COND=(0,NE)                                        
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F595 DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//BP13L745 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*-  REPRO REGN NO FILE TO SEQ FILE                                            
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=SHR,                                   
//            AMP=('BUFND=12')                                                  
//OUTPUT1  DD DSN=BP13.F530.ISSUENO,DISP=OLD                                    
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*-  REPRO BALLOT FILE TO SEQ FILE                                             
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F520.BALLOT.DAILY(+1),DISP=(NEW,CATLG),                  
//            SPACE=(CYL,(48,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* SORT OUT ONLY SUCCESSFUL CASES.                                             
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR                                     
//SORTOUT  DD DSN=&&F740MAT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,213,2,A,10,19,A),FORMAT=CH                            
     INCLUDE COND=(260,1,CH,EQ,C'S')                                            
//*-----------------------------------------------------------------            
//* OUTPUT FILES FOR SEPARATE PIGEONHOLING PROCESS, PRIORITY,                   
//* TRANSITION NHH > 7 MTH, AND COHORTS ( MAX 5 )                               
//*-----------------------------------------------------------------            
//STEP6A   EXEC PGM=BP13C741,COND=(0,NE),ADDRSPC=VIRT,REGION=4096K              
//BP13F520 DD  DSN=&&F740MAT,DISP=(OLD,PASS)                                    
//BP13MGP  DD  DUMMY                                                            
//BP13PR   DD  DSN=&&F740PRO,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13GRO  DD  DSN=&&F740GR1,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13PUB  DD DSN=&&F740PUB,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//SYSDBG   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* OUTREC AAA TO ALLO-SCH FOR ALL GRO CASES                                    
//*---------------------------------------------------------------------        
//STEP06A  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740GR1,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(,PASS),                                       
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(35,2),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,373,3,A,163,2,A,10,19,A),FORMAT=CH                       
  OUTREC FIELDS=(1,212,C'AAA',216,284)                                          
//*---------------------------------------------------------------------        
//* OUTREC SPACES TO GRO-RANK AND WARD TO NON-GRO CASES                         
//* OUTREC PA TO ALLOC-SCHEME TO NON-GRO CASES                                  
//*---------------------------------------------------------------------        
//STEP06C  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740PUB,DISP=(OLD,PASS)                                     
//         DD DSN=&&F740PRO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(MOD,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,10,19,A),FORMAT=CH                                       
  OUTREC FIELDS=(1,162,C'  ',165,48,C'PA ',216,157,C'   ',376,124)              
//*---------------------------------------------------------------------        
//* SORT BY NT, FT, WARD, GRO RANKING AND 10TH BYTE RANDOM NO                   
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740GRO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,213,3,A,373,3,A,163,2,A,10,19,A),FORMAT=CH            
//*---------------------------------------------------------------------        
//* TO ASSIGN REGN NUMBER TO SUCCESSFUL CASES AFTER BALLOTING                   
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C512,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K530 DD DSN=BP13.K530.ISSUENO,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L512 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT IN SUCC NEW TOWN,FLAT TYPE AND REGISTRATION NUMBER                     
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,123,8,A),FORMAT=CH                            
     INCLUDE COND=(260,1,CH,EQ,C'S')                                            
//*---------------------------------------------------------------------        
//*  TO PRINT SUCESSFUL REQUEST ASSIGNED WITH REGISTRATION NO.                  
//*  TO ASSIGN QUEUE NO BASED ON NT,FT,REG NO.                                  
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C514,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740REGN,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L514 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//STEP10   EXEC SAS,COND=(0,NE)                                                 
//BP13K520 DD DSN=&&F740REGN,DISP=(OLD,PASS)                                    
//BP13L536 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S536),DISP=SHR                             
//*---------------------------------------------------------------------        
//STEP11   EXEC SAS,COND=(0,NE)                                                 
//BP13K520 DD DSN=&&F740REGN,DISP=(OLD,PASS)                                    
//BP13L535 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S535),DISP=SHR                             
//*                                                                             
//*---------------------------------------------------------------------        
//* END BP13A539                                                                
//*---------------------------------------------------------------------        
