//BP13D806 JOB (BP13P),'BP13D806',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB08605
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//**************************************************************        00040000
//*             SENDING SMS TO BOOKING CASES                            00050000
//**************************************************************        00060000
//* CHG REF  BY  ON        DESCRIPTION                                  00070000
//* -------- --- ------    -----------                                  00080000
//* BP132943 CKK 20061201  NEW JCL. FOR SENDING SMS                     00090000
//* BP135227 ESA120140701  TO CATER FOR SENDING SMS FOR PENDING DOCUMENT00100000
//* BP135941 EL2720151019  INCLUDE 'BI' IN SORTING OF BP13K203          00110000
//* BP136192 ESA120160427  TO ADD CREATION OF BP13.F203.SMS.BN          00120000
//* BP136133 CCC520160601  TO SPLIT 'BN' INTO 4 PARTS                   00130000
//* BP136431 KSJ 20160919  TO RUN BP13CS03 FOR BP13.F203.SMS.PCD        00140000
//* BP136561 KSJ 20170118  TO RUN BP13CS03 FOR BP13.F203.SMS.SBK.AUTO   00150000
//*                        TO RUN BP13CS12 FOR BP13.F23B.EMAIL.SBK.AUTO 00160000
//* BP136757 KSJ 20170821  TO RUN BP13CS03 FOR BP13.F203.SMS.CPF.SOCA   00170000
//* BP137144 ESA120180105  TO CATER FOR APPOINTMENT TYPE 'DI' AND 'DN'  00180000
//* BP137144 EL2720180120  SPLIT STEP4 INTO 2 FOR 600 APPT LIMIT        00190000
//* BP137024 LJL120180312  SPLIT STEP09A INTO 6 FOR 1800 APPT LIMIT     00200000
//* BP137208 FNP120180314  TO CATER FOR APPOINTMENT TYPE 'BR'           00210000
//* BP137208 EL2720180315  REORG BK & BN STEPS, INCLUDE BP13C24N FOR BN 00220000
//* BP138198 PP11 20200213  TO INCREASE THE SPILITING BY 33%            00230000
//* BP138198 PP11 20200217  TO CATER FOR APPOINTMENT TYPE 'DZ'          00240000
//* BP138330 EL27 20200601 TRANSLATE BN DN TO K1-K4(BTO) AND L1-L4(SBF) 00250000
//*                        OUTPUT TO 20 DATASETS WITH 200 REC EACH      00260000
//*                        CATERED FOR MAX 1000 BN/DN CASES             00270000
//* BP138744 PP11 20210521 TRANSLATE BI TO BJ AND DI TO DJ              00280000
//* BP138981 MRR5 20211213 CATER FOR K5-K8 AND L5-L8                    00290000
//* BP138998 LJL1 20211214 CATER FOR 2000 SMS                           00300000
//* BP139170 EL27 20220525 DOWNSIZE BK NOTIFICATION AND REMINDER SMSES  00310000
//*                        IN GENERAL, OLD 2ND AND 3RD SMS BECOME 1 SMS 00320000
//*                        BTO 100% K1-K4 BECOME K1-K3                  00330000
//*                        BTO>100% K5-K8 BECOME K5-K7                  00340000
//*                        SBF 100% L1-L4 BECOME L1-L3                  00350000
//*                        SBF>100% L5-L8 BECOME L5-L7                  00360000
//*                        DROPPED BJ DJ DZ (2ND SMS OF REMINDER)       00370000
//* BP138926 PP11 20220928 CONVERT AUTOMATED SMS INTO XML FORMAT        00310000
//* BP139611 MRR5 20230911 NEW APPMT TYPES FOR HFE                      00310000
//*                        CI - 3 days reminder 100%                            
//*                        CN - 14 days reminder 100%                           
//*                        EI - 3 days reminder >100%                           
//*                        EN - 14 days reminder >100%                          
//*-------------------------------------------------------------------* 00300000
//*-------------------------------------------------------------------*         
//* DELETE THE TEMP DATA SETS                                                   
//*-------------------------------------------------------------------*         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL (BP13.F203.ASMS.BK.XML01)                                              
     DEL (BP13.F203.ASMS.BK.XML02)                                              
     DEL (BP13.F203.ASMS.BK.XML03)                                              
     DEL (BP13.F203.ASMS.BK.XML04)                                              
     DEL (BP13.F203.ASMS.BK.XML05)                                              
     DEL (BP13.F203.ASMS.BN.XML01)                                              
     DEL (BP13.F203.ASMS.BN.XML02)                                              
     DEL (BP13.F203.ASMS.BN.XML03)                                              
     DEL (BP13.F203.ASMS.BN.XML04)                                              
     DEL (BP13.F203.ASMS.BN.XML05)                                              
     DEL (BP13.BULKSMS.FILEIN)                                                  
     DEL (BP13.BULKSMS.FILEIN.FTP)                                              
     DEL (BP13.F203.FTP)                                                        
     DEL (BP13.F203.BN.FTP)                                                     
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* DEFINE TEMP DATA SETS                                                       
//*-------------------------------------------------------------------*         
//STEP00A  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F203001   DD  DSN=BP13.F203.ASMS.BK.XML01,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203002   DD  DSN=BP13.F203.ASMS.BK.XML02,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203003   DD  DSN=BP13.F203.ASMS.BK.XML03,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203004   DD  DSN=BP13.F203.ASMS.BK.XML04,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203005   DD  DSN=BP13.F203.ASMS.BK.XML05,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203006   DD  DSN=BP13.F203.ASMS.BN.XML01,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203007   DD  DSN=BP13.F203.ASMS.BN.XML02,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203008   DD  DSN=BP13.F203.ASMS.BN.XML03,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203009   DD  DSN=BP13.F203.ASMS.BN.XML04,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203010   DD  DSN=BP13.F203.ASMS.BN.XML05,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203011   DD  DSN=BP13.BULKSMS.FILEIN,                                        
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
/*                                                                              
//F203012   DD  DSN=BP13.BULKSMS.FILEIN.FTP,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
/*                                                                              
//F203013   DD  DSN=BP13.F203.FTP,                                              
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
/*                                                                              
//F203014   DD  DSN=BP13.F203.BN.FTP,                                           
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
/*                                                                              
//*-------------------------------------------------------------------* 00310000
//*  SORT OUT ALL THE BOOKING CASES FOR SENDING 3-DAYS REMINDER SMS     00320000
//*-------------------------------------------------------------------- 00330000
//STEP01   EXEC SORT,COND=(0,NE)                                        00340000
//SORTIN   DD DSN=BP13.K203.SMS,DISP=SHR                                00350000
//SORTOUT  DD DSN=&&F203BK,DISP=(NEW,PASS),                             00360000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         00370000
//         SPACE=(CYL,(8,5),RLSE)                                       00380000
//SYSIN    DD  *                                                        00390000
   SORT FIELDS=(1,19,A),FORMAT=CH                                       00400000
   INCLUDE COND=(1,3,CH,NE,C'DBS',AND,                                  00410000
                 (9,2,CH,EQ,C'BK',OR,9,2,CH,EQ,C'BM',OR,                00420000
                  9,2,CH,EQ,C'BL',OR,9,2,CH,EQ,C'BS',OR,                00430000
                  9,2,CH,EQ,C'BI',OR,9,2,CH,EQ,C'DI'),AND,              00440000
                  140,1,CH,EQ,C' ')                                     00450000
//*---------------------------------------------------------------------00460000
//*  OUTPUT ONLY CASES WITHIN DAY +3                                    00470000
//*  REMOVE CANCELLED CASES AND NO HANDPHONE CASES                      00480000
//*-------------------------------------------------------------------- 00490000
//STEP02   EXEC PGM=BP13CS02,COND=(0,NE)                                00500000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              00510000
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                    00520000
//BP13F203 DD DSN=&&F203BK,DISP=(SHR,PASS)                              00530000
//BP13F20A DD DSN=BP13.F203.SMS.BK,DISP=SHR                             00540000
//SYSDBG   DD SYSOUT=*                                                  00550000
//SYSDBOUT DD SYSOUT=*                                                  00560000
//SYSOUT   DD SYSOUT=*                                                  00570000
//*-------------------------------------------------------------------* 02170000
//* TRANSLATE 'BI' AND dte ballot >= 202305 AND not 'SER' INTO NEW 'CI' 02270000
//* TRANSLATE 'DI' AND dte ballot >= 202305 AND not 'SER' INTO NEW 'EI' 02270000
//* other appt types with diff condition will not be affected                   
//*-------------------------------------------------------------------- 02190000
//STEP02A  EXEC SORT,COND=(0,NE)                                        02200000
//SORTIN   DD DSN=BP13.F203.SMS.BK,DISP=SHR                             02210000
//SORTOUT  DD DSN=&&F203BK0,DISP=(NEW,PASS),                            02220000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         02230000
//         SPACE=(CYL,(8,5),RLSE)                                       02240000
//SYSIN    DD  *                                                        02250000
   SORT FIELDS=(1,19,A),FORMAT=CH                                       02260000
   OUTREC IFTHEN=(WHEN=(20,6,CH,GE,C'202305',AND,9,2,CH,EQ,C'BI',AND,   02360000
                        1,3,CH,NE,C'SER'),                                      
                  BUILD=(1:1,8,9:C'CI',11:11,190)),                     02370000
          IFTHEN=(WHEN=(20,6,CH,GE,C'202305',AND,9,2,CH,EQ,C'DI',AND,   02380000
                        1,3,CH,NE,C'SER'),                                      
                  BUILD=(1:1,8,9:C'EI',11:11,190))                      02390000
//*-------------------------------------------------------------------* 02550000
//* sort by allo mode, new town, flat type, ethnic, regno, appmt type   02550000
//*-------------------------------------------------------------------* 02550000
//STEP02B  EXEC SORT,COND=(0,NE)                                        02680000
//SORTIN   DD DSN=&&F203BK0,DISP=(OLD,DELETE)                           02690000
//SORTOUT  DD DSN=&&F203BK1,DISP=(NEW,PASS),                            02730000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         02230000
//         SPACE=(CYL,(8,5),RLSE)                                       02240000
//SYSIN    DD  *                                                        02740000
   SORT FIELDS=(1,8,A,11,9,A,9,2,A),FORMAT=CH                           02750000
   SUM FIELDS=NONE                                                      02760000
//*=====================================================================00630000
//*  SPLIT 'BK' CASES                                                   00670000
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                    00640000
//*=====================================================================00650000
//STEP03    EXEC PGM=BP13CFB6,COND=(0,NE)                               00660000
//BP13F203  DD DSN=&&F203BK1,DISP=(SHR,PASS)                            00670000
//BP13K209  DD DSN=BP13.K209.SMS.MSG,DISP=SHR                           00670000
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                              00680000
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                           00690000
//B13F203A  DD DSN=BP13.F203.ASMS.BK.XML01,DISP=SHR                     00700000
//B13F203B  DD DSN=BP13.F203.ASMS.BK.XML02,DISP=SHR                     00710000
//B13F203C  DD DSN=BP13.F203.ASMS.BK.XML03,DISP=SHR                     00720000
//B13F203D  DD DSN=BP13.F203.ASMS.BK.XML04,DISP=SHR                     00730000
//B13F203E  DD DSN=BP13.F203.ASMS.BK.XML05,DISP=SHR                     00740000
//SYSPRINT  DD SYSOUT=*                                                 00750000
//SYSOUT    DD SYSOUT=*                                                 00760000
//SYSIN     DD *                                                        00770000
/*                                                                      00780000
//**********************************************************************00790000
//* FTP FILE(S) THAT ARE NOT EMPTY                                      00800000
//**********************************************************************00810000
//STEP03A EXEC PGM=IDCAMS,COND=(0,NE,STEP03)                            00820000
//SYSPRINT DD SYSOUT=*                                                  00830000
//FILE1 DD DSN=BP13.F203.ASMS.BK.XML01,DISP=SHR                         00840000
//SYSUDUMP DD SYSOUT=*                                                  00850000
//SYSIN DD *                                                            00860000
  PRINT INFILE(FILE1) -                                                 00870000
  DUMP COUNT(1)                                                         00880000
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       00890000
/*                                                                      00900000
//STARTIF IF (STEP03A.RC = 0) THEN                                      00910000
//**********************************************************************00920000
//*          GENERATE THE FILELIST DATASET                              00930000
//**********************************************************************00940000
//STEP03B   EXEC SAS,COND=(0,NE,STEP03A)                                00950000
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00960000
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=SHR                        00970000
//SYSPRINT  DD  SYSOUT=*                                                00980000
//SYSIN     DD  *                                                       00990000
DATA _NULLS_;                                                           01000000
FILE FILELST;                                                           01010000
TDAY=DATE();                                                            01020000
   PUT @001 "BP13E20"                                                   01030000
       @008 TDAY   YYMMDD6.                                             01040000
       @014 '0806000001.xml';                                           01050000
//**********************************************************************01060000
//*          GENERATE THE CURRENT FTP DATE FILE                         01070000
//**********************************************************************01080000
//STEP03C   EXEC SAS,COND=(0,NE,STEP03A)                                01090000
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         01100000
//FTPDATE   DD  DSN=BP13.F203.FTP,DISP=OLD                              01110000
//SYSPRINT  DD  SYSOUT=*                                                01120000
//SYSIN     DD  *                                                       01130000
DATA _NULLS_;                                                           01140000
FILE FTPDATE;                                                           01150000
TDAY=DATE();                                                            01160000
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 01170000
   PUT @001 "put 'BP13.F203.ASMS.BK.XML01' BP13E20"                     01180000
       @038 TDAY   YYMMDD6.                                             01190000
       @044 '0806000001.xml';                                           01200000
   PUT @001 'quit';                                                     01210000
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           01220000
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          01230000
//INPUT    DD DSN=BP13.F203.FTP,DISP=OLD                                01240000
/*                                                                      01250000
//STOPIF   ENDIF                                                        01260000
/*                                                                      01270000
//**********************************************************************01280000
//* FTP FILE(S) THAT ARE NOT EMPTY                                      01290000
//**********************************************************************01300000
//STEP03D EXEC PGM=IDCAMS,COND=(0,NE,STEP03)                            01310000
//SYSPRINT DD SYSOUT=*                                                  01320000
//FILE1 DD DSN=BP13.F203.ASMS.BK.XML02,DISP=SHR                         01330000
//SYSUDUMP DD SYSOUT=*                                                  01340000
//SYSIN DD *                                                            01350000
  PRINT INFILE(FILE1) -                                                 01360000
  DUMP COUNT(1)                                                         01370000
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       01380000
/*                                                                      01390000
//STARTIF IF (STEP03D.RC = 0) THEN                                      01400000
//**********************************************************************01410000
//*          GENERATE THE FILELIST DATASET                              01420000
//**********************************************************************01430000
//STEP03E   EXEC SAS,COND=(0,NE,STEP03D)                                01440000
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         01450000
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=MOD                        01460000
//SYSPRINT  DD  SYSOUT=*                                                01470000
//SYSIN     DD  *                                                       01480000
DATA _NULLS_;                                                           01490000
FILE FILELST;                                                           01500000
TDAY=DATE();                                                            01510000
   PUT @001 "BP13E20"                                                   01520000
       @008 TDAY   YYMMDD6.                                             01530000
       @014 '0806000002.xml';                                           01540000
//**********************************************************************01550000
//*          GENERATE THE CURRENT FTP DATE FILE                         01560000
//**********************************************************************01570000
//STEP03F   EXEC SAS,COND=(0,NE,STEP03D)                                01580000
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         01590000
//FTPDATE   DD  DSN=BP13.F203.FTP,DISP=OLD                              01600000
//SYSPRINT  DD  SYSOUT=*                                                01610000
//SYSIN     DD  *                                                       01620000
DATA _NULLS_;                                                           01630000
FILE FTPDATE;                                                           01640000
TDAY=DATE();                                                            01650000
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 01660000
   PUT @001 "put 'BP13.F203.ASMS.BK.XML02' BP13E20"                     01670000
       @038 TDAY   YYMMDD6.                                             01680000
       @044 '0806000002.xml';                                           01690000
   PUT @001 'quit';                                                     01700000
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           01710000
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          01720000
//INPUT    DD DSN=BP13.F203.FTP,DISP=OLD                                01730000
/*                                                                      01740000
//STOPIF   ENDIF                                                        01750000
/*                                                                      01760000
//*-------------------------------------------------------------------* 01931400
//*  SORT OUT ALL THE 'BN' CASES (BOOKING NOTIFICATION)                 01932000
//*-------------------------------------------------------------------- 01940000
//STEP04   EXEC SORT,COND=(0,NE,STEP03)                                 01950000
//SORTIN   DD DSN=BP13.K203.SMS,DISP=SHR                                01960000
//SORTOUT  DD DSN=&&F203BN,DISP=(NEW,PASS),                             01970000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         01980000
//         SPACE=(CYL,(8,5),RLSE)                                       01990000
//SYSIN    DD  *                                                        02000000
   SORT FIELDS=(1,19,A),FORMAT=CH                                       02010000
   INCLUDE COND=(1,3,CH,NE,C'DBS',AND,                                  02020000
                 ((9,2,CH,EQ,C'BN',OR,9,2,CH,EQ,C'DN'),AND,             02030000
                  141,1,CH,EQ,C'A'))                                    02040000
//*-------------------------------------------------------------------* 02050000
//* FILTER CASES WITH APPMT DATE <= 14 DAYS AFTER THE CURRENT DATE      02060000
//*-------------------------------------------------------------------* 02070000
//STEP04A  EXEC PGM=BP13C24N,COND=(0,NE,STEP03)                         02080000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               02090000
//BP13F203 DD DSN=&&F203BN,DISP=(SHR,PASS)                              02100000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              02110000
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                    02120000
//P13F203A DD DSN=BP13.F203.SMS.BN,DISP=SHR                             02130000
//SYSDBG   DD SYSOUT=*                                                  02140000
//SYSDBOUT DD SYSOUT=*                                                  02150000
//SYSOUT   DD SYSOUT=*                                                  02160000
//*-------------------------------------------------------------------* 02170000
//* TRANSLATE 'BN' INTO NEW 'K1' AND 'L1' - for dte ballot < 202305     02260000
//* TRANSLATE 'DN' INTO NEW 'K5' AND 'L5' - for dte ballot < 202305     02270000
//* TRANSLATE 'BN' and dte ballot >= 202305 AND not 'SER' INTO NEW 'CN' 02270000
//* TRANSLATE 'DN' and dte ballot >= 202305 AND not 'SER' INTO NEW 'EN' 02270000
//* other appt types with diff condition will not be affected                   
//*-------------------------------------------------------------------- 02190000
//STEP04A1 EXEC SORT,COND=(0,NE,STEP03)                                 02200000
//SORTIN   DD DSN=BP13.F203.SMS.BN,DISP=SHR                             02210000
//SORTOUT  DD DSN=&&F203CB1,DISP=(NEW,PASS),                            02220000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         02230000
//         SPACE=(CYL,(8,5),RLSE)                                       02240000
//SYSIN    DD  *                                                        02250000
   SORT FIELDS=(1,19,A),FORMAT=CH                                       02260000
   OUTREC IFTHEN=(WHEN=(1,3,CH,EQ,C'BTO',AND,9,2,CH,EQ,C'BN',AND,       02360000
                        20,6,CH,LT,C'202305'),                                  
                  BUILD=(1:1,8,9:C'K1',11:11,190)),                     02370000
          IFTHEN=(WHEN=(1,3,CH,EQ,C'SBF',AND,9,2,CH,EQ,C'BN',AND,       02380000
                        20,6,CH,LT,C'202305'),                                  
                  BUILD=(1:1,8,9:C'L1',11:11,190)),                     02390000
          IFTHEN=(WHEN=(1,3,CH,EQ,C'BTO',AND,9,2,CH,EQ,C'DN',AND,       02400000
                        20,6,CH,LT,C'202305'),                                  
                  BUILD=(1:1,8,9:C'K5',11:11,190)),                     02410000
          IFTHEN=(WHEN=(1,3,CH,EQ,C'SBF',AND,9,2,CH,EQ,C'DN',AND,       02420000
                        20,6,CH,LT,C'202305'),                                  
                  BUILD=(1:1,8,9:C'L5',11:11,190)),                     02430000
          IFTHEN=(WHEN=(20,6,CH,GE,C'202305',AND,9,2,CH,EQ,C'BN',AND,   02420000
                        1,3,CH,NE,C'SER'),                                      
                  BUILD=(1:1,8,9:C'CN',11:11,190)),                     02430000
          IFTHEN=(WHEN=(20,6,CH,GE,C'202305',AND,9,2,CH,EQ,C'DN',AND,   02420000
                        1,3,CH,NE,C'SER'),                                      
                  BUILD=(1:1,8,9:C'EN',11:11,190))                      02430000
//*-------------------------------------------------------------------* 02310000
//*-------------------------------------------------------------------* 02550000
//STEP04A5 EXEC SORT,COND=(0,NE,STEP03)                                 02680000
//SORTIN   DD DSN=&&F203CB1,DISP=(OLD,DELETE)                           02690000
//SORTOUT  DD DSN=BP13.F203.SMS.BN.CB2020,DISP=OLD                      02730000
//SYSIN    DD  *                                                        02740000
   SORT FIELDS=(1,8,A,11,9,A,9,2,A),FORMAT=CH                           02750000
   SUM FIELDS=NONE                                                      02760000
//*-------------------------------------------------------------------* 02770000
//* SPLIT 'BN' CASES                                                    02790000
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                    02802000
//*-------------------------------------------------------------------* 02802100
//STEP04B   EXEC PGM=BP13CFB6,COND=(0,NE,STEP03)                        02804000
//BP13F203  DD DSN=BP13.F203.SMS.BN.CB2020,DISP=OLD                     02805000
//BP13K209  DD DSN=BP13.K209.SMS.MSG,DISP=SHR                           02805000
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                              02806000
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                           02807000
//B13F203A  DD DSN=BP13.F203.ASMS.BN.XML01,DISP=SHR                     02808000
//B13F203B  DD DSN=BP13.F203.ASMS.BN.XML02,DISP=SHR                     02809000
//B13F203C  DD DSN=BP13.F203.ASMS.BN.XML03,DISP=SHR                     02809100
//B13F203D  DD DSN=BP13.F203.ASMS.BN.XML04,DISP=SHR                     02809200
//B13F203E  DD DSN=BP13.F203.ASMS.BN.XML05,DISP=SHR                     02809300
//SYSPRINT  DD SYSOUT=*                                                 02809400
//SYSOUT    DD SYSOUT=*                                                 02809500
//SYSIN     DD *                                                        02809600
/*                                                                      02809700
//**********************************************************************02809800
//* FTP FILE(S) THAT ARE NOT EMPTY                                      02809900
//**********************************************************************02810000
//STEP04C  EXEC PGM=IDCAMS,COND=(0,NE,STEP04B)                          02810100
//SYSPRINT DD SYSOUT=*                                                  02810200
//FILE1 DD DSN=BP13.F203.ASMS.BN.XML01,DISP=SHR                         02810300
//SYSUDUMP DD SYSOUT=*                                                  02810400
//SYSIN DD *                                                            02810500
  PRINT INFILE(FILE1) -                                                 02810600
  DUMP COUNT(1)                                                         02810700
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       02810800
/*                                                                      02810900
//STARTIF IF (STEP04C.RC = 0) THEN                                              
//**********************************************************************02811100
//*          GENERATE THE FILELIST DATASET                              02811200
//**********************************************************************02811300
//STEP04D   EXEC SAS,COND=(0,NE,STEP04C)                                02811400
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         02811500
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=MOD                        02811600
//SYSPRINT  DD  SYSOUT=*                                                02811700
//SYSIN     DD  *                                                       02811800
DATA _NULLS_;                                                           02811900
FILE FILELST;                                                           02812000
TDAY=DATE();                                                            02812100
   PUT @001 "BP13E20"                                                   02812200
       @008 TDAY   YYMMDD6.                                             02812300
       @014 '0806000006.xml';                                           02812400
//**********************************************************************02812500
//*          GENERATE THE CURRENT FTP DATE FILE                         02812600
//**********************************************************************02812700
//STEP04E   EXEC SAS,COND=(0,NE,STEP04C)                                02812800
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         02812900
//FTPDATE   DD  DSN=BP13.F203.BN.FTP,DISP=OLD                           02813000
//SYSPRINT  DD  SYSOUT=*                                                02813100
//SYSIN     DD  *                                                       02813200
DATA _NULLS_;                                                           02813300
FILE FTPDATE;                                                           02813400
TDAY=DATE();                                                            02813500
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 02813600
   PUT @001 "put 'BP13.F203.ASMS.BN.XML01' BP13E20"                     02813700
       @038 TDAY   YYMMDD6.                                             02813800
       @044 '0806000006.xml';                                           02813900
   PUT @001 'quit';                                                     02814000
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           02814100
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          02814200
//INPUT    DD DSN=BP13.F203.BN.FTP,DISP=OLD                             02814300
/*                                                                      02814400
//STOPIF   ENDIF                                                        02814500
/*                                                                      02814600
//**********************************************************************02814700
//* FTP FILE(S) THAT ARE NOT EMPTY                                      02814800
//**********************************************************************02814900
//STEP04F  EXEC PGM=IDCAMS,COND=(0,NE,STEP04B)                          02815000
//SYSPRINT DD SYSOUT=*                                                  02815100
//FILE1 DD DSN=BP13.F203.ASMS.BN.XML02,DISP=SHR                         02815200
//SYSUDUMP DD SYSOUT=*                                                  02815300
//SYSIN DD *                                                            02815400
  PRINT INFILE(FILE1) -                                                 02815500
  DUMP COUNT(1)                                                         02815600
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       02815700
/*                                                                      02815800
//STARTIF IF (STEP04F.RC = 0) THEN                                      02815900
//**********************************************************************02816000
//*          GENERATE THE FILELIST DATASET                              02816100
//**********************************************************************02816200
//STEP04G   EXEC SAS,COND=(0,NE,STEP04F)                                02816300
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         02816400
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=MOD                        02816500
//SYSPRINT  DD  SYSOUT=*                                                02816600
//SYSIN     DD  *                                                       02816700
DATA _NULLS_;                                                           02816800
FILE FILELST;                                                           02816900
TDAY=DATE();                                                            02817000
   PUT @001 "BP13E20"                                                   02817100
       @008 TDAY   YYMMDD6.                                             02817200
       @014 '0806000007.xml';                                           02817300
//**********************************************************************02817400
//*          GENERATE THE CURRENT FTP DATE FILE                         02817500
//**********************************************************************02817600
//STEP04H   EXEC SAS,COND=(0,NE,STEP04F)                                02817700
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         02817800
//FTPDATE   DD  DSN=BP13.F203.BN.FTP,DISP=OLD                           02817900
//SYSPRINT  DD  SYSOUT=*                                                02818000
//SYSIN     DD  *                                                       02818100
DATA _NULLS_;                                                           02818200
FILE FTPDATE;                                                           02818300
TDAY=DATE();                                                            02818400
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 02818500
   PUT @001 "put 'BP13.F203.ASMS.BN.XML02' BP13E20"                     02818600
       @038 TDAY   YYMMDD6.                                             02818700
       @044 '0806000007.xml';                                           02818800
   PUT @001 'quit';                                                     02818900
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           02819000
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          02819100
//INPUT    DD DSN=BP13.F203.BN.FTP,DISP=OLD                             02819200
/*                                                                      02819300
//STOPIF   ENDIF                                                        02819400
/*                                                                      02819500
//**********************************************************************02819600
//* FTP FILE(S) THAT ARE NOT EMPTY                                      02819700
//**********************************************************************02819800
//STEP04I  EXEC PGM=IDCAMS,COND=(0,NE,STEP04B)                          02819900
//SYSPRINT DD SYSOUT=*                                                  02820000
//FILE1 DD DSN=BP13.F203.ASMS.BN.XML03,DISP=SHR                         02820100
//SYSUDUMP DD SYSOUT=*                                                  02820200
//SYSIN DD *                                                            02820300
  PRINT INFILE(FILE1) -                                                 02820400
  DUMP COUNT(1)                                                         02820500
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       02820600
/*                                                                      02820700
//STARTIF IF (STEP04I.RC = 0) THEN                                              
//**********************************************************************02820900
//*          GENERATE THE FILELIST DATASET                              02821000
//**********************************************************************02821100
//STEP04J   EXEC SAS,COND=(0,NE,STEP04I)                                02821200
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         02821300
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=MOD                        02821400
//SYSPRINT  DD  SYSOUT=*                                                02821500
//SYSIN     DD  *                                                       02821600
DATA _NULLS_;                                                           02821700
FILE FILELST;                                                           02821800
TDAY=DATE();                                                            02821900
   PUT @001 "BP13E20"                                                   02822000
       @008 TDAY   YYMMDD6.                                             02822100
       @014 '0806000008.xml';                                           02822200
//**********************************************************************02822300
//*          GENERATE THE CURRENT FTP DATE FILE                         02822400
//**********************************************************************02822500
//STEP04K   EXEC SAS,COND=(0,NE,STEP04I)                                02822600
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         02822700
//FTPDATE   DD  DSN=BP13.F203.BN.FTP,DISP=OLD                           02822800
//SYSPRINT  DD  SYSOUT=*                                                02822900
//SYSIN     DD  *                                                       02823000
DATA _NULLS_;                                                           02823100
FILE FTPDATE;                                                           02823200
TDAY=DATE();                                                            02823300
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 02823400
   PUT @001 "put 'BP13.F203.ASMS.BN.XML03' BP13E20"                     02823500
       @038 TDAY   YYMMDD6.                                             02823600
       @044 '0806000008.xml';                                           02823700
   PUT @001 'quit';                                                     02823800
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           02823900
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          02824000
//INPUT    DD DSN=BP13.F203.BN.FTP,DISP=OLD                             02824100
/*                                                                      02824200
//STOPIF   ENDIF                                                        02824300
/*                                                                      02824400
//*-------------------------------------------------------------------- 09785000
//*          FTP TO BulkSMS-File-List.txt                                       
//*-------------------------------------------------------------------- 09785000
//STEP13    EXEC SAS,COND=(0,NE,STEP03)                                         
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.BULKSMS.FILEIN.FTP,DISP=OLD                            
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.BULKSMS.FILEIN' BulkSMS-File-List.txt";                  
   PUT @001 'quit';                                                             
//FTP013   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.BULKSMS.FILEIN.FTP,DISP=OLD                              
/*                                                                              
//*-------------------------------------------------------------------*         
