//BP13A208 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071                                                         
//*********************************************************************         
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP135404 EL27 20140711 CHANGE PRINTER FROM L03Z TO X6AI                     
//* BP135404 NST1 20140719 CHANGE PRINTER FROM X6AI TO X6AU(LANDSCAPE)          
//* BP135561 ESA1 20150115 OUTPUT TO DATASET BEFORE SENDING TO PRINTER          
//* BP136836 ESA1 20170807 CHANGE PRINTER FROM X6AU TO XDA2                     
//*********************************************************************         
//*---------------------------------------------------------------------        
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*--------------------------------------------------------------------         
//STEP00   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.APPLREC,DISP=OLD                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'BA')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*--------------------------------------------------------------------         
//STEP01   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//BP13F205 DD DSN=BP13.F205.APPLREC,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              03870012
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                  03870012
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//FILEOUT1 DD DSN=&&P13L203A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//FILEOUT2 DD DSN=&&P13L203B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S203),DISP=SHR                             
/*                                                                              
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP01 IN XDA2 PRINTER                               
//*--------------------------------------------------------------------         
//STEP1A EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&P13L203A,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=XDA2                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP01 IN XDA2 PRINTER                               
//*--------------------------------------------------------------------         
//STEP1B EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&P13L203B,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=XDA2                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*--------------------------------------------------------------------         
//STEP02   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//BP13F205 DD DSN=BP13.F205.APPLREC,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              03870012
//BP13F200 DD DSN=BP13.F200.BKAPPMT,DISP=SHR                                    
//FILEOUT  DD DSN=&&P13L200A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S200),DISP=SHR                             
/*                                                                              
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP02 IN XDA2 PRINTER                               
//*--------------------------------------------------------------------         
//STEP2A EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&P13L200A,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=XDA2                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*--------------------------------------------------------------------         
//STEP02    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F205.APPLREC,DISP=SHR                                   
//OUTPUT1   DD DSN=BP13.F205.ACCUM,DISP=MOD                                     
//SYSIN     DD *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*----------------------------------------------------------------             
//*   CREATE SOFTCOPY REPORT FOR ALL REPORTS PRINTED                            
//*----------------------------------------------------------------             
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&P13L203A,DISP=(SHR,PASS)                                   
//         DD  DSN=&&P13L203B,DISP=(SHR,PASS)                                   
//         DD  DSN=&&P13L200A,DISP=(SHR,PASS)                                   
//OUTPUT1  DD  DSN=BP13.L208.RPT,                                               
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
//*                                                                             
//*---------------------------------------------------------------------        
//* END BP13A208                                                                
//*---------------------------------------------------------------------        
