//BP13A242 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*-----------------------------------------------------------------            
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*-----------------------------------------------------------------            
//STEP00 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F205.DPD,                                               
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE BB14K500 & BB14K580 BY LEASE-COMM-DTE AND DTE-UNIT-DELIVERY          
//*---------------------------------------------------------------------        
//STEP01 EXEC    PGM=BP13C207,COND=(0,NE)                                       
//BM06F800 DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=SHR                                                         
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BB14K580 DD  DSN=BB14.K580.UNTLEASE,                                          
//             DISP=SHR                                                         
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,                                          
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//*   TO COPY DATASET WITH THE INSERTION OF 'BP13A213' TO ACCUM FILE            
//*--------------------------------------------------------------------         
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,15,A),FORMAT=CH                                             
     OUTREC FIELDS=(1,50,C'BP13A213',59,22)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO CLEAR UP DATASET                                                        
//*---------------------------------------------------------------------        
//STEP03   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DUMMY                                                            
//OUTPUT1  DD  DSN=BP13.F205.DPD,                                               
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A242                                                                
//*---------------------------------------------------------------------        
