//BP13DM24 JOB (BP13P),'BP13DM24',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             COND=(4,LT),NOTIFY=CSD0071                                       
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//**********************************************************************        
//* TO DETERMINE FAMILY AND PERSON INFORMATION FOR FT(PMC) ELIGIBILITY          
//**********************************************************************        
//* STEP01 : TO UNLOAD HFE NUMBER AND HFE APPLICATION DATE                      
//**********************************************************************        
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=20                                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//LISTING  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPUNCH DD SYSOUT=*                                                          
//SYSREC00 DD DISP=SHR,DSN=BP13.FDM24001.HFEDATA.SD                             
//SYSTSIN  DD DISP=SHR,DSN=ISD.DATABASE.ADMIN(@TIAULS)                          
//SYSIN    DD *                                                                 
  SELECT NUM_ELGBTY_CASE,                                                       
         VARCHAR_FORMAT(TME_SUBMIT,'YYYYMMDD')                                  
  FROM DBPROD.FLAT_ELGBTY_CASE                                                  
  ORDER BY NUM_ELGBTY_CASE                                                      
  WITH UR;                                                                      
/*                                                                              
//********************************************************************          
//* STEP02 : EXTRACT AND UPDATE FT2T FROM K730 INTO DAILY REQUEST FILE          
//********************************************************************          
//STEP02  EXEC PGM=ICETOOL                                                      
//TOOLMSG  DD SYSOUT=*                                                          
//DFSMSG   DD SYSOUT=*                                                          
//IN01     DD DISP=SHR,DSN=BP13.F730.MATURERQ.DAILY                             
//IN02     DD DISP=SHR,DSN=BP13.K730.MATURERQ,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//OUT01    DD DSN=BP13.FDM24005.DAILYREQ.SD(+1),                                
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(10,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  OPTION DYNALLOC=(SYSDA,20)                                                    
/*                                                                              
//TOOLIN   DD *                                                                 
  COPY JKFROM    TO(OUT01) USING(CTL1)                                          
/*                                                                              
//CTL1CNTL DD *                                                                 
  JOINKEYS F1=IN01,FIELDS=(123,8,A)                                             
  JOINKEYS F2=IN02,FIELDS=(123,8,A)                                             
  JOIN UNPAIRED,F1                                                              
  REFORMAT FIELDS=(F1:1,474,F2:475,1,F1:476,25)                                 
/*                                                                              
//**********************************************************************        
//*STEP03: EXTRACT FIRST TIMER AND FT2T REQUEST AND MERGE WITH HFE DATA         
//**********************************************************************        
//STEP03  EXEC PGM=ICETOOL                                                      
//TOOLMSG  DD SYSOUT=*                                                          
//DFSMSG   DD SYSOUT=*                                                          
//INPUT1   DD DISP=OLD,DSN=BP13.FDM24005.DAILYREQ.SD(+1)                        
//OUTPUT1  DD DISP=(NEW,PASS,DELETE),                                           
//            UNIT=CART,                                                        
//            DCB=(RECFM=FB,LRECL=30),                                          
//            DSN=&&OUT01                                                       
//INPUT2   DD DISP=SHR,DSN=BP13.K757.BTO,                                       
//            AMP=('BUFND=4','BUFNI=8')                                         
//OUTPUT2  DD DISP=(NEW,PASS,DELETE),                                           
//            DCB=(RECFM=FB,LRECL=17),                                          
//            UNIT=CART,                                                        
//            DSN=&&OUT02                                                       
//OUTPUT3  DD DISP=(NEW,PASS,DELETE),                                           
//            DCB=(RECFM=FB,LRECL=39),                                          
//            UNIT=CART,                                                        
//            DSN=&&OUT03                                                       
//INPUT3   DD DISP=SHR,DSN=BP13.FDM24001.HFEDATA.SD                             
//OUTPUT4  DD DISP=(NEW,PASS,DELETE),                                           
//            DCB=(RECFM=FB,LRECL=47),                                          
//            UNIT=CART,                                                        
//            DSN=&&OUT04                                                       
//OUTPUT5  DD DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(10,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=47,BLKSIZE=27965),                            
//            DSN=BP13.FDM24002.FRSTIMER.SD(+1)                                 
//SYSIN    DD *                                                                 
  OPTION DYNALLOC=(SYSDA,20)                                                    
/*                                                                              
//TOOLIN   DD *                                                                 
  SORT FROM(INPUT1) TO(OUTPUT1) USING(CTL1)                                     
  SORT FROM(INPUT2) TO(OUTPUT2) USING(CTL2)                                     
  COPY JKFROM    TO(OUTPUT3) USING(CTL3)                                        
  COPY JKFROM    TO(OUTPUT4) USING(CTL4)                                        
  SORT FROM(OUTPUT4) TO(OUTPUT5) USING(CTL5)                                    
/*                                                                              
//CTL1CNTL DD *                                                                 
  SORT FIELDS=(123,8,CH,A)                                                      
  INCLUDE COND=(123,1,CH,EQ,C'8',AND,                                           
                (116,1,CH,EQ,C'H',OR,                                           
                 116,1,CH,EQ,C'T',OR,                                           
                (116,1,CH,EQ,C'G',AND,                                          
                 475,1,CH,EQ,C'Y')))                                            
  OUTREC FIELDS=(123,8,248,3,376,3,116,1,475,1,261,8,334,6)                     
/*                                                                              
//CTL2CNTL DD *                                                                 
  SORT FIELDS=(1,8,CH,A)                                                        
  OUTREC FIELDS=(1,8,2921,9)                                                    
/*                                                                              
//CTL3CNTL DD *                                                                 
  JOINKEYS F1=OUTPUT1,FIELDS=(1,8,A)                                            
  JOINKEYS F2=OUTPUT2,FIELDS=(1,8,A)                                            
  JOIN UNPAIRED,F1                                                              
  REFORMAT FIELDS=(F1:1,30,F2:9,9)                                              
/*                                                                              
//CTL4CNTL DD *                                                                 
  JOINKEYS F1=OUTPUT3,FIELDS=(31,9,A)                                           
  JOINKEYS F2=INPUT3,FIELDS=(1,9,A)                                             
  JOIN UNPAIRED,F1                                                              
  REFORMAT FIELDS=(F1:1,39,F2:12,8)                                             
/*                                                                              
//CTL5CNTL DD *                                                                 
  SORT FIELDS=(1,8,CH,A)                                                        
/*                                                                              
//*******************************************************************           
//* STEP04: TO SORT AND EXTRACT PERSON INFORMATION WITH K825-NUM-REGN           
//* STARTING WITH 8                                                             
//*******************************************************************           
//STEP04   EXEC SORT                                                            
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DISP=SHR,DSN=BP13.K825.REQOCCP,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//SORTOUT  DD  DISP=(NEW,PASS,DELETE),UNIT=CART,                                
//             DCB=(RECFM=FB,LRECL=32,BLKSIZE=0),                               
//             DSN=&&STEP04                                                     
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,CH,A,97,8,CH,D)                                              
  INCLUDE COND=(1,1,CH,EQ,C'8')                                                 
  OUTREC FIELDS=(1,8,9,9,96,1,97,8,107,2,131,1,157,1,105,2)                     
/*                                                                              
//*==================================================================           
//* STEP05: TO DETERMINE FAMILY AND PERSON FTPMC ELIGIBILITY                    
//*==================================================================           
//STEP05   EXEC PGM=BP13CM24                                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDUMP  DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SY02F001 DD DISP=SHR,DSN=SY02.F001.DATE                                       
//BP13FIN1 DD DISP=OLD,DSN=BP13.FDM24002.FRSTIMER.SD(+1)                        
//BP13FIN2 DD DSN=&&STEP04,DISP=(OLD,DELETE,DELETE),UNIT=CART                   
//BP13FOT1 DD DSN=BP13.FDM24003.ACCEPTED.SD(+1),                                
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(10,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                            
//BP13FOT2 DD DSN=BP13.FDM24004.REJECTED.SD(+1),                                
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(10,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                            
/*                                                                              
