//BP13D409 JOB (BP13P),'BP13D409',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================*           
//* OBJECTIVE : THIS JOB PROCESSES THE SENDING OF S&P FILE FROM     *           
//*             HDB TO CPF THRU IDNET.                              *           
//*-----------------------------------------------------------------*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* ========  ==========  ==== ===========                          *           
//* BP132249  13/01/2003  CLT1 BANK ORIGINATION JOB                 *           
//* BP132331  13/05/2003  CLT1 READ BM06K110 WHEN RUNNING BP13C344  *           
//* BP132680  28/04/2005  CLT1 READ BP13K440 WHEN RUNNING BP13C347  *           
//* BP132814  13/04/2006  SD10 ADD DBSS ACCEPTANCE AND BP13C34A     *           
//* BP133793  16/12/2009  LSB  CHG SORT FIELDS IN STEP11            *           
//* BP134294  02/12/2011  LSB  DO NOT SEND REC TO CPFB IF FOUND     *           
//*                            DUPLICATE SCH-ACC-NO                 *           
//* BP134872  16/04/2013  ESD1 ADDED BB14K500 TO GET LEASE COMMENCE-*           
//*                            MENT DATE AND LEASE PERIOD.          *           
//* BP135171  11/02/2014  RJE1 TO CATER FOR DB2 UPGRADE                         
//* BP136161  15/03/2016  KSJ3 TO ADD BP17K100/110/112 TO BP13C342/ *           
//*                            C345/C347                            *           
//* BP136161  22/03/2016  KSJ3 TO ADD BP17K000 TO BP13C342/C345/C347*           
//* BP136161  18/04/2016  KSJ3 TO REMOVE BP17 DATASETS FROM BP13C342*           
//*                            /C345/C347                           *           
//* BP137779  28/01/2012  ZDD  TO MOD FOR F105                      *           
//*=================================================================*           
//*-----------------------------------------------------------------            
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                                   
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K440.CPFSNP,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K310.TRANS,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*-------------------------------------------------------------------*         
//*  BACKUP S&P FILE BEFORE RUN                                       *         
//*-------------------------------------------------------------------*         
//STEP02 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT     DD DSN=BP13.K440.CPFSNP,DISP=SHR                                    
//OUTPUT    DD DSN=BP13.F440.CPFSNP.BFDAILY(+1),DISP=(NEW,CATLG),               
//          SPACE=(CYL,(20,10)),                                                
//          DCB=(BP13.GDG,BLKSIZE=0,LRECL=1000,RECFM=FB)                        
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                         
//*                                                                             
//*=================================================================*           
//* TO MONITOR EXISTING CASES                                       *           
//*=================================================================*           
//*-------------------------------------------------------------------*         
//* SORT BP13K440 BY REGN NO                                          *         
//*-------------------------------------------------------------------*         
//STEP03  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K440.CPFSNP,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F440,DISP=(NEW,PASS),                                   
//         UNIT=(SYSDA),SPACE=(CYL,(80,50),RLSE),                               
//         DCB=(BLKSIZE=0,LRECL=1000,RECFM=FB)                                  
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C' ')                                                
//*                                                                             
//*-------------------------------------------------------------------*         
//* PROGRAM TO CHECK FOR CHANGES IN PARTICULARS OF APPLICANTS AND     *         
//* WRITE NEW AND AMENDMENT CASES TO TEMP FILES                       *         
//* - &&P13F44A = AMENDMENT CASES                                     *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F445 DD DSN=&&BP13F440,DISP=(OLD,PASS)                                    
//BP13K440 DD DSN=BP13.K440.CPFSNP,DISP=SHR,                            00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                             00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K670 DD DSN=BP13.K670.BO,DISP=SHR,                                00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//          AMP=('BUFND=4','BUFNI=8')                                           
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BB14K580 DD DSN=BB14.K580.UNTLEASE,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//P13F445A DD DSN=&&P13F44A,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1000),                                
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C345) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================*           
//* TO DETECT NEW BO BOOKED FLAT CASES NOT IN S&P FILE              *           
//*=================================================================*           
//*---------------------------------------------------------------------        
//* SORT K800 BY REGN NO -- INCLUDE ONLY BANK LOAN CASES                        
//* ADD ALL BOOKED CASES INCLUDE DBSS FLAT                                      
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(50,30),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',&,155,4,CH,NE,C'    ')                           
//*                                                                             
//*-------------------------------------------------------------------- 00060000
//* CREATE TRANS 'BO' IN BP13K310 - ALL MISSING BANK LOAN CASES IN K440 00060000
//* FOR CASES WHERE AFTER ACCEPTANCE, CHANGE TO BANK LOAN               00060000
//*-------------------------------------------------------------------- 00060000
//STEP07   EXEC PGM=BP13C344,COND=(0,NE)                                00080019
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13K440 DD DSN=BP13.K440.CPFSNP,DISP=SHR,                            00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K310 DD DSN=BP13.K310.TRANS,DISP=SHR,                             00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               00231000
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13L344 DD SYSOUT=*                                                  00231000
//SYSOUT   DD SYSOUT=*                                                  00090000
//SYSABOUT DD SYSOUT=*                                                  00110000
//SYSDBOUT DD SYSOUT=*                                                  00120000
//*                                                                             
//*=================================================================*           
//* TO PROCESS CASES INITIATED TRHU BP13B369 AND                    *           
//* CASES NEWLY ACCEPTED FLAT                                       *           
//*=================================================================*           
//*-------------------------------------------------------------------*         
//* SORT BP13F310 BY REGN NO AND CDE-TRANS                            *         
//* INCLUDE ACCEPTED FLATS AND THOSE RAISE THRU BP13B369              *         
//* INCLUDE DBSS ACCEPTANCE ON 18/2/2006                                        
//*-------------------------------------------------------------------*         
//STEP08  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F310A,DISP=(NEW,PASS),                                   
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                                
//         DCB=(BLKSIZE=0,LRECL=150,RECFM=FB)                                   
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,10,A),FORMAT=CH                                                
  INCLUDE COND=(9,2,CH,EQ,C'BO')                                                
//*                                                                             
//*-------------------------------------------------------------------*         
//* PROGRAM TO EXTRACT CASES BASED ON TRANS FILE AND UPDATE BP13K440  *         
//* FOR NEWLY ACCEPTED CASES                                          *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&P13F310A,DISP=(OLD,PASS)                                    
//BP13K440 DD DSN=BP13.K440.CPFSNP,DISP=SHR,                            00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                             00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K670 DD DSN=BP13.K670.BO,DISP=SHR,                                00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//          AMP=('BUFND=4','BUFNI=8')                                           
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BB14K580 DD DSN=BB14.K580.UNTLEASE,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13F445 DD DSN=&&P13F44B,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1000),                                
//         SPACE=(CYL,(20,10),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C342) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* PROGRAM TO CREATE S&P RECORDS FOR NON-BO TP CASES                 *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F410 DD DSN=BP13.F410.DAILYSO,DISP=SHR                                    
//BP13K440 DD DSN=BP13.K440.CPFSNP,DISP=SHR,                            00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                             00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K670 DD DSN=BP13.K670.BO,DISP=SHR,                                00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//          AMP=('BUFND=4','BUFNI=8')                                           
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BB14K580 DD DSN=BB14.K580.UNTLEASE,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13F445 DD DSN=&&P13F44C,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1000),                                
//         SPACE=(CYL,(20,10),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C347) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*-------------------------------------------------------------------*         
//*-OUTREC BP13K800 ADDITIONAL CPF GRANT (AHG) APPROVED CASE                    
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                        00010000
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                             03870012
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F310CPFG,DISP=(,PASS),                              00120000
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                  
//        SPACE=(CYL,(10,2),RLSE)                                               
//SYSIN    DD *                                                         00150000
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   OUTREC FIELDS=(4,8,C'BO',19X,1240,8,113X)                                    
   INCLUDE COND=(1248,1,CH,EQ,C'A',AND,1,1,CH,NE,C'C',AND,                      
                 155,4,CH,NE,C'    ')                                           
//*-------------------------------------------------------------------*         
//*-OUTREC BP13KD00 DBSS CASE WITH CPF GRANT APPROVED CASE                      
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                        00010000
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                           03870012
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F310CPFG,DISP=(MOD,PASS),                           00120000
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                  
//        SPACE=(CYL,(10,2),RLSE)                                               
//SYSIN    DD *                                                         00150000
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  OUTREC FIELDS=(1,8,C'BO',140X)                                                
  INCLUDE COND=(98,8,CH,NE,C'        ')                                         
//*-------------------------------------------------------------------*         
//*-SORT BY REGN-NO ON APPROVED CPF GRANT CASES                                 
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                        00010000
//SORTIN   DD DSN=&&F310CPFG,DISP=(OLD,PASS)                            03870012
//SORTOUT  DD DSN=&&F310GRNT,DISP=(,PASS),                              00120000
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                  
//        SPACE=(CYL,(10,2),RLSE)                                               
//SYSIN    DD *                                                         00150000
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*-------------------------------------------------------------------*         
//* UPDATE HOUSING GRANT OR ADDITIONAL GRANT TO BP13K440 FILE         *         
//* IF NOTFD IN BP13K440 CREATE NEW RECORD                            *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&F310GRNT,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               00231000
//BP13K440 DD DSN=BP13.K440.CPFSNP,DISP=SHR,                            00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                             00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR,                          00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K670 DD DSN=BP13.K670.BO,DISP=SHR,                                00231000
//          AMP=('BUFND=4','BUFNI=8')                                           
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//          AMP=('BUFND=4','BUFNI=8')                                           
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BB14K580 DD DSN=BB14.K580.UNTLEASE,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13F445 DD DSN=&&P13F44E,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1000),                                
//         SPACE=(CYL,(20,10),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C34A) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13F440 TEMP FILES BY SCHEME ACCT                           *         
//*-------------------------------------------------------------------*         
//STEP11  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=&&P13F44A,DISP=(OLD,PASS)                                     
//         DD DSN=&&P13F44B,DISP=(OLD,PASS)                                     
//         DD DSN=&&P13F44C,DISP=(OLD,PASS)                                     
//         DD DSN=&&P13F44E,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=BP13.F440.CPFSNP.SENT,DISP=OLD,                               
//         UNIT=(SYSDA),SPACE=(CYL,(20,10),RLSE),                               
//         DCB=(BLKSIZE=0,LRECL=1000,RECFM=FB)                                  
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A,10,11,A),FORMAT=CH                                        
   SUM FIELDS=NONE                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BP13F440 TEMP FILES BY SCHEME ACCT                           *         
//*-------------------------------------------------------------------*         
//STEP11A EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.F440.CPFSNP.SENT,DISP=SHR                                
//SORTOUT  DD DSN=&&F445NODP,DISP=(NEW,PASS),                                   
//         UNIT=(SYSDA),SPACE=(CYL,(20,10),RLSE),                               
//         DCB=(BLKSIZE=0,LRECL=1000,RECFM=FB)                                  
//SYSIN    DD *                                                                 
   SORT FIELDS=(10,11,A),FORMAT=CH                                              
//*                                                                             
//*------------------------------------------------------------------*          
//*  CREATE BP13F105 - S&P FILE TO BE SENT DAILY BY HDB TO CPF BOARD *          
//*                    THRU IDNET                                    *          
//* IF FOUND DUPLICATE RECORD, RETURN CODE=99                                   
//*------------------------------------------------------------------*          
//STEP12   EXEC PGM=BP13C343,COND=(0,NE)                                00080019
//BP13F445 DD DSN=&&F445NODP,DISP=(OLD,PASS)                                    
//BP13F105 DD DSN=BP13.F105.CPFSNP.SENT,DISP=MOD                        00231000
//BP13L343 DD SYSOUT=*                                                  00231000
//SYSOUT   DD SYSOUT=*                                                  00090000
//SYSABOUT DD SYSOUT=*                                                  00110000
//SYSDBOUT DD SYSOUT=*                                                  00120000
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F105.SALES.CPF TO DAILY BKUP                          *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F105.CPFSNP.SENT,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.F105.CPFSNP.SENT.DBKUP(+1),DISP=(NEW,CATLG),             
//         SPACE=(CYL,(10,2)),                                                  
//         DCB=(BP13.GDG,BLKSIZE=0,LRECL=450,RECFM=FB)                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F105.SALES.CPF TO MTHLY BKUP                          *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F105.CPFSNP.SENT,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.F105.CPFSNP.SENT.MTH,DISP=MOD                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//*  BACKUP S&P FILE AFTER RUN                                        *         
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=IDCAMS                                                      
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT     DD DSN=BP13.K440.CPFSNP,DISP=SHR                                    
//OUTPUT    DD DSN=BP13.F440.CPFSNP.AFDAILY(+1),DISP=(NEW,CATLG),               
//          SPACE=(CYL,(50,5)),                                                 
//          DCB=(BP13.GDG,BLKSIZE=0,LRECL=1000,RECFM=FB)                        
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//*   END OF BP13D409                                                 *         
//*-------------------------------------------------------------------*         
