//BP13A746 JOB (BP13P),'BP13A746',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP130652  18/10/1999  SRA  EXPAND F510 RECL FROM 300 TO 500     *           
//* BP130810  06/03/2000  LSB  CHG BP13K772 TO BP13K722             *           
//*----------------------------------------------------------------*            
//* JCL TO PRINT PA/PRIORITY FOR BP13APA4                          *            
//* SUBMITED FROM PANEL BP13M541 (OPTION 6)                        *            
//*----------------------------------------------------------------*            
//* SORT BP13F520 IN ZONE,FT,SEQNO,REGNP SEQUENCE                  *            
//* OMIT RECS WITH ALLOCATION-SCHEME 'JB'                          *            
//*----------------------------------------------------------------*            
//STEPB    EXEC SORT                                                            
//SORTIN   DD DSN=BP13.K722.RANAPA4,                                            
//            DISP=SHR                                                          
//SORTOUT  DD DSN=&&BP13F520,                                                   
//            DISP=(NEW,PASS),                                                  
//            DCB=(LRECL=500,BLKSIZE=27500,RECFM=FB,DSORG=PS),                  
//            SPACE=(CYL,(130,10),RLSE)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(78,2,A,211,2,A,225,1,A,131,8,A,123,8,A),FORMAT=CH                
  INCLUDE COND=(213,3,CH,NE,C'JB ')                                             
/*                                                                              
//*----------------------------------------------------------------*            
//* PRINT REPORT ON BALLOTING FILE                                 *            
//*----------------------------------------------------------------*            
//STEPD    EXEC  SAS,DYNAMNBR=20,OPTIONS='MACRO',COND=(0,NE)                    
//BP13F510 DD DSN=&&BP13F520,                                                   
//            DISP=(OLD,PASS)                                                   
//BP13L541 DD SYSOUT=A,DEST=L434                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S541),                                     
//            DISP=SHR                                                          
