//BP13A59M JOB (BP13P),'BP13A59M',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000100
//          NOTIFY=CSD0071                                              00000200
//JOBLIB DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                     
//*=================================================================            
//*                                                                             
//*  THIS JOB IS TO ftp xml file(vfy file) to server                            
//*                                                                             
//*                                                                             
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---  -------- -----------                                          
//* BP136882 ZDD1 100817   NEW JCL                                              
//*=================================================================            
//*=====================================================================        
//*  to run the vry file for sending of sms                                     
//*=====================================================================        
//*=====================================================================        
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                            
//*=====================================================================        
//STEP06    EXEC PGM=BP13CFA4,COND=(0,NE)                                       
//BP13F203  DD DSN=BP13.F203.SMS.ROF.R1.VFY,DISP=SHR                            
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                                   
//B13F203A  DD DSN=BP13.F203.ASMS.XML01,DISP=SHR                                
//B13F203B  DD DSN=BP13.F203.ASMS.XML02,DISP=SHR                                
//B13F203C  DD DSN=BP13.F203.ASMS.XML03,DISP=SHR                                
//B13F203D  DD DSN=BP13.F203.ASMS.XML04,DISP=SHR                                
//B13F203E  DD DSN=BP13.F203.ASMS.XML05,DISP=SHR                                
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP07A EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.XML01,DISP=SHR                                    
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP07A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP07B   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN,DISP=SHR                                
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000001.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP07C   EXEC SAS,COND=(0,NE)                                                
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.FTP,DISP=OLD                                      
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.XML01' 20"                                     
       @030 TDAY   YYMMDD6.                                                     
       @036 '0800000001.xml';                                                   
   PUT @001 'quit';                                                             
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.FTP,DISP=OLD                                        
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//*=====================================================================        
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                            
//*=====================================================================        
//STEP15    EXEC PGM=BP13CFA8,COND=(0,NE,STEP06)                                
//BP13F213  DD DSN=BP13.F203.SMS.ROF.R2.VFY,DISP=SHR                            
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                                   
//B13F213A  DD DSN=BP13.F203.ASMS.UNSUCC.XML01,DISP=SHR                         
//B13F213B  DD DSN=BP13.F203.ASMS.UNSUCC.XML02,DISP=SHR                         
//B13F213C  DD DSN=BP13.F203.ASMS.UNSUCC.XML03,DISP=SHR                         
//B13F213D  DD DSN=BP13.F203.ASMS.UNSUCC.XML04,DISP=SHR                         
//B13F213E  DD DSN=BP13.F203.ASMS.UNSUCC.XML05,DISP=SHR                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP16A EXEC PGM=IDCAMS,COND=(0,NE,STEP15)                                    
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.UNSUCC.XML01,DISP=SHR                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP16A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP16B   EXEC SAS,COND=(0,NE,STEP16A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.UNSUCC.FILEIN,DISP=SHR                         
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "20"                                                                
       @003 TDAY   YYMMDD6.                                                     
       @009 '0800000006.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP16C   EXEC SAS,COND=(0,NE,STEP16A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                               
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.F203.ASMS.UNSUCC.XML01' 20"                              
       @037 TDAY   YYMMDD6.                                                     
       @043 '0800000006.xml';                                                   
   PUT @001 'quit';                                                             
//FTP008   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.UNSUCC.FTP,DISP=OLD                                 
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//*---------------------------------------------------------------------        
//STEP20D  EXEC SORT,COND=(0,NE,STEP15)                                         
//SORTIN   DD DSN=BP13.BULKSMS.UNSUCC.FILEIN,DISP=SHR                           
//SORTOUT  DD DSN=BP13.BULKSMS.FILEIN,DISP=MOD                                  
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,80,A),FORMAT=CH                                                
//**********************************************************************        
//*          FTP TO BulkSMS-File-List.txt                                       
//**********************************************************************        
//STEP21    EXEC SAS,COND=(0,NE,STEP15)                                         
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.BULKSMS.FILEIN.FTP,DISP=OLD                            
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "put 'BP13.BULKSMS.FILEIN' BulkSMS-File-List.txt";                  
   PUT @001 'quit';                                                             
//FTP013   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.BULKSMS.FILEIN.FTP,DISP=OLD                              
/*                                                                              
