//BP13SM23 JOB (BP13P),'BP13SM23',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00001031
//         NOTIFY=CSD0071                                               00002000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030020
//**************************************************************        00040000
//* SMS for appmt type M2 (Step 4)                                      00040126
//* (Receive your Ballot Results) BLTDCCYY SEL: There are updates       00040226
//* to your flat application. To view details, visit HDB Flat Portal >  00040326
//* Login via Singpass > My Flat Dashboard > I am a new flat buyer.     00040426
//**************************************************************        00060003
//* CHG REF  BY   ON        DESCRIPTION                                 00070003
//* -------- ---- --------  -----------                                 00080003
//* BP138342 MRR5 20230517  NEW JCL FOR SENDING SMS                     00090003
//*--------------------------------------------------------------------*00110000
//* DELETE THE TEMP DATA SETS                                           00112000
//*-------------------------------------------------------------------* 00113000
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                  00114014
//SYSPRINT DD   SYSOUT=*                                                00115000
//SYSIN    DD   *                                                       00116000
     DEL (BP13.BULKSMS.FILEIN.M2)                                       00118630
     DEL (BP13.BULKSMS.FILEIN.M2.FTP)                                   00118730
     DEL (BP13.F203.M2.FTP)                                             00119030
     IF MAXCC < 12 THEN                                                 00121600
        SET MAXCC = 0                                                   00121714
/*                                                                      00121800
//*-------------------------------------------------------------------* 00122011
//* DEFINE TEMP DATA SETS                                               00123011
//*-------------------------------------------------------------------* 00124011
//STEP0B   EXEC PGM=IEFBR14,COND=(0,NE)                                 00125014
//F203026   DD  DSN=BP13.BULKSMS.FILEIN.M2,                             00401930
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00402011
//             SPACE=(CYL,(2,1),RLSE),                                  00402111
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00402211
/*                                                                      00402311
//F203027   DD  DSN=BP13.BULKSMS.FILEIN.M2.FTP,                         00402430
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00402511
//             SPACE=(CYL,(2,1),RLSE),                                  00402611
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00402711
/*                                                                      00402811
//F203028   DD  DSN=BP13.F203.M2.FTP,                                   00402930
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00403011
//             SPACE=(CYL,(2,1),RLSE),                                  00403111
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00403211
/*                                                                      00403311
//**********************************************************************00403409
//* FTP FILE(S) THAT ARE NOT EMPTY                                      00403509
//**********************************************************************00403609
//STEP01A EXEC PGM=IDCAMS,COND=(0,NE)                                   00403714
//SYSPRINT DD SYSOUT=*                                                  00403809
//FILE1 DD DSN=BP13.F203.SMS.M2.XML03,DISP=SHR                          00403930
//SYSUDUMP DD SYSOUT=*                                                  00404009
//SYSIN DD *                                                            00404109
  PRINT INFILE(FILE1) -                                                 00404209
  DUMP COUNT(1)                                                         00404309
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       00404409
/*                                                                      00404509
//STARTIF IF (STEP01A.RC = 0) THEN                                      00404614
//**********************************************************************00404709
//*          GENERATE THE FILELIST DATASET                              00404809
//**********************************************************************00404909
//STEP01B   EXEC SAS,COND=(0,NE,STEP01A)                                00405014
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00405109
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN.M2,DISP=SHR                     00405230
//SYSPRINT  DD  SYSOUT=*                                                00405309
//SYSIN     DD  *                                                       00405409
DATA _NULLS_;                                                           00405509
FILE FILELST;                                                           00405609
TDAY=DATE();                                                            00405709
   PUT @001 "BP13E20"                                                   00405809
       @008 TDAY   YYMMDD6.                                             00405909
       @014 '0908000003.xml';                                           00406029
//**********************************************************************00406109
//*          GENERATE THE CURRENT FTP DATE FILE                         00406209
//**********************************************************************00406309
//STEP01C   EXEC SAS,COND=(0,NE,STEP01A)                                00406414
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00406509
//FTPDATE   DD  DSN=BP13.F203.M2.FTP,DISP=OLD                           00406630
//SYSPRINT  DD  SYSOUT=*                                                00406709
//SYSIN     DD  *                                                       00406809
DATA _NULLS_;                                                           00406909
FILE FTPDATE;                                                           00407009
TDAY=DATE();                                                            00407109
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 00407209
   PUT @001 "put 'BP13.F203.SMS.M2.XML03' BP13E20"                      00407330
       @037 TDAY   YYMMDD6.                                             00407432
       @043 '0908000003.xml';                                           00407532
   PUT @001 'quit';                                                     00407609
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           00407709
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          00407809
//INPUT    DD DSN=BP13.F203.M2.FTP,DISP=OLD                             00407930
/*                                                                      00408009
//STOPIF   ENDIF                                                        00408109
/*                                                                      00408209
//*-------------------------------------------------------------------- 00946015
//*          FTP TO BulkSMS-File-List.txt                               00946115
//*-------------------------------------------------------------------- 00946215
//STEP30    EXEC SAS,COND=(0,NE)                                        00946316
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00946415
//FTPDATE   DD  DSN=BP13.BULKSMS.FILEIN.M2.FTP,DISP=OLD                 00946530
//SYSPRINT  DD  SYSOUT=*                                                00946615
//SYSIN     DD  *                                                       00946715
DATA _NULLS_;                                                           00946815
FILE FTPDATE;                                                           00946915
TDAY=DATE();                                                            00947015
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 00947115
   PUT @001 "put 'BP13.BULKSMS.FILEIN.M2' BulkSMS-File-List.txt";       00948030
   PUT @001 'quit';                                                     00950000
//FTP013   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           00960000
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          00970000
//INPUT    DD DSN=BP13.BULKSMS.FILEIN.M2.FTP,DISP=OLD                   00980030
/*                                                                      00990000
