//BP13M404  JOB (BP13P),'BP13M404',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : MONTHLY AGREEMENT TEAM REPORTING                      *         
//* FREQUENCY : LAST DAY OF MONTH.                                    *         
//*                                                                   *         
//*===================================================================*         
//* CHG REF   DATE      BY   DESCRIPTION                              *         
//* --------  ----      ---  -----------                              *         
//* BP135948  17112015  RJB1 EXTRACTED BP13L65E FROM BP13M401         *         
//* BP136390  01112016  PCL4 TO ADD BP13C38P                          *         
//* BP136438  29112016  KSJ3 TO ADD BP13C11J (PEND KEY ISSUED)        *         
//* BP136525  30112016  KSJ3 UPDATE PEND KEY ISSUED SORT COND         *         
//* BP136326  13062016  KVL1 ADDED PPO EMAIL ALERT CREATION STEPS 15  *         
//*                          TO 27                                    *         
//* BP136525  08122016  PCL4 TO READ BP13K024 (BP13C11J)              *         
//* BP136525  13062016  KSJ3 ADD BP13C11L AND PEND KEY ISSUED HISTORY *         
//*                          RENAME STEPS 15-27 AS STEPS 19-31        *         
//* BP136574  11012017  RJB1 ADD BP13C99W                             *         
//* BP136743  25072017  KVL1 ADDED STEP32                             *         
//* BP136910  28072017  KVL1 UPDATED STEPS 20,25                      *         
//*                          ADDED STEPS   24A, 28A, 32               *         
//*                          CHANGED STEP  32 TO 33                   *         
//* BP136797  26072017  KSJ3 ADD BP13K365/BP13KB05 TO BP13C11J        *         
//* BP136696  24082017  MRN1 CHANGE RUN STEP TO PLAN FOR BP13C65E     *         
//* BP136925  16082017  KVL1 ADDED STEP    34 (BB24 INTRFC MNTHLY BKUP)         
//* BP136797  29082017  KVL1 REMOVED BP13KB05 IN STEP 15              *         
//* BP137028  11102017  KVL1 ADDED STEPS 35 TO 37 FOR PENDING LOA RPT *         
//* BP137213  21022018  LJL1 TO MOVE BP13C38P TO BP13M401             *         
//* BP138542  18012021  LJL1 TO CATER FOR PENDING SOCA TO MONITOR SOCA*         
//*===================================================================*         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-------------------------------------------------------------------*         
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                         *         
//*-------------------------------------------------------------------*         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT2   DD DSN=BP13.KC40.PENDKEY,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*                                                                             
//*--------------------------------------------------------------------         
//*    SORT BP13F410                                                            
//*--------------------------------------------------------------------         
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K410.ACCUMSO,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F410,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(100,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
  INCLUDE COND=(43,1,CH,EQ,C'S',AND,43,3,CH,NE,C'SAP',                          
                                AND,855,1,CH,NE,C' ')                           
//*--------------------------------------------------------------------         
//* BP13C65E - TO CHECK FOR SERS CASES                                          
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IKJEFT01,COND=(4,LT),REGION=4096K,                          
//            DYNAMNBR=20                                                       
//BP13F410 DD  DSN=&&BP13F410,DISP=(OLD,PASS)                                   
//P13F410A DD  DSN=&&P13F410A,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(100,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C65E) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT SERS CASES REPORT                                                     
//*-----------------------------------------------------------------            
//STEP03   EXEC SAS,COND=(4,LT)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F410 DD DSN=&&P13F410A,DISP=(OLD,PASS)                                    
//BP13L65E DD DSN=BP13.L65E.BP13C65E,DISP=SHR                                   
//P13L65EA DD DSN=BP13.L65E.P13C65EA,DISP=SHR                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S65E),DISP=SHR                             
//*                                                                             
//*****************************************************************             
//*         AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*****************************************************************             
//STEP04   EXEC PGM=IRXJCL,PARM='SMTPHDR',COND=(4,LT)                           
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD DSN=&&P13MHDG,DISP=(NEW,PASS),                                    
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=205,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*                                                                             
//*---------------------------------------------------------------------        
//STEP05   EXEC SAS,COND=(4,LT),OPTIONS='MACRO'                                 
//SYSOUT   DD SYSOUT=*                                                          
//MAILNAME DD DSN=&&MAILNAME,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                        00080000
//            DCB=(RECFM=VB,LRECL=205)                                  00090001
//MAILRCPT DD DSN=&&MAILRCPT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                        00080000
//            DCB=(RECFM=VB,LRECL=205)                                  00090001
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
    FILE MAILNAME;                                                              
    PUT @01 '           FILENAME="BP13L65E.TXT"';                               
    PUT @01 ' ';                                                                
  RUN;                                                                          
//         DD DSN=BP13.MAIL.BP13C65E,DISP=SHR                                   
//         DD *                                                                 
    PUT @01 'SUBJECT : NO. OF SERS CASES KEY COLLECTED';                        
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=IEBGENER,COND=(4,LT)                                        
//SYSUT1   DD DSN=*.STEP04.SMTPHDR,DISP=(OLD,DELETE)                            
//         DD DSN=&&MAILRCPT,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&MAILNAME,DISP=(OLD,DELETE)                                  
//         DD *                                                                 
//         DD DSN=BP13.L65E.BP13C65E,DISP=SHR                                   
//         DD DSN=BP13.L65E.P13C65EA,DISP=SHR                                   
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILRPT.BP13C65E,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*  DETAILS OF THE TRANSACTION CASES (BCP USE)                       *         
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//STEP07   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13C65E,DISP=SHR                                
//*=================================================================            
//*                                                                             
//* PROCESSING FOR PENDING KEY ISSUED                                           
//*                                                                             
//*=================================================================            
//*-----------------------------------------------------------------            
//* BACK-UP BP13KC40                                                            
//*-----------------------------------------------------------------            
//STEP11   EXEC PGM=IDCAMS,COND=(4,LT)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KC40.PENDKEY,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.FC40.PENDKEY.DAILY(+1),DISP=(NEW,CATLG),                 
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13.KC40.PENDKEY RECS WITH UPDATE                                     
//*-----------------------------------------------------------------            
//STEP12   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.KC40.PENDKEY,DISP=SHR                                    
//SORTOUT  DD DSN=&&FC40,                                                       
//            DISP=(NEW,PASS,DELETE),                                           
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(57,3,CH,NE,C'   ',AND,57,3,CH,NE,C'000')                        
//*                                                                             
//*-----------------------------------------------------------------            
//* ARCHIVE UPDATED BP13KC40 RECS TO BP13KC45                                   
//*-----------------------------------------------------------------            
//STEP13   EXEC PGM=BP13C11L,COND=(4,LT)                                        
//BP13FC40 DD DSN=&&FC40,DISP=(OLD,DELETE)                                      
//BP13KC45 DD DSN=BP13.KC45.PENDKEY.HISTORY,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* EXTRACT BP13K800 FOR PENDING KEY ISSUED                                     
//*-----------------------------------------------------------------            
//STEP14   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&F800,                                                       
//            DISP=(NEW,PASS,DELETE),                                           
//            SPACE=(CYL,(200,100),RLSE),                                       
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(155,11,CH,NE,C'           ')                                    
//*                                                                             
//*-----------------------------------------------------------------            
//* POPULATE BP13FC40 FOR ONLINE UPDATE OF REASON CODE                          
//*-----------------------------------------------------------------            
//STEP15   EXEC PGM=IKJEFT01,COND=(4,LT),REGION=4096K,                          
//            DYNAMNBR=20                                                       
//BP13F800 DD DSN=&&F800,DISP=(OLD,DELETE)                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//BP13KC40 DD DSN=BP13.KC40.PENDKEY,DISP=SHR                                    
//BP13K096 DD DSN=BP13.K096.SECURITY,DISP=SHR                                   
//BP13K365 DD DSN=BP13.K365.LATE.COMPL,DISP=SHR                                 
//BP13FC40 DD DSN=&&FC4A,                                                       
//            DISP=(NEW,PASS,DELETE),                                           
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C11J) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//* REDEFINE BP13KC40 BASED ON NEWLY EXTRACTED BP13FC40                         
//*-----------------------------------------------------------------            
//STEP16  EXEC PGM=IDCAMS,COND=(4,LT)                                           
//BP13FC40 DD DSN=&&FC4A,DISP=(OLD,DELETE)                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL 'BP13.KC40.PENDKEY' CL PURGE                                           
     DEF CL    (NAME(BP13.KC40.PENDKEY)                 -                       
                CYL(20 10)                              -                       
                UNIQUE                                  -                       
                STORCLAS(PRODRLS)                       -                       
                LOG(NONE)                               -                       
                SHR(2 3))                               -                       
         DATA  (NAME(BP13.KC40.PENDKEY.DATA)            -                       
                KEYS(8 13)                              -                       
                RECSZ(100 100)                          -                       
                CISZ(4096))                             -                       
         INDEX (NAME(BP13.KC40.PENDKEY.INDEX))                                  
     IF LASTCC = 0 THEN                                                         
        REPRO INFILE(BP13FC40)                          -                       
              ODS(BP13.KC40.PENDKEY) REUSE                                      
     IF MAXCC = 0 THEN                                                          
        DEF AIX (NAME(BP13.KC40.PENDKEY.ALTX1)          -                       
                 REL(BP13.KC40.PENDKEY)                 -                       
                 CYL(20 10)                             -                       
                 SHR(2 3)                               -                       
                 KEYS(16 5)                             -                       
                 CISZ(4096)                             -                       
                 RECSZ(29 29)                           -                       
                 UNQK)                                                          
        IF LASTCC = 0 THEN                              -                       
           DEF PATH(NAME(BP13.KC40.PENDKEY.PATH1)       -                       
               PENT(BP13.KC40.PENDKEY.ALTX1))                                   
        IF LASTCC = 0 THEN                              -                       
           BIX IDS(BP13.KC40.PENDKEY)                   -                       
               ODS(BP13.KC40.PENDKEY.ALTX1)                                     
     IF MAXCC = 0 THEN                                                          
        DEF AIX (NAME(BP13.KC40.PENDKEY.ALTX2)          -                       
                 REL(BP13.KC40.PENDKEY)                 -                       
                 CYL(20 10)                             -                       
                 SHR(2 3)                               -                       
                 KEYS(21 0)                             -                       
                 CISZ(4096)                             -                       
                 RECSZ(34 34)                           -                       
                 UNQK)                                                          
        IF LASTCC = 0 THEN                              -                       
           DEF PATH(NAME(BP13.KC40.PENDKEY.PATH2)       -                       
               PENT(BP13.KC40.PENDKEY.ALTX2))                                   
        IF LASTCC = 0 THEN                              -                       
           BIX IDS(BP13.KC40.PENDKEY)                   -                       
               ODS(BP13.KC40.PENDKEY.ALTX2)                                     
     IF MAXCC = 0 THEN                                                          
        DEF AIX (NAME(BP13.KC40.PENDKEY.ALTX3)          -                       
                 REL(BP13.KC40.PENDKEY)                 -                       
                 CYL(20 10)                             -                       
                 SHR(2 3)                               -                       
                 KEYS(14 68)                            -                       
                 CISZ(4096)                             -                       
                 RECSZ(27 27)                           -                       
                 UNQK)                                                          
        IF LASTCC = 0 THEN                              -                       
           DEF PATH(NAME(BP13.KC40.PENDKEY.PATH3)       -                       
               PENT(BP13.KC40.PENDKEY.ALTX3))                                   
        IF LASTCC = 0 THEN                              -                       
           BIX IDS(BP13.KC40.PENDKEY)                   -                       
               ODS(BP13.KC40.PENDKEY.ALTX3)                                     
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13.KC40.PENDKEY                                                      
//*-----------------------------------------------------------------            
//STEP17   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.KC40.PENDKEY,DISP=SHR                                    
//SORTOUT  DD DSN=&&FC4B,                                                       
//            DISP=(NEW,PASS,DELETE),                                           
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* CREATE INTRAY RECORD FOR OIC ACTION                               * 11      
//*-------------------------------------------------------------------*         
//STEP18   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BP13FC40 DD DSN=&&FC4B,DISP=(OLD,DELETE)                                      
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C99Z) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BP13.KC40.PENDKEY                                                      
//*-----------------------------------------------------------------            
//STEP18A  EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.KC40.PENDKEY,DISP=SHR                                    
//SORTOUT  DD DSN=&&FC4C,                                                       
//            DISP=(NEW,PASS,DELETE),                                           
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(69,14,A),FORMAT=CH                                               
//*                                                                             
//*-------------------------------------------------------------------*         
//* CREATE INTRAY RECORD FOR TEAM LEAD ACTION                         * 11      
//*-------------------------------------------------------------------*         
//STEP18B  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BP13FC40 DD DSN=&&FC4C,DISP=(OLD,DELETE)                                      
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C99W) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//*                                                                             
//* PROCESSING FOR PPO EMAIL ALERT                                              
//*                                                                             
//*=================================================================            
//*-------------------------------------------------------------------*         
//* EXTRACT FROM K73E PPO FILE FOR CASES THAT ARE:                    *         
//* FILE 1 : EXEMPT TAG = ' ' (NOT EXEMPTED)                          *         
//* FILE 2 : EXEMPT TAG = 'Y' (EXEMPTED) AND                          *         
//*          DISPOSAL DEADLINE IS 3 MONTHS FROM NOW AND THE BACKLOG   *         
//*          CASES (REPORTED BEFORE BUT STILL NOT DONE) SO OIC WILL BE*         
//*          ALERTED BEFORE THE DISPOSAL DEADLINE IS UP               *         
//*-------------------------------------------------------------------*         
//STEP19   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.K73E.PPO.MONITOR,DISP=SHR                                
//SORTOF01 DD DSN=&&EXEMPT,DISP=(NEW,PASS),                                     
//            SPACE=(CYL,(50,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SORTOF02 DD DSN=&&NOEXEMPT,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(50,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=COPY                                                            
  OUTFIL FILES=01,                                                              
   INCLUDE=(211,01,CH,EQ,C'Y',AND,                                              
            349,01,CH,EQ,C'Y',AND,                                              
            376,06,ZD,LE,DATE2P+3,AND,                                          
            334,08,CH,EQ,C'        ',AND,                                       
            358,01,CH,NE,C'Y',AND,                                              
            375,01,CH,EQ,C'2')                                                  
  OUTFIL FILES=02,                                                              
   INCLUDE=(211,01,CH,EQ,C' ')                                                  
/*                                                                              
//*---------------------------------------------------------------------00031706
//* VALIDATE AND GENERATE PPO EMAIL ALERT                                       
//*---------------------------------------------------------------------00031706
//STEP20   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BP13F73A DD  DSN=&&EXEMPT,DISP=(OLD,DELETE)                                   
//BP13F73B DD  DSN=&&NOEXEMPT,DISP=(OLD,DELETE)                                 
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                                     
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR                                    
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                              
//BP13K024 DD  DSN=BP13.K024.WISLAST,DISP=SHR                                   
//BP13K410 DD  DSN=BP13.K410.ACCUMSO,DISP=SHR                                   
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BP13L73A DD  DSN=BP13.L73A.EXEMPT.LIST,DISP=SHR                               
//BP13L73B DD  DSN=BP13.L73B.NOEXEMPT.LIST,DISP=SHR                             
//BP13L73C DD  DSN=BP13.L73C.NOEXEMPT.LIST,DISP=SHR                             
//BP13L73D DD  DSN=BP13.L73D.NOEXEMPT.LIST,DISP=SHR                             
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C995) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-------------------------------------------------------------------*         
//* SORT IN ASCENDING OIC PREB, REGN NUM EXEMPT FILE                  *         
//*-------------------------------------------------------------------*         
//STEP21   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.L73A.EXEMPT.LIST,DISP=SHR                                
//SORTOUT  DD DSN=&&PREB,DISP=(NEW,PASS),                                       
//            SPACE=(CYL,(50,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=(137,60,A,1,08,A),FORMAT=CH                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT IN ASCENDING OIC POSB, REGN NUM EXEMPT FILE                  *         
//*-------------------------------------------------------------------*         
//STEP22   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.L73A.EXEMPT.LIST,DISP=SHR                                
//SORTOUT  DD DSN=&&POSB,DISP=(NEW,PASS),                                       
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=(197,50,A,1,08,A),FORMAT=CH                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT IN ASCENDING OIC NON EXEMPT FILE B                           *         
//*-------------------------------------------------------------------*         
//STEP23   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.L73B.NOEXEMPT.LIST,DISP=SHR                              
//SORTOUT  DD DSN=&&L73B,DISP=(NEW,PASS),                                       
//            SPACE=(CYL,(50,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=(137,50,A,1,08,A),FORMAT=CH                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT IN ASCENDING OIC NON EXEMPT FILE C                           *         
//*-------------------------------------------------------------------*         
//STEP24   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.L73C.NOEXEMPT.LIST,DISP=SHR                              
//SORTOUT  DD DSN=&&L73C,DISP=(NEW,PASS),                                       
//            SPACE=(CYL,(50,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=(137,50,A,1,08,A),FORMAT=CH                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT IN ASCENDING OIC NON EXEMPT FILE C                           *         
//*-------------------------------------------------------------------*         
//STEP24A  EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.L73D.NOEXEMPT.LIST,DISP=SHR                              
//SORTOUT  DD DSN=&&L73D,DISP=(NEW,PASS),                                       
//            SPACE=(CYL,(50,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=(137,50,A,1,08,A),FORMAT=CH                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* CREATE PPO EMAIL ALERT                                            *         
//*-------------------------------------------------------------------*         
//STEP25 EXEC  PGM=BP13C996,COND=(4,LT)                                         
//BP13FPRB DD  DSN=&&PREB,DISP=(OLD,DELETE)                                     
//BP13FPOS DD  DSN=&&POSB,DISP=(OLD,DELETE)                                     
//BP13F73B DD  DSN=&&L73B,DISP=(OLD,DELETE)                                     
//BP13F73C DD  DSN=&&L73C,DISP=(OLD,DELETE)                                     
//BP13F73D DD  DSN=&&L73D,DISP=(OLD,DELETE)                                     
//MAILRPA1 DD  DSN=BP13.L996A1.EXEMPT.LIST,DISP=SHR                             
//MAILRPA2 DD  DSN=BP13.L996A2.EXEMPT.LIST,DISP=SHR                             
//MAILRPB1 DD  DSN=BP13.L996B1.NOEXEMPT.LIST,DISP=SHR                           
//MAILRPB2 DD  DSN=BP13.L996B2.NOEXEMPT.LIST,DISP=SHR                           
//MAILRPC1 DD  DSN=BP13.L996C1.NOEXEMPT.LIST,DISP=SHR                           
//MAILRPC2 DD  DSN=BP13.L996C2.NOEXEMPT.LIST,DISP=SHR                           
//MAILRPD1 DD  DSN=BP13.L996D1.NOEXEMPT.LIST,DISP=SHR                           
//MAILRPD2 DD  DSN=BP13.L996D2.NOEXEMPT.LIST,DISP=SHR                           
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* MERGE MAILRPTA INTO 1 FILE FOR SENDING                            *         
//*-------------------------------------------------------------------*         
//STEP26   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.L996A1.EXEMPT.LIST,DISP=SHR                              
//         DD DSN=BP13.L996A2.EXEMPT.LIST,DISP=SHR                              
//SORTOUT  DD DSN=&&RPTA,DISP=(NEW,PASS),                                       
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=COPY                                                            
/*                                                                              
//*-------------------------------------------------------------------*         
//* MERGE MAILRPTB INTO 1 FILE FOR SENDING                            *         
//*-------------------------------------------------------------------*         
//STEP27   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.L996B1.NOEXEMPT.LIST,DISP=SHR                            
//         DD DSN=BP13.L996B2.NOEXEMPT.LIST,DISP=SHR                            
//SORTOUT  DD DSN=&&RPTB,DISP=(NEW,PASS),                                       
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=COPY                                                            
/*                                                                              
//*-------------------------------------------------------------------*         
//* MERGE MAILRPTC INTO 1 FILE FOR SENDING                            *         
//*-------------------------------------------------------------------*         
//STEP28   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.L996C1.NOEXEMPT.LIST,DISP=SHR                            
//         DD DSN=BP13.L996C2.NOEXEMPT.LIST,DISP=SHR                            
//SORTOUT  DD DSN=&&RPTC,DISP=(NEW,PASS),                                       
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=COPY                                                            
/*                                                                              
//*-------------------------------------------------------------------*         
//* MERGE MAILRPTC INTO 1 FILE FOR SENDING                            *         
//*-------------------------------------------------------------------*         
//STEP28A  EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SORTIN   DD DSN=BP13.L996D1.NOEXEMPT.LIST,DISP=SHR                            
//         DD DSN=BP13.L996D2.NOEXEMPT.LIST,DISP=SHR                            
//SORTOUT  DD DSN=&&RPTD,DISP=(NEW,PASS),                                       
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=COPY                                                            
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAILRPTA TO OIC (PPO EMAIL ALERT3)                          *         
//*-------------------------------------------------------------------*         
//STEP29   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&RPTA,DISP=(OLD,DELETE)                                      
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAILRPTB TO OIC (PPO EMAIL ALERT1)                          *         
//*-------------------------------------------------------------------*         
//STEP30   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&RPTB,DISP=(OLD,DELETE)                                      
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAILRPTC TO OIC (PPO EMAIL ALERT2)                          *         
//*-------------------------------------------------------------------*         
//STEP31   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&RPTC,DISP=(OLD,DELETE)                                      
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAILRPTD TO OIC (PPO EMAIL ALERT4)                          *         
//*-------------------------------------------------------------------*         
//STEP32   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&RPTD,DISP=(OLD,DELETE)                                      
/*                                                                              
//*-------------------------------------------------------------------*         
//*  MONTHLY BACKUP OF BB24 INTERFACE FILE INTO GDG AND                         
//*  HOUSEKEEPING OF DAILY BB24 ACCUM FILE                                      
//*-------------------------------------------------------------------*         
//STEP33   EXEC PGM=IDCAMS,COND=(4,LT)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F007.TLOAN.BB24.ACCUM,DISP=SHR                           
//INPUT2   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.F007.TLOAN.BB24.BKUP(+1),                                
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(BP13.GDG,BLKSIZE=27900,LRECL=300,RECFM=FB)                   
//OUTPUT2  DD DSN=BP13.F007.TLOAN.BB24.ACCUM,DISP=OLD                           
//SYSIN    DD  *                                                                
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                       
    REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//*  MONTHLY BACKUP OF BB24 INTERFACE FILE INTO GDG AND                         
//*  HOUSEKEEPING OF DAILY BP13 ACCUM FILE                                      
//*-------------------------------------------------------------------*         
//STEP34   EXEC PGM=IDCAMS,COND=(4,LT)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F94E.INTERFC.BB24.ACCUM,DISP=SHR                         
//INPUT2   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.F94E.INTERFC.BB24.BKUP(+1),                              
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(BP13.GDG,BLKSIZE=27900,LRECL=150,RECFM=FB)                   
//OUTPUT2  DD DSN=BP13.F94E.INTERFC.BB24.ACCUM,DISP=OLD                         
//SYSIN    DD  *                                                                
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                       
    REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                       
//*                                                                             
//*-----------------------------------------------------------------            
//* EXTRACT PENDING LOA STATUS 4 MONTHS HAS PASSED SINCE CANCELLATION           
//*-----------------------------------------------------------------            
//STEP35   EXEC  SORT,COND=(4,LT)                                               
//SORTIN   DD  DSN=BP13.K62A.STAMPREF,DISP=SHR                                  
//SORTOUT  DD  DSN=BP13.F62A.PENDING.LOA,DISP=SHR                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(30,8,A),FORMAT=CH                                                
  INCLUDE COND=(70,08,CH,NE,C'        ',AND,                                    
                70,06,ZD,EQ,DATE2P-4,AND,                                       
               181,01,CH,EQ,C'P')                                               
//*-----------------------------------------------------------------            
//*   GENERATE MONTHLY REPORT FOR PENDING LOA                                   
//*-----------------------------------------------------------------            
//STEP36   EXEC PGM=BP13C94H,COND=(4,LT)                                        
//BP13F62A DD DSN=BP13.F62A.PENDING.LOA,DISP=SHR                                
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13L94H DD DSN=BP13.L94H.PENDING.LOA,DISP=SHR                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*         SEND THE SMTP MAIL                                                  
//*-----------------------------------------------------------------            
//STEP37   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L94H.PENDING.LOA,DISP=SHR                                
//*-----------------------------------------------------------------            
//* EXTRACT BP13K800 FOR PENDING SOCA                                           
//* ---DTE-AO-APPT NOT EQUAL TO BLANK                                           
//* ---DTE-AGRMT-FOR-LEASE  EQUAL TO BLANK                                      
//* ---ALLO-SCHEME NOT EQUAL TO FSH                                             
//* ---MODE IS EQUAL TO BTO OR SBF OR ROF                                       
//* ---PORT-ELIG-TAG NOT EQUAL TO Y AND P                                       
//*-----------------------------------------------------------------            
//STEP38   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&F800,                                                       
//            DISP=(NEW,PASS,DELETE),                                           
//            SPACE=(CYL,(200,100),RLSE),                                       
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE  COND=(459,8,CH,EQ,C'        ',AND,                                   
                 587,8,CH,EQ,C'        ',AND,                                   
                 57,3,CH,NE,C'FSH',AND,                                         
                (924,3,CH,EQ,C'BTO',OR,924,3,CH,EQ,C'SBF',OR,                   
                 924,3,CH,EQ,C'ROF'),AND,                                       
                (1148,1,CH,NE,C'Y',AND,1148,1,CH,NE,C'P'))                      
//*                                                                             
//*-----------------------------------------------------------------            
//* POPULATE BP13FC55 FOR ONLINE UPDATE OF REASON CODE                          
//*-----------------------------------------------------------------            
//STEP39   EXEC PGM=IKJEFT01,COND=(4,LT),REGION=4096K,                          
//            DYNAMNBR=20                                                       
//BP13F800 DD DSN=&&F800,DISP=(OLD,DELETE)                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//BP13KC55 DD DSN=BP13.KC55.PENDSOCA,DISP=SHR                                   
//BP13K096 DD DSN=BP13.K096.SECURITY,DISP=SHR                                   
//BP13KQ10 DD DSN=BP13.KQ10.DOC.TBL,DISP=SHR                                    
//BP13FC55 DD DSN=BP13.FC55.PENDSOCA.NEW,DISP=SHR                               
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C11N) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//* REDEFINE BP13KC55 BASED ON NEWLY EXTRACTED BP13FC55                         
//*-----------------------------------------------------------------            
//STEP40  EXEC PGM=IDCAMS,COND=(4,LT)                                           
//BP13FC55 DD DSN=BP13.FC55.PENDSOCA.NEW,DISP=SHR                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL 'BP13.KC55.PENDSOCA' CL PURGE                                          
     DEF CL    (NAME(BP13.KC55.PENDSOCA)                -                       
                CYL(20 10)                              -                       
                UNIQUE                                  -                       
                STORCLAS(PRODRLS)                       -                       
                LOG(NONE)                               -                       
                SHR(2 3))                               -                       
         DATA  (NAME(BP13.KC55.PENDSOCA.DATA)           -                       
                KEYS(8 13)                              -                       
                RECSZ(100 100)                          -                       
                CISZ(4096))                             -                       
         INDEX (NAME(BP13.KC55.PENDSOCA.INDEX))                                 
     IF LASTCC = 0 THEN                                                         
        REPRO INFILE(BP13FC55)                          -                       
              ODS(BP13.KC55.PENDSOCA) REUSE                                     
     IF MAXCC = 0 THEN                                                          
        DEF AIX (NAME(BP13.KC55.PENDSOCA.ALTX1)         -                       
                 REL(BP13.KC55.PENDSOCA)                -                       
                 CYL(20 10)                             -                       
                 SHR(2 3)                               -                       
                 KEYS(16 5)                             -                       
                 CISZ(4096)                             -                       
                 RECSZ(29 29)                           -                       
                 UNQK)                                                          
        IF LASTCC = 0 THEN                              -                       
           DEF PATH(NAME(BP13.KC55.PENDSOCA.PATH1)      -                       
               PENT(BP13.KC55.PENDSOCA.ALTX1))                                  
        IF LASTCC = 0 THEN                              -                       
           BIX IDS(BP13.KC55.PENDSOCA)                  -                       
               ODS(BP13.KC55.PENDSOCA.ALTX1)                                    
     IF MAXCC = 0 THEN                                                          
        DEF AIX (NAME(BP13.KC55.PENDSOCA.ALTX2)         -                       
                 REL(BP13.KC55.PENDSOCA)                -                       
                 CYL(20 10)                             -                       
                 SHR(2 3)                               -                       
                 KEYS(21 0)                             -                       
                 CISZ(4096)                             -                       
                 RECSZ(34 34)                           -                       
                 UNQK)                                                          
        IF LASTCC = 0 THEN                              -                       
           DEF PATH(NAME(BP13.KC55.PENDSOCA.PATH2)      -                       
               PENT(BP13.KC55.PENDSOCA.ALTX2))                                  
        IF LASTCC = 0 THEN                              -                       
           BIX IDS(BP13.KC55.PENDSOCA)                  -                       
               ODS(BP13.KC55.PENDSOCA.ALTX2)                                    
     IF MAXCC = 0 THEN                                                          
        DEF AIX (NAME(BP13.KC55.PENDSOCA.ALTX3)         -                       
                 REL(BP13.KC55.PENDSOCA)                -                       
                 CYL(20 10)                             -                       
                 SHR(2 3)                               -                       
                 KEYS(14 68)                            -                       
                 CISZ(4096)                             -                       
                 RECSZ(27 27)                           -                       
                 UNQK)                                                          
        IF LASTCC = 0 THEN                              -                       
           DEF PATH(NAME(BP13.KC55.PENDSOCA.PATH3)      -                       
               PENT(BP13.KC55.PENDSOCA.ALTX3))                                  
        IF LASTCC = 0 THEN                              -                       
           BIX IDS(BP13.KC55.PENDSOCA)                  -                       
               ODS(BP13.KC55.PENDSOCA.ALTX3)                                    
//*                                                                             
//*=================================================================            
//* PROCESSING FOR PENDING SOCA TOTAL NUMBER OF CASES PER MONTH/OIC             
//* DEFINE BP13KC66                                                             
//*-----------------------------------------------------------------            
//STEP41  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//BP13FC55 DD DSN=BP13.BLANK.CHAR100,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL 'BP13.KC66.PENDSOCA.CNT' CL PURGE                                      
     DEF CL    (NAME(BP13.KC66.PENDSOCA.CNT)                     -              
                CYL(1 1)                              -                         
                UNIQUE                                  -                       
                STORCLAS(PRODRLS)                       -                       
                LOG(NONE)                               -                       
                SHR(2 3))                               -                       
         DATA  (NAME(BP13.KC66.PENDSOCA.CNT.DATA)                -              
                KEYS(1 0)                              -                        
                RECSZ(100 100)                          -                       
                CISZ(4096))                             -                       
         INDEX (NAME(BP13.KC66.PENDSOCA.CNT.INDEX))                             
     IF LASTCC = 0 THEN                                                         
        REPRO INFILE(BP13FC55)                          -                       
              ODS(BP13.KC66.PENDSOCA.CNT) REUSE                                 
//*-----------------------------------------------------------------            
//STEP42   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.FC55.PENDSOCA.NEW,DISP=SHR                               
//SORTOUT  DD DSN=&&FC55,                                                       
//            DISP=(NEW,PASS,DELETE),                                           
//            SPACE=(CYL,(200,100),RLSE),                                       
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(69,1,A),FORMAT=CH                                                
//*                                                                             
//*--------------------------------------------------------------------         
//*UPDATE BP13KC66                                                              
//*--------------------------------------------------------------------         
//STEP43   EXEC  PGM=BP13C11O,COND=(0,NE)                                       
//BP13FC55 DD DSN=&&FC55,DISP=(OLD,DELETE)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KC66 DD DSN=BP13.KC66.PENDSOCA.CNT,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*                           END OF JOB                              *         
//*-------------------------------------------------------------------*         
