//BP13D117 JOB (BP13P),'BP13D117',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//* ============================================================== *            
//*                                                                *            
//*             D A I L Y    F I N A N C I A L    J O B            *            
//*                                                                *            
//* ============================================================== *            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- --   ------   -----------                                          
//* BP136182 MRN1 190416   PROCESS RETURN FILE FROM CPF BOARD                   
//* ============================================================== *            
//*--------------------------------------------------------------------         
//* STEP01  TO SORT RECORDS IN REGN SEQUENCE                                    
//*---------------------------------------------------------------------        
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F935.ACCEPT,DISP=SHR                               
//SORTOUT  DD  DSN=&&AB02F935,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
        SORT FIELDS=(57,8,A,2,9,A),FORMAT=CH                                    
//*-----------------------------------------------------------------            
//* UPDATE BP13KD05 FOR THOSE CASES THAT ARE MATCHED FROM CPF                   
//*-----------------------------------------------------------------            
//STEP02 EXEC PGM=BP13CB5A,COND=(0,NE)                                          
//AB02F935 DD DSN=&&AB02F935,DISP=(OLD,PASS)                                    
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORT AB02F935 TO PROCESS SRG/AHG/SHG/REG/SUG                                
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.AB02.F935.SOC.DAILY,DISP=SHR                             
//SORTOUT  DD  DSN=&&B02F935A,DISP=(,PASS),                                     
//         UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                   
//         DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,64,CH,A),FORMAT=CH                                         
//*-------------------------------------------------------------------*         
//* SORT AB02F930                                                               
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.AB02.F930.GRNT.BKP,DISP=SHR                              
//SORTOUT  DD DSN=BP13.AB02.F930.GRNT.BKP,DISP=OLD                              
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,64,CH,A),FORMAT=CH                                         
//*-----------------------------------------------------------------            
//* PROCESS RETURN FILE (UPD GRANT_AMSNT TBL, DEL FRM INTRAY & BP13KD10)        
//*-----------------------------------------------------------------            
//STEP05 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                 
//AB02F935 DD DSN=&&B02F935A,DISP=(OLD,PASS)                                    
//AB02F930 DD DSN=BP13.AB02.F930.GRNT.BKP,DISP=SHR                              
//BP13KD10 DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR                                   
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR                                     
//SY08K011 DD DSN=SY08.K010.USERID.PATH1,DISP=SHR                               
//AB02F93A DD DSN=BP13.AB02.F930.GRNT.MATCHED,DISP=MOD                          
//AB02F93B DD DSN=BP13.AB02.F935.GRNT.REJ,DISP=MOD                              
//AB02F93C DD DSN=BP13.AB02.F930.GRNT.UNMATCH,DISP=OLD                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CB3D) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-------------------------------------------------------------------*         
//* OVERWRITE BACKUP FILE WITH UNMATCHED CASES                                  
//*-------------------------------------------------------------------*         
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.AB02.F930.GRNT.UNMATCH,DISP=SHR                          
//SORTOUT  DD DSN=BP13.AB02.F930.GRNT.BKP,DISP=OLD                              
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,64,CH,A),FORMAT=CH                                         
      SUM FIELDS=NONE                                                           
//*=================================================================            
//* EMPTY BP13.AB02.F930.GRNT.DAILY                                             
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                  00002800
//SYSPRINT DD SYSOUT=*                                                  00003600
//INPUT01  DD DSN=NULLFILE,DISP=SHR                                     00003702
//OUTPUT01 DD DSN=BP13.AB02.F930.GRNT.DAILY,DISP=OLD                            
//SYSIN    DD *                                                         00012300
   REPRO INFILE(INPUT01) OUTFILE(OUTPUT01)                              00012300
/*                                                                              
