//BP13M202  JOB (BP13P),'BP13M202',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*******************************************************************           
//* 1) TABULATE MONTHY REPORT ON BOOKED FLATS TO APL UNIT                       
//* 2) OUTPUT AHG CASES TO PLANNING & MARKETING UNIT                            
//*******************************************************************           
//* CHG REF  DATE   BY    DESCRIPTION                                           
//* -------- ------ ----  -----------                                           
//* BP132172 070802 LSB   NEW JCL                                               
//* BP132226 101002 ANC1  INCLUDE 3RM CASES IN THE REPORT                       
//* BP132235 200203 ANC1  REMOVE STEP16 INCLUDE COND EQUAL TO THE FF:           
//*                       COL 1   - STATUS(NOT EQUAL CANCEL)                    
//*                       COL 32  - EC-TAG(NOT EQUAL C)                         
//*                       COL 51  - NEW TOWN(NOT EQUAL BLANK)                   
//*                       COL 155 - NUM-SCH-ACC(NOT EQUAL BLANK)                
//* BP132627 121104 GAN1  CHG F800.APPLN.KEYISSUE TO BP13K893                   
//* BP132892 260906 SSS2  OUTPUT AHG CASES TO DATASET                           
//* BP135171 110214 RJE1  TO CATER FOR DB2 UPGRADE                              
//*******************************************************************           
//* TO SEND DJDE AHEAD OF THE PRINT DATASET                                     
//* PRT01 : 1 COPY                                                              
//*------------------------------------------------------------------           
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAMPPA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* SORT BY SCH-ACC-NO                                                          
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                        00000810
//SORTIN   DD DSN=BM06.K110.FLATINV,DISP=SHR,                           00000830
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&BM06F110,DISP=(NEW,PASS),                           00000900
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                       00000804
//            SPACE=(CYL,(150,500),RLSE)                                00000805
//SYSOUT   DD SYSOUT=*                                                  00001000
//SYSPRINT DD SYSOUT=*                                                  00000820
//SYSIN    DD *                                                         00001100
     SORT FIELDS=(1,11,A),FORMAT=CH                                     00001200
//*-----------------------------------------------------------------            
//* GET PREV MONTH DATE FROM SY02 & COMPARE W/ ACCEPTANCE DATE                  
//* OUTPUT TO FILE IF DATES ARE EQUAL                                           
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C015,COND=(0,NE)                                        
//BM06F110 DD DSN=&&BM06F110,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BM6F110A DD DSN=BM06.F110.FLATINV.BOOK,DISP=OLD                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT HISTORY FILE TO 2000 RECORDS                                           
//*-----------------------------------------------------------------            
//STEP03A  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                      00000830
//SORTOUT  DD DSN=&&BP13K893,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(320,150),RLSE)                                        
//SYSIN    DD  *                                                                
     SORT FIELDS=(155,11,A),FORMAT=CH                                           
     OUTREC FIELDS=(1,2000)                                                     
     SUM FIELDS=NONE                                                            
//*-----------------------------------------------------------------            
//* SORT BY SCHEME ACCOUNT NO                                                   
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F800.APPLN,DISP=SHR                              00000830
//         DD DSN=&&BP13K893,DISP=(OLD,DELETE)                          00000830
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(320,150),RLSE)                                        
//SYSIN    DD  *                                                                
     SORT FIELDS=(155,11,A),FORMAT=CH                                           
//*-----------------------------------------------------------------            
//* MATCH SOC MASTER TO FIS MASTER,GET ACCEPTANCE DATE                          
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13C016,COND=(0,NE)                                        
//BM06F110 DD DSN=BM06.F110.FLATINV.BOOK,DISP=SHR                               
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//P13F800A DD DSN=&&F800BOOK,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(20,50),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT SOC MASTER BY NRIC1                                                    
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F800BOOK,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F800FIS,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(20,50),RLSE)                                          
//SYSIN    DD  *                                                                
     SORT FIELDS=(88,9,A),FORMAT=CH                                             
//*-----------------------------------------------------------------            
//* GET MARRIAGE DATE FROM CDB                                                  
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=IKJEFT01,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800FIS,DISP=(OLD,DELETE)                                   
//P13F800A DD DSN=&&F800CDBA,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(20,50),RLSE)                                          
//P13F800B DD DSN=&&F800CDBB,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(20,50),RLSE)                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C010) -                                                       
        PLAN(BP13PCC) -                                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* MERGE & SORT SOC MASTER TO INCLUDE BOOKED CASES FOR THE QUARTER             
//* BOOKED CASES BY REGISTRATION NUMBER                                         
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800CDBA,DISP=(OLD,DELETE)                                  
//         DD DSN=&&F800CDBB,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.F800.APPLN.BOOK,DISP=OLD                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* REPORT ON TIME GAP BETWEEN MARRIAGE AND DATE OF BOOKING                     
//*-----------------------------------------------------------------            
//STEP08   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//BP13F800 DD DSN=BP13.F800.APPLN.BOOK,DISP=SHR                                 
//FT18F001 DD SYSOUT=A,DEST=L43D                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S075),DISP=SHR                             
//*-----------------------------------------------------------------            
//* REPORT ON BOOKED FLAT UNDER RFS FOR NEW TOWN                                
//*-----------------------------------------------------------------            
//STEP09   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//BP13F800 DD DSN=BP13.F800.APPLN.BOOK,DISP=SHR                                 
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//FT42F001 DD DUMMY                                                             
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S076),DISP=SHR                             
/*                                                                              
//*=================================================================            
//* GET AMT-AHG NOT EMPTY                                                       
//*-----------------------------------------------------------------            
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&F800AHG,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(30,20),RLSE)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1229,3,CH,NE,C'   ')                                           
//*-----------------------------------------------------------------            
//* GET NUM-REGN NOT EMPTY                                                      
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K825.REQOCCP,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD  DSN=&&BP13F825,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(40,20),RLSE),                             
//             DCB=(RECFM=FB,LRECL=200)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,8,CH,NE,C'        ')                                          
//*-----------------------------------------------------------------            
//* GET HH SIZE/AGE/INCOME/MARIED COUPLES                                       
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=BP13C041,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800AHG,DISP=(OLD,DELETE)                                   
//BP13F825 DD DSN=&&BP13F825,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F800A DD DSN=&&F800C041,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,25),RLSE),                              
//            DCB=(LRECL=2000,RECFM=FB)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*----------------------------------------------------------------             
//STEP13   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(500,200),,,ROUND)                          
//BP13F800 DD DSN=&&F800C041,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FOUT DD DSN=BP13.FOUT.BP13S035,DISP=OLD                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S035),DISP=SHR                             
//*===============================================================              
