//BP13A281 JOB (BP13P),'BP13A281',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR PRINTING CHECKLIST OF APPOINTMENT LETTERS FOR               
//* DBSS/EC FLATS                                                               
//*********************************************************************         
//* PRINT CHECKLIST OF APPOINTMENT LETTER                                       
//* NO UPDATE OF APPOINTMENT DATE/TIME TO BP13K800 AND BP13K200                 
//*********************************************************************         
//* CHG REF  ON       BY    DESCRIPTION                                         
//* -------- -------- ----  -----------                                         
//* BP135016 14/08/13 ESA1  NEW JCL                                             
//* BP135057 10/10/13 IL5   REMOVE DELETE DEFINE STEP FOR BP13K200              
//* BP135505 21/10/14 IL5   REPLACE BP13.F200.BKAPPMT WITH                      
//*                         BP13.F200.BKAPPMT.EC                                
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=*,                                                        
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 2 - SCHEDULE BOOKING APPMT (NT)                         
//*--------------------------------------------------------------------         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&F205,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,DATACLAS=MULTIVOL,                                        
//         DCB=(RECFM=FB,LRECL=80),                                             
//        SPACE=(CYL,(5,2),RLSE)                                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'EC')                                              
//*--------------------------------------------------------------------*        
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, QUEUE-POSITION                   
//*--------------------------------------------------------------------*        
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F200.BKAPPMT.EC,                                        
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,DATACLAS=MULTIVOL,                                    
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(9,3,A,12,2,A,50,6,A,57,5,A),FORMAT=CH                          
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CANCELLATION RECORDS.                                                       
//*--------------------------------------------------------------------*        
//STEP03 EXEC    PGM=BP13C240,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                         
//             DISP=SHR                                                         
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,DELETE)                                                
//P13F200O DD  DSN=&&P13F200B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,DATACLAS=MULTIVOL,                                    
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//P13F240O DD  SYSOUT=*,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CASES WITH SHORTLIST-QTR NOT THE SAME AS BALLOT-QTR.                        
//*--------------------------------------------------------------------*        
//STEP04 EXEC    PGM=BP13C273,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                         
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,DATACLAS=MULTIVOL,                                    
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L273 DD  SYSOUT=*,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK SOC MASTER FILE FOR CASES ALREADY ACCEPTED A FLAT.                 
//*--------------------------------------------------------------------*        
//STEP05 EXEC    PGM=BP13C285,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200C,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                         
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,DATACLAS=MULTIVOL,                                    
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L285 DD  SYSOUT=*,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CASES WITH DIFFERENT ZONE/NT/FT.                                            
//*--------------------------------------------------------------------*        
//STEP06 EXEC    PGM=BP13C27A,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200D,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                         
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200E,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,DATACLAS=MULTIVOL,                                    
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L27A DD  SYSOUT=*,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//*  TO SCHEDULE BOOKING APPOINTMENT BY NT/FT/REGN-NO BASED ON THE     *        
//*  BOOKING WORK PLAN                                                 *        
//*--------------------------------------------------------------------*        
//STEP07 EXEC    PGM=BP13C24P,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200E,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                         
//             DISP=SHR                                                         
//BP13K200 DD  DSN=BP13.K200.BKAPPMT.EC,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K201 DD  DSN=BP13.K200.BKAPPMT.EC.PATH1,                                  
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K220 DD  DSN=BP13.K220.BKWKPLAN.DBS,                                      
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO                       
//*--------------------------------------------------------------------*        
//STEP08 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT.EC,                                        
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200F,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,DATACLAS=MULTIVOL,                                    
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,13,A,57,5,A),FORMAT=CH                                       
//*----------------------------------------------------------------             
//*   TO PRINT CHECK LIST OF APPOINTMENT LETTER                                 
//*----------------------------------------------------------------             
//STEP09 EXEC    PGM=BP13C246,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13F200 DD  DSN=&&P13F200F,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                         
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP.DBS,                                         
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13L246 DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP10 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
//*---------------------------------------------------------------------        
//* END BP13A281                                                                
//*---------------------------------------------------------------------        
