//BP13D303 JOB (BP13P),'BP13D303',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//*                                                                             
//*  TAKE NOTE STEP19, COND=(4,LT)                                              
//*  SENDMAIL STEPS TO BE AT THE END OF THE PROGRAM                             
//*                                                                             
//*=================================================================            
//*                  S O C A       J O B                                        
//*=================================================================            
//* CHG REF  DATE     BY   DESCRIPTION                                          
//* -------- -------- ---  -----------                                          
//* BP130488 19981120 LMS  PRINT OCS LETTERS FOR ALLOCATION                     
//* BP130857 20000515 SSS  ADD GROUPID                                          
//* BP130805 20000526 SSS  REMOVE REPORT FOR ALLOCATION                         
//* BP130883 27102000 CLT  REMOVE BP13C904 AND CALL BP13C913                    
//* BP132168 28082002 CLT  REMOVE BP13C456 UPDATING OF APPT FILE                
//* BP132309 10042003 CLT  CATER FOR BANK LOAN AGREEMENT ORDER                  
//* BP132387 18082003 SSS  DELETE BP13C315                                      
//* BP133314 18062008 LSB  BP13L311 COPIES=2                                    
//* BP134216 18042012 ZDD1 ADD BP13K022 IN BP13C053 AND BP13C054                
//* BP134779 29052013 PCL4 TO UPDATE BP13L311 INTO EMAIL/FILE                   
//*                        REPORT FORMAT                                        
//* BP135171 11022014 RJE1 TO CATER FOR DB2 UPGRADE                             
//* BP135404 12032014 ESA1 TO REMOVE BP13C331 FOR REPORT CLEAN-UP               
//* BP135398 14072014 ESA1 TO REVERT BP13C331                                   
//* BP136082 28012016 KVL1 TO CHANGE STEPS 15 AND 17 TO DB2 FORMAT              
//* BP136402 24082016 KSJ3 TO INCL NEW DATASETS TO BP13C316                     
//*                        TO INCL PGM BP13C31J AND SENDMAIL STMTS              
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : COPIES = 1               (SALES - AGM TEAM)                         
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT02 : COPIES = 1               (SALES - AGM TEAM)                         
//*-----------------------------------------------------------------            
//PRT02    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1B CP-1',END;                                    
1$DJDE$ JDE=BP13S,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1B                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT03 : COPIES = 2               (SALES - AGM TEAM)                         
//*-----------------------------------------------------------------            
//PRT03  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALAG3 CP-2',END;                                     
1$DJDE$ JDE=BP13D,COPIES=2,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG3                                    
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT04 : COPIES =1                (SALES - AGREEMENT TEAM)                   
//* -> FOR PRINTING OF LETTER IN PGM BP13C340 & BP13C341                        
//*-----------------------------------------------------------------            
//PRT04  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1C CP-1',END;                                    
1$DJDE$ JDE=13C511,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAG1C                                   
//SYSUT2   DD  SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                             
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
/*                                                                              
//*=================================================================            
//* INCLUDE ALL BANK ORIGINATION CASES                                          
//*-----------------------------------------------------------------            
//SORT01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F300.SUCCESS,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F300,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1083,1,CH,EQ,C'B')                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* AGREEMENT ORDER RAISE ON THE DAY                                            
//*-----------------------------------------------------------------            
//STEP02   EXEC  PGM=IKJEFT01,COND=(0,NE),REGION=4096K,                         
//             DYNAMNBR=20                                                      
//BP13F300 DD  DSN=&&BP13F300,DISP=(SHR,DELETE)                                 
//*BP13L311 DD  SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                      
//BP13L31A DD  SYSOUT=*                                                         
//BP13L311 DD  DSN=BP13.L311.BP13C311,DISP=SHR                                  
//*BP13L31A DD  DSN=BP13.L311.BP13C31A,DISP=SHR                                 
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13C311) PLAN(BP13PCC) -                                      
         LIB    ('BP13.BATCH.LOADCOB')                                          
     END                                                                        
/*                                                                              
//*=================================================================            
//* INCLUDE ALL NON BANK ORIGINATION CASES                                      
//*-----------------------------------------------------------------            
//SORT03   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F300.SUCCESS,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F30A,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1083,1,CH,NE,C'B')                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* AGREEMENT ORDER RAISE ON THE DAY                                            
//*-----------------------------------------------------------------            
//STEP04   EXEC  PGM=IKJEFT01,COND=(0,NE),REGION=4096K,                         
//             DYNAMNBR=20                                                      
//BP13F300 DD  DSN=&&BP13F30A,DISP=(SHR,DELETE)                                 
//*BP13L311 DD  SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                      
//BP13L311 DD  DSN=BP13.L311.BP13C31A,DISP=SHR                                  
//BP13L31A DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13C311) PLAN(BP13PCC) -                                      
         LIB    ('BP13.BATCH.LOADCOB')                                          
     END                                                                        
/*                                                                              
//*=================================================================            
//* INCLUDE SALES AGREEMENT NOT RAISED CASES                                    
//*-----------------------------------------------------------------            
//STEP05   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K300.AGRORDER,DISP=SHR                                  
//SORTOUT  DD  DSN=&&F3050,DISP=(NEW,PASS),                                     
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH,SIZE=E200000                                   
   INCLUDE COND=(679,2,CH,EQ,C'BA')                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT SALES AGREEMENT NOT RAISED WITHIN THE DAY                             
//*-----------------------------------------------------------------            
//STEP06   EXEC  PGM=BP13C316,COND=(0,NE)                                       
//BP13F300 DD  DSN=&&F3050,DISP=(OLD,DELETE)                                    
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR                                    
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                              
//SY08K010 DD  DSN=SY08.K010.USERID,DISP=SHR                                    
//SY08K011 DD  DSN=SY08.K010.USERID.PATH1,DISP=SHR                              
//BP17K000 DD  DSN=BP17.K000.SCHREF,DISP=SHR                                    
//BP17K001 DD  DSN=BP17.K000.SCHREF.PATH1,DISP=SHR                              
//P13L316A DD  DSN=BP13.MAILRPT.P13L316A,DISP=OLD                               
//P13L316B DD  DSN=BP13.MAILRPT.P13L316B,DISP=OLD                               
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*=================================================================            
//* PRINT KEY AVAILABLE CASES FOR AGREEMENT ORDER RAISED CASES                  
//*-----------------------------------------------------------------            
//STEP07   EXEC  PGM=IKJEFT01,COND=(0,NE),REGION=4096K,                         
//             DYNAMNBR=20                                                      
//BP13F300 DD  DSN=BP13.F300.SUCCESS,DISP=OLD                                   
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13L331 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13C331) PLAN(BP13PCC) -                                      
         LIB    ('BP13.BATCH.LOADCOB')                                          
     END                                                                        
/*                                                                              
//*=================================================================            
//* SORT OUT ACCEPTED CASES  IN KIVTRAN FILE                                    
//* SORT IN NEWTOWN /REQ NO SEQUENCE                                            
//*-----------------------------------------------------------------            
//STEP08   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F310.TRANS,DISP=SHR                                     
//SORTOUT  DD  DSN=&&F310ACC,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                           
//SYSIN    DD  *                                                                
      SORT FIELDS=(61,3,A,1,8,A),FORMAT=CH,SIZE=E200000                         
      INCLUDE COND=(9,2,CH,EQ,C'AI',OR,                                         
                    9,2,CH,EQ,C'AS',OR,                                         
                    9,2,CH,EQ,C'AW',OR,                                         
                    9,2,CH,EQ,C'AA')                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT KEY AVAILABLE CASES (AFTER ACCEPTANCE) IE BOOKING                     
//*-----------------------------------------------------------------            
//STEP09   EXEC  PGM=BP13C332,COND=(0,NE)                                       
//BP13F310 DD  DSN=&&F310ACC,DISP=(OLD,PASS)                                    
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13L332 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//BP13L333 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* LETTER TO PROJECT MGR TO INFORM THEM TO REISTATE THE OPTIONS                
//*-----------------------------------------------------------------            
//STEP10   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F310.TRANS,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13F310,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(2,2,),RLSE),                                         
//             DCB=(LRECL=150,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(9,2,CH,EQ,C'RY')                                                
  OPTION DYNALLOC=(SYSDA,4)                                                     
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT LIST OF REJECTED CASES AFTER SIGNING SALES AGR                        
//*-----------------------------------------------------------------            
//STEP11   EXEC  PGM=BP13C340,COND=(0,NE)                                       
//BP13F310 DD  DSN=&&BP13F310,DISP=(OLD,PASS)                                   
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13L340 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13P340 DD  SYSOUT=W,OUTPUT=(*.PRT04.FORMID),DEST=IOMW                       
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT RZ CASES                                                               
//*-----------------------------------------------------------------            
//STEP12   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F310.TRANS,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13F31A,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(2,2,),RLSE),                                         
//             DCB=(LRECL=150,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(9,2,CH,EQ,C'RZ')                                                
  OPTION DYNALLOC=(SYSDA,4)                                                     
/*                                                                              
//*-----------------------------------------------------------------            
//* LIST OF SOCA CASES OPTED NOT TO HAVE DOORS INSTALLED                        
//*-----------------------------------------------------------------            
//STEP13   EXEC  PGM=BP13C341,COND=(0,NE)                                       
//BP13F310 DD  DSN=&&BP13F31A,DISP=(OLD,PASS)                                   
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13L341 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13P341 DD  SYSOUT=W,OUTPUT=(*.PRT04.FORMID),DEST=IOMW                       
//SYSOUT   DD  SYSOUT=*                                                         
//*=================================================================            
//* SORT BY BO WHERE CDE-TRANS = 'R4'                                           
//*-----------------------------------------------------------------            
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&F310R5,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(42,2,A),FORMAT=CH                                               
   INCLUDE COND=(9,2,CH,EQ,C'R4')                                               
//*----------------------------------------------------------------             
//* PRODUCE EMAIL ON INSTALLATION OF INTERNAL TIME DOOR TO SLM2                 
//*----------------------------------------------------------------             
//STEP15   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BP13F310 DD DSN=&&F310R5,DISP=(OLD,DELETE)                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13MAIL DD DSN=BP13.MAILOUT.C053,DISP=OLD                                    
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C053) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* SORT BY BO WHERE CDE-TRANS = 'R5'                                           
//*-----------------------------------------------------------------            
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&F310R5,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(42,2,A),FORMAT=CH                                               
   INCLUDE COND=(9,2,CH,EQ,C'R5')                                               
//*----------------------------------------------------------------             
//* PRODUCE EMAIL ON INSTALLATION OF INTERNAL TIME DOOR TO BO                   
//*----------------------------------------------------------------             
//STEP17   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BP13F310 DD DSN=&&F310R5,DISP=(OLD,DELETE)                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13MAIL DD DSN=BP13.MAILOUT.C054,DISP=OLD                                    
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C054) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* INCLUDE SALES AGREEMENT RAISED CASES                                        
//*-----------------------------------------------------------------            
//STEP18   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K300.AGRORDER,DISP=SHR                                  
//SORTOUT  DD  DSN=&&F300SA,DISP=(NEW,PASS),                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH,SIZE=E200000                                   
   INCLUDE COND=(679,2,CH,EQ,C'SA')                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* CHECK VALUE CONSISTENCY ON SA AISED WITHIN THE DAY                          
//*-----------------------------------------------------------------            
//STEP19   EXEC  PGM=BP13C31J,COND=(0,NE)                                       
//BP13F300 DD  DSN=&&F300SA,DISP=(OLD,DELETE)                                   
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                                     
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR                                    
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                              
//SY08K010 DD  DSN=SY08.K010.USERID,DISP=SHR                                    
//SY08K011 DD  DSN=SY08.K010.USERID.PATH1,DISP=SHR                              
//BP13L31J DD  DSN=BP13.MAILRPT.BP13L31J,DISP=OLD                               
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*=================================================================            
//*  SEND MAINFRAME EMAIL TO BO                                                 
//*-----------------------------------------------------------------            
//STEP20   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.C053,DISP=SHR                                    
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO BO                                                 
//*-----------------------------------------------------------------            
//STEP21   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILOUT.C054,DISP=SHR                                    
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L311)                                            
//*-----------------------------------------------------------------            
//STEP22   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L311.BP13C311,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L311)                                            
//*-----------------------------------------------------------------            
//STEP23   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L311.BP13C31A,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (P13L316A)                                            
//*-----------------------------------------------------------------            
//STEP24   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.P13L316A,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (P13L316B)                                            
//*-----------------------------------------------------------------            
//STEP25   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.P13L316B,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L31J)                                            
//*-----------------------------------------------------------------            
//STEP26   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L31J,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*=================================================================            
//*  END OF JOB                                                                 
//*=================================================================            
