//BP13AMP4 JOB (BP13P),'BP13AMP4',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*    3RD ROUND PIGEONHOLING OF MATUTE NEW TOWN               *                
//*                                       UNSUCC MTF/SFF/REN/RH*                
//*                                       AND PUBLIC SCHEME    *                
//*                                                            *                
//*    NOT THE DIFFERENCE                                      *                
//*    - TENDER PROGRAM ONLY HAVE NEW + BALANCE FLATS          *                
//*    - INCLUDE  ONLY MATURE NT CASES WHICH ARE UNSUCC        *                
//*    - NO HHTY AND NO RESIDENT CHECK                         *                
//**************************************************************                
//* STEP 00 - 01 = LASER PRINTER JCL                           *                
//* STEP 02 - 03 = BACKUP TENDER AND BALLOT FILE               *                
//* STEP 04 - 05 = PRINT FLAT SYPPLY REPORT BF PIGEONHOLING    *                
//* STEP 06 - 08 = PROCESS PIGEONHOLING(BP13U531 PRIORITY ONLY)*                
//* STEP 09      = MATCH RELEVANT REQUEST TO GET SUCC & UNSUCC *                
//*                BALLOT RESULT FOR PRINT REPORT              *                
//* STEP 10 - 11 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING    *                
//* STEP 12      = PRINT SUCC/UNSUCC REPORT BP13L522           *                
//* STEP 13      = BACKUP TENDER FILE                          *                
//*                                                            *                
//**************************************************************                
//* CHG REF   BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP131064 CKK  20011220 NEW JCL FOR BE'02. 3RD ROUND PA                      
//* BP132171 ED   120702 - INCLUDE STEPS FOR GROPA CASES.                       
//*                        (STEP15-16)                                          
//* BP132360 CKK  170703 - MOVE STEP15-16 TO BP13AMP5.                          
//* BP132555 CKK  170704 - REMOVE BP13K760 FROM PRGM BP13U532                   
//* BP132596 PGS1 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E           
//* BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                               
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//**************************************************************                
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//**************************************************************                
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, WITH DUPLICATE COPIES                                             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.PA3,DISP=OLD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.PA3,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT OUT 4,5,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP3A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F012,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=23200)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* MERGE THE TOTAL MCPS AND NON-MCPS FLAT SUPPLY BACK TO K010                  
//*-----------------------------------------------------------------            
//STEP3B   EXEC PGM=BP13C782,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F012 DD DSN=&&P13F012,DISP=(OLD,DELETE)                                   
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010A,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP05    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010A,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING             
//*-----------------------------------------------------------------            
//STEP5A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010B,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP5B    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010B,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT UNSUCC REQUEST CASES                                               
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   INCLUDE COND=(226,3,CH,EQ,C'   ')                                            
//*-----------------------------------------------------------------            
//* SORT OUT THE MATURE PA REQUEST BY                                           
//* HHTY, FOLLOWED BY RANDOM NUMBER.                                            
//*-----------------------------------------------------------------            
//STEP6A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520NHT,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(116,1,D,1,28,A),FORMAT=CH                                      
    OUTREC FIELDS=(1,115,C'H',117,384)                                          
    INCLUDE COND=(116,1,CH,EQ,C'T')                                             
//*-----------------------------------------------------------------            
//STEP6B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520NHH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(116,1,D,1,28,A),FORMAT=CH                                      
    INCLUDE COND=(116,1,CH,EQ,C'H')                                             
//*-----------------------------------------------------------------            
//STEP6B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520NHT,DISP=(OLD,PASS)                                     
//         DD DSN=&&F520NHH,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F520HTH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* SORT OUT THE MATURE PA REQUEST BY                                           
//* HHTY, FOLLOWED BY RANDOM NUMBER.                                            
//*-----------------------------------------------------------------            
//STEP6C   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520HTH,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
    INCLUDE COND=(116,1,CH,EQ,C'G')                                             
//*-----------------------------------------------------------------            
//* SORT UNSUCC CASES ACCORDING TO RESIDENT/HHTY                                
//*-----------------------------------------------------------------            
//STEP6A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520HTH,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F520PA,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(116,1,D,1,28,A),FORMAT=CH                                      
    INCLUDE COND=(121,1,CH,NE,C' ',OR,                                          
                   122,1,CH,NE,C' ',OR,                                         
                   253,1,CH,NE,C' ',OR,                                         
                   254,1,CH,NE,C' ')                                            
//*-----------------------------------------------------------------            
//* SORT UNSUCC CASES ACCORDING TO NON-RESIDENT/HHTY                            
//*-----------------------------------------------------------------            
//STEP6B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520HTH,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F520PA,DISP=(MOD,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(116,1,D,1,28,A),FORMAT=CH                                      
    INCLUDE COND=(121,1,CH,EQ,C' ',AND,                                         
                   122,1,CH,EQ,C' ',AND,                                        
                   253,1,CH,EQ,C' ',AND,                                        
                   254,1,CH,EQ,C' ')                                            
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR MATURE PA CASES, THE PROGRAM WI           
//* ONLY ALLOCATE THE PRIORITY SUPPLY QUOTA FOR ALL SCHEME                      
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13U532,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F740 DD DSN=&&F520PA,DISP=(OLD,PASS)                                      
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L532 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L532A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------              
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------              
//STEP09   EXEC  PGM=BP13C713,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//   AMP=('BUFND=23')                                                           
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(32,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(32,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* PRINT SUMMARY BALLOT RESULT BY NT/FT/CAT                                    
//*---------------------------------------------------------------------        
//STEP10   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//P13FSUCC DD  DSN=&&P13SUCC,DISP=(OLD,PASS)                                    
//P13FUNSC DD  DSN=&&P13UNSUC,DISP=(OLD,PASS)                                   
//PRIOFMT  DD  DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT42F001 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                            
//*-----------------------------------------------------------------            
//* PRINT REPORTS ON RESIDENT/NON-RESIDENT REGISTERED COUNT                     
//*-----------------------------------------------------------------            
//*STEP10A  EXEC PGM=BP13C733,COND=(0,NE)                                       
//*BP13K760 DD DSN=BP13.K760.RESHHTY,DISP=SHR                                   
//*BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//*BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//*BP13L733 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=N                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010C,DISP=(,PASS),                                         
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP12    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010C,DISP=(OLD,DELETE)                                    
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING              
//*---------------------------------------------------------------------        
//STEP12A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010D,DISP=(,PASS),                                         
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP12B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010D,DISP=(OLD,DELETE)                                    
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER(+1),DISP=(NEW,CATLG),                        
//            SPACE=(TRK,(5,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*--------------------------------------------------------------------         
//STEP14  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F525.APPL,DISP=SHR                                      
//OUTPUT1   DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//******************************************************************            
//* REPORT ON DEMAND BY FIRST TIMER AND SECOND TIMER UNDER BE                   
//******************************************************************            
//STEP15   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//BP13K010  DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//BP13K012  DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                  
//BP13L017  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S017),DISP=SHR                            
//SYSOUT    DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//*                                                                             
//******************************************************************            
//* REPORT ON BE - ALLOCATION OF FLATS BETWEEN MCPS AND NON MCPS.               
//******************************************************************            
//STEP16   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//BP13K010  DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//BP13K012  DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                  
//BP13L016  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S016),DISP=SHR                            
//SYSOUT    DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//*                                                                             
//****************************************************************              
//*            END OF BP13AMP4                                                  
//****************************************************************              
