//BP13M010 JOB (BP13P),'BP13M010',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* JOB TO AUTO DELETE 2ND LEVEL USERID                                         
//*-----------------------------------------------------------------            
//* BP130777 19991227 SSS - NEW JOB                                             
//* BP136030 20160223 LSB - REPORT TO ACCESS SOC ENQ 01                         
//* BP136413 20161103 RJB - REMOVE BP13C000 (TRANSFERRED TO D524)               
//* BP138335 20200817 AM2 - HARDCOPY REPORTS CONVERSION                         
//*=================================================================            
//*-----------------------------------------------------------------            
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                                   
//*-----------------------------------------------------------------            
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K860.USER,DISP=OLD                                       
//INPUT2   DD DSN=BP13.K870.PANEL,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*-----------------------------------------------------------------            
//*  TO OMIT OVERTIME STAFF RECORDS FROM BP13K868                               
//*-----------------------------------------------------------------            
//STEP04   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.F868.USER.LOG.MONTH(0),                                  
//            DISP=SHR                                                          
//SORTOUT  DD DSN=&&BP13F868,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=3380,                                                        
//            SPACE=(TRK,(50,25),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,26,A),FORMAT=CH                                              
    OMIT COND=(1,26,CH,EQ,C'                          ',OR,                     
               161,1,CH,EQ,C'Y')                                                
//*-----------------------------------------------------------------            
//*  TO PRINT REPORT ON USER LOG                                                
//*-----------------------------------------------------------------            
//STEP05   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO,DQUOTE'                         
//WORK     DD UNIT=SYSDA,                                                       
//            SPACE=(TRK,(500,100))                                             
//SY02F001 DD DSN=SY02.F001.DATE,                                               
//            DISP=SHR                                                          
//BP13F868 DD DSN=&&BP13F868,                                                   
//            DISP=(SHR,PASS)                                                   
//SY08K010 DD DSN=SY08.K010.USERID,                                             
//            DISP=SHR                                                          
//BP13L003 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S003),                                     
//            DISP=SHR                                                          
//*-----------------------------------------------------------------            
//*  TO OMIT OVERTIME STAFF RECORDS FROM BP13K878                               
//*-----------------------------------------------------------------            
//STEP06   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.F878.PANEL.LOG.MONTH(0),                                 
//            DISP=SHR                                                          
//SORTOUT  DD DSN=&&BP13F878,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=3380,                                                        
//            SPACE=(TRK,(50,25),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,26,A),FORMAT=CH                                              
    OMIT COND=(1,26,CH,EQ,C'                          ',OR,                     
               85,1,CH,EQ,C'Y')                                                 
//*-----------------------------------------------------------------            
//*  TO PRINT REPORT ON ACCESS LOG                                              
//*-----------------------------------------------------------------            
//STEP07   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO,DQUOTE'                         
//WORK     DD UNIT=SYSDA,                                                       
//            SPACE=(TRK,(500,100))                                             
//SY02F001 DD DSN=SY02.F001.DATE,                                               
//            DISP=SHR                                                          
//BP13F878 DD DSN=&&BP13F878,                                                   
//            DISP=(SHR,PASS)                                                   
//SY08K010 DD DSN=SY08.K010.USERID,                                             
//            DISP=SHR                                                          
//BP13L004 DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S004),                                     
//            DISP=SHR                                                          
//*-----------------------------------------------------------------            
//* SORT BYH USERID/DATE, ACCESS KEY                                            
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(0),DISP=SHR                   
//SORTOUT  DD  DSN=&&BP13F879,DISP=(,PASS),                                     
//             SPACE=(CYL,(80,30),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=100)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(01,27,A,28,20,A),FORMAT=CH                                       
//*-------------------------------------------------------------------*         
//* ACCESS TO SOC MASTER > 20 TIMES WITHIN A MONTH FOR SALES STAFF              
//* OTHER STAFFS  > 10 TIMES WITHIN A MONTH                                     
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=BP13C879,COND=(0,NE)                                        
//BP13F879 DD DSN=&&BP13F879,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K860 DD DSN=BP13.K860.USER,DISP=SHR,                                      
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13L879 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* TO INCLUDE ONLY WITH ALPHABETIC IN THE FIRST 2 CHARACTERS                   
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=&&BP13F879,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&P13F879A,DISP=(,PASS),                                     
//             SPACE=(CYL,(80,30),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=100)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(01,02,CH,LT,C'1')                                               
  OUTREC FIELDS=(1:1,95,96:3,5)                                                 
//*-----------------------------------------------------------------            
//* TO INCLUDE ONLY WITH NUMERIC IN THE FIRST 2 CHARACTERS                      
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=&&BP13F879,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&P13F879B,DISP=(,PASS),                                     
//             SPACE=(CYL,(80,30),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=100)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(01,02,CH,GT,C'0')                                               
  OUTREC FIELDS=(1:1,95,96:1,5)                                                 
//*-----------------------------------------------------------------            
//* TO COMBINE THE 2 PREVIOUSLY SORTED FILES                                    
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=&&P13F879A,DISP=(OLD,PASS)                                   
//         DD  DSN=&&P13F879B,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&P13F879O,DISP=(,PASS),                                     
//             SPACE=(CYL,(80,30),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=100)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(96,5,A,28,20,A),FORMAT=CH                                        
//*-----------------------------------------------------------------            
//* TO OUTREC FIELDS FROM BP13K860                                              
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.F860.USER.OT.MONTH(0),DISP=SHR                          
//SORTOUT  DD  DSN=&&F860C87A,DISP=(,PASS),                                     
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(80,30),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=80)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(13,07,A),FORMAT=CH                                               
  OUTREC FIELDS=(1:1,12,13:3,5,19:9,1)                                          
//*-----------------------------------------------------------------            
//*-------------------------------------------------------------------*         
//* REPORT ON ENQUIRY OF SOC MASTER BY USERS FROM OTHER DEPARTMENTS WHO         
//* ARE DOING OVERTIME (OT) WORK AT SALES DEPARTMENTS                           
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=BP13C87A,COND=(0,NE)                                        
//BP13F860 DD DSN=&&F860C87A,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F879 DD DSN=&&P13F879O,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13L87A DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
