//BP13A59N JOB (BP13P),'BP13A59N',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB00874
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//*                                                                             
//*  THIS JOB IS USE TO UPDATE BP13K800 - NUM-STATUS TO 'C'                     
//*                                       CANCEL-REASON = 22                    
//*                                       ALO-CAT = RQ                          
//* TO ALL ROF SMS RESPONSE = 'N'                                               
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---  -------- -----------                                          
//* BP136912 ZDD1 170817   NEW JCL                                              
//*=================================================================            
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN                                            
//*-----------------------------------------------------------------            
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*--------------------------------------------------------------------         
//* SORT ALL ROF RECORD                                                 00000040
//*-------------------------------------------------------------------- 00000050
//STEP01  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BC03.K853.UNSUB.MOBILE,DISP=SHR,                               
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT DD DSN=&&BP13F853,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(9,4,CH,EQ,C'ROFN')                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* UPDATE BP13K800 -STAT/TATUS AND CODE                                00000040
//*-------------------------------------------------------------------- 00000050
//STEP02  EXEC PGM=BP13CFB1,COND=(0,NE)                                 00002680
//BC03F853 DD  DSN=&&BP13F853,DISP=(OLD,DELETE)                         00002710
//BP13K213 DD  DSN=BP13.K213.SMS.ROF,DISP=SHR                           00002710
//BP13K211 DD  DSN=BP13.K213.SMS.ROF.PATH1,DISP=SHR                     00002710
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                             00002710
//BC3F853A DD  DSN=BP13.BC03.F853.HP.NTFND,DISP=SHR                     00002710
//BP13F213 DD  DUMMY                                                    00002710
//BP13RPT1 DD  DSN=BP13.REPORT.RESPN.CFB1,DISP=SHR                      00002710
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
