//BP13W470  JOB (BP13P),'BP13W470',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//* ============================================================== *            
//*                                                                *            
//*     T A K E     P O S S E S S I O N     J O B                  *            
//*     PRINT REPORT TO REFLECT QUANTUM LVY AND RESALE LEVY        *            
//*                                                                *            
//* ============================================================== *            
//* CHGE REQ  DATE        BY   DESCRIPTION                                      
//* --------  ----        ---  -----------                                      
//* BP133527  13/05/2009  YCH2 PRINT LN OR LNS REPORT                           
//* BP133817  03/06/2010  DW5  ADD HOUSEKEEPING OF BP13KQ10                     
//* BP134054  08/11/2010  DW5  ADD CHECKING OF SC/SPR PREMIUM REPORT            
//* BP134043  03/12/2010  DW5  UPDATE SORTING FOR SC/SPR REPORT                 
//* BP134135  10/08/2011  DW5  REMOVE HOUSEKEEP OF PENDING DOC                  
//* BP135488  10/09/2014  NST1 EXCLUDE FTS CASES IN SC/SPR PREM REPORT          
//*-------------------------------------------------------------------*         
//* SORT THE DAILY SO FILE IN REGN-NO ORDER                           *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F410.DAILSO.WKBKUP,DISP=SHR                              
//SORTOUT  DD DSN=&&P13LNS,DISP=(NEW,PASS),                                     
//         SPACE=(TRK,(10,5),RLSE),UNIT=SYSDA,                                  
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                  
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(1,3,CH,NE,C'   ')                                            
//*-------------------------------------------------------------------*         
//* TO PRINT LN/LNS CASES IN THE DAILY SO FILE BY REGNO               *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=BP13C44A,COND=(0,NE)                                        
//BP13F410 DD DSN=&&P13LNS,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K162 DD DSN=BP13.K162.LVYTAG,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L44A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* EMPTY ACCUMULATED SO TRANS FILE                                             
//*--------------------------------------------------------------------         
//STEP99   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F410.DAILSO.WKBKUP,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-----------------------------------------------------------------            
//* TO PRINT REPORT CHECKING ON SC/SPR PREMIUM                                  
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,30),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(155,11,CH,NE,C'           ',AND,                               
                 785,6,CH,GE,C'201003',AND,                                     
                 30,2,CH,NE,C'1A',AND,                                          
                 30,2,CH,NE,C'2A',AND,                                          
                 57,3,CH,NE,C'FTS')                                             
//*--------------------------------------------------------------------         
//* TO PRINT REPORT CHECKING ON SC/SPR PREMIUM                                  
//*--------------------------------------------------------------------         
//STEP04   EXEC  PGM=BP13C06A,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&BP13F800,DISP=(OLD,DELETE)                                 
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//P13L06AA DD  SYSOUT=8,DEST=IOM8                                               
//P13L06AB DD  SYSOUT=8,DEST=IOM8                                               
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-------------------------------------------------------------------*         
//*                       END OF JOB                                  *         
//*-------------------------------------------------------------------*         
