//BP13REVA  JOB (BP13P),'BP13MBK3',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//*--------------------------------------------------------------------         
//* BP130487 SSS 980507 - CHG UNIT=3480 TO UNIT=CART                            
//* BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//* BP132627 LSB 190405 - ADD PRI SPACE TO 150 CYLS                             
//* BP138647 LSB 210401 - EXPAND TEMP SPACE                                     
//*--------------------------------------------------------------------         
//******************************************************************            
//* SORT IN BP13K130 KEY-FLD                                                    
//******************************************************************            
//STEP3    EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F130.SOCHIST.MONTH(0),DISP=SHR                           
//SORTOUT  DD DSN=&&BP13F130,DISP=(NEW,PASS),                                   
//          UNIT=(SYSDA,3),                                                     
//          DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400),                             
//          SPACE=(CYL,(200,30),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN     DD  *                                                               
   SORT FIELDS=(5,19,A),FORMAT=CH                                               
/*                                                                              
//******************************************************************            
//* DELETE & DEFINE BP13K130                                                    
//******************************************************************            
//STEP4     EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&BP13F130,DISP=(OLD,PASS)                                   
//SYSIN     DD  *                                                               
          DEL (BP13.K130.SOCHIST) CL PURGE                                      
          DEF CLUSTER                                -                          
              (NAME(BP13.K130.SOCHIST)          -                               
              CYL(190 30)                              -                        
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K130.SOCHIST.DATA)     -                               
              KEYS(19 4)                             -                          
              RECSZ(150 150)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K130.SOCHIST.INDEX)    -                               
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K130.SOCHIST)                                              
