//BP13DP11 JOB (BP13P),'EXCEPTION',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),           
//        NOTIFY=CSD0071,SCHENV=PKZIP                                           
//JOBLIB DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                     
//*===================================================================          
//* PREPARE AND SEND EMAIL OF EXCEPTION REPORTS AND INCLUSION REPORT            
//* NOTES: THIS IS ONLY APPLICABLE FOR BTO/SBF EXERCISE                         
//*===================================================================          
//* CHG REF   BY   DATE    DESCRIPTION                                          
//* -------- ---- -------- ----------                                           
//* BP133625 YCH2 25052012 NEW JOB TO CHECK ON BTO/SBF EXERCISE                 
//*=====================================================================        
//*===========  ((( PRINT EXCEPTION REPORT  )))  ===========                    
//*=====================================================================        
//*****************************************************************             
//* STEP00: AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*****************************************************************             
//STEP00   EXEC PGM=IRXJCL,PARM='SMTPHDR',COND=(0,NE)                           
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD  DSN=&&TEMP1,DISP=(NEW,PASS),                                     
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=259,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*=================================================================            
//*   DELETE ZIP FILE BEFORE PROCESSING                                         
//*=====================================================================        
//STEP0A    EXEC  PGM=IDCAMS,COND=(0,NE)                                        
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD *                                                                
     DEL (BP13.MFMAIL.EXCRPT.ZIP)                                               
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*--------------------------------------------------------------------*        
//*                 *  ZIP THE REPORT FILE    *                                 
//*--------------------------------------------------------------------*        
//STEP01    EXEC PKZIP,COND=(0,NE)                                              
-ARCHIVE(BP13.MFMAIL.EXCRPT.ZIP)                                                
-ARCHVOL(DUMMY)                                                                 
-METHOD(FAST)                                                                   
-ZIPPED_DSN(BP13.BP13FBTO.NOF757,NOF757.TXT)                                    
-ZIPPED_DSN(BP13.BP13FBTO.NOCOUP,NO_COUPON.TXT)                                 
-ZIPPED_DSN(BP13.BP13FBTO.NOF757B,OIC_TO_CHK_NOF757.TXT)                        
-ZIPPED_DSN(BP13.BTOSBF.CRCC.NOAC28,CRCC_NOAC28.TXT)                            
-ZIPPED_DSN(BP13.BTOSBF.AC28.NOCRCC,AC28_NOCRCC.TXT)                            
-ZIPPED_DSN(BP13.BTOSBF.EXCRPT.MGPS,MGPS.TXT)                                   
-ZIPPED_DSN(BP13.BTOSBF.EXCRPT.MULTIPLE,MULTIPLE.TXT)                           
-ZIPPED_DSN(BP13.BP13FBTO.DUPPAY,AC28DUP.TXT)                                   
-FILE_TERMINATOR()                                                              
 BP13.BP13FBTO.NOF757                                                           
 BP13.BP13FBTO.NOCOUP                                                           
 BP13.BP13FBTO.NOF757B                                                          
 BP13.BTOSBF.CRCC.NOAC28                                                        
 BP13.BTOSBF.AC28.NOCRCC                                                        
 BP13.BTOSBF.EXCRPT.MGPS                                                        
 BP13.BTOSBF.EXCRPT.MULTIPLE                                                    
 BP13.BP13FBTO.DUPPAY                                                           
//*------------------------------------------------------------------*          
//*               CREATE EMAIL RECIPIENT AND SUBJECT                            
//*------------------------------------------------------------------*          
//STEP02    EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                
//SYSOUT   DD SYSOUT=*                                                          
//BP13RCPT DD DSN=&&BP13RCPT,DISP=(NEW,PASS),                                   
//         LRECL=259,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//         DD DSN=BP13.MFMAIL.RCPTSST,DISP=SHR                                  
//         DD *                                                                 
     PUT @01 'SUBJECT:BTO/SBF EXERCISE - EXCEPTION REPORTS';                    
//*------------------------------------------------------------------*          
//* STEP11:-      CREATE ZIP HEADER FORMAT                                      
//*------------------------------------------------------------------*          
//STEP03    EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                
//WORK     DD UNIT=SYSDA,SPACE=(1,(50,50)),AVGREC=M                             
//SYSOUT   DD SYSOUT=*                                                          
//BP13ZIPH DD DSN=&&BP13ZIPH,DISP=(NEW,PASS),                                   
//         LRECL=259,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
      FILE BP13ZIPH;                                                            
      PUT @01 '               NAME="BP13.MFMAIL.EXCRPT.ZIP"';                   
      PUT @01 '                                   ';                            
/*                                                                              
//*****************************************************************             
//*         ENCODE A ZIP DATASET INTO BASE64 FORMAT                             
//*****************************************************************             
//STEP04   EXEC ENCODE,COND=(0,NE)                                              
//ENCODOUT DD DSN=&&BASE64,DISP=(,PASS),                                        
//            SPACE=(5,(10,10),RLSE),AVGREC=M                                   
//ENCODIN  DD DSN=BP13.MFMAIL.EXCRPT.ZIP,DISP=SHR                               
/*                                                                              
//*****************************************************************             
//*         CONVERT OUTPUT TO VARIABLE-BLOCKED (VB)                             
//*****************************************************************             
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BASE64,DISP=(SHR,DELETE)                                    
//FBVB     DD DSN=&&VB64,DISP=(,PASS),                                          
//           SPACE=(TRK,(10,5),RLSE),                                           
//           DCB=(DSORG=PS,LRECL=259,RECFM=VB)                                  
//SYSIN    DD *                                                                 
 MERGE FIELDS=COPY                                                              
 OUTFIL FNAMES=FBVB,FTOV,VLTRIM=X'40'                                           
/*                                                                              
//*****************************************************************             
//*  OUTPUT SMTP MAIL WITH CONTENT & ATTACHMENT TO A DATASET                    
//*****************************************************************             
//STEP06   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=*.STEP00.SMTPHDR,DISP=(SHR,PASS)                              
//         DD DSN=&&BP13RCPT,DISP=(SHR,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(APPLHDR),DISP=SHR                        
//         DD DSN=&&BP13ZIPH,DISP=(SHR,DELETE)                                  
//         DD DSN=&&VB64,DISP=(SHR,DELETE)                                      
//SYSUT2   DD DSN=&&MAILEXCP,DISP=(,PASS),SPACE=(TRK,(50,5)),                   
//            UNIT=SYSDA                                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//****************************************************************              
//*  SEND THE SMTP MAIL FOR EXCEPTION REPORTS                                   
//*****************************************************************             
//STEP99A  EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=&&MAILEXCP,DISP=(OLD,DELETE)                                  
