//BP13D501 JOB (BP13P),'BP13D501',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//* CHG-NO   BY   ON    - DESCRIPTION                                 *         
//* ---------------------------------                                 *         
//* BP130230 LSB 970116 - BP13F723 TO BYPASS RESALE CASES WITH REF='*'*         
//* BP130652 SRA 991016 - EXPAND F500, F730 RECL FROM 300 TO 500      *         
//* BP130718 CLT 011099 - E-FAST INPLMENTATION                        *         
//* BP130788 LSB 150200 - MOVE BP13C799 TO BP13D513, C506 OUTPUT F500 *         
//* BP130871 SSS 090600 - LISTING FOR EAALSS                          *         
//* BP130979 LSB 080201 - ADD ALT-KET BP13K830 IN BP13C506            *         
//* BP132313 CKK 080703 - READ CDB NATIONALITY TABLE FOR BP13C506     *         
//* BP132376 LSB 100703 - INTERFCE WITH CDB FILE FROM MHA             *         
//* BP132583 CKK 070904 - NEW REPORT FOR NATIONALITY NOT = SG         *         
//* BP132663 CKK 090305 - EXCLUDE CASES NOT FOUND IN MHA FOR BP13C506 *         
//* BP133026 LSB 300307 - ADD BP13K820 TO BP13C506                    *         
//* BP132887 LSB 060707 - CHG LREC BE01F515 FROM 560 TO 580           *         
//* BP132887 IL5 270807 - CHG INPUT FILE FROM CDB *                             
//* BP134229 IL5 230511 - GENERATE BP13.F730.MATURERQ.DAILY *                   
//*                     - BKUP BE01F515 FILE                          *         
//* BP134922 SMR 280613 - ADD CF87/CF91/CF93/CF95 (ALL NRIC RECORDS   *         
//*                       SHOULD HAVE MATCHING RECORD FROM BE01F500)  *         
//* BP134996 SMR 310713 - PROCESS ALL BE01F515 RECORDS                *         
//*                       ADD BP13S571 (RECORDS NOT FOUND IN MHA)     *         
//* BP135148 IL5 051213 - ADD SUMFIELDS=NONE TO STEP1B TO GET RID     *         
//*                       OF DUPLICATES                               *         
//* BP135171 RJE 110214 - TO CATER FOR DB2 UPGRADE                              
//* BP135279 SMR 250314 - BACKUP BP13.F500.SEQUENCE.DAILY             *         
//*                       BACKUP BP13.F730.MATURERQ.DAILY             *         
//* BP136505 SMR 151116 - NEW OUTPUT FILE FOR BP13C506                *         
//* BP137016 SMR 261017 - NEW OUTPUT FILES P13L506D/P13L506E/P13L506F *         
//* BP137048 SMR 091117 - TRANSFER BP13CB15 FROM BP13D50B/BP13D50D    *         
//* BP137048 SMR 171117 - USE DAILY FILE AS INPUT FOR BP13C02R        *         
//* BP137783 AM2 090519 - NEW OUTPUT REPORT FOR BP13CB15              *         
//* BP137924 IL5 120719 - ADD OBF CASES TO BP13.F500.SEQUENCE DAILY   *         
//*                     - GENERATED AFTER MHA UPDATE                  *         
//*          IL5 010819 - UNDO EARLIER CHANGES FOR OBF PROCESSING     *         
//* BP138285 AM2 240420 - HARDCOPY REPORTS CONVERSION                 *         
//*              050620 - REMOVE DJDE STEPS                           *         
//* BP139673 AM2 150923 - CATER FOR HFE SUBMISSION DATE               *         
//* FB202302703  290923 - RESOLVE SYNTAX ERROR IN STEP19B             *         
//* BP139682 AM2 121223 - ADD NEW OUTPUT FILE IN BP13C506 - P13L506A  *         
//*-------------------------------------------------------------------*         
//*--------------------------------------------------------------------         
//* DELETE SEQUENTIAL FILE                                                      
//*--------------------------------------------------------------------         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL (BP13.CLOUD.BP13D501.L506G)                                            
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*--------------------------------------------------------------------         
//* SORT MHA DATA FROM BE01 BY REF (CASE NO), UIN                               
//*--------------------------------------------------------------------         
//STEP01A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BE01.F515.INT.OBTPRT.BP13,DISP=SHR                            
//         DD DSN=BP13.BE01.F515.MHA.INCMPLTE,DISP=SHR                          
//SORTOUT  DD DSN=&&BE01F515,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=580,BLKSIZE=0),                               
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(24,8,A,11,9,A),FORMAT=CH                                       
    INCLUDE COND=(20,4,CH,EQ,C'BP13')                                           
//*-------------------------------------------------------------------*         
//* SORT BY REGN, NRIC                                                *         
//*-------------------------------------------------------------------*         
//STEP01B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.BE01.F500.DAILY,DISP=SHR                                 
//         DD DSN=BP13.BE01.F500.SENDID.MATCH,DISP=SHR                          
//         DD DSN=BP13.BE01.F500.SENDID.NOTMATCH,DISP=SHR                       
//SORTOUT  DD DSN=&&BE01F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=0),                                
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(14,8,A,1,9,A),FORMAT=CH                                        
    INCLUDE COND=(14,8,CH,GT,C'        ')                                       
    SUM FIELDS=NONE                                                             
//*-------------------------------------------------------------------*         
//* SEPARATE COMPLETE AND INCOMPLETE CASES                            *         
//*-------------------------------------------------------------------*         
//STEP01C  EXEC PGM=BP13CF87,COND=(0,NE)                                        
//BE01F500 DD DSN=&&BE01F500,DISP=(OLD,PASS)                                    
//BE01F515 DD DSN=&&BE01F515,DISP=(OLD,PASS)                                    
//P13LF87C DD DSN=&&P13LF87C,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=20,RECFM=FB),                                          
//            SPACE=(CYL,(5,2),RLSE)                                            
//P13LF87I DD DSN=&&P13LF87I,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=20,RECFM=FB),                                          
//            SPACE=(CYL,(5,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* GENERATE FILES WITH COMPLETE & INCOMPLETE APPLT/OCCUP PER REGN    *         
//*-------------------------------------------------------------------*         
//STEP01D  EXEC PGM=BP13CF91,COND=(0,NE)                                        
//P13LF87C DD DSN=&&P13LF87C,DISP=(OLD,DELETE)                                  
//BE01F515 DD DSN=&&BE01F515,DISP=(OLD,DELETE)                                  
//F515COMP DD DSN=BP13.BE01.F515.MHA,DISP=OLD                                   
//F515INCO DD DSN=BP13.BE01.F515.MHA.INCMPLTE,DISP=OLD                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* GENERATE FILE WITH INCOMPLETE APPLT/OCCUP PER REGN (BE01F500)     *         
//*-------------------------------------------------------------------*         
//STEP01E  EXEC PGM=BP13CF93,COND=(0,NE)                                        
//P13LF87I DD DSN=&&P13LF87I,DISP=(OLD,DELETE)                                  
//BE01F500 DD DSN=&&BE01F500,DISP=(OLD,DELETE)                                  
//F500INCO DD DSN=&&F500INCO,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=0),                                
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SPLIT MATCH & NOT MATCH CASES (BE01F500)                          *         
//*-------------------------------------------------------------------*         
//STEP01F  EXEC PGM=BP13CF95,COND=(0,NE)                                        
//BE01F500 DD DSN=&&F500INCO,DISP=(OLD,DELETE)                                  
//BE01F515 DD DSN=BP13.BE01.F515.MHA.INCMPLTE,DISP=SHR                          
//P13LF95M DD DSN=BP13.BE01.F500.SENDID.MATCH,DISP=OLD                          
//P13LF95N DD DSN=BP13.BE01.F500.SENDID.NOTMATCH,DISP=OLD                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT MHA DATA FROM BE01 BY REF (CASE NO), UIN                               
//*--------------------------------------------------------------------         
//STEP01G  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.BE01.F515.MHA,DISP=SHR                                   
//SORTOUT  DD DSN=&&BE01F515,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=580,BLKSIZE=0),                               
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(24,8,A,11,9,A),FORMAT=CH                                       
    INCLUDE COND=(20,4,CH,EQ,C'BP13',AND,                                       
                 (492,1,CH,NE,C'A',AND,492,1,CH,NE,C'L'))                       
//*-----------------------------------------------------------------            
//* EXCEPTION REPORT FOR RECORDS NOT FOUND IN MHA                               
//*-----------------------------------------------------------------            
//STEP01H  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BE01F515 DD DSN=&&BE01F515,DISP=(OLD,DELETE)                                  
//BP13L571 DD DSN=BP13.D501.BP13L571,DISP=OLD                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S571),DISP=SHR                             
//*--------------------------------------------------------------------         
//* SORT MHA DATA FROM BE01 BY REF (CASE NO), UIN                               
//*--------------------------------------------------------------------         
//STEP01I  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.BE01.F515.MHA,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.BE01.F515.MHA,DISP=OLD                                   
//SYSIN    DD *                                                                 
    SORT FIELDS=(24,8,A,11,9,A),FORMAT=CH                                       
    INCLUDE COND=(20,4,CH,EQ,C'BP13',AND,                                       
                 (492,1,CH,EQ,C'A',OR,492,1,CH,EQ,C'L'))                        
//*-------------------------------------------------------------------*         
//* UPDATE OCCUPIER FILE (K825) WITH MHA INFO (BE01F515)              *         
//*-------------------------------------------------------------------*         
//STEP02  EXEC PGM=IKJEFT01,DYNAMNBR=20,REGION=4096K,COND=(0,NE)                
//BE01F515 DD DSN=BP13.BE01.F515.MHA,DISP=SHR                                   
//BP13K500 DD DSN=BP13.K500.PREREGN,DISP=OLD,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=OLD,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=OLD,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=OLD,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13F725 DD DSN=BP13.F725.MHADATA,DISP=OLD                                    
//BP13F500 DD DSN=BP13.F500.SEQUENCE.DAILY,DISP=OLD                             
//BP13L506 DD DSN=BP13.L506.DECEASED,DISP=OLD                                   
//P13L506A DD SYSOUT=*                                                          
//P13L506B DD SYSOUT=*                                                          
//P13L506C DD SYSOUT=*                                                          
//P13L506D DD SYSOUT=8,DEST=IOM8                                                
//P13L506E DD SYSOUT=8,DEST=IOM8                                                
//P13L506F DD SYSOUT=*                                                          
//P13L506G DD DSN=BP13.CLOUD.BP13D501.L506G,DISP=(NEW,CATLG),                   
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(50,50),RLSE),DATACLAS=MULTIVOL                        
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C506) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT NEW REGISTERED CASES BY REGN                                 *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&NEWREGN,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&OCCP,DISP=(NEW,PASS),                                       
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A,107,2,A,9,9,A),FORMAT=CH                                 
    INCLUDE COND=(1,8,CH,GT,C'        ')                                        
//*-------------------------------------------------------------------*         
//* TO UPDATE LESSEE CHECK                                            *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13C834,COND=(0,NE)                                        
//BP13F730 DD DSN=&&NEWREGN,DISP=(OLD,PASS)                                     
//BP13F825 DD DSN=&&OCCP,DISP=(OLD,PASS)                                        
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L834 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BE01F515 BY REGNNO                                           *         
//*-------------------------------------------------------------------*         
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.BE01.F515.MHA,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F515C,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=580,BLKSIZE=0),                               
//            SPACE=(CYL,(60,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(24,8,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO UPDATE CATEGORY                                                *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC PGM=BP13C726,COND=(0,NE)                                        
//BE01F515 DD DSN=&&P13F515C,DISP=(OLD,PASS)                                    
//BP13K500 DD DSN=BP13.K500.PREREGN,DISP=OLD,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=OLD,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13L726B DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* COMPARE DAILY FILE WITH ACCUMULATED VSAM FILE.                              
//* SORT OUT ONLY CASES IN THE DAILY FILE                                       
//*------------------------------------------------------------------           
//STEP7A   EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&NEWREGN,DISP=(OLD,PASS)                                     
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F730 DD DSN=&&BP13F730,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORT CATEGORY = BLANK CASES                                                 
//*-------------------------------------------------------------------*         
//STEP7B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F730MIX,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(60,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(225,1,CH,EQ,C' ')                                              
//*-------------------------------------------------------------------*         
//* UPDATE CATEGORY FOR MIX MARRIAGE CASES                            *         
//*-------------------------------------------------------------------*         
//STEP7C   EXEC PGM=BP13C02R,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730MIX,DISP=(OLD,PASS)                                     
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=OLD,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L02R DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* COMPARE DAILY FILE WITH ACCUMULATED VSAM FILE.                              
//* SORT OUT ONLY CASES IN THE DAILY FILE                                       
//*------------------------------------------------------------------           
//STEP7D   EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&NEWREGN,DISP=(OLD,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F730 DD DSN=&&BP13F730,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT BY ALLO CAT/NT/FT/REGNO                                                
//*------------------------------------------------------------------           
//STEP7E   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F730CB15,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,187,3,A,211,2,A,123,8,A),FORMAT=CH                     
//*------------------------------------------------------------------           
//* GENERATE INTER-RACIAL COUPLE REPORT                                         
//*------------------------------------------------------------------           
//STEP7F   EXEC PGM=BP13CB15,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730CB15,DISP=(OLD,DELETE)                                  
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR,                                       
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13LB15 DD SYSOUT=8,DEST=IOM8                                                
//P13LB15A DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* ORT BP13F723 BY REF NO, NRIC                                      *         
//* MIT RESALE CASES, REF-NO WITH '*'                                 *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SENDID.OBTPRT.BE01,DISP=SHR                         
//SORTOUT  DD DSN=&&BE01F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=0),                                
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(14,8,A,1,9,A),FORMAT=CH                                         
   OMIT COND=(14,1,CH,EQ,C'*')                                                  
//*-------------------------------------------------------------------*         
//* SORT BP13F725 BY REF NO, NRIC                                     *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F725.MHADATA,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F725,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=211,BLKSIZE=21100),                           
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A,9,9,A),FORMAT=CH                                          
//*-------------------------------------------------------------------*         
//* REPORT ON F500 RECORDS WITH UNMATCHED F725 RECORDS                *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=BP13C827,COND=(0,NE)                                        
//BE01F500 DD DSN=&&BE01F500,DISP=(OLD,DELETE)                                  
//BP13F725 DD DSN=&&BP13F725,DISP=(OLD,DELETE)                                  
//BP13L827 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* BACKUP FILE FROM CDB MHA INTERFACE FILE                           *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1  DD DSN=BP13.BE01.F515.MHA,DISP=SHR                                    
//OUTPUT1 DD DSN=BP13.BE01.F515.MHAMTH,DISP=MOD                                 
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
//*--------------------------------------------------------------------         
//* EMPTY PREP FILE (BE01F515)                                                  
//*                                                                             
//*--------------------------------------------------------------------         
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.BE01.F515.MHA,DISP=OLD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*---------------------------------------------------------------------        
//*  REPRO FILE TO ACCUMULATIVE FILE                                            
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.F725.MHADATA,DISP=SHR                                    
//OUTPUT3  DD DSN=BP13.F725.MHADATA.ACCUM,DISP=MOD                              
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*====================================================================         
//* BACKUP BE01 FILE TO DISK                                                    
//*====================================================================         
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BE01.F515.INT.OBTPRT.BP13,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.BE01.F515.MHA.BACKUP(+1),                                
//         DISP=(NEW,CATLG),                                                    
//         DCB=(BLKSIZE=0,LRECL=580,RECFM=FB),                                  
//         SPACE=(CYL,(10,5),RLSE)                                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//*===================================================================          
//*   CLEAR BE01 FILE                                                           
//*===================================================================          
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DUMMY                                                             
//OUTPUT1  DD DSN=BE01.F515.INT.OBTPRT.BP13,DISP=OLD                            
//OUTPUT2  DD DSN=BP13.BE01.F500.DAILY,DISP=OLD                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT) OUTFILE(OUTPUT1)                                      
      REPRO INFILE(INPUT) OUTFILE(OUTPUT2)                                      
//*-------------------------------------------------------------------*         
//* BACKUP BP13F500                                                   *         
//*-------------------------------------------------------------------*         
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=BP13.F500.SEQUENCE.BP13D501.MTH,DISP=MOD                      
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
//*-------------------------------------------------------------------*         
//* GENERATE BP13.F730.MATURERQ.DAILY                                 *         
//* FILE WAS PREVIOUSLY GENERATED IN BP13D500 FROM BP13K730           *         
//*-------------------------------------------------------------------*         
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=BP13.F730.MATURERQ.DAILY,DISP=OLD                             
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OMIT COND=(116,1,CH,EQ,C' ')                                                
    SUM FIELDS=NONE                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13F730                                                   *         
//*-------------------------------------------------------------------*         
//STEP18   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//OUTPUT1  DD DSN=BP13.F730.MATURERQ.BP13D501.MTH,DISP=MOD                      
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
//*---------------------------------------------------------------------        
//* REMOVE DUPS FOR HFE DAILY                                                   
//*---------------------------------------------------------------------        
//STEP19A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FECA.HFE.ACCUM,DISP=SHR                                  
//SORTOUT  DD DSN=&&FECA,DISP=(NEW,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(50,50),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*--------------------------------------------------------------------         
//* SORT JOINKEYS TO GET HFE RECORDS                                            
//*--------------------------------------------------------------------         
//STEP19B  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTJNF2 DD DSN=&&FECA,DISP=(OLD,DELETE)                                      
//MATCH    DD DSN=BP13.FECA.HFE,DISP=OLD                                        
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   REFORMAT FIELDS=(F2:1,500)                                                   
   OPTION COPY                                                                  
   OUTFILE FNAMES=MATCH                                                         
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*                   END OF BP13D501                                 *         
//*-------------------------------------------------------------------*         
