//BP13M217 JOB (BP13P),'BP13',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),        00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//********************************************************************* 00000660
//* REPORT BY ESTATE ON BTO REQUEST RESIDENCE ADDRESS                   00000660
//********************************************************************* 00000660
//*---------------------------------------------------------------------        
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAMPPA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------- 00000660
//* OUTPUT BTO SORT BY REGN-NO                                          00000660
//*-------------------------------------------------------------------- 00000660
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F730,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,25),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(376,3,CH,EQ,C'BTO')                                             
//*-------------------------------------------------------------------- 00000660
//* SORT ADDRESS FILE BY REGN-NO                                        00000660
//*-------------------------------------------------------------------- 00000660
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F830,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                              
//            SPACE=(CYL,(500,250),RLSE)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*-------------------------------------------------------------------- 00000660
//* MATCH TO GET RESIDENCE ADDRESS FOR BTO REQUEST, HHTY                00000660
//*-------------------------------------------------------------------- 00000660
//STEP03   EXEC PGM=BP13C04A,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F830 DD DSN=&&BP13F830,DISP=(OLD,PASS)                                    
//P13F830A DD DSN=&&F830ADDR,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------- 00000660
//* SORT BY STREET NAME TO GET NT-CODE, ESTATE CODE/NAME                00000660
//*-------------------------------------------------------------------- 00000660
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F830ADDR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F830STR,DISP=(,PASS),                                       
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                              
//            SPACE=(CYL,(500,250),RLSE)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(56,32,A),FORMAT=CH                                               
//*-------------------------------------------------------------------- 00000660
//* SORT AB03 PIDB FILE BY STREET NAME                                  00000660
//*-------------------------------------------------------------------- 00000660
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AB03.F089.PIDB,DISP=SHR                                       
//SORTOUT  DD DSN=&&AB03F089,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                              
//            SPACE=(CYL,(500,250),RLSE)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(15,32,A),FORMAT=CH                                               
//*-------------------------------------------------------------------- 00000660
//* MATCH BP13F830 WITH AB03 PIDB FILE BY STREET NAME TO GET NT CODE    00000660
//* GET ESTATE CODE/ESTATE NAME FROM BM06K510                           00000660
//*-------------------------------------------------------------------- 00000660
//STEP06   EXEC PGM=BP13C04B,COND=(0,NE)                                        
//AB03F089 DD DSN=&&AB03F089,DISP=(OLD,PASS)                                    
//BP13F830 DD DSN=&&F830STR,DISP=(OLD,PASS)                                     
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//P13F830A DD DSN=&&F830EST,DISP=(,PASS),                                       
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=300),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//P13F830B DD DSN=&&F830NTFD,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------- 00000660
//* PRINT SUMMARY REPORT BY ESTATE/NON-MATURE, HOUSEHOLD-TYPE           00000660
//*       DETAIL REPORT FOR UNMATCH ADDRESS, FOREIGN ADDRESS            00000660
//*-------------------------------------------------------------------- 00000660
//STEP07   EXEC SAS,COND=(0,NE)                                                 
//BP13F830 DD DSN=&&F830EST,DISP=(OLD,PASS)                                     
//P13F830A DD DSN=&&F830NTFD,DISP=(OLD,PASS)                                    
//BP13L048 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S048),DISP=SHR                             
//*-------------------------------------------------------------------- 00000660
//*                     END OF BP13M217                                 00000660
//*-------------------------------------------------------------------- 00000660
