//BP13M001 JOB (BP13P),'BP13M001',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=====================================================================        
//* OUTPUT FILE TO ICDB                                                         
//*=====================================================================        
//* CHGE REQ    DATE     AUTHOR  REMARKS                                        
//* --------    ----     ------  -------                                        
//* BP130418    27/08/98 CLT     F800-DTE-BALLOT FROM 521 TO 785 POS            
//*                              F110-DTE-KEY-ISSUED FROM 212 TO 323 POS        
//* BP132627    08/11/04 GAN1    CHG F800.APPLN.KEYISSUE TO BP13K893            
//* BP133145    11/10/07 BA3    -INCLUDE THE FF. FLDS ON THE OUTREC             
//*                                 IN STEP01 AND STEP02:                       
//*                                 DTE-BALLOT, NUM-ALLO-CAT,                   
//*                                 AMT-CA-INCOME, NUM-LOAN-TAG,                
//*                                 NUM-AHG                                     
//*                             -RENAMED STEP08 TO STEP10                       
//*                             -INCLUDED BM06K100, BP13K410 FOR NEW            
//*                                STEPS. STEP08 AND STEP09 RESPECTIVELY        
//* BP133145    03/11/07 YCH2   -INCLUDE CONTRACT BLK IN OUTREC OF K110         
//* BP133145    14/11/07 LSB1   -CONVERT TO COBOL PGM, DELETE BP13M002          
//* BP133771    04/01/10 LSB1   -EXPAND TEMP SPACE                              
//* BP135171    11/02/14 RJE1   -TO CATER FOR DB2 UPGRADE                       
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------            
//* SORT BY BP13K820 BY REGN                                                    
//* INCLUDE ESSENTIAL FAMILY                                                    
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F820REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(280,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(131,1,CH,EQ,C'Y')                                              
//*-----------------------------------------------------------------            
//* SORT BP13K800 BY REGN                                                       
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F800REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(400,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* MATCH F800 AND F820 TO CREATE F716                                          
//* INCLUDE RECORD WITH APPLICATION DATE EQUAL TO CURRENT MONTH                 
//*-----------------------------------------------------------------            
//STEP03     EXEC PGM=BP13C518,COND=(0,NE)                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F800 DD DSN=&&F800REGN,DISP=(OLD,PASS)                                    
//BP13F820 DD DSN=&&F820REGN,DISP=(OLD,PASS)                                    
//BP13F716 DD DSN=&&F716C518,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=0)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE EXIST NT/FT/ROLE                                                   
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716C518,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=&&F716Q748,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                                    
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                        
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716Q748,DISP=(OLD,PASS)                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=BP13.F716.M002Q748,DISP=OLD                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* UPDATE EXISTING NT,FT AND ROLE TO K820                                      
//*-----------------------------------------------------------------            
//STEP06     EXEC PGM=BP13C517,COND=(0,NE)                                      
//BP13F716 DD DSN=BP13.F716.M002Q748,DISP=SHR                                   
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*=====================================================================        
//* SORT MONTH SALES ORDER BY REGN-NO                                           
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F410.MTHSO,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F410,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(40,10),RLSE),                         00690000
//         DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                          00700000
//SYSIN    DD *                                                                 
      SORT FIELDS=(4,8,A),FORMAT=CH                                             
//*-----------------------------------------------------------------            
//* BASED ON MONTH SALES ORDER FILE TO EXTRACT SOC MASTER/OCCUP                 
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=BP13C928,COND=(0,NE)                                        
//BP13F410 DD DSN=&&BP13F410,DISP=(OLD,PASS)                                    
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F800 DD DSN=&&F800KEYI,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                         00690000
//         DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                          00700000
//BP13F820 DD DSN=&&F820KEYI,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                         00690000
//         DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                           00700000
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT SOC MATSER BY REGN-NO                                                  
//*-----------------------------------------------------------------            
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F800NEW,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,SPACE=(CYL,(400,30),RLSE),                        00690000
//         DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                          00700000
//SYSIN    DD *                                                                 
      SORT FIELDS=(4,8,A),FORMAT=CH                                             
//*-----------------------------------------------------------------            
//* MERGE NEW AND KEY-ISSUED CASES BY REGN-NO                                   
//*-----------------------------------------------------------------            
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800KEYI,DISP=(OLD,PASS)                                    
//         DD DSN=&&F800NEW,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F800SALE,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(130,30),RLSE),                        00690000
//         DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                          00700000
//SYSIN    DD *                                                                 
      SORT FIELDS=(4,8,A),FORMAT=CH                                             
      SUM FIELDS=NONE                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT SOC MATSER BY REGN-NO/NRIC                                             
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F820NEW,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,SPACE=(CYL,(280,30),RLSE),                        00690000
//         DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                           00700000
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,17,A),FORMAT=CH                                            
//*-----------------------------------------------------------------            
//* MERGE NEW AND KEY-ISSUED CASES BY REGN-NO/NRIC                              
//*-----------------------------------------------------------------            
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F820KEYI,DISP=(OLD,PASS)                                    
//         DD DSN=&&F820NEW,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F820SALE,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(280,30),RLSE),                        00690000
//         DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                           00700000
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,17,A),FORMAT=CH                                            
      SUM FIELDS=NONE                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* OUTPUT SALE/OCCUP FILE TO ICDB                                              
//*-----------------------------------------------------------------            
//STEP13   EXEC PGM=BP13C927,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800SALE,DISP=(OLD,PASS)                                    
//BP13F820 DD DSN=&&F820SALE,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD45 DD DSN=BP13.KD45.PPAYHIST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13FW01 DD DSN=BP13.FW01.SOC,DISP=OLD                                        
//BP13FW02 DD DSN=BP13.FW02.SOC,DISP=OLD                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
