//BP13W200  JOB (BP13P),'BP13W200',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*====================================================================*        
//* CHG-NO   BY  REMARK                                                         
//*-------------------------------------------------------------------*         
//* BP136158 LSB INCLUDE BP13K893 HISTORY FILE                                  
//* BP136901 LSB ADD ROF                                                        
//* BP137786 KV6 ADD OBF                                                        
//* BP137719 KV6 INCLUDE WEEKLY REPORT OF RESERVED FLATS                        
//* BP138067 KV6 INCLUDE CONSOLIDATED WEEKLY REPORT OF RESERVED FLATS           
//* BP138260 LSB NEW REPORT ON FTS ELDERLY PREMIUM                              
//*====================================================================*        
//*--------------------------------------------------------------------         
//* SORT OUT ELDERLY FTS                                                        
//*--------------------------------------------------------------------         
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F800ELD,DISP=(,PASS),                                       
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000),                              
//        SPACE=(CYL,(30,10),RLSE)                                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C'C',AND,                                            
                (57,3,CH,EQ,C'FTS',OR,                                          
                 57,3,CH,EQ,C'SAP',OR,                                          
                 57,3,CH,EQ,C'GRO',OR,                                          
                 57,3,CH,EQ,C'REN',OR,                                          
                 57,3,CH,EQ,C'REG',OR,                                          
                 57,3,CH,EQ,C'RNG'),AND,                                        
                 608,1,CH,NE,C'N')                                              
//*---------------------------------------------------------------------        
//* PRINT REPORT ON FTS ELDERY PREMIUM, SINGLE PREMIUM                          
//*---------------------------------------------------------------------        
//STEP02   EXEC  PGM=BP13CE19,COND=(0,NE)                               00002680
//BP13F800 DD  DSN=&&F800ELD,DISP=(OLD,PASS)                            00002710
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                          00002710
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F800A DD  DSN=BP13.LE19.FTSPREM,DISP=OLD                                   
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//*-------------------------------------------------------------------*         
//* GET FROM SOC MASTER                                                         
//* SORT IN WEEKLY SA FLAT CASES FOR MONITORING                       *         
//* SORT THE RECORDS IN REGN-NO SEQUENCE                              *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=BP13.F800.APPLN.SOCHLE,DISP=OLD                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(30,2,CH,NE,C'1A',AND,                                         
                  30,2,CH,NE,C'2A',AND,                                         
                 509,4,CH,GT,C'    ',AND,                                       
                 785,6,CH,GE,C'201502',AND,                                     
                 (924,3,CH,EQ,C'BTO',OR,                                        
                  924,3,CH,EQ,C'ROF',OR,                                        
                  924,3,CH,EQ,C'OBF',OR,                                        
                  924,3,CH,EQ,C'SBF'))                                          
//*-------------------------------------------------------------------*         
//* GET FROM SOC HISTORY                                                        
//* SORT IN WEEKLY SA FLAT CASES FOR MONITORING                       *         
//* SORT THE RECORDS IN REGN-NO SEQUENCE                                        
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=BP13.F800.APPLN.SOCHLE,DISP=MOD                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(30,2,CH,NE,C'1A',AND,                                         
                  30,2,CH,NE,C'2A',AND,                                         
                 509,4,CH,GT,C'    ',AND,                                       
                 785,6,CH,GE,C'201502',AND,                                     
                 (924,3,CH,EQ,C'BTO',OR,                                        
                  924,3,CH,EQ,C'SBF'))                                          
  OUTREC FIELDS=(1,2000)                                                        
//*-----------------------------------------------------------------            
//* CR7719 - WEEKLY REPORT OF RESERVED FLATS                                    
//* INCLUDE BM06K110 CASES WITH DTE-ACCEPTANCE = SPACES/ZEROES                  
//*         AND DTE-RESERVE-RELEASE IS GREATER THAN ZEROES                      
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BM06F110,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(250,50),RLSE)                                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,11,A),FORMAT=CH                                              
    INCLUDE COND=(367,8,CH,GT,C'00000000',AND,                                  
                 (299,8,CH,EQ,C'        ',OR,                                   
                  299,8,CH,EQ,C'00000000'))                                     
//*-----------------------------------------------------------------            
//*   GENERATE FILE OF RESERVED FLATS WHERE DATE RESERVE IS                     
//*   A. GREATER THAN OR EQUAL 1MONTH BUT LESS THAN OR EQUAL 2MONTHS            
//*   B. EQUAL 2.5 MONTHS                                                       
//*   C. GREATER THAN OR EQUAL 3 MONTHS                                         
//*   D. CONSOLIDATED REPORT - A, B, AND C (CR8067)                             
//*-----------------------------------------------------------------            
//STEP06  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                
//BM06F110 DD DSN=&&BM06F110,DISP=(OLD,PASS)                                    
//BM06K200 DD DSN=BM06.K200.KIVFLATS,DISP=SHR                                   
//BP13FE17 DD DSN=&&BP13FE17,DISP=(,PASS),                                      
//            SPACE=(CYL,(10,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CE17) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//*  SORT BY REPORT TYPE AND OIC                                                
//*-----------------------------------------------------------------            
//STEP07   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13FE17,DISP=(OLD,DELETE)                                 
//SORTOUT  DD  DSN=&&BP13FESR,DISP=(,PASS),                                     
//             SPACE=(CYL,(10,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,1,A,85,5,A),FORMAT=CH                                         
//*-----------------------------------------------------------------            
//*   FORMAT EMAIL REPORT                                                       
//*-----------------------------------------------------------------            
//STEP08  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                
//BP13FE17 DD DSN=&&BP13FESR,DISP=(OLD,DELETE)                                  
//P13LE17A DD DSN=BP13.MAILRPT.P13LE17A,DISP=OLD                                
//P13LE17B DD DSN=BP13.MAILRPT.P13LE17B,DISP=OLD                                
//P13LE17C DD DSN=BP13.MAILRPT.P13LE17C,DISP=OLD                                
//P13LE17D DD DSN=&&P13LE17D,DISP=(,PASS),                                      
//         SPACE=(CYL,(5,3),RLSE),                                              
//         DCB=(RECFM=FB,LRECL=132,BLKSIZE=0)                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CE18) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL (P13LE17A)                                            
//*-----------------------------------------------------------------            
//STEP09   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.P13LE17A,DISP=SHR                                
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL (P13LE17B)                                            
//*-----------------------------------------------------------------            
//STEP10   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.P13LE17B,DISP=SHR                                
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL (P13LE17C)                                            
//*-----------------------------------------------------------------            
//STEP11   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.P13LE17C,DISP=SHR                                
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL (P13LE17D)                                            
//*-----------------------------------------------------------------            
//STEP12   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13LE17D,DISP=(OLD,PASS)                                    
/*                                                                              
