//BP13AA06  JOB (BP13P),'BP13AA06',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*--------------------------------------------------------------------         
//* TO REPRO RECORDS                                                            
//*--------------------------------------------------------------------         
//STEP1    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KA20.BLOCK,                                              
//            DISP=SHR                                                          
//OUTPUT1  DD DSN=BP13.FA20.BLOCK,                                              
//            DISP=SHR                                                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*--------------------------------------------------------------------         
//* TO REPRO RECORDS                                                            
//*--------------------------------------------------------------------         
//STEP2    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KA30.UNIT,                                               
//            DISP=SHR                                                          
//OUTPUT1  DD DSN=BP13.FA30.UNIT,                                               
//            DISP=SHR                                                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*-----------------------------------------------------------------            
//*   SORT BP13KA10                                                             
//*-----------------------------------------------------------------            
//STEP3  EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.KA10.PRJCT,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13FA10,                                                   
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(700,65,A),FORMAT=CH                                            
    INCLUDE COND=(1,3,CH,NE,C'   ')                                             
//*-----------------------------------------------------------------            
//*   SORT BM06F410                                                             
//*-----------------------------------------------------------------            
//STEP4  EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BM06.F410.PIDB,DISP=SHR                                       
//SORTOUT  DD DSN=&&BM06F410,                                                   
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(251,32,A),FORMAT=CH                                            
    INCLUDE COND=(1,2,CH,EQ,C'NP',AND,                                          
                  3,4,CH,GE,C'7000',AND,                                        
                  124,2,CH,EQ,C'85')                                            
//*-------------------------------------------------------------------- 00001880
//* TO CREATE BP13KA30                                                  00001870
//*-------------------------------------------------------------------- 00001880
//STEP5  EXEC    PGM=BP13CA06,COND=(0,NE)                               00001890
//BM06F410 DD  DSN=&&BM06F410,DISP=(SHR,PASS)                           00001900
//BP13FA10 DD  DSN=&&BP13FA10,DISP=(SHR,PASS)                           00001900
//BP13KA20 DD  DSN=BP13.KA20.BLOCK,DISP=OLD                             00001900
//BP13KA30 DD  DSN=BP13.KA30.UNIT,DISP=OLD                              00001900
//BP13KD15 DD  DSN=BP13.KD15.DBSSTP,DISP=OLD                            00001900
//BP13KA63 DD  DSN=BP13.KA63.PPTYUNIT,DISP=SHR                          00001900
//SYSOUT   DD  SYSOUT=*                                                 00001940
//SYSPRINT DD  SYSOUT=*                                                 00001940
//SYSDBOUT DD  SYSOUT=*                                                 00001950
//*                                                                     00001960
//*-----------------------------------------------------------------            
//*   SORT BP13K100                                                             
//*-----------------------------------------------------------------            
//STEP6  EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K100.DBSSUNIT.UPDATE,DISP=SHR                            
//SORTOUT  DD DSN=&&BP13F100,                                                   
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(1,10,CH,NE,C'          ')                                     
//*---------------------------------------------------------------------        
//* RUN PROGRAM BP13CA04                                                        
//*---------------------------------------------------------------------        
//STEP7  EXEC    PGM=BP13CA04,COND=(0,NE)                                       
//BP13F100 DD  DSN=&&BP13F100,DISP=(SHR,PASS)                                   
//BP13KA30 DD  DSN=BP13.KA30.UNIT,                                              
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* END OF JOB BP13AA06                                                         
//*---------------------------------------------------------------------        
