//BP13M151  JOB (BP13P),'BP13M151',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//******************************************************************            
//*- REPORTS FOR BANK LOAN CASES                                                
//******************************************************************            
//* CHG REF  BY   ON    - DESCRIPTION                                           
//* -------- --- --------------------                                           
//* BP132347 SK  290503 - ADD BP13C373,C374,C375,C105,BP13S022,S023,            
//*                           S018,S019,S020,S021,S151,C354                     
//* BP132347 SK  220703 - REMOVE BP13C375, BP13S023, ADD BP13C379               
//* BP132347 SK  300703 - ADD BP13C378                                          
//* BP132400 MCC 270803 - ADD BP13C071,BP13C075,BP13S024                        
//* BP132400 SK  120304 - ADD BP13C449                                          
//* BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//* BP132526 SK  230604   EXPAND BP13K671 LENGTH TO 3000                        
//* BP132565 SK  060904   INCLUDE TRANS TYPE "43" & "45"                        
//* BP132801 LSB 180406   STEP05 INCLUDE A640 TRAN-TY FOR MANUAL CASE           
//* BP133244 LSB 010208   STEP40 CHG REC LENGTH                                 
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                            
//*  PRT01 : COPIES = 2                  (MA&B)                                 
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAAMB1A CP-2',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=2,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAAMB1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* BACKUP  BP13K673  TO  BP13F673                                              
//*-----------------------------------------------------------------            
//STEP01A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K673.BANKBAL,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//OUTPUT1  DD DSN=BP13.F673.BANKBAL.PREVMTH,DISP=SHR                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                         
//*-----------------------------------------------------------------            
//* SORT OUT TRAN TYPE '40' CASES                                               
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F121.BANKIBG,DISP=SHR                                    
//SORTOUT  DD DSN=&&F121TT40,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(10,20),RLSE)                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,2,A,5,8,A),FORMAT=CH                                         
    INCLUDE COND=(1,2,CH,EQ,C'40',OR,1,2,CH,EQ,C'41')                           
//*-----------------------------------------------------------------            
//* PRINT DETAILS RECEIPT FOR ACCOUNT 0000000404151 (HBL=1)                     
//* PRINT DETAILS RECEIPT FOR ACCOUNT 0000000544151 (HBL=2)                     
//*-----------------------------------------------------------------            
//STEP02   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE'                          
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F121 DD DSN=&&F121TT40,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13L018 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S018),DISP=SHR                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* INCLUDE SOLICITOR BILL                                                      
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&F121SOL,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(TRK,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(79,1,A,13,8,A),FORMAT=CH                                       
    INCLUDE COND=(66,13,CH,EQ,C'BANK LOAN CPF',AND,99,3,CH,EQ,C'SOL')           
//*-----------------------------------------------------------------            
//* PRINT TRANSFER OF SILICITOR FEE FOR ACCOUNT 40-4151 & 54-4151               
//*-----------------------------------------------------------------            
//STEP04   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE'                          
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F121 DD DSN=&&F121SOL,DISP=(OLD,DELETE)                                   
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L019 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S019),DISP=SHR                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BP13K673                                                               
//*---------------------------------------------------------------------        
//STEP04A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K673.BANKBAL,DISP=SHR                                    
//SORTOUT  DD DSN=&&F673REGN,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=100,RECFM=FB),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SORT BP13K671                                                               
//*---------------------------------------------------------------------        
//STEP04B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K671.BO.FIN,DISP=SHR                                     
//SORTOUT  DD DSN=&&F671REGN,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=3000,RECFM=FB),                                        
//            SPACE=(CYL,(15,10),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* FIND THE CHANGE OF HBL-TPYE IN BANK ORIGINATION MEMO FILE                   
//*---------------------------------------------------------------------        
//STEP04C  EXEC PGM=BP13C449,COND=(0,NE)                                        
//BP13F671 DD DSN=&&F671REGN,DISP=(OLD,DELETE)                                  
//BP13F673 DD DSN=&&F673REGN,DISP=(OLD,DELETE)                                  
//P13F671A DD DSN=&&F671HBL,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=3000,RECFM=FB),                                        
//            SPACE=(CYL,(15,10),RLSE)                                          
//P13L449A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*- OUTREC TRANSACTION TYPE= TT42 FOR MANUAL RECEIPT THRU P13M640              
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.E671.BO.FIN.LOG,DISP=SHR                                 
//SORTOUT  DD DSN=BP13.F121.BANKIBG,DISP=MOD                                    
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,CH,A)                                                       
   OUTREC FIELDS=(C'42',2X,1,8,1981,8,60X,C'0',                                 
                  1865,8,12X,9,11,36X)                                          
   INCLUDE COND=(1865,8,CH,GT,C'00000000',AND,2977,4,CH,EQ,C'A640')             
//*-----------------------------------------------------------------            
//* MERGE ALL BANK TRANSACTION                                                  
//* TT40 - RECEIPT 40-4151                                                      
//* TT41 - RECEIPT 54-4151                                                      
//* TT42 - RECEIPT MANUAL                                                       
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//         DD DSN=BP13.F121.BANKIBG,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FALL,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                             
//             SPACE=(CYL,(10,20),RLSE)                                         
//SYSIN    DD  *                                                                
      SORT FIELDS=(5,8,A),FORMAT=CH                                             
      INCLUDE COND=(1,2,CH,EQ,C'40',OR,                                         
                    1,2,CH,EQ,C'41',OR,                                         
                    1,2,CH,EQ,C'42',OR,                                         
                    1,2,CH,EQ,C'43',OR,                                         
                    1,2,CH,EQ,C'44',OR,                                         
                    1,2,CH,EQ,C'45',OR,                                         
                    66,13,CH,EQ,C'BANK LOAN CPF')                               
//*-----------------------------------------------------------------            
//* SORT THE OUTPUT OF BP13C449 - BY REGN                                       
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F671HBL,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&BP13F671,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=3000),                            
//             SPACE=(CYL,(20,20),RLSE)                                         
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,8,A),FORMAT=CH                                             
      INCLUDE COND=(1,8,CH,GT,C'        ')                                      
//*-----------------------------------------------------------------            
//* PRINT OPENING & CLOSING ON 40-4151/40-4154 RECONCILLIATION                  
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=BP13C374,COND=(0,NE)                                        
//BP13F121 DD DSN=&&BP13FALL,DISP=(OLD,DELETE)                                  
//BP13F671 DD DSN=&&BP13F671,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K673 DD DSN=BP13.K673.BANKBAL,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F673 DD DSN=BP13.F673.BANKBAL,DISP=OLD                                    
//P13L374A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L374B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L374C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT SOLICITOR CASES                                                        
//*-----------------------------------------------------------------            
//STEP08A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&F136SOL,DISP=(NEW,PASS),                                    
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                             
//             SPACE=(CYL,(10,20),RLSE)                                         
//SYSIN    DD  *                                                                
        SORT FIELDS=(5,8,A),FORMAT=CH                                           
        INCLUDE COND=((1,2,CH,EQ,C'11',OR,                                      
                       1,2,CH,EQ,C'12',OR,                                      
                       1,2,CH,EQ,C'13',OR,                                      
                       1,2,CH,EQ,C'14',OR,                                      
                       1,2,CH,EQ,C'15',OR,                                      
                       1,2,CH,EQ,C'16'),AND,                                    
                      99,3,CH,EQ,C'SOL')                                        
//*-----------------------------------------------------------------            
//* PRINT RECONCILIATION STATEMENT FOR 40-4153                                  
//*-----------------------------------------------------------------            
//STEP08B  EXEC PGM=BP13C379,COND=(0,NE)                                        
//BP13F121 DD DSN=&&F136SOL,DISP=(OLD,DELETE)                                   
//BP13F671 DD DSN=&&BP13F671,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K673 DD DSN=BP13.K673.BANKBAL,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F673 DD DSN=BP13.F673.BANKBAL,DISP=MOD                                    
//P13L379A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L379B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT ON PAYMENT TYPE & DTE-CREATE                                           
//*-----------------------------------------------------------------            
//STEP08C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K673.BANKBAL,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F673,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=100),                             
//             SPACE=(CYL,(10,20),RLSE)                                         
//SYSIN    DD  *                                                                
        SORT FIELDS=(9,3,A,74,8,A),FORMAT=CH                                    
        INCLUDE COND=(1,8,CH,NE,C'        ')                                    
//*-----------------------------------------------------------------            
//* PRINT AGEING REPORT FOR AMOUNTS IN 40-4151, 54-4151 & 40-4153               
//*-----------------------------------------------------------------            
//STEP08D  EXEC PGM=BP13C378,COND=(0,NE)                                        
//BP13F673 DD DSN=&&BP13F673,DISP=(OLD,DELETE)                                  
//P13L378A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L378B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&F136BCPF,DISP=(NEW,PASS)                                    
//SYSIN    DD  *                                                                
     SORT FIELDS=(79,1,A,5,8,A),FORMAT=CH                                       
     INCLUDE COND=(66,13,CH,EQ,C'BANK LOAN CPF')                                
//*-----------------------------------------------------------------            
//* PRINT DETAILS PAYMENTS FOR ACCOUNT 0000000404151 (HBL=1)                    
//* PRINT DETAILS PAYMENTS FOR ACCOUNT 0000000544151 (HBL=2)                    
//*-----------------------------------------------------------------            
//STEP10   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE'                          
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F136 DD DSN=&&F136BCPF,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L021 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S021),DISP=SHR                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*- SORT ON DATE POST                                                          
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13CASH,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(10,20),RLSE)                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(13,8,A),FORMAT=CH                                              
    INCLUDE COND=((1,2,CH,EQ,C'11',OR,1,2,CH,EQ,C'12'),                         
                   AND,66,13,CH,NE,C'BANK LOAN CPF',                            
                   AND,99,3,CH,EQ,C'SOL')                                       
//*-----------------------------------------------------------------            
//* PRINT CASH RECEIPTS FOR ACCOUNT 0000000404151 FOR SOL PAYMENT               
//*-----------------------------------------------------------------            
//STEP12   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE'                          
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F136 DD DSN=&&BP13CASH,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L022 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S022),DISP=SHR                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* INCLUDE SOL ACCNT TRANSFER OUT OF 40-4153                                   
//*-----------------------------------------------------------------            
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&F136PAY,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(10,20),RLSE)                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,8,A),FORMAT=CH                                               
    INCLUDE COND=((1,2,CH,EQ,C'13',OR,                                          
                   1,2,CH,EQ,C'14',OR,                                          
                   1,2,CH,EQ,C'15',OR,                                          
                   1,2,CH,EQ,C'16'),AND,99,3,CH,EQ,C'SOL')                      
//*-----------------------------------------------------------------            
//* REPORT ON OF PAYMENTS SOL UNDER ACCOUNT 40-4153                             
//*-----------------------------------------------------------------            
//STEP16   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE'                          
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F136 DD DSN=&&F136PAY,DISP=(OLD,DELETE)                                   
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L020 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S020),DISP=SHR                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*----------------------------------------------------------------             
//* PRINT REPORT OF DETAILS OF OUTSTANDING BALANCE (PARTIAL PAYMENT)            
//*----------------------------------------------------------------             
//STEP17   EXEC PGM=BP13C373,COND=(0,NE)                                        
//BP13F671 DD DSN=&&BP13F671,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L373 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*-SORTOUT TYPE '40' CASES FOR F121 BANKIBG FILE                               
//*-----------------------------------------------------------------            
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F121.BANKIBG,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F12A,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(25,9,A),FORMAT=CH                                                
  INCLUDE COND=(1,2,CH,EQ,C'40')                                                
//*--------------------------------------------------------------------         
//*-SORT RESALE FILE BY NRIC (CURRENT & PREV MONTH)                             
//*--------------------------------------------------------------------         
//STEP19   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.BB24.F04A.IBGCPF.MBKUP(0),DISP=SHR                       
//         DD DSN=BP13.BB24.F04A.IBGCPF.MTH,DISP=SHR                            
//SORTOUT  DD DSN=&&BB24F04A,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(13,9,A),FORMAT=CH                                                
//*--------------------------------------------------------------------         
//*-MATCH RECORDS BY NRIC - PROCESS 'HBL1'                                      
//*-MATCHED RECS MUST BE SAME MONTH WITH SY02F001                               
//*-&&P13F04A - ALL MATCHED CASES                                               
//*-&&P13F04B - ALL UNMATCHED CASES                                             
//*---------------------------------------------------------------------        
//STEP20   EXEC  PGM=BP13C071,COND=(0,NE)                                       
//BP13F121 DD DSN=&&BP13F12A,DISP=(OLD,DELETE)                                  
//BB24F04A DD DSN=&&BB24F04A,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//P13F04A  DD DSN=&&P13F04A,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(50,30))                                               
//P13F04B  DD DSN=&&P13F04B,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(50,30))                                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*-MATCHED RECORDS SORT BY DATE-VALUE - PROCESS 'HBL1'                         
//*-----------------------------------------------------------------            
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F04A,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&HBL1MTCH,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(143,8,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*-PRINT MATCH RECORDS  'HBL1 - IBG THRU RESALE'                               
//*-INCLUDE SUBTOTAL BY DATE VALUE                                              
//*---------------------------------------------------------------------        
//STEP22   EXEC  PGM=BP13C075,COND=(0,NE)                                       
//BB24F04A DD DSN=&&HBL1MTCH,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L075 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*-UNMATCHED RECORDS SORT BY DATE-VALUE - PROCESS 'HBL1'                       
//*-----------------------------------------------------------------            
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F04B,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&HBL1UNMT,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(143,8,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*-PRINT UNMATCHED RECORDS  'HBL1 - IBG THRU RESALE'                           
//*-INCLUDE SUBTOTAL BY DATE VALUE                                              
//*---------------------------------------------------------------------        
//STEP24   EXEC  PGM=BP13C075,COND=(0,NE)                                       
//BB24F04A DD DSN=&&HBL1UNMT,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L075 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*-SORTOUT TYPE '41' CASES FOR F121 BANKIBG FILE                               
//*-----------------------------------------------------------------            
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.BACKUP(0),DISP=SHR                                  
//SORTOUT  DD DSN=&&BP13F12B,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(25,9,A),FORMAT=CH                                                
  INCLUDE COND=(1,2,CH,EQ,C'41')                                                
//*--------------------------------------------------------------------         
//*-SORT SMS FILE BY NRIC                                                       
//*--------------------------------------------------------------------         
//STEP26   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.AB03.F845.SALES.MBKUP(0),DISP=SHR                        
//         DD DSN=BP13.AB03.F845.SALES.MTH,DISP=SHR                             
//SORTOUT  DD DSN=&&AB03F845,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(13,9,A),FORMAT=CH                                                
//*--------------------------------------------------------------------         
//*-MATCH RECORDS - PROCESS 'HBL2'                                              
//*-MATCHED RECS MUST BE SAME MONTH WITH SY02F001                               
//*-&&P13F04A - ALL MATCHED CASES                                               
//*-&&P13F04B - ALL UNMATCHED CASES                                             
//*---------------------------------------------------------------------        
//STEP27   EXEC  PGM=BP13C071,COND=(0,NE)                                       
//BP13F121 DD DSN=&&BP13F12B,DISP=(OLD,DELETE)                                  
//BB24F04A DD DSN=&&AB03F845,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//P13F04A  DD DSN=&&P13F04C,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(50,30))                                               
//P13F04B  DD DSN=&&P13F04D,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(50,30))                                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*-MATCHED RECORDS SORT BY DATE-VALUE - PROCESS 'HBL2'                         
//*-----------------------------------------------------------------            
//STEP28   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F04C,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&HBL2MTCH,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(143,8,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*-PRINT MATCHED RECORDS  'HBL2 - IBG THRU SMS'                                
//*-INCLUDE SUBTOTAL BY DATE VALUE                                              
//*---------------------------------------------------------------------        
//STEP29   EXEC  PGM=BP13C075,COND=(0,NE)                                       
//BB24F04A DD DSN=&&HBL2MTCH,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L075 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*-UNMATCHED RECORDS SORT BY DATE-VALUE - PROCESS 'HBL2'                       
//*-----------------------------------------------------------------            
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F04D,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&HBL2UNMT,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(143,8,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*-PRINT UNMATCHED RECORDS  'HBL2 - IBG THRU SMS'                              
//*-INCLUDE SUBTOTAL BY DATE VALUE                                              
//*---------------------------------------------------------------------        
//STEP31   EXEC  PGM=BP13C075,COND=(0,NE)                                       
//BB24F04A DD DSN=&&HBL2UNMT,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L075 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* EMPTY MTHLY FINANCIAL TRANSACTION FILE                                      
//*---------------------------------------------------------------------        
//*  BACKUP BALANCE FILE AFTER BLANCE BROUGHT FORWARD DONE - 12 GDG             
//*---------------------------------------------------------------------        
//STEP32   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.F673.BANKBAL,DISP=SHR                                    
//OUTPUT3  DD DSN=BP13.F673.BANKBAL.MONTH(+1),DISP=(NEW,CATLG),                 
//            SPACE=(CYL,(5,2)),                                                
//            DCB=(BP13.GDG,RECFM=FB,LRECL=100,BLKSIZE=23400)                   
//*                                                                             
      REPRO INFILE(INPUT3)   OUTFILE(OUTPUT3)                                   
//*-----------------------------------------------------------------            
//* MERGING BANK LOAN TRANS TO MONTHLY TRANSACTION                              
//*-----------------------------------------------------------------            
//STEP33   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F121.BANKIBG,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN,DISP=MOD                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*---------------------------------------------------------------------        
//*  BACKUP MONTHLY TRAN FILE TO CARTRIDGE - 12 GDG                             
//*---------------------------------------------------------------------        
//STEP34   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F136.BACKUP(+1),DISP=(NEW,CATLG,DELETE),                 
//            SPACE=(TRK,(100,20)),                                             
//            DCB=(BP13.GDG,RECFM=FB,LRECL=150,BLKSIZE=23400)                   
//*                                                                             
      REPRO INFILE(INPUT1)   OUTFILE(OUTPUT1)                                   
//*                                                                             
//*--------------------------------------------------------------------         
//STEP35   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT2  DD DSN=BP13.F136.MTHTRAN,DISP=OLD                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*--------------------------------------------------------------------         
//STEP36   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F121.BANKIBG,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F121.BANKIBG.MONTH,DISP=OLD                              
//INPUT2   DD DSN=BP13.F121.BANKIBG.NEXTMTH,DISP=SHR                            
//OUTPUT2  DD DSN=BP13.F121.BANKIBG.NEXTMTH.BKUP,DISP=OLD                       
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*--------------------------------------------------------------------         
//STEP37   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.F121.BANKIBG.NEXTMTH,DISP=SHR                            
//OUTPUT2  DD DSN=BP13.F121.BANKIBG,DISP=OLD                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*--------------------------------------------------------------------         
//STEP38   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT2  DD DSN=BP13.F121.BANKIBG.NEXTMTH,DISP=OLD                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*--------------------------------------------------------------------         
//*  BACKUP MONTHLY LOG FILE TO CARTRIDGE - 12 GDG                              
//*---------------------------------------------------------------------        
//STEP39   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.E671.BO.FIN.LOG,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F671.BO.FIN.LOGMTH(+1),DISP=(,CATLG),                    
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,RECFM=FB,LRECL=3000,BLKSIZE=0)                      
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*---------------------------------------------------------------------------  
//* DELETE/DEFINE BP13E671 FILE                                         ------  
//*---------------------------------------------------------------------------  
//STEP40    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR3000,DISP=SHR                                 
//SYSIN    DD *                                                                 
         DEL 'BP13.E671.BO.FIN.LOG' CL PURGE                                    
         DEF CL (NAME(BP13.E671.BO.FIN.LOG) -                                   
                 CYL(30 15)               -                                     
                 SHR(2 3)                 -                                     
                 RECSZ(3000 3000)         -                                     
                 CISZ(4096)               -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 NIXD)                  -                                       
              DATA                        -                                     
              (NAME(BP13.E671.BO.FIN.LOG.DATA))                                 
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT1)                          -                       
                 ODS(BP13.E671.BO.FIN.LOG)                                      
//*---------------------------------------------------------------------        
//* SORT BY TRANS TYPE, DATE POST & REGN                                        
//*---------------------------------------------------------------------        
//STEP41   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K130.SOCHIST,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F130,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(10,20),RLSE)                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,2,A,13,8,A,5,8,A),FORMAT=CH                                  
    INCLUDE COND=(1,1,CH,EQ,C'9')                                               
//*---------------------------------------------------------------------        
//* PRINT REPORT ON MANUAL CASES VIA COLLECTION SYSTEM 40-4151 & 54-4151        
//*---------------------------------------------------------------------        
//STEP42   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE'                          
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F130 DD DSN=&&BP13F130,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13L024 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S024),DISP=SHR                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
