//BP13ADP3 JOB (BP13P),'BP13ADP3',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//* JOB FOR DBSS SHORTLISTING (BYPASS 85%/15%) HHTY CHECK                       
//**************************************************************                
//*    2ND ROUND PIGEONHOLING OF PUBLIC SCHEME                 *                
//*                                                            *                
//*    - INCLUDE ALL UNSUCC GRO AND PRIO CASES                 *                
//*    - LIFT RESTRICTION ON HOUSEHOLD TYPE                    *                
//*    - 1ST TIMER CAN TAKE 2ND TIMER QUOTA AND VICE VERSA     *                
//**************************************************************                
//* STEP 00 - 01 = LASER PRINTER JCL                           *                
//* STEP 02 - 03 = BACKUP TENDER AND BALLOT FILE               *                
//* STEP 04 - 05 = PRINT FLAT SYPPLY REPORT BF PIGEONHOLING    *                
//* STEP 06 - 08 = PROCESS PIGEONHOLING(BP13U531 PRIORITY ONLY)*                
//* STEP 09      = MATCH RELEVANT REQUEST TO GET SUCC & UNSUCC *                
//*                BALLOT RESULT FOR PRINT REPORT              *                
//* STEP 10 - 11 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING    *                
//* STEP 12      = PRINT SUCC/UNSUCC REPORT BP13L522           *                
//* STEP 13      = BACKUP TENDER FILE                          *                
//*                                                            *                
//**************************************************************                
//* CHG REF   BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP132870 CKK  111106 - NEW JCL FOR DBSS SHORTLISTING                        
//* BP132440 LSB  250108 - ONLY SHORTLIST FIRST TIMER                           
//* BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                               
//* BP138246 IL5  09032020 CHANGE JCL FOR EC USE                                
//*                        SHORTLIST BAL APPLICATIONS (NO HH CAT)               
//* BP138246 IL5  12032020 CHANGE CLASS 2 TO CLASS J AND IOMS                   
//* BP139931 AM25 29022024 CHANGE CLASS J TO CLASS 2                            
//**************************************************************                
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K019.TENDER.EC,DISP=OLD                                  
//INPUT2   DD DSN=BP13.K740.MATUREBA.EC,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//**************************************************************                
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F010.TENDER.PA3,DISP=OLD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.PA3,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//SORTOUT  DD DSN=&&P13K010A,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP06    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010A,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING             
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//SORTOUT  DD DSN=&&P13K010B,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP08    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010B,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT OUT UNSUCC REQUEST CASES                                               
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   INCLUDE COND=(226,3,CH,EQ,C'   ')                                            
//*---------------------------------------------------------------------        
//* SORT OUT FIRST-TIMER APPLICATIONS FIRST                                     
//*-----------------------------------------------------------------            
//STEP11A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520BAL,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
    OMIT COND=(461,1,CH,EQ,C'G')                                                
//*-----------------------------------------------------------------            
//* APPEND SECOND-TIMER APPLICATIONS AFTER FIRST-TIMER APPLICAITONS             
//*-----------------------------------------------------------------            
//STEP11B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520BAL,DISP=(MOD,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
    INCLUDE COND=(461,1,CH,EQ,C'G')                                             
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR MATURE PA CASES, THE PROGRAM WI           
//* ONLY ALLOCATE THE PRIORITY SUPPLY QUOTA FOR ALL SCHEME                      
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=BP13U532,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K019.TENDER.EC,DISP=OLD                                  
//BP13F740 DD DSN=&&F520BAL,DISP=(OLD,PASS)                                     
//BP13K740 DD DSN=BP13.K740.MATUREBA.EC,DISP=OLD,                               
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L532 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L532A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------              
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------              
//STEP15   EXEC  PGM=BP13C713,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//   AMP=('BUFND=23')                                                           
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(32,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(32,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* PRINT SUMMARY BALLOT RESULT BY NT/FT/CAT                                    
//*---------------------------------------------------------------------        
//STEP16   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//P13FSUCC DD  DSN=&&P13SUCC,DISP=(OLD,PASS)                                    
//P13FUNSC DD  DSN=&&P13UNSUC,DISP=(OLD,PASS)                                   
//PRIOFMT  DD  DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT42F001 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                            
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//SORTOUT  DD DSN=&&K010C,DISP=(,PASS),                                         
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP18    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010C,DISP=(OLD,DELETE)                                    
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING              
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K019.TENDER.EC,DISP=SHR                                  
//SORTOUT  DD DSN=&&K010D,DISP=(,PASS),                                         
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP20    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010D,DISP=(OLD,DELETE)                                    
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*--------------------------------------------------------------------         
//STEP21  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F525.APPL,DISP=SHR                                      
//OUTPUT1   DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*------------------------------------------------------------------           
//* SORT BY NT/FT/RANDOM-NO                                                     
//*------------------------------------------------------------------           
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SORTOUT  DD DSN=&&F740NTFT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION REPORT BEFORE BALLOTING                                   
//*------------------------------------------------------------------           
//STEP24   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740NTFT,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L525B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L525C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*                                                                             
//****************************************************************              
//*            END OF BP13ADP3                                                  
//****************************************************************              
