//BP13A50D JOB (BP13P),'BP13A50D',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071,SCHENV=HICPU                                            
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : EXTRACT SBF REQUEST FOR HHTY CHECK                    *         
//* THIS JOB ONLY SCHEDULE TO RUN DURING SBFS LAUNCHING PERIOD        *         
//* BP13A50A - EXTRACT SBFS CASES FOR HOUSEHOLD CHECK                 *         
//* BP13A501 - SMS, RSL, DEBARMENT CHECK                              *         
//* BP13A533 - TENAT PRIORITY SCHEME                                  *         
//* BP13A534 - PARENT/CHILD                                           *         
//* BP13A535 - 5YR                                                    *         
//* BP13A737 - 5YR                                                    *         
//*                                                                   *         
//*===================================================================*         
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP135171 RJE1 20140210 TO CATER FOR DB2 UPGRADE                             
//* BP135340 IL5  20140529 TO ADD STEP TO LIMIT RECORDS WRITTEN                 
//*                        TO BP13F558. ADD HICPU PARAM                         
//* BP135748 IL5  20150504 TO SHIFT PGM BP13CF86 TO 1ST STEP                    
//* BP135944 SMR2 20150910 REVISE CONDITION OMITTING FTS WITH HH=G              
//*                        TO CHECK FOR ELDERLY TAG                             
//* BP136852 SMR2 20170623 CATER FOR SALES-MODE = 'ROF'                         
//* BP137208 YCH2 20180212 TO INCLUDE BP17F100                                  
//* BP138285 AM25 20200518 ADD SYSIN FOR PGM BP13CF92                           
//* BP138565 LSB1 20210128 ADD FT=1F                                            
//*-------------------------------------------------------------------          
//*---------------------------------------------------------------------        
//* ==>  ISSUE COND CODE 99 IF THERE IS NO EXERCISE GOING ON                    
//*-------------------------------------------------------------------          
//STEP00A  EXEC PGM=BP13CF86,COND=(0,NE)                                        
//BP13K764 DD DSN=BP13.K764.SALES,DISP=SHR                                      
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F757 DD DSN=&&BP13F757,DISP=(,PASS),                                      
//            UNIT=(SYSDA,2),                                                   
//            DCB=(LRECL=4000,RECFM=FB),                                        
//            SPACE=(CYL,(80,70),RLSE)                                          
//BP13LF86 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* STEP0  :  TO DELETE SEQ. DATASET                                            
//*-------------------------------------------------------------------*         
//STEP00B  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FF01.SALES.DEMAND')                                             
     DEL ('BP13.F500.SEQUENCE.BP13A50D')                                        
     DEL ('BP13.F558.UPGOCCP.BP13A50D')                                         
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//*  DELETE AND DEFINE BP13K730 - SBFS REQUEST FILE                             
//*---------------------------------------------------------------------        
//STEP01A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.BLANK.CHAR500,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K730.MATURERQ.SBF) CLUSTER PURGE                             
         DEF CL (NAME(BP13.K730.MATURERQ.SBF)          -                        
                 CYL(8 5)                             -                         
                 UNIQUE                                -                        
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SPEED                                 -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K730.MATURERQ.SBF.DATA)    -                        
                 KEYS(8 122)                           -                        
                 RECSZ(500 500)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K730.MATURERQ.SBF)                                    
//*---------------------------------------------------------------------        
//* DEFINE SBFS OCCUP FILE BP13K825                                             
//*---------------------------------------------------------------------        
//STEP01B  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.BLANK.CHAR200,DISP=SHR                                   
//SYSIN    DD *                                                                 
   DEL (BP13.K825.REQOCCP.SBF) CLUSTER PURGE                                    
  DEF CLUSTER                                          -                        
        (NAME(BP13.K825.REQOCCP.SBF)                   -                        
        SHR(2,3)                                       -                        
        KEYS(17 0)                                     -                        
        CYL(8 3)                                      -                         
        RECSZ(200 200)                                 -                        
        FREESPACE(30 30)                               -                        
        CISZ(4096)                                     -                        
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K825.REQOCCP.SBF.DATA))             -                        
      INDEX                                            -                        
        (NAME(BP13.K825.REQOCCP.SBF.INDEX))                                     
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K825.REQOCCP.SBF)                                        
//*------------------------------------------------------------------           
//* DEFINE SBFB ADDRESS FILE                                                    
//*------------------------------------------------------------------           
//STEP01C  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.BLANK.CHAR250,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
         DEL 'BP13.K830.ADDR.SBF' CL PURGE                                      
         DEF CL (NAME(BP13.K830.ADDR.SBF)              -                        
                 CYL(4 3)                           -                           
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K830.ADDR.SBF.DATA)             -                   
                 KEYS(9 0)                             -                        
                 RECSZ(250 250)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K830.ADDR.SBF)                                        
//*-----------------------------------------------------------------            
//STEP01D  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.BLANK.CHAR200,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
          DEL 'BP13.K857.EMAIL.SBF' CL PURGE                                    
          DEF CLUSTER                                -                          
              (NAME(BP13.K857.EMAIL.SBF)           -                            
              CYL(5 5)                           -                              
              UNIQUE                                 -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K857.EMAIL.SBF.DATA)      -                            
              KEYS(8 0)                              -                          
              RECSZ(200 200)                       -                            
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K857.EMAIL.SBF.INDEX) -                                
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K857.EMAIL.SBF)                                          
//*-------------------------------------------------------------------*         
//*  CREATE THE REQUESTS FOR SBF FORM BP13K757                                  
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13C023,COND=(0,NE)                                        
//BP13F757 DD DSN=&&BP13F757,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ.SBF,DISP=OLD,                              
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K830 DD DSN=BP13.K830.ADDR.SBF,DISP=OLD,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K825 DD DSN=BP13.K825.REQOCCP.SBF,DISP=OLD,                               
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K857 DD DSN=BP13.K857.EMAIL.SBF,DISP=OLD,                                 
//             AMP=('BUFND=4','BUFNI=8')                                        
//BE01F500 DD DSN=&&BE01F500,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=50,RECFM=FB),                                          
//            SPACE=(CYL,(10,10),RLSE)                                          
//BP13L023 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORT OUT SBFS CASES                                                         
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F730MAT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP.SBF,DISP=SHR,                               
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&OCCP,DISP=(NEW,PASS),                                       
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A,107,2,A,9,9,A),FORMAT=CH                                 
    INCLUDE COND=(1,8,CH,GT,C'        ')                                        
//*-------------------------------------------------------------------*         
//* TO UPDATE LESSEE CHECK                                            *         
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=BP13C834,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730MAT,DISP=(OLD,DELETE)                                   
//BP13F825 DD DSN=&&OCCP,DISP=(OLD,PASS)                                        
//BP13K825 DD DSN=BP13.K825.REQOCCP.SBF,DISP=SHR,                               
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L834 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE HOUSEHOLD                                                  *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC  PGM=BP13CF43,COND=(0,NE)                                       
//BP13K730 DD  DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//P13K730A DD  DSN=BP13.K730.MATURERQ.SBF,DISP=OLD                              
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* FOR MATURE NT - WITHOUT HHTY                                                
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F500.SEQUENCE.BP13A50D,DISP=(NEW,CATLG),                 
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(32,20),RLSE),DATACLAS=MULTIVOL                        
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(116,1,CH,EQ,C' ')                                             
//*-------------------------------------------------------------------*         
//* FOR MATURE NT - WITHOUT HHTY                                                
//*-------------------------------------------------------------------*         
//STEP10A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.BP13A50D,DISP=SHR                          
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(32,20),RLSE),DATACLAS=MULTIVOL                        
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP10B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP.SBF,DISP=SHR,                               
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F825LESS,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(131,1,CH,EQ,C'Y')                                             
//*-------------------------------------------------------------------*         
//* OUTREC BP13F558 FROM BP13K825 REQUEST OCCUPIER FILE               *         
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE               *         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"       *         
//*-------------------------------------------------------------------*         
//STEP10C  EXEC  PGM=BP13C059,COND=(0,NE)                                       
//BP13F500 DD  DSN=&&BP13F500,DISP=(OLD,DELETE)                                 
//BP13F825 DD  DSN=&&F825LESS,DISP=(OLD,PASS)                                   
//BP13F558 DD  DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=(NEW,CATLG),                 
//            DCB=(BLKSIZE=27600,LRECL=600,RECFM=FB),                           
//            SPACE=(CYL,(200,30),RLSE),DATACLAS=MULTIVOL                       
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT BY NRIC SEQUENCE                                                       
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=SHR                           
//SORTOUT  DD DSN=&&P13F558B,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27600,LRECL=600,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST, SOC-OCCUPIER FILE                             
//* MATCH NRIC IN SMS FILE, IF MATCH UPDATE AS UPGRADER                         
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13U706,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&P13F558B,DISP=(OLD,PASS)                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=&&P13F558C,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//BP13F559 DD DUMMY                                                             
//BP13L706 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* MATCH NRIC WITH TRANSFER HISTORY ONLY FOR TRF-APPLN-DTE  AFTER              
//* '19970901' OR FOR DIVORCE CASES TRF-APPLN-DATE > 19970709                   
//* AND TRF-SCH-ACC IS NOT THE SAME AS SMS-SCH-ACC                              
//* AS ONE NRIC TRANSFER, ALL FOUR LESSEE WILL BE FOUND IN TRANSFER             
//* BP13.F558.UPGOCCP CONTAINS TRANSFER HISTORY DATA                            
//*-----------------------------------------------------------------            
//STEP14   EXEC PGM=BP13C619,COND=(0,NE)                                        
//BB13K510 DD DSN=BB13.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB13K500 DD DSN=BB13.K500.HISTORY,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F558 DD DSN=&&P13F558C,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=OLD                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT IN SCH-ACC-NI ORDER FOR RETRIEVING FLAT TYPE FROM PBF                  
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=SHR                           
//SORTOUT  DD DSN=&&F558SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(101,11,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* FLAT TYPE  IS NOT AVAILABLE IN SMS                                          
//* BASED ON THE SCHEME ACCOUNT FR SMS EXTRACT FLAT TYPE FROM PBF               
//*---------------------------------------------------------------------        
//STEP16   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F558 DD DSN=&&F558SORT,DISP=(OLD,DELETE)                                  
//BP13OUT  DD DSN=&&F558PBF,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C742) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT BP13F558 IN NRIC ORDER, IF ONE NRIC WITH MULTIPLE SMS REC          
//* PROGRAM WILL SELECT THE BIGGER FLAT TYPE                                    
//*---------------------------------------------------------------------        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558PBF,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F558SMSF,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SELECT THE LEAST PRIORITY IF FOUND TO HAVE MULTIPLE SMS RECORDS             
//* SELECT BIGGER FLAT TYPE, DIRENT PURCHASE OVER OPEN MARKET                   
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=BP13C734,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558SMSF,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558FLAT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT BY NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558FLAT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558NRIC,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                            
//* MATCH NRIC IN RESALE FILE, IF MATCH UPDATE AS UPGRADER                      
//*---------------------------------------------------------------------        
//STEP20   EXEC PGM=BP13U702,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&F558NRIC,DISP=(OLD,PASS)                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=OLD                           
//BP13L702 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT THE HOUSEHOLD TYPE = 'G' UPGRADER CASES                            
//*              HOUSEHOLD TYPE = '3' UPGRADER 3 ROOM CASES                     
//*              SMS-SALE-TYPE 2B CASE, NH BUT HAVE TO PAY $618 REGN-FEE        
//* SORT THE HOUSEHOLD TYPE IN DECENDING ORDER                                  
//*---------------------------------------------------------------------        
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=SHR                           
//SORTOUT  DD DSN=&&F558UPG,DISP=(,PASS),                                       
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A,93,1,D),FORMAT=CH                                         
   SUM FIELDS=NONE                                                              
   INCLUDE COND=(93,1,CH,EQ,C'G',OR,93,1,CH,EQ,C'3',OR,                         
                 61,2,CH,EQ,C'2B')                                              
//*---------------------------------------------------------------------        
//* SORT BY REGISTRATION NUMBER SEQUENCE - NON-MATURE NT                        
//* BP13.F500.SEQUENCE - ALREADY UPDATED WITH DATE-BALLOT & WAIT-TIME &         
//*                    - NUM-UNSUCC-REQUEST                                     
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.BP13A50D,DISP=SHR                          
//SORTOUT  DD DSN=&&F500SEQ,DISP=(,PASS),                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(32,20),RLSE)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* MATCH BY COL 123-130, FOR MATURE-NT - REF-NO (6 BYTES) = 2 SPACES           
//*                       FOR NON-MATURE-NT - REGN-NO (8 BYTES)                 
//* UPDATE HOUSEHOLD TYPE TO REQUEST FILE = 'G' (UPGRADER),                     
//*                                         'H' (NEW HOUSEHOLD)                 
//*---------------------------------------------------------------------        
//STEP23   EXEC PGM=BP13U707,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&F558UPG,DISP=(OLD,PASS)                                     
//BP13F500 DD DSN=&&F500SEQ,DISP=(OLD,PASS)                                     
//BP13F510 DD DSN=BP13.F500.SEQUENCE.BP13A50D,DISP=OLD                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*===================================================================*         
//STEP24   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.F500.SEQUENCE.BP13A50D,DISP=SHR                          
//OUTPUT   DD DSN=BP13.K730.MATURERQ.SBF,DISP=OLD                               
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT) OFILE(OUTPUT) REPLACE                                  
//*===============================================================              
//*===================================================================*         
//* JOB TO KEEP PRE-E INFOR DATA : SMS, RSL, TRF, SLS, MAMS                     
//* FILE : BP13K558                                                             
//* JOB TO KEEP PRE-E INFOR DATA : RDB, PIDB                                    
//* FILE : BP13K716                                                             
//*===================================================================*         
//*---------------------------------------------------------------------        
//* OUTREC SOC OCCUPIER TO BP13F716 FORMAT FOR MATCHING RDB BY HDBREF           
//* OUTPUT FOUDN WITH DP FLAT FOUND IN SMS                                      
//*---------------------------------------------------------------------        
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=SHR                           
//SORTOUT  DD DSN=&&F716OCC,DISP=(NEW,PASS),                                    
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   OUTREC FIELDS=(1,8,9,9,33X,101,11,45X,53,8,236X)                             
//*---------------------------------------------------------------------        
//* EXTRACT OCCUPIER RECORDS FROM RDB DATABASE BASED ON NRIC                    
//* ONE NRIC MAY HAVE A FEW RECORDS WITH DIFF SHC-ACC-NO IN RDB                 
//*---------------------------------------------------------------------        
//STEP31   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716OCC,DISP=(OLD,PASS)                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=&&F716Q749,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//BP13L749 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q749) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* DROP DUPLICATE RECORDS                                                      
//*---------------------------------------------------------------------        
//STEP31A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716Q749,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716UQ49,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,350,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* SORT BY SCH-ACC-NO                                                          
//*---------------------------------------------------------------------        
//STEP31B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716UQ49,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716ST49,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSIN   DD *                                                                  
   SORT FIELDS=(51,11,A),FORMAT=CH                                              
//*-------------------------------------------------------------------*         
//* USE SCH-ACC-NO TO GET ESTATE AND FLAT TYPE FROM PBF FILE AND      *         
//*     USE ESTATE TO GET FROM BM06K510 ON NEW TOWN RESIDE            *         
//*-------------------------------------------------------------------*         
//STEP31C  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716ST49,DISP=(OLD,PASS)                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=BP13.F716.DPREQ749.A50D,DISP=OLD                              
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*---------------------------------------------------------------------        
//* SORTOUT IN REGNO/NRIC SEQUENCE BP13F558                                     
//*---------------------------------------------------------------------        
//STEP31D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=SHR                           
//SORTOUT  DD DSN=&&F558ST31,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=600,RECFM=FB),                               
//            SPACE=(CYL,(150,30),RLSE)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
     SUM FIELDS=NONE                                                            
//*---------------------------------------------------------------------        
//* SORTOUT IN REGNO/NRIC SEQUENCE BP13F716                                     
//*---------------------------------------------------------------------        
//STEP31E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.DPREQ749.A50D,DISP=SHR                              
//SORTOUT  DD DSN=&&F716REGN,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(150,30),RLSE)                                         
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,17,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//* OUTPUT BP13F716 IS SCH-ACC-NO = SMS-SCH-ACC-NO                              
//*---------------------------------------------------------------------        
//STEP31F  EXEC PGM=BP13C767,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558ST31,DISP=(OLD,PASS)                                    
//BP13F716 DD DSN=&&F716REGN,DISP=(OLD,PASS)                                    
//P13F716A DD DSN=BP13.F716.DPREQ750.A50D,DISP=OLD                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------05130004
//* DROP DUPLICATE RECORDS                                              05140004
//*---------------------------------------------------------------------05150004
//STEP32  EXEC SORT,COND=(0,NE)                                         05160004
//SORTIN   DD DSN=BP13.BLANK.CHAR350,DISP=SHR                           05170004
//         DD DSN=BP13.F716.DPREQ750.A50D,DISP=SHR                      05180004
//SORTOUT  DD DSN=&&F716ST80,DISP=(,PASS),                              05190004
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=350),                          05200004
//        SPACE=(CYL,(10,12),RLSE)                                      05210004
//SYSIN   DD *                                                          05220004
     SORT FIELDS=(1,17,A),FORMAT=CH                                     05230004
     SUM FIELDS=NONE                                                    05240004
//*-------------------------------------------------------------------- 05250004
//*  DELETE/DEFINE BP13K716                                             05260004
//*-------------------------------------------------------------------- 05270004
//STEP33    EXEC PGM=IDCAMS,COND=(0,NE)                                 05280004
//SYSPRINT  DD SYSOUT=*                                                 05290004
//INPUT1   DD DSN=&&F716ST80,DISP=(OLD,PASS)                            05300004
//SYSIN     DD  *                                                       05310004
          DEL (BP13.K716.DPREQ750.A50D) CL PURGE                        05320004
          DEF CLUSTER                                -                  05330004
              (NAME(BP13.K716.DPREQ750.A50D)         -                  05340004
              CYL(20 10)                           -                    05350004
              DATACLAS(MULTIVOL)                     -                  05360004
              STORCLAS(PRODRLS)                      -                  05370004
              LOG(NONE)                              -                  05380004
              SPEED                                  -                  05390004
              UNIQUE                                 -                  05400004
              SHR(2 3))                              -                  05410004
              DATA                                   -                  05420004
              (NAME(BP13.K716.DPREQ750.A50D.DATA)    -                  05430004
              KEYS(17 0)                             -                  05440004
              RECSZ(350 350)                         -                  05450004
              CISZ(4096)                             -                  05460004
              FSPC(10 10))                           -                  05470004
              INDEX                                  -                  05480004
              (NAME(BP13.K716.DPREQ750.A50D.INDEX)   -                  05490004
              CISZ(4096))                                               05500004
      IF MAXCC = 0  THEN                             -                  05510004
         REPRO IFILE(INPUT1)                         -                  05520004
              ODS(BP13.K716.DPREQ750.A50D)                              05530004
//*---------------------------------------------------------------------        
//* SORT BY NRIC SEQUENCE                                                       
//*---------------------------------------------------------------------        
//STEP34   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.BLANK.CHAR600,DISP=SHR                           05170004
//         DD DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=SHR                           
//SORTOUT  DD DSN=&&F558K558,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27600,LRECL=600,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
     SUM FIELDS=NONE                                                    05240004
//*---------------------------------------------------------------------05870004
//* DEFINE BP13K558                                                     05880004
//*---------------------------------------------------------------------05890004
//STEP35    EXEC PGM=IDCAMS,COND=(0,NE)                                 05900004
//SYSPRINT  DD SYSOUT=*                                                 05910004
//INPUT     DD DSN=&&F558K558,DISP=(OLD,PASS)                           05920004
//SYSIN    DD *                                                         05930004
  DEL (BP13.K558.BP13DPRE.A50D) CLUSTER PURGE                           05940004
  DEF CLUSTER                                          -                05950004
        (NAME(BP13.K558.BP13DPRE.A50D)                 -                05960004
        SHR(2,3)                                       -                05970004
        KEYS(17 0)                                     -                05980004
        CYL(20 20)                                     -                05990004
        RECSZ(600 600)                                 -                06000004
        FREESPACE(10 10)                               -                06010004
        CISZ(4096)                                     -                06020004
        STORCLAS(PRODRLS)                              -                06030004
        LOG(NONE)                                      -                06040004
        IXD                                            -                06050004
        UNQ)                                           -                06060004
      DATA                                             -                06070004
        (NAME(BP13.K558.BP13DPRE.A50D.DATA))           -                06080004
      INDEX                                            -                06090004
        (NAME(BP13.K558.BP13DPRE.A50D.INDEX))                           06100004
      IF LASTCC = 0 THEN                               -                06110004
        REPRO IFILE(INPUT)                             -                06120004
              ODS(BP13.K558.BP13DPRE.A50D)                              06130004
//*---------------------------------------------------------------------        
//* DAILY FILE USE TO DETERMINE CDE-HOSUEHOLD                                   
//* OMIT SA FLAT                                                                
//*---------------------------------------------------------------------        
//STEP36   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.BP13A50D,DISP=SHR                          
//SORTOUT  DD DSN=&&BP13F713,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN   DD *                                                                  
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(116,1,CH,EQ,C'G',AND,                                        
                   211,2,CH,NE,C'1A')                                           
//*---------------------------------------------------------------------        
//* CHECK FOR CASES WITH FT/2T                                                  
//* TAG COL 462 TAG 'Y' FOR FT-2T CASES                                         
//*---------------------------------------------------------------------        
//STEP37   EXEC PGM=BP13CD82,COND=(0,NE)                                        
//BP13F595 DD DSN=&&BP13F713,DISP=(OLD,PASS)                                    
//BP13K558 DD DSN=BP13.K558.BP13DPRE.A50D,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K716 DD DSN=BP13.K716.DPREQ750.A50D,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=&&F730CD82,DISP=(,PASS),                                      
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(80,30),RLSE)                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* COL 475 = 'Y' FOR FT-2T CASES, COL 116 = G UPGRADER                         
//*-------------------------------------------------------------------*         
//STEP37A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CD82,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730CY83,DISP=(,PASS),                                      
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
  INCLUDE COND=(116,1,CH,EQ,C'G',AND,                                           
                475,1,CH,EQ,C'Y')                                               
//*--------------------------------------------------------------------*        
//* BYPASS NON-CITIZEN SPOUSE                                                   
//*--------------------------------------------------------------------*        
//STEP37B  EXEC PGM=BP13CY83,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F730CY83,DISP=(OLD,PASS)                                    
//BP13K828 DD DSN=BP13.K825.REQOCCP.SBF,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=&&F595NONC,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500)                                          
//BP13LY83 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------*        
//* BYPASS SPOUSE FOUND AS OCCUPIER IN THE DP FLAT                              
//* RDB ROLE 023(LESSEE), 024(CO-LESSEE) 025(OCCUPIER)                          
//*--------------------------------------------------------------------*        
//STEP37C  EXEC PGM=BP13CY84,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595NONC,DISP=(OLD,PASS)                                    
//BP13K828 DD DSN=BP13.K825.REQOCCP.SBF,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K716 DD DSN=BP13.K716.DPREQ750.A50D,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=BP13.F730.FT2T.A50D,DISP=OLD                                  
//BP13LY84 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*------------------------------------------------------------------           
//* EXTRACT FT2T CASES FOR UPDATNG BASED ON TAG IN POS 462                      
//*------------------------------------------------------------------           
//STEP38   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.FT2T.A50D,DISP=SHR                                  
//SORTOUT  DD DSN=&&F730FT2T,DISP=(NEW,PASS),                                   
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                                 
//          SPACE=(CYL,(50,15),RLSE)                                            
//SYSIN    DD  *                                                                
       SORT FIELDS=(123,8,A),FORMAT=CH                                          
       INCLUDE COND=(475,1,CH,EQ,C'Y')                                          
//*---------------------------------------------------------------------        
//* GENERATE FT2T REPORT SHOW SMS, RSL, TRF, MAM & SLS INFOR                    
//* UPDATE K730-NUM-FT2T = Y                                                    
//*---------------------------------------------------------------------        
//STEP39   EXEC PGM=BP13CF92,COND=(0,NE)                                        
//BP13F205 DD DSN=BP13.F205.FT2T,DISP=SHR                                       
//BP13F730 DD DSN=&&F730FT2T,DISP=(OLD,DELETE)                                  
//BP13K558 DD DSN=BP13.K558.BP13DPRE.A50D,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13LF92 DD DSN=BP13.LF92.BP13CF92.A50D,DISP=OLD                              
//SYSIN    DD *                                                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------    00130010
//* INCLUDE 2-ROOM FLEXI & RF CASES                                     00130010
//*-----------------------------------------------------------------    00130010
//STEP40   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.BP13A50D,DISP=SHR                          
//SORTOUT  DD DSN=&&F730RM2,DISP=(,PASS),                                       
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                    
//            SPACE=(CYL,(80,30),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,123,8,A),FORMAT=CH                                     
    INCLUDE COND=(211,2,CH,EQ,C'2F',OR,211,2,CH,EQ,C'RF',OR,                    
                  211,2,CH,EQ,C'1F')                                            
//*------------------------------------------------------------------           
//* VALIDATE ELDERLY SCHEME                                                     
//* UPDATE K730-ELDERLY-TAG( COL 210) = F (FAMILY), S (SINGLE), N (NO)  00130010
//* OUTPUT BP13F740 IS FROM BP13K730                                    00130010
//* - UPDATED WITH PPO, ELDERLY-TAG, FT2T-TAG                           00130010
//*------------------------------------------------------------------           
//STEP41   EXEC PGM=BP13CZ2G,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730RM2,DISP=(OLD,PASS)                                     
//BP17F100 DD DUMMY                                                             
//BP13K825 DD DSN=BP13.K825.REQOCCP.SBF,DISP=SHR,                               
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR,                              
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13F740 DD DSN=&&F730ELD,DISP=(,PASS),                                       
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(80,30),RLSE)                                          
//P13LZ2GA DD DUMMY                                                             
//P13LZ2GB DD DUMMY                                                             
//P13LZ2GC DD DUMMY                                                             
//P13LZ2GD DD DUMMY                                                             
//P13LZ2GE DD DUMMY                                                             
//P13LZ2GF DD DUMMY                                                             
//P13LZ2GG DD DUMMY                                                             
//P13LZ2GH DD DUMMY                                                             
//P13LZ2GI DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------    00130010
//* INCLUDE ELDERLY-TAG ( COL 210) = F (FAMILY), S (SINGLE)             00130010
//*-----------------------------------------------------------------    00130010
//STEP42   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730ELD,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=BP13.F730.ELDERLY.A50D,DISP=OLD                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(210,1,CH,EQ,C'F',OR,                                          
                  210,1,CH,EQ,C'S')                                             
//*---------------------------------------------------------------------00050000
//* BP13F558 - AFTER MACTHED WITH SMS/RSL/TRF/DEBARMENT                 00060000
//*---------------------------------------------------------------------00070000
//STEP43   EXEC SORT,COND=(0,NE)                                        00080000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=SHR                   00090009
//SORTOUT  DD DSN=&&F558MRGE,DISP=(,PASS),                              00100000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   00110000
//            UNIT=SYSDA,SPACE=(CYL,(20,30),RLSE)                       00120000
//SYSIN    DD *                                                         00130000
   SORT FIELDS=(1,17,A),FORMAT=CH                                       00140002
//*-----------------------------------------------------------------    00130010
//* INCLUDE ELDERLY-TAG ( COL 210) = F (FAMILY), S (SINGLE)             00130010
//* INCLUDE HHTY=G, FT2T NOT = Y                                        00130010
//*-----------------------------------------------------------------    00130010
//STEP44   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.ELDERLY.A50D,DISP=SHR                               
//SORTOUT  DD DSN=&&F730ST,DISP=(,PASS),                                        
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(80,30),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(116,1,CH,EQ,C'G',AND,                                         
                  475,1,CH,NE,C'Y')                                             
//*---------------------------------------------------------------------00170000
//* DETERMINE N-TIMER                                                   00180000
//* DEBARMENT CODE 33 OR > 2 DP FLATS                                   00180000
//* UPDATE N-TIMER = Y/N TO BP13K730                                    00180000
//*---------------------------------------------------------------------00200000
//STEP45   EXEC PGM=BP13CZ2H,COND=(0,NE)                                00210000
//BP13F730 DD DSN=&&F730ST,DISP=(OLD,PASS)                              00230000
//BP13F558 DD DSN=&&F558MRGE,DISP=(OLD,PASS)                            00230000
//BP13K558 DD DSN=BP13.K558.BP13DPRE.A50D,DISP=SHR                      00470014
//P13F558O DD DSN=BP13.F558.UPGOCCP.BP13A50D,DISP=OLD,                  00320009
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   00330000
//            SPACE=(CYL,(20,30),RLSE)                                  00340005
//BP13TMP  DD DSN=BP13.F558.NTIMER.TEMP.A50D,DISP=OLD,                  00320009
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=0),                        00330000
//            SPACE=(CYL,(20,30),RLSE)                                  00340005
//P13LZ2HA DD DUMMY                                                     00360008
//P13LZ2HB DD DUMMY                                                     00360008
//P13LZ2HC DD DUMMY                                                     00360008
//P13LZ2HD DD DUMMY                                                     00360008
//P13LZ2HE DD DUMMY                                                     00360008
//P13LZ2HF DD DUMMY                                                     00360008
//SYSPRINT DD SYSOUT=*                                                  00370000
//SYSDBG   DD SYSOUT=*                                                  00380000
//SYSDBOUT DD SYSOUT=*                                                  00390000
//SYSOUT   DD SYSOUT=*                                                  00400000
//*---------------------------------------------------------------------00050000
//* BP13F558 - AFTER MACTHED WITH SMS/RSL/TRF/DEBARMENT                 00060000
//*---------------------------------------------------------------------00070000
//STEP46   EXEC SORT,COND=(0,NE)                                        00080000
//SORTIN   DD DSN=BP13.F558.NTIMER.TEMP.A50D,DISP=SHR                   00090009
//SORTOUT  DD DSN=&&BP13TEMP,DISP=(,PASS),                              00100000
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=0),                        00110000
//            UNIT=SYSDA,SPACE=(CYL,(20,30),RLSE)                       00120000
//SYSIN    DD *                                                         00130000
   SORT FIELDS=(18,3,A,1,8,A),FORMAT=CH                                 00140002
   SUM FIELDS=NONE                                                      00140002
//*---------------------------------------------------------------------00420014
//* UPDATE N-TIMER TO BP13K730                                          00430014
//*---------------------------------------------------------------------00440014
//STEP47   EXEC PGM=BP13CZ2I,COND=(0,NE)                                00450014
//BP13TMP  DD DSN=&&BP13TEMP,DISP=(OLD,PASS)                            00460014
//BP13K558 DD DSN=BP13.K558.BP13DPRE.A50D,DISP=SHR,                     00470014
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR,                      00480014
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13LZ2IA DD DUMMY                                                     00490014
//P13LZ2IB DD DUMMY                                                     00490014
//P13LZ2IC DD DUMMY                                                     00490014
//P13LZ2ID DD DUMMY                                                     00490014
//P13LZ2IE DD DUMMY                                                     00490014
//P13LZ2IF DD DUMMY                                                     00490014
//SYSPRINT DD SYSOUT=*                                                  00500014
//SYSDBG   DD SYSOUT=*                                                  00510014
//SYSDBOUT DD SYSOUT=*                                                  00520014
//SYSOUT   DD SYSOUT=*                                                  00530014
//*------------------------------------------------------------------           
//* SORT CASES ACCORDING TO SALES MODE / BALLOT DATE / NT / FT                  
//*------------------------------------------------------------------           
//STEP50   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13F730,DISP=(NEW,PASS),                                   
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                                 
//          SPACE=(CYL,(50,15),RLSE)                                            
//SYSIN    DD  *                                                                
       SORT FIELDS=(376,3,A,334,6,A,187,3,A,211,2,A),FORMAT=CH                  
       INCLUDE COND=(376,3,CH,EQ,C'BTO',OR,376,3,CH,EQ,C'SBF',OR,               
                     376,3,CH,EQ,C'ROF')                                        
//*------------------------------------------------------------------           
//* SORT CASES ACCORDING TO SALES MODE / BALLOT DATE / NT / FT                  
//*------------------------------------------------------------------           
//STEP51   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F730A,DISP=(NEW,PASS),                                   
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                                 
//          SPACE=(CYL,(50,15),RLSE)                                            
//SYSIN    DD  *                                                                
       SORT FIELDS=(376,3,A,334,6,A,187,3,A,211,2,A),FORMAT=CH                  
       OMIT COND=(213,3,CH,EQ,C'FTS',AND,116,1,CH,EQ,C'G',AND,                  
                 (210,1,CH,EQ,C' ',OR,210,1,CH,EQ,C'N'))                        
//*------------------------------------------------------------------           
//* TO GENERATE RECORD PER SALES MODE / BALLOT DATE / NT / FT                   
//* WITH THE TOTAL NUMBER OF FIRST TIMER AND ITS PERCENTAGE                     
//*------------------------------------------------------------------           
//STEP52   EXEC PGM=BP13CF44,COND=(0,NE)                                        
//BP13F730 DD DSN=&&P13F730A,DISP=(OLD,DELETE)                                  
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13FF01 DD DSN=BP13.FF01.SALES.DEMAND,DISP=(NEW,CATLG),                      
//          DCB=(BLKSIZE=0,LRECL=100,RECFM=FB),                                 
//          SPACE=(CYL,(1,5),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*===================================================================*         
//* BACKUP    BP13.FF01.SALES.DEMAND                                            
//*===================================================================*         
//STEP53   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.FF01.SALES.DEMAND,DISP=SHR                               
//OUTPUT   DD DSN=BP13.FF01.SALES.DEMAND.BKUP(+1),DISP=(NEW,CATLG),             
//          DCB=(BLKSIZE=0,LRECL=100,RECFM=FB),                                 
//          SPACE=(CYL,(1,5),RLSE)                                              
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT) OFILE(OUTPUT)                                          
