//BP13A21C JOB (BP13P),'BP13A21C',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*********************************************************************         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR CREATING REPORT FOR CANCELLED CASE WITH APPOINTMENT         
//*********************************************************************         
//*CHG REF  OIC   DATE    DESCRIPTION                                           
//*-------- ---- -------- ------------------------------------------            
//*BP135404 ESA1 09062014 NEW JCL FOR UPDATING OF PARENT FLAT TYPE              
//*BP135468 KAM4 18112014 CATER TO SUPPORT THE REVISION IN BP13C24V             
//******************************************************************            
//*          VERIFY FILES BEFORE DAILY PRODUCTION RUN                           
//*-----------------------------------------------------------------            
//STEP01 EXEC  PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD  DSN=BP13.K288.CANBKAPT,DISP=OLD                                  
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 11  FROM BP13M289 PANEL                                 
//*--------------------------------------------------------------------         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13F205,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'CA')                                              
/*                                                                              
//*****************************************************************             
//* SORT OUT ALL CANCELLED CASES WITH APPOINTMENT IN BP13K800                   
//*****************************************************************             
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                            
//             SPACE=(CYL,(100,50),RLSE)                                        
//SYSIN    DD  *                                                                
        SORT FIELDS=(4,8,A),FORMAT=CH                                           
        INCLUDE COND=(1,1,CH,EQ,C'C')                                           
//*--------------------------------------------------------------------*        
//*  TO CREATE RECORD IN BP13K288                                               
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C24V,COND=(0,NE)                                        
//BP13F205 DD DSN=&&BP13F205,DISP=(SHR,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F800 DD DSN=&&BP13F800,DISP=(SHR,PASS)                                    
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                    
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                              
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K288 DD DSN=BP13.K288.CANBKAPT,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC WTOG,COND=(0,NE)                                                
   ----> ############################################                           
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13A21C                             
   ---->    PLEASE OPEN BP13K288.                                               
   ----> ############################################                           
