//BP13M726  JOB (BP13P),'BP13M726',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*====================================================================         
//* RUN ON 17TH OF THE MONTH                                                    
//* 1)PRINT 2ND REMINDER LETTER FOR OUTSTANDING PAYMENTS/ARREARS                
//*====================================================================         
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP135171 RJE1 20140211 TO CATER FOR DB2 UPGRADE                             
//*-------------------------------------------------------------------          
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*-----------------------------------------------------------------            
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.KD76.ARREARS,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY                           (MA&B TEAM)                        
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13S,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------    00050004
//* LOAN LETTER  (MA&B)                                                 00060004
//*-----------------------------------------------------------------    00070004
//PRT02    EXEC PGM=IEBGENER                                            00080004
//SYSUT1   DD *                                                         00090004
$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13D4,END;                            00100004
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1B                           00110004
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00120004
//SYSPRINT DD SYSOUT=*                                                  00130004
//SYSIN    DD DUMMY                                                     00131004
//*                                                                     00132004
//*-------------------------------------------------------------------* 00050004
//* BACKUP BP13KD76                                                     00060004
//*-------------------------------------------------------------------* 00070004
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KD76.ARREARS,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.FD76.ARREARS,DISP=OLD                                    
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-------------------------------------------------------------------*         
//* SORT BP13KD00 BY REGN NO., AMT-ARR-INSTAL > 0                               
//*-------------------------------------------------------------------*         
//STEP02 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=BP13.KD76.ARREARS,DISP=SHR,                                  
//          AMP=('BUFND=8','BUFNI=4')                                           
//SORTOUT   DD DSN=&&BP13FD76,DISP=(,PASS),                                     
//          UNIT=SYSDA,SPACE=(CYL,(200,50),RLSE),                               
//          DCB=(BLKSIZE=0,LRECL=300,RECFM=FB)                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
/*                                                                              
//*-------------------------------------------------------------------*         
//*  PRINT 2ND REMINDER LETTER AND CONTROL REPORT                               
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00390002
//BP13FD76 DD  DSN=&&BP13FD76,DISP=(OLD,PASS)                                   
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13KD76 DD  DSN=BP13.KD76.ARREARS,DISP=SHR,                                  
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//AC15K010 DD  DSN=AC15.K010.MASTER,DISP=SHR,                                   
//             AMP=('BUFND=8','BUFNI=4')                                        
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//P13FD76A DD  DSN=BP13.FD76.ARREARS.DELETE,DISP=OLD                            
//BP13LC53 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//BP13PC53 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSOUT   DD SYSOUT=*                                                  00570002
//SYSTSPRT DD SYSOUT=*                                                  00580002
//SYSPRINT DD SYSOUT=*                                                  00590002
//SYSDBG   DD SYSOUT=*                                                  00600002
//SYSDBOUT DD SYSOUT=*                                                  00610002
//SYSTSIN  DD *                                                         00620002
     DSN SYSTEM(DSN)                                                    00630002
     RUN PROGRAM(BP13CC53) PLAN(BP13PCC) -                              00640002
         LIB('BP13.BATCH.LOADCOB')                                      00650002
     END                                                                00660002
