//BP13ARE7  JOB (BP13P),'BP13ARE7',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//* FOR BTO RUN USING BP13C777                                                  
//* THIS JCL TO COMPUTE MCPS QUOTA FOR 200% FLAT SUPPLY                         
//*---------------------------------------------------------------------        
//* THIS JCL COMBINE BP13A509, BP13ABAL AND BP13A522 TOGETHER                   
//* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                 
//* STEP1A-1F ADJUST PA ETHNIC MAX ALLOWANCE TAKEN BY GRO - BP13A509            
//* STEP2A-2D ADJUST BAL GRO QUOTA TO PA AFTER PIGEONHOLING OFGRO               
//* STEP03-04 COMPUTE NO OF RESIDENT AND NON-RESIDENT                           
//* STEP05-07 COMPUTE FLAT QUOAT FOR RESIDENT AND NON-RESIDENT                  
//* STEP08    PRINT REPORT FOR RESIDENT SCHEME                                  
//*                                                                             
//* LATEST CHANGE - 05022002 - COMMENT OUT STEP1B DUE TO SWAP OF GRO            
//*                            AND PRO PIGEONHOLING                             
//**********************************************************************        
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP131064 CKK  20010925 DETERMINE THE RESIDENT QUOTA FOR PA CASES            
//* BP132360 CKK  20030725 TO CREATE ALTERNATE KEY FOR BP13K740                 
//* BP132546 YCH  11062004 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                
//* BP132596 PGS  17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E           
//* BP132693 CKK  12052005 TO REMOVE DEFINATION OF K740 ALT KEY                 
//* BP132929 IL5  06032008 TO UPDATE DATASET FROM R1 TO R01                     
//* BP133511 IL5  11022009 TO ADD STEPS TO RECALCULATE REQ-NH AND               
//*                        REQ-UG IN BP13K712                                   
//* BP133913 IL5  25052010 REMOVE UNUSED REPORTS                                
//* BP134688 IL5  25102012 OMIT UNSHORTLISTED GRO RECORDS FROM                  
//*                        PUBLIC ROUND                                         
//* BP134718 SMR2 04122012 EXCLUDE UNSUCCESSFUL MGP RECORD FROM                 
//*                        PUBLIC ROUND SHORTLISTING                            
//* BP134782 IL5  14022013 ADD PROGRAM BP13CF78 TO COMPUTE PPS                  
//*                        FLAT QUOTA                                           
//* BP134861 EAA1 30042013 EXPAND BP13K010 TO 600                               
//* BP135231 IL5  15022013 REMOVE PROGRAM BP13C545 (REPLACED WITH               
//*                        BP13CF78)                                            
//* BP135458 SMR2 04082014 EXPAND BP13K712 TO 350                               
//* BP136096 IL5  13012016 REMOVE ELDERLY APPLICATIONS FROM INPUT               
//*                        TO BP13C54A                                          
//* BP138301 AM25 09072020 REMOVE DJDE                                          
//* BP139411 AM25 07122022 ADD SYSIN FOR BP13CF78                               
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*===============================================================              
//*---------------------------------------------------------------------        
//* FOR MATURE NT                                                               
//* SORT UNSUCC PRIORITY AND PUBLIC CASES FOR PA PIGEONHOLONG                   
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.ARE7,DISP=OLD,                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=29000),                           
//            SPACE=(CYL,(10,5))                                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.ARE2.R01,DISP=OLD,                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=29000),                           
//            SPACE=(CYL,(10,5))                                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,213,3,CH,NE,C'GRO',AND,                 
                 245,1,CH,EQ,C' ')                                              
//*--------------------------------------------------------------------------   
//* DEFINE BP13K010                                                     -----   
//*--------------------------------------------------------------------------   
//STEP04A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F010.TENDER.ARE2,DISP=SHR                                
//SORTOUT  DD DSN=&&TEMP1,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(TRK,(10,5),RLSE)                                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* TO DELETE & REDEFINE BP13K010                                       00020004
//*---------------------------------------------------------------------        
//STEP04B  EXEC PGM=IDCAMS,COND=(0,NE)                                  00030000
//SYSPRINT DD SYSOUT=*                                                  00040000
//INPUT    DD DSN=&&TEMP1,DISP=(OLD,PASS)                                       
//SYSIN    DD *                                                         00050000
  DEL (BP13.K010.TENDER) CLUSTER PURGE                                  001     
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K010.TENDER)                             -             001   
        SHAREOPTIONS(2,3)                              -                  001   
        KEYS(5 0)                                      -                  001   
        CYL(1 1)                                       -                  001   
        RECSZ(600 600)                                 -                  001   
        FREESPACE(10 10)                               -                  001   
        CISZ(4096)                                     -                  001   
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                  001   
        UNQ)                                           -                  001   
      DATA                                             -                      00
        (NAME(BP13.K010.TENDER.DATA))                       -             001   
      INDEX                                            -                      00
        (NAME(BP13.K010.TENDER.INDEX))                                    001   
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K010.TENDER)                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* CREATE/DEFINE BP13K712 FLAT NHH/UPG FILE                                    
//*---------------------------------------------------------------------        
//STEP05A   EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR350,DISP=SHR                                  
//SYSIN     DD  *                                                               
          DEL (BP13.K712.FLATNHUG) CL PURGE                                     
          DEF CLUSTER                                -                          
              (NAME(BP13.K712.FLATNHUG)              -                          
              CYL(1 1)                               -                          
              UNIQUE                                 -                          
              STORCLAS(PRODRLS)               -                                 
              LOG(NONE)                       -                                 
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K712.FLATNHUG.DATA)         -                          
              KEYS(10 0)                             -                          
              RECSZ(350 350)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K712.FLATNHUG.INDEX))                                  
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K712.FLATNHUG)                                           
//*---------------------------------------------------------------------        
//* SORT THE BALLOT FILE FOR PA SCHEME (NEW TOWN, FLAT TYPE, ALLOC SCH)         
//*---------------------------------------------------------------------        
//STEP05B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.ARE2.R01,DISP=SHR                          
//SORTOUT  DD DSN=&&F520NHUG,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(187,3,A,211,2,A,213,3,A),FORMAT=CH                            
     INCLUDE COND=(((210,1,CH,EQ,C'N',OR,210,1,CH,EQ,C' '),AND,                 
                    211,2,CH,EQ,C'2F'),OR,                                      
                    211,1,CH,NE,C'2')                                           
//*                                                                             
//*---------------------------------------------------------------------        
//* COMPUTE NO OF TOTAL REQUESTS FOR NHH/UPG FOR PA ONLY                        
//*---------------------------------------------------------------------        
//STEP05C  EXEC PGM=BP13C54A,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13F520 DD DSN=&&F520NHUG,DISP=(OLD,PASS)                                    
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* COMPUTE NO OF UNITS SET ASIDE FOR NHH/UPG FOR PRIORITY SCHEME               
//* COMPUTE FOR PA SCHEME                                                       
//*---------------------------------------------------------------------        
//STEP5D   EXEC PGM=BP13CF78,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
300                                                                             
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*  PREPARE FILE TO RUN BP13AMP2                                               
//*--------------------------------------------------------------------         
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F740.MATUREBA.ARE2.R01,DISP=SHR                          
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//****************************************************************              
//* END BP13ARE7                                                                
//****************************************************************              
