//BP13D212 JOB (BP13P),'BP13D212',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* DETERMINE BOOKED/NOT BOOK ON APPLICANT SCHEDULED APPOINTMENT FOR            
//* THE DAY.                                                                    
//* UPDATE NON-SELECTION COUNT BP13KH10                                         
//* UPDATE BOOK-STATUS TO BALLOT LOG BP13K595                                   
//*---------------------------------------------------------------------        
//* BP133367 LSB 080708 - NEW JCL                                               
//* BP133367 JB8 100309 - NEW LETTERS                                           
//* BP133555 LSB 080409 - ADD RE-SELECTION BP13CH17                             
//* BP133601 LSB 300409 - RQ NO BOOKING DATE                                    
//* BP133601 LSB 020609 - ADD BP13F268 TO GET RANGE OF Q-NO FOR THE DAY         
//* BP133771 JB8 040110 - TO CATER FOR SBF                                      
//* BP133881 JB8 140110 - TO CATER FOR COMBINE FLAT TYPE UNDER SBF              
//* BP133818 ZDD 130110 - TO ADD BP13CB82                                       
//* BP133737 JB8 220110 - NEW LETTER FOR BP13CH07                               
//* BP134174 LSB 280311 - DO NOT MATCH BY ETHNIC, MATCH BY QUEUE-NO             
//* BP134353 LSB 140911 - ADD BP13K813 TO BP13CH02                              
//* BP134388 LSB 141011 - HH=G,BOOK-ST=LS(WITHIN LIMIT), WS(OUTSIDE LIM)        
//* BP134712 SMR 071112 - TO ADD BP13CF70                                       
//* BP134716 ESA1230113 - TO ADD CP27K090 IN BP13CH07                           
//* BP135039 IMC 300913 - ADD NEW LETTERS IN BP13CH07                           
//* BP135040 ESA1041213 - TO CATER FOR FTS CANCELLATION LETTERS                 
//* BP135237 LSB 280214 - OMIT SA FOR CH07                                      
//* BP135252 IMC 210414 - ADD STEPS TO PRINT REC FROM BP13K310                  
//* BP136160 FNP 310316 - ADD NEW LETTERS IN BP13CH07                           
//* BP136467 FNP 061016 - ADD BP13CH3A FOR BP13K249 ELDERLY SBF CASES           
//* BP137206 LSB 080218 - UPDATE BF FOR ROF                                     
//* BP137377 LSB 250918 - BACKUP BP13KH10 TO TAPE                               
//* BP137718 LSB 210919 - ONCE NRIC BOOKED A FLAT, CANCEL OTHER APPLN           
//* BP138716 FP6 260421 - ADD BP13F915 FOR BP13CZ3E                             
//* BP138645 KR13150421 - TO ADD BP13CZ3M - GET CUST_ID FROM BE01C808           
//* BP139635 LJL 051023 - TO ADD BP13C51F - EXTRACT HFE FOR BOOKED CASES        
//* BP139635 LJL 171023 - TO ADD BP13CAD1 - TO CREATE FILE FOR SOC HFE          
//*                       STATUS UPDATE AFTER GETTING STATUS FROM HFE           
//* BP139635 LJL 201023 - TO ADD BP13CAD5 - TO PREPARE SOC FILE FOR HFE         
//*                       STATUS UPDATE AFTER READING BP13FECA FOR PP           
//* BP139635 LJL 201023 - TO ADD BP13CAD6 - TO UPDATE SOC MASTER FOR            
//*                       HFE'S NEW HFE STATUS                                  
//* BP139545 FKH2 20240130 - 1. TO AMEND STEP13 AND STEP30.                     
//*                          2. TO ADD STEP50 TO STEP53 FOR                     
//*                             NEW NON-SELECTION LETTERS.                      
//* BP139545 FKH2 20240220-  1. TO ADD STEP49A,STEP49B AND STEP49C              
//*                             FOR BACKUP FILES.                               
//*                          2. AMENDED STEP50 SORT INPUT AS THE                
//*                             BACKUP DATA FILE.                               
//* BP139545 SC54 20240221-  AMENDED STEP49A,STEP49B AND STEP49C.               
//*---------------------------------------------------------------------        
//*=================================================================            
//*  PRT01 : 1 COPY                      ALLOCATION SECTION                     
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//PRT02   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1B CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13I0,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1B                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT03   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1C CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13I1,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1C                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT04   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1D CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13I2,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1D                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT05   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1E CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13I3,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1E                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT06   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1F CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13I4,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1F                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT07   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1G CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13I5,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1G                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT08   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1H CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13I6,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1H                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT09   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1I CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13I7,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1I                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT10   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1J CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13IT,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1J                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT11   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1K CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13IU,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1K                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT12   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1L CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13IV,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1L                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT13   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1M CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13IW,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1M                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT14   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1N CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13IX,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1N                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT15   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1O CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP131B,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1O                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT16   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1P CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP131C,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1P                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT17   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1Q CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP131D,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1Q                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT18   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1R CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP131E,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1R                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT19   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1S CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP131F,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1S                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT20   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1T CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP131G,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1T                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT21   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1U CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP131J,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1U                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT22   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1V CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP131K,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1V                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//PRT23   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1W CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13I9,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1W                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT24   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1X CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138A,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1X                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT25   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1Y CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138B,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1Y                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT26   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1Z CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138C,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1Z                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT27   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALA1 CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138D,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALA1                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT28   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALA2 CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138E,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALA2                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT29   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALA3 CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138F,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALA3                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT30   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALA4 CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138G,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALA4                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT31   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALA5 CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138H,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALA5                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT32   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALA6 CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138I,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALA6                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT33   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALA7 CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138J,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALA7                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT34   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALA8 CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138K,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALA8                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT35   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALA9 CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138L,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALA9                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT36   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALA0 CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138M,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALA0                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT37   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAA CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138N,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAA                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT38   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAB CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138O,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAB                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT39   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAC CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138P,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAC                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT40   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAD CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138Q,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAD                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT41   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAE CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138R,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAE                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT42   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAF CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138S,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAF                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT43   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138T,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT44   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAH CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138U,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAH                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT45   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAI CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138V,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAI                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT46   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAJ CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138W,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAJ                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT47   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAK CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP138X,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAK                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT48   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAL CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP131S,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAL                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT49   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAM CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP131R,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAM                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT50   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAN CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13MD,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAN                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//PRT51   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAO CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13ME,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAO                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* INCLUDE BE/BTO/SBF WITH BOOKING APPOINTMENT (COL 509)                       
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(200,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(509,8,CH,NE,C'        ',AND,                                    
                785,6,CH,GE,C'200805',AND,                                      
                (924,3,CH,EQ,C'BE ',OR,                                         
                 924,3,CH,EQ,C'BTO',OR,                                         
                 924,3,CH,EQ,C'SBF'))                                           
//*-----------------------------------------------------------------            
//* MATCH DTE-BK-APPT FOR TODAY (DTE-CURRENT)                                   
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13CH02,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13F800A DD DSN=&&F800APPT,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(180,30),RLSE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BY MODE/DTE-BALLOT/NT/FT/BK-APPT DATE/QUEUE-NO                         
//* TAKE OUT SORTING BY CAT ON 28/3/2011                                        
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800APPT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F800.APPLN.BKDAY,DISP=OLD                                
//SYSIN   DD *                                                                  
   SORT FIELDS=(924,3,A,785,6,A,51,3,A,30,2,A,509,8,A,526,5,A),                 
              FORMAT=CH                                                         
//*-----------------------------------------------------------------            
//* OMIT REJECT FLAT CASES                                                      
//* SORT BY MODE/DTE-BALLOT/NT/FT/BK-APPT DATE/TIME                             
//* TAKE OUT SORTING BY CAT ON 28/3/2011                                        
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K268.REGN,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F268,DISP=(,PASS),                                      
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                                 
//         SPACE=(CYL,(150,20),RLSE)                                            
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,38,A,40,8,A,63,5,A),FORMAT=CH                                 
   INCLUDE COND=(94,1,CH,NE,C'Y',AND,                                           
                 (1,3,CH,EQ,C'BE ',OR,                                          
                  1,3,CH,EQ,C'BTO',OR,                                          
                  1,3,CH,EQ,C'SBF'))                                            
//*-----------------------------------------------------------------            
//* MATCH DTE-BK-APPT FOR TODAY (DTE-CURRENT)                                   
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=BP13CH06,COND=(0,NE)                                        
//BP13F268 DD DSN=&&BP13F268,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//P13F268A DD DSN=&&F268APPT,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                               
//            SPACE=(CYL,(130,20),RLSE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* DROP OUT OF QUENO SEQEUNCE                                                  
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=BP13CH05,COND=(0,NE)                                        
//BP13F268 DD DSN=&&F268APPT,DISP=(OLD,PASS)                                    
//P13F268A DD DSN=BP13.F268.REGN.BKDAY,DISP=OLD                                 
//P13F268B DD DSN=BP13.F268.REGN.BKDAY.DROP,DISP=OLD                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* INCLUDE BTO/WIS                                                             
//*-----------------------------------------------------------------            
//STEP07 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.K249.NT.FT,DISP=SHR                                      
//SORTOUT  DD DSN=&&F249BTO,DISP=(,PASS),                                       
//             UNIT=SYSDA,                                                      
//             DCB=(RECFM=FB,LRECL=450,BLKSIZE=0),                              
//             SPACE=(CYL,(80,5),RLSE)                                          
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,39,A),FORMAT=CH                                               
   INCLUDE COND=(30,3,CH,NE,C'SBF')                                             
//*-----------------------------------------------------------------            
//* INCLUDE SBF NON-2-ROOM FLEXI                                                
//*-----------------------------------------------------------------            
//STEP7A EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.K249.NT.FT,DISP=SHR                                      
//SORTOUT  DD DSN=&&F249SBF,DISP=(,PASS),                                       
//             UNIT=SYSDA,                                                      
//             DCB=(RECFM=FB,LRECL=450,BLKSIZE=0),                              
//             SPACE=(CYL,(50,5),RLSE)                                          
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,39,A),FORMAT=CH                                               
   INCLUDE COND=(30,3,CH,EQ,C'SBF',AND,                                         
                (21,6,CH,NE,C'SA    ',AND,                                      
                 21,6,CH,NE,C'2-ROOM'))                                         
//*-----------------------------------------------------------------            
//*  SORT K249 IN KEY-FLD ORDER                                                 
//*-----------------------------------------------------------------            
//STEP7B EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=&&F249BTO,DISP=(OLD,PASS)                                     
//         DD DSN=&&F249SBF,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F249CH03,DISP=(,PASS),                                      
//             UNIT=SYSDA,                                                      
//             DCB=(RECFM=FB,LRECL=450,BLKSIZE=0),                              
//             SPACE=(CYL,(50,5),RLSE)                                          
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,39,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* DEFINE K249 VSAM FILE FOR CH03 PROGRAM                                      
//*---------------------------------------------------------------------        
//STEP7C EXEC    PGM=IDCAMS                                                     
//INPUT1   DD  DSN=&&F249CH03,DISP=(OLD,PASS)                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL 'BP13.K249.CH03' CLUSTER PURGE                                    
          DEF CLUSTER                                -                          
              (NAME(BP13.K249.CH03)                  -                          
              CYL(8 5)                               -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K249.CH03.DATA) -                                      
              KEYS(39 0)                             -                          
              RECSZ(450 450)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K249.CH03.INDEX) -                                     
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K249.CH03)                                                 
//*-----------------------------------------------------------------            
//* INCLUDE SBF 20-ROOM FLEXI ( 2ROOM + EX SA)                                  
//*-----------------------------------------------------------------            
//STEP7D EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.K249.NT.FT,DISP=SHR                                      
//SORTOUT  DD DSN=&&F249RM2,DISP=(,PASS),                                       
//             UNIT=SYSDA,                                                      
//             DCB=(RECFM=FB,LRECL=450,BLKSIZE=0),                              
//             SPACE=(CYL,(10,5),RLSE)                                          
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,39,A),FORMAT=CH                                               
   INCLUDE COND=(30,3,CH,EQ,C'SBF',AND,                                         
                (21,6,CH,EQ,C'SA    ',OR,                                       
                 21,6,CH,EQ,C'2-ROOM'))                                         
//*-----------------------------------------------------------------            
//* CREATE NEW K249 FOR CH03 ( 2-ROOM FLEXI)                                    
//*-----------------------------------------------------------------            
//STEP07E  EXEC PGM=BP13CH3A,COND=(0,NE)                                        
//BP13F249 DD DSN=&&F249RM2,DISP=(OLD,DELETE)                                   
//BP13K249 DD DSN=BP13.K249.NT.FT,DISP=SHR                                      
//P13K249A DD DSN=BP13.K249.CH03,DISP=SHR                                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*------------------------------------------------------------------           
//* DETERMINE BOOKED/NOT-BOOK CASES                                             
//* COMPUTE NON-SELECTION COUNT                                                 
//*-----------------------------------------------------------------            
//STEP07F  EXEC PGM=BP13CH03,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F800 DD DSN=BP13.F800.APPLN.BKDAY,DISP=SHR                                
//BP13F268 DD DSN=BP13.F268.REGN.BKDAY,DISP=SHR                                 
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K249 DD DSN=BP13.K249.CH03,DISP=SHR                                       
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KH15 DD DSN=BP13.KH15.NOTBKREG,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K268 DD DSN=BP13.K268.REGN,DISP=SHR,                                      
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13FH15 DD DSN=BP13.FH15.NOTBKREG.BKDAY,DISP=OLD                             
//BP04F010 DD DSN=BP13.BP04.F010.DBRFTS,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//*  SORT BY REGN UPDATE DID NOT BOOK CASES                                     
//*------------------------------------------------------------------           
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FH15.NOTBKREG.BKDAY,DISP=SHR                             
//SORTOUT  DD DSN=&&BP13FH15,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                               
//            SPACE=(CYL,(150,20),RLSE)                                         
//SYSIN   DD *                                                                  
       SORT FIELDS=(55,8,A),FORMAT=CH                                           
//*-----------------------------------------------------------------            
//* UPDATE BOOK-STATUS TO BALLOT LOG BP13K595                                   
//* FIRST TIMER HOUSEHOLD = H, T                                                
//* LF = DID NOT BOOK WITHIN  LIMIT (FLAT QUOTA)                                
//* WF = DID NOT BOOK OUTSIDE LIMIT (FLAT QUOTA)                                
//* UPGRADER    HOUSEHOLD = G                                                   
//* LS = DID NOT BOOK WITHIN  LIMIT (FLAT QUOTA)                                
//* WS = DID NOT BOOK OUTSIDE LIMIT (FLAT QUOTA)                                
//* --------------------------------------------------------------              
//* UPGRADER    HOUSEHOLD = G                                                   
//* ------------------------------                                              
//* LF = DID NOT BOOK WITHIN  LIMIT (FLAT QUOTA)                                
//* WF = DID NOT BOOK OUTSIDE LIMIT (FLAT QUOTA)                                
//*-----------------------------------------------------------------            
//* -CODE FROM 201307 BTO/SBF                                                   
//* --------------------------------------------------------------              
//*             (FIRST TIMER)  (FT-2T)  (SECOND TIMER) (SINGLE)                 
//*               H/H   H/G    G/F  G/G    G/G           H/H (FTS/STS)          
//* --------------------------------------------------------------              
//* WITHIN LIMIT : LF   LG     LF    LG     LA           LB                     
//* OUTSIDE LIMIT: WF   WG     WF    WG     WA           WB                     
//* --------------------------------------------------------------              
//STEP09   EXEC PGM=BP13CH04,COND=(0,NE)                                        
//BP13FH15 DD DSN=&&BP13FH15,DISP=(OLD,PASS)                                    
//BP13K595 DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*------------------------------------------------------------------           
//*  SORT BY REGN UPDATE BOOK CASES                                             
//*------------------------------------------------------------------           
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F268.REGN.BKDAY,DISP=SHR                                 
//         DD DSN=BP13.F268.REGN.BKDAY.DROP,DISP=SHR                            
//SORTOUT  DD DSN=&&F268BOOK,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN   DD *                                                                  
       SORT FIELDS=(55,8,A),FORMAT=CH                                           
//*-----------------------------------------------------------------            
//* UPDATE BOOK-STATUS = BF TO BALLOT LOG BP13K595                              
//*-----------------------------------------------------------------            
//STEP11   EXEC PGM=BP13CH04,COND=(0,NE)                                        
//BP13FH15 DD DSN=&&F268BOOK,DISP=(OLD,PASS)                                    
//BP13K595 DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* SORT BY MODE/DTE-BALLOT/NT/FT/Q-NO                                          
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F800.APPLN.BKDAY,DISP=SHR                                
//SORTOUT  DD DSN=&&F800NT,DISP=(,PASS),                                        
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(924,3,A,785,6,A,51,3,A,30,2,A,526,5,A),FORMAT=CH                 
//*---------------------------------------------------------------------        
//* REPORT 1) BOOKED 2) NOT BOOKED FOR SELECTION TEAM TO CHECK DAILY            
//* BOOKING CASES AND NON-SELECTION COUNT                                       
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13CH09,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800NT,DISP=(OLD,PASS)                                      
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KH15 DD DSN=BP13.KH15.NOTBKREG,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KH11 DD DSN=BP13.KH15.NOTBKREG.PATH1,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K268 DD DSN=BP13.K268.REGN,DISP=SHR                                       
//BP13K261 DD DSN=BP13.K268.REGN.PATH1,DISP=SHR                                 
//P13LH09A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13LH09B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13LH09C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13LH09D DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT BY MODE/DTE-BALLOT/NT/FT/Q-NO                                          
//*---------------------------------------------------------------------        
//STEP13A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F800.APPLN.BKDAY,DISP=SHR                                
//SORTOUT  DD DSN=&&F800CH07,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(924,3,A,785,6,A,51,3,A,30,2,A,526,5,A),FORMAT=CH                 
  OMIT COND=(30,2,CH,EQ,C'1A',OR,                                               
             30,2,CH,EQ,C'2A')                                                  
//*---------------------------------------------------------------------        
//* PRINT NON-SELECTION LETTER FOR CASES DID NOT BOOK FLAT                      
//*---------------------------------------------------------------------        
//STEP14    EXEC PGM=BP13CH07,COND=(0,NE)                                       
//BP13F800  DD DSN=&&F800CH07,DISP=(OLD,PASS)                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K246  DD DSN=BP13.K246.SBF.LOOKUP,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KH15  DD DSN=BP13.KH15.NOTBKREG,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K060  DD DSN=BP13.K060.CODETAB,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KH11  DD DSN=BP13.KH15.NOTBKREG.PATH1,DISP=SHR,                           
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K022  DD DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K021  DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                             
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K024  DD DSN=BP13.K024.WISLAST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KH10  DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//CP27K090  DD DSN=CP27.K090.HOLIDAY,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13PH07A  DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                       
//P13PH07B  DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                       
//P13PH07C  DD SYSOUT=W,OUTPUT=(*.PRT04.FORMID),DEST=IOMW                       
//P13PH07D  DD SYSOUT=W,OUTPUT=(*.PRT05.FORMID),DEST=IOMW                       
//P13PH07E  DD SYSOUT=W,OUTPUT=(*.PRT06.FORMID),DEST=IOMW                       
//P13PH07F  DD SYSOUT=W,OUTPUT=(*.PRT07.FORMID),DEST=IOMW                       
//P13PH07G  DD SYSOUT=W,OUTPUT=(*.PRT08.FORMID),DEST=IOMW                       
//P13PH07H  DD SYSOUT=W,OUTPUT=(*.PRT09.FORMID),DEST=IOMW                       
//P13PH07I  DD SYSOUT=W,OUTPUT=(*.PRT10.FORMID),DEST=IOMW                       
//P13PH07J  DD SYSOUT=W,OUTPUT=(*.PRT11.FORMID),DEST=IOMW                       
//P13PH07K  DD SYSOUT=W,OUTPUT=(*.PRT12.FORMID),DEST=IOMW                       
//P13PH07L  DD SYSOUT=W,OUTPUT=(*.PRT13.FORMID),DEST=IOMW                       
//P13PH07M  DD SYSOUT=W,OUTPUT=(*.PRT14.FORMID),DEST=IOMW                       
//P13PH07N  DD SYSOUT=W,OUTPUT=(*.PRT15.FORMID),DEST=IOMW                       
//P13PH07O  DD SYSOUT=W,OUTPUT=(*.PRT16.FORMID),DEST=IOMW                       
//P13PH07P  DD SYSOUT=W,OUTPUT=(*.PRT17.FORMID),DEST=IOMW                       
//P13PH07Q  DD SYSOUT=W,OUTPUT=(*.PRT18.FORMID),DEST=IOMW                       
//P13PH07R  DD SYSOUT=W,OUTPUT=(*.PRT19.FORMID),DEST=IOMW                       
//P13PH07S  DD SYSOUT=W,OUTPUT=(*.PRT20.FORMID),DEST=IOMW                       
//P13PH07T  DD SYSOUT=W,OUTPUT=(*.PRT21.FORMID),DEST=IOMW                       
//P13PH07U  DD SYSOUT=W,OUTPUT=(*.PRT22.FORMID),DEST=IOMW                       
//P13PH07V  DD SYSOUT=W,OUTPUT=(*.PRT23.FORMID),DEST=IOMW                       
//P13PH07W  DD SYSOUT=W,OUTPUT=(*.PRT24.FORMID),DEST=IOMW                       
//P13PH07X  DD SYSOUT=W,OUTPUT=(*.PRT25.FORMID),DEST=IOMW                       
//P13PH07Y  DD SYSOUT=W,OUTPUT=(*.PRT26.FORMID),DEST=IOMW                       
//P13PH07Z  DD SYSOUT=W,OUTPUT=(*.PRT27.FORMID),DEST=IOMW                       
//P13PH071  DD SYSOUT=W,OUTPUT=(*.PRT28.FORMID),DEST=IOMW                       
//P13PH072  DD SYSOUT=W,OUTPUT=(*.PRT29.FORMID),DEST=IOMW                       
//P13PH073  DD SYSOUT=W,OUTPUT=(*.PRT30.FORMID),DEST=IOMW                       
//P13PH074  DD SYSOUT=W,OUTPUT=(*.PRT31.FORMID),DEST=IOMW                       
//P13PH075  DD SYSOUT=W,OUTPUT=(*.PRT32.FORMID),DEST=IOMW                       
//P13PH076  DD SYSOUT=W,OUTPUT=(*.PRT33.FORMID),DEST=IOMW                       
//P13PH077  DD SYSOUT=W,OUTPUT=(*.PRT34.FORMID),DEST=IOMW                       
//P13PH078  DD SYSOUT=W,OUTPUT=(*.PRT35.FORMID),DEST=IOMW                       
//P13PH079  DD SYSOUT=W,OUTPUT=(*.PRT36.FORMID),DEST=IOMW                       
//P13PH070  DD SYSOUT=W,OUTPUT=(*.PRT37.FORMID),DEST=IOMW                       
//P13PH7A1  DD SYSOUT=W,OUTPUT=(*.PRT38.FORMID),DEST=IOMW                       
//P13PH7A2  DD SYSOUT=W,OUTPUT=(*.PRT39.FORMID),DEST=IOMW                       
//P13PH7A3  DD SYSOUT=W,OUTPUT=(*.PRT40.FORMID),DEST=IOMW                       
//P13PH7A4  DD SYSOUT=W,OUTPUT=(*.PRT41.FORMID),DEST=IOMW                       
//P13PH7A5  DD SYSOUT=W,OUTPUT=(*.PRT42.FORMID),DEST=IOMW                       
//P13PH7A6  DD SYSOUT=W,OUTPUT=(*.PRT43.FORMID),DEST=IOMW                       
//P13PH7A7  DD SYSOUT=W,OUTPUT=(*.PRT44.FORMID),DEST=IOMW                       
//P13PH7A8  DD SYSOUT=W,OUTPUT=(*.PRT45.FORMID),DEST=IOMW                       
//P13PH7A9  DD SYSOUT=W,OUTPUT=(*.PRT46.FORMID),DEST=IOMW                       
//P13PH7A0  DD SYSOUT=W,OUTPUT=(*.PRT47.FORMID),DEST=IOMW                       
//P13PH7B1  DD SYSOUT=W,OUTPUT=(*.PRT48.FORMID),DEST=IOMW                       
//P13PH7B2  DD SYSOUT=W,OUTPUT=(*.PRT49.FORMID),DEST=IOMW                       
//P13PH7B3  DD SYSOUT=W,OUTPUT=(*.PRT50.FORMID),DEST=IOMW                       
//P13PH7B4  DD SYSOUT=W,OUTPUT=(*.PRT51.FORMID),DEST=IOMW                       
//BP13LH07  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//STEP15   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F310.TRANS,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13F310,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(30,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
   INCLUDE COND=(9,2,CH,EQ,C'AI',OR,9,2,CH,EQ,C'AS')                            
/*                                                                              
//*-----------------------------------------------------------------            
//* RE-SELCTION, DELETE NON-SELECTION COUNT                                     
//*-----------------------------------------------------------------            
//STEP16   EXEC PGM=BP13CH17,COND=(0,NE)                                        
//BP13F310 DD DSN=&&BP13F310,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR                                   
//BP13LH17 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* OUTPUT CANCELLED CASE, RQ, NO BK-APPOIMT, UPGRADER                          
//*---------------------------------------------------------------------        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F800QTR,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(120,20),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(259,2,CH,EQ,C'RQ',AND,                                          
                509,8,CH,EQ,C'        ',AND,                                    
                785,6,CH,GT,C'200811',AND,                                      
               (924,3,CH,EQ,C'BE ',OR,                                          
                924,3,CH,EQ,C'BTO',OR,                                          
                924,3,CH,EQ,C'SBF'))                                            
//*---------------------------------------------------------------------        
//* OUTPUT CANCELLED CASE, RQ, NO BK-APPOIMT, UPGRADER ( HIST FILE)             
//*---------------------------------------------------------------------        
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F800QTR,DISP=(MOD,PASS),                                    
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000,BLKSIZE=),                        
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(259,2,CH,EQ,C'RQ',AND,                                          
                509,8,CH,EQ,C'        ',AND,                                    
                785,6,CH,GT,C'200811',AND,                                      
               (924,3,CH,EQ,C'BE ',OR,                                          
                924,3,CH,EQ,C'BTO',OR,                                          
                924,3,CH,EQ,C'SBF'))                                            
  OUTREC FIELDS=(1,2000)                                                        
//*---------------------------------------------------------------------        
//* MERGE AND SORT BY REGN-NO                                                   
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800QTR,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F800BTO,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000,BLKSIZE=),                        
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* DECODE F800-NUM-NEW-TOWN WHEN SPACES USING K816-CDE-NT                      
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=BP13CH15,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800BTO,DISP=(OLD,PASS)                                     
//P13F800A DD DSN=&&F800CNLA,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(100,50),RLSE)                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BP13F800 W/OUT BOOKING APPOINTMENT AND NUM-STATUS = 'C'                
//* BY MODE/DTE-BALLOT/NT/FT/CAT/QUEUE-NO(4 BYTES)                              
//* OMIT BALLOT-HOUSEHOLD = G                                                   
//*-----------------------------------------------------------------            
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800CNLA,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F800NOBK,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(924,3,A,785,6,A,51,3,A,30,2,A,81,1,A,527,4,A),                  
              FORMAT=CH                                                         
//*   OMIT COND=(1421,1,CH,EQ,C'G')                                             
//*-----------------------------------------------------------------            
//* SORT BP13FH15 BY MODE/DTE-BALLOT/NT/FT/CAT/QUEUE-NO (4 BYTES)               
//*-----------------------------------------------------------------            
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FH15.NOTBKREG.BKDAY,DISP=SHR                             
//         DD DSN=BP13.F268.REGN.BKDAY,DISP=SHR                                 
//SORTOUT  DD DSN=&&FH15DAY,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                               
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,4,6,A,89,3,A,92,2,A,39,1,A,64,4,A),                       
              FORMAT=CH                                                         
   INCLUDE COND=(4,6,CH,GT,C'200811',AND,120,2,CH,NE,C'NE')                     
//*-----------------------------------------------------------------            
//* GET THE START AND END QUEUE NO FOR THE DAY FROM BP13FH15                    
//* BY MODE/DTE-BALLOT/NT/FT/CAT/QUEUE-NO                                       
//*-----------------------------------------------------------------            
//STEP23   EXEC PGM=BP13CH19,COND=(0,NE)                                        
//BP13FH15 DD DSN=&&FH15DAY,DISP=(OLD,PASS)                                     
//BP13FH17 DD DSN=&&BP13FH17,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=100,RECFM=FB),                               
//            SPACE=(CYL,(30,10),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BP13FH17 BY MODE/DTE-BALLOT/NT/FT/CAT                                  
//*-----------------------------------------------------------------            
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FH17,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FH17SUM,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=100,RECFM=FB),                               
//            SPACE=(CYL,(20,5),RLSE)                                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* MATCH BP13F800 AND BP17FH17                                                 
//* SELECT BP13F800 WITH THE RANGE OF START AND END QUEUE-NO                    
//*-----------------------------------------------------------------            
//STEP26   EXEC PGM=BP13CH20,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800NOBK,DISP=(OLD,PASS)                                    
//BP13FH17 DD DSN=&&FH17SUM,DISP=(OLD,PASS)                                     
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F800A DD DSN=&&F800SUM,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(80,30),RLSE)                                          
//BP13LH20 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BP13FH15 BY MODE/DTE-BALLOT/NT/FT/CAT/QUEUE-NO (4 BYTES)               
//* ONLY MATCH WITH NOT BOOK CASES                                              
//*-----------------------------------------------------------------            
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FH15.NOTBKREG.BKDAY,DISP=SHR                             
//SORTOUT  DD DSN=&&FH15CH16,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                               
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,4,6,A,89,3,A,92,2,A,39,1,A,64,4,A),                       
              FORMAT=CH                                                         
   INCLUDE COND=(4,6,CH,GT,C'200811',AND,120,2,CH,NE,C'NE')                     
//*-----------------------------------------------------------------            
//* UPDATE BP13F800/BP13K800 NUM-ALLOC-TAG BY FH15-NUM-ALLOC-TAG                
//* ADD NON-SELECTION IF WITHIN LIMIT                                           
//* UPDATE BOOK-STATUS IN BP13K595 BALLOT LOG                                   
//*-----------------------------------------------------------------            
//STEP27   EXEC PGM=BP13CH16,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800SUM,DISP=(OLD,PASS)                                     
//BP13FH15 DD DSN=&&FH15CH16,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F800A DD DSN=&&F800RQST,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//BP13LH16 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* FOR HOUSEHOLD = H, T                                                        
//* PRINT NON-SELECTION LETTER FOR RQ NO BK-APPOINTMENT CASE                    
//*---------------------------------------------------------------------        
//STEP28    EXEC PGM=BP13CH07,COND=(0,NE)                                       
//BP13F800  DD DSN=&&F800RQST,DISP=(OLD,PASS)                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K246  DD DSN=BP13.K246.SBF.LOOKUP,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KH15  DD DSN=BP13.KH15.NOTBKREG,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K060  DD DSN=BP13.K060.CODETAB,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KH11  DD DSN=BP13.KH15.NOTBKREG.PATH1,DISP=SHR,                           
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K022  DD DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K021  DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                             
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K024  DD DSN=BP13.K024.WISLAST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KH10  DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//CP27K090  DD DSN=CP27.K090.HOLIDAY,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13PH07A  DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                       
//P13PH07B  DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                       
//P13PH07C  DD SYSOUT=W,OUTPUT=(*.PRT04.FORMID),DEST=IOMW                       
//P13PH07D  DD SYSOUT=W,OUTPUT=(*.PRT05.FORMID),DEST=IOMW                       
//P13PH07E  DD SYSOUT=W,OUTPUT=(*.PRT06.FORMID),DEST=IOMW                       
//P13PH07F  DD SYSOUT=W,OUTPUT=(*.PRT07.FORMID),DEST=IOMW                       
//P13PH07G  DD SYSOUT=W,OUTPUT=(*.PRT08.FORMID),DEST=IOMW                       
//P13PH07H  DD SYSOUT=W,OUTPUT=(*.PRT09.FORMID),DEST=IOMW                       
//P13PH07I  DD SYSOUT=W,OUTPUT=(*.PRT10.FORMID),DEST=IOMW                       
//P13PH07J  DD SYSOUT=W,OUTPUT=(*.PRT11.FORMID),DEST=IOMW                       
//P13PH07K  DD SYSOUT=W,OUTPUT=(*.PRT12.FORMID),DEST=IOMW                       
//P13PH07L  DD SYSOUT=W,OUTPUT=(*.PRT13.FORMID),DEST=IOMW                       
//P13PH07M  DD SYSOUT=W,OUTPUT=(*.PRT14.FORMID),DEST=IOMW                       
//P13PH07N  DD SYSOUT=W,OUTPUT=(*.PRT15.FORMID),DEST=IOMW                       
//P13PH07O  DD SYSOUT=W,OUTPUT=(*.PRT16.FORMID),DEST=IOMW                       
//P13PH07P  DD SYSOUT=W,OUTPUT=(*.PRT17.FORMID),DEST=IOMW                       
//P13PH07Q  DD SYSOUT=W,OUTPUT=(*.PRT18.FORMID),DEST=IOMW                       
//P13PH07R  DD SYSOUT=W,OUTPUT=(*.PRT19.FORMID),DEST=IOMW                       
//P13PH07S  DD SYSOUT=W,OUTPUT=(*.PRT20.FORMID),DEST=IOMW                       
//P13PH07T  DD SYSOUT=W,OUTPUT=(*.PRT21.FORMID),DEST=IOMW                       
//P13PH07U  DD SYSOUT=W,OUTPUT=(*.PRT22.FORMID),DEST=IOMW                       
//P13PH07V  DD SYSOUT=W,OUTPUT=(*.PRT23.FORMID),DEST=IOMW                       
//P13PH07W  DD SYSOUT=W,OUTPUT=(*.PRT24.FORMID),DEST=IOMW                       
//P13PH07X  DD SYSOUT=W,OUTPUT=(*.PRT25.FORMID),DEST=IOMW                       
//P13PH07Y  DD SYSOUT=W,OUTPUT=(*.PRT26.FORMID),DEST=IOMW                       
//P13PH07Z  DD SYSOUT=W,OUTPUT=(*.PRT27.FORMID),DEST=IOMW                       
//P13PH071  DD SYSOUT=W,OUTPUT=(*.PRT28.FORMID),DEST=IOMW                       
//P13PH072  DD SYSOUT=W,OUTPUT=(*.PRT29.FORMID),DEST=IOMW                       
//P13PH073  DD SYSOUT=W,OUTPUT=(*.PRT30.FORMID),DEST=IOMW                       
//P13PH074  DD SYSOUT=W,OUTPUT=(*.PRT31.FORMID),DEST=IOMW                       
//P13PH075  DD SYSOUT=W,OUTPUT=(*.PRT32.FORMID),DEST=IOMW                       
//P13PH076  DD SYSOUT=W,OUTPUT=(*.PRT33.FORMID),DEST=IOMW                       
//P13PH077  DD SYSOUT=W,OUTPUT=(*.PRT34.FORMID),DEST=IOMW                       
//P13PH078  DD SYSOUT=W,OUTPUT=(*.PRT35.FORMID),DEST=IOMW                       
//P13PH079  DD SYSOUT=W,OUTPUT=(*.PRT36.FORMID),DEST=IOMW                       
//P13PH070  DD SYSOUT=W,OUTPUT=(*.PRT37.FORMID),DEST=IOMW                       
//P13PH7A1  DD SYSOUT=W,OUTPUT=(*.PRT38.FORMID),DEST=IOMW                       
//P13PH7A2  DD SYSOUT=W,OUTPUT=(*.PRT39.FORMID),DEST=IOMW                       
//P13PH7A3  DD SYSOUT=W,OUTPUT=(*.PRT40.FORMID),DEST=IOMW                       
//P13PH7A4  DD SYSOUT=W,OUTPUT=(*.PRT41.FORMID),DEST=IOMW                       
//P13PH7A5  DD SYSOUT=W,OUTPUT=(*.PRT42.FORMID),DEST=IOMW                       
//P13PH7A6  DD SYSOUT=W,OUTPUT=(*.PRT43.FORMID),DEST=IOMW                       
//P13PH7A7  DD SYSOUT=W,OUTPUT=(*.PRT44.FORMID),DEST=IOMW                       
//P13PH7A8  DD SYSOUT=W,OUTPUT=(*.PRT45.FORMID),DEST=IOMW                       
//P13PH7A9  DD SYSOUT=W,OUTPUT=(*.PRT46.FORMID),DEST=IOMW                       
//P13PH7A0  DD SYSOUT=W,OUTPUT=(*.PRT47.FORMID),DEST=IOMW                       
//P13PH7B1  DD SYSOUT=W,OUTPUT=(*.PRT48.FORMID),DEST=IOMW                       
//P13PH7B2  DD SYSOUT=W,OUTPUT=(*.PRT49.FORMID),DEST=IOMW                       
//P13PH7B3  DD SYSOUT=W,OUTPUT=(*.PRT50.FORMID),DEST=IOMW                       
//P13PH7B4  DD SYSOUT=W,OUTPUT=(*.PRT51.FORMID),DEST=IOMW                       
//BP13LH07  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//*  BACKUP BP13KH10 BEFORE DELETION                                            
//*---------------------------------------------------------------------        
//STEP29   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=BP13.FH10.NOTBKCNT.BACKUP(+1),DISP=(NEW,CATLG),               
//         UNIT=CART,LABEL=(1,SL),                                              
//         DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)                     
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* SORT RECORDS WITH VALUE ON DTE EXPIRY                                       
//*---------------------------------------------------------------------        
//STEP30 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.KH10.NOTBKCNT,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13FH10,DISP=(NEW,PASS),                                  
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
  INCLUDE COND=(76,2,CH,GE,C'01',OR,                                            
              1924,2,CH,GE,C'01',OR,                                            
              1946,2,CH,GE,C'01',OR,                                            
              1886,2,CH,GE,C'01')                                               
//*-----------------------------------------------------------------            
//* HOUSEKEEP BP13KH10 AND WRITE LOGS TO BP13KH12                               
//*-----------------------------------------------------------------            
//STEP31 EXEC PGM=BP13CB82,COND=(0,NE)                                          
//BP13FH10 DD DSN=&&BP13FH10,DISP=(OLD,DELETE)                                  
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KH12 DD DSN=BP13.KH12.NOTBKCNT.HISTORY,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//P13FH10A DD DSN=BP13.FH10.NOTBKCNT.DELETE,DISP=MOD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT RECORDS WITH VALUE ON DTE-DEBAR-EXPIRY                                 
//*---------------------------------------------------------------------        
//STEP32 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.KH25.REJBOOK,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FH25,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                                 
//         SPACE=(CYL,(130,30),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(29,8,CH,NE,C'        ')                                         
//*-----------------------------------------------------------------            
//* HOUSEKEEP BP13KH25 AND WRITE LOGS TO BP13KH27                               
//*-----------------------------------------------------------------            
//STEP33 EXEC PGM=BP13CF70,COND=(0,NE)                                          
//BP13FH25 DD DSN=&&BP13FH25,DISP=(OLD,DELETE)                                  
//BP13KH25 DD DSN=BP13.KH25.REJBOOK,DISP=SHR                                    
//BP13KH27 DD DSN=BP13.KH27.REJBOOK.HIST,DISP=SHR                               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* GET DEBAR-REF-NO, DEBAR PERIOD=12, REASON=FD                                
//* DEBAR BY NRIC ON FTS/2T NON-SELECTION COUNT=02                              
//*-----------------------------------------------------------------            
//STEP34   EXEC PGM=BP13CH24,COND=(0,NE)                                        
//BP04F010 DD DSN=BP13.BP04.F010.DBRFTS,DISP=SHR                                
//BP13K665 DD DSN=BP13.K665.DEBARREF.SOC,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP04FOUT DD DSN=&&P04F010,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=300),                                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* GET CUSTOMER ID FROM BE01C808                                               
//*-----------------------------------------------------------------            
//STEP34A  EXEC PGM=IKJEFT01,COND=(0,NE),DYNAMNBR=20                            
//P04F010  DD DSN=&&P04F010,DISP=(OLD,PASS)                                     
//BE01KMSG DD DSN=BE01.KMSG.ONLINE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BE01F003 DD DSN=BP13.BE01F003.CUSTUPD.LOGB,DISP=OLD                           
//BE01F903 DD DSN=BP13.BE01F903.INVUPD,DISP=OLD                                 
//BE01F400 DD DSN=BP13.BE01F400.SENDID.NEWID,DISP=OLD                           
//P04F010A DD DSN=&&P04F010A,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=300),                                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CZ3M) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* REPRO THE BP13 DATASET AND MOD TO BE01 DATASET                    *         
//*-------------------------------------------------------------------*         
//STEP34B   EXEC PGM=IDCAMS                                                     
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1  DD DSN=BP13.BE01F003.CUSTUPD.LOGB,DISP=SHR                            
//OUTPUT1 DD DSN=BE01.F003.CUSTUPD.LOGB.BP13,DISP=MOD                           
//INPUT2  DD DSN=BP13.BE01F903.INVUPD,DISP=SHR                                  
//OUTPUT2 DD DSN=BE01.F903.INVUPD.BP13,DISP=MOD                                 
//INPUT3  DD DSN=BP13.BE01F400.SENDID.NEWID,DISP=SHR                            
//OUTPUT3 DD DSN=BE01.F400.SENDID.NEWID.BP13,DISP=MOD                           
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
      REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                    
      REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                    
//*-----------------------------------------------------------------            
//* PASS FD RECORD TO DEBARMENT SYSTEM                                          
//*-----------------------------------------------------------------            
//STEP35   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P04F010A,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=BP13.F010.DEBAR.SOC,DISP=MOD                                  
//OUTPUT2  DD DSN=BP13.F010.DEBAR.SOC.ACCUM,DISP=MOD                            
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                       
//*--------------------------------------------------------------------         
//* SORT FROM DAILY TRANS FILE                                                  
//*---------------------------------------------------------------------        
//STEP36   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&F800K310,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(9,2,CH,EQ,C'NS')                                                
  OUTREC FIELDS=(3X,1,8,1989X)                                                  
//*-----------------------------------------------------------------            
//* EXTRACT FULL DATA FROM BP13K800                                             
//*-----------------------------------------------------------------            
//STEP37   EXEC PGM=BP13C39B,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800K310,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13FOUT DD DSN=&&F800EXT,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT BY MODE/DTE-BALLOT/NT/FT/Q-NO                                          
//*---------------------------------------------------------------------        
//STEP38   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800EXT,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F800EXTS,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(924,3,A,785,6,A,51,3,A,30,2,A,526,5,A),FORMAT=CH                 
//*---------------------------------------------------------------------        
//STEP39    EXEC PGM=BP13CH07,COND=(0,NE)                                       
//BP13F800  DD DSN=&&F800EXTS,DISP=(OLD,PASS)                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K246  DD DSN=BP13.K246.SBF.LOOKUP,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KH15  DD DSN=BP13.KH15.NOTBKREG,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K060  DD DSN=BP13.K060.CODETAB,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KH11  DD DSN=BP13.KH15.NOTBKREG.PATH1,DISP=SHR,                           
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K022  DD DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K021  DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                             
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K024  DD DSN=BP13.K024.WISLAST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KH10  DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//CP27K090  DD DSN=CP27.K090.HOLIDAY,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13PH07A  DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                       
//P13PH07B  DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                       
//P13PH07C  DD SYSOUT=W,OUTPUT=(*.PRT04.FORMID),DEST=IOMW                       
//P13PH07D  DD SYSOUT=W,OUTPUT=(*.PRT05.FORMID),DEST=IOMW                       
//P13PH07E  DD SYSOUT=W,OUTPUT=(*.PRT06.FORMID),DEST=IOMW                       
//P13PH07F  DD SYSOUT=W,OUTPUT=(*.PRT07.FORMID),DEST=IOMW                       
//P13PH07G  DD SYSOUT=W,OUTPUT=(*.PRT08.FORMID),DEST=IOMW                       
//P13PH07H  DD SYSOUT=W,OUTPUT=(*.PRT09.FORMID),DEST=IOMW                       
//P13PH07I  DD SYSOUT=W,OUTPUT=(*.PRT10.FORMID),DEST=IOMW                       
//P13PH07J  DD SYSOUT=W,OUTPUT=(*.PRT11.FORMID),DEST=IOMW                       
//P13PH07K  DD SYSOUT=W,OUTPUT=(*.PRT12.FORMID),DEST=IOMW                       
//P13PH07L  DD SYSOUT=W,OUTPUT=(*.PRT13.FORMID),DEST=IOMW                       
//P13PH07M  DD SYSOUT=W,OUTPUT=(*.PRT14.FORMID),DEST=IOMW                       
//P13PH07N  DD SYSOUT=W,OUTPUT=(*.PRT15.FORMID),DEST=IOMW                       
//P13PH07O  DD SYSOUT=W,OUTPUT=(*.PRT16.FORMID),DEST=IOMW                       
//P13PH07P  DD SYSOUT=W,OUTPUT=(*.PRT17.FORMID),DEST=IOMW                       
//P13PH07Q  DD SYSOUT=W,OUTPUT=(*.PRT18.FORMID),DEST=IOMW                       
//P13PH07R  DD SYSOUT=W,OUTPUT=(*.PRT19.FORMID),DEST=IOMW                       
//P13PH07S  DD SYSOUT=W,OUTPUT=(*.PRT20.FORMID),DEST=IOMW                       
//P13PH07T  DD SYSOUT=W,OUTPUT=(*.PRT21.FORMID),DEST=IOMW                       
//P13PH07U  DD SYSOUT=W,OUTPUT=(*.PRT22.FORMID),DEST=IOMW                       
//P13PH07V  DD SYSOUT=W,OUTPUT=(*.PRT23.FORMID),DEST=IOMW                       
//P13PH07W  DD SYSOUT=W,OUTPUT=(*.PRT24.FORMID),DEST=IOMW                       
//P13PH07X  DD SYSOUT=W,OUTPUT=(*.PRT25.FORMID),DEST=IOMW                       
//P13PH07Y  DD SYSOUT=W,OUTPUT=(*.PRT26.FORMID),DEST=IOMW                       
//P13PH07Z  DD SYSOUT=W,OUTPUT=(*.PRT27.FORMID),DEST=IOMW                       
//P13PH071  DD SYSOUT=W,OUTPUT=(*.PRT28.FORMID),DEST=IOMW                       
//P13PH072  DD SYSOUT=W,OUTPUT=(*.PRT29.FORMID),DEST=IOMW                       
//P13PH073  DD SYSOUT=W,OUTPUT=(*.PRT30.FORMID),DEST=IOMW                       
//P13PH074  DD SYSOUT=W,OUTPUT=(*.PRT31.FORMID),DEST=IOMW                       
//P13PH075  DD SYSOUT=W,OUTPUT=(*.PRT32.FORMID),DEST=IOMW                       
//P13PH076  DD SYSOUT=W,OUTPUT=(*.PRT33.FORMID),DEST=IOMW                       
//P13PH077  DD SYSOUT=W,OUTPUT=(*.PRT34.FORMID),DEST=IOMW                       
//P13PH078  DD SYSOUT=W,OUTPUT=(*.PRT35.FORMID),DEST=IOMW                       
//P13PH079  DD SYSOUT=W,OUTPUT=(*.PRT36.FORMID),DEST=IOMW                       
//P13PH070  DD SYSOUT=W,OUTPUT=(*.PRT37.FORMID),DEST=IOMW                       
//P13PH7A1  DD SYSOUT=W,OUTPUT=(*.PRT38.FORMID),DEST=IOMW                       
//P13PH7A2  DD SYSOUT=W,OUTPUT=(*.PRT39.FORMID),DEST=IOMW                       
//P13PH7A3  DD SYSOUT=W,OUTPUT=(*.PRT40.FORMID),DEST=IOMW                       
//P13PH7A4  DD SYSOUT=W,OUTPUT=(*.PRT41.FORMID),DEST=IOMW                       
//P13PH7A5  DD SYSOUT=W,OUTPUT=(*.PRT42.FORMID),DEST=IOMW                       
//P13PH7A6  DD SYSOUT=W,OUTPUT=(*.PRT43.FORMID),DEST=IOMW                       
//P13PH7A7  DD SYSOUT=W,OUTPUT=(*.PRT44.FORMID),DEST=IOMW                       
//P13PH7A8  DD SYSOUT=W,OUTPUT=(*.PRT45.FORMID),DEST=IOMW                       
//P13PH7A9  DD SYSOUT=W,OUTPUT=(*.PRT46.FORMID),DEST=IOMW                       
//P13PH7A0  DD SYSOUT=W,OUTPUT=(*.PRT47.FORMID),DEST=IOMW                       
//P13PH7B1  DD SYSOUT=W,OUTPUT=(*.PRT48.FORMID),DEST=IOMW                       
//P13PH7B2  DD SYSOUT=W,OUTPUT=(*.PRT49.FORMID),DEST=IOMW                       
//P13PH7B3  DD SYSOUT=W,OUTPUT=(*.PRT50.FORMID),DEST=IOMW                       
//P13PH7B4  DD SYSOUT=W,OUTPUT=(*.PRT51.FORMID),DEST=IOMW                       
//BP13LH07  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* INCLUDE ROF CASES AND NOT REJECTED CASE                                     
//*-----------------------------------------------------------------            
//STEP40   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K268.REGN,DISP=SHR                                       
//SORTOUT  DD DSN=&&F268ROF,DISP=(,PASS),                                       
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                                 
//         SPACE=(CYL,(50,20),RLSE)                                             
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,38,A,40,8,A,63,5,A),FORMAT=CH                                 
   INCLUDE COND=(94,1,CH,NE,C'Y',AND,                                           
                  1,3,CH,EQ,C'ROF')                                             
//*-----------------------------------------------------------------            
//* MATCH DTE-BK-APPT FOR TODAY (DTE-CURRENT)                                   
//*-----------------------------------------------------------------            
//STEP41   EXEC PGM=BP13CH06,COND=(0,NE)                                        
//BP13F268 DD DSN=&&F268ROF,DISP=(OLD,PASS)                                     
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//P13F268A DD DSN=&&F268AROF,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                               
//            SPACE=(CYL,(30,20),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* UPDATE BOOK-STATUS = BF FOR ROF                                             
//*-----------------------------------------------------------------            
//STEP42   EXEC PGM=BP13CH04,COND=(0,NE)                                        
//BP13FH15 DD DSN=&&F268AROF,DISP=(OLD,PASS)                                    
//BP13K595 DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT OUT BOOKED CASES                                                       
//*-----------------------------------------------------------------            
//STEP43   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&F310BOOK,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,20),SPACE=(CYL,(10,10),RLSE),                         
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,10,A),FORMAT=CH                                                
  INCLUDE COND=(9,2,CH,EQ,C'AI',OR,                                             
                9,2,CH,EQ,C'AS')                                                
//*--------------------------------------------------------------------         
//* ONCE BOOKED, CANCEL OTHER APPLCATION                                        
//*-----------------------------------------------------------------            
//STEP44   EXEC  PGM=BP13CZ3E,COND=(0,NE)                                       
//BP13F310 DD DSN=&&F310BOOK,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F915 DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                   
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
//*---------------------------------------------------------------------        
//STEP45   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=BP13.F800.APPLN.MAYBTO.BKAPPT,DISP=SHR                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=((((509,8,ZD,EQ,DATE1P+1),OR,                                    
                  (1580,8,ZD,EQ,DATE1P+1)),OR,                                  
                 ((509,8,ZD,EQ,DATE1P+2),OR,                                    
                  (1580,8,ZD,EQ,DATE1P+2)),OR,                                  
                 ((509,8,ZD,EQ,DATE1P+3),OR,                                    
                  (1580,8,ZD,EQ,DATE1P+3)),OR,                                  
                 ((509,8,ZD,EQ,DATE1P+4),OR,                                    
                  (1580,8,ZD,EQ,DATE1P+4)),OR,                                  
                 ((509,8,ZD,EQ,DATE1P+5),OR,                                    
                  (1580,8,ZD,EQ,DATE1P+5)),OR,                                  
                 ((509,8,ZD,EQ,DATE1P+6),OR,                                    
                  (1580,8,ZD,EQ,DATE1P+6))),AND,                                
                (785,6,CH,EQ,C'202305'))                                        
//*------------------------------------------------------------------           
//* SORT FOR BOOKED FLATS, IE SCHEME-ACCT > 00000                               
//*------------------------------------------------------------------           
//STEP046  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F800.APPLN.MAYBTO.BKAPPT,DISP=SHR                        
//SORTOUT  DD DSN=&&F800MCPS,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(30,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=2000)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(509,8,A,1580,8,A,1,8,A),FORMAT=CH                                
  INCLUDE COND=(1270,3,CH,EQ,C'PP ')                                            
//*-------------------------------------------------------------------*         
//* EXTRACT FLAT_ELGBTY_CASE                                          *         
//*-------------------------------------------------------------------*         
//STEP047  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F800 DD DSN=&&F800MCPS,DISP=(OLD,DELETE)                                  
//BP13FECA DD DSN=BP13.FECA.HFE.MAYBTO,DISP=SHR                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
 DSN SYSTEM(DSN)                                                                
 RUN PROGRAM(BP13C51F) PLAN(BP13PCC) -                                          
     LIB('BP13.BATCH.LOADCOB')                                                  
 END                                                                            
/*                                                                              
//*===================================================================          
//* TO MATCH FECA WITH K800 AND OUTPUT TO BP13F800 FILE                         
//*===================================================================          
//STEP48   EXEC PGM=BP13CAD5,COND=(0,NE)                                        
//BP13FECA DD DSN=BP13.FECA.HFE.MAYBTO,DISP=SHR                                 
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13F800 DD DSN=BP13.F800.APPLN.MAYBTO.BKAPPT.HFE,DISP=SHR                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*--------------------------------------------------------------------         
//* UPDATE BP13K800 ON HFE STATUS                                               
//*--------------------------------------------------------------------         
//STEP49  EXEC   PGM=BP13CAD6,COND=(0,NE)                                       
//BP13F800 DD  DSN=BP13.F800.APPLN.MAYBTO.BKAPPT.HFE,DISP=SHR                   
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                                     
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*********************************************************************         
//*---------------------------------------------------------------------        
//* BACKUP TEMP PROCESSED DATA INTO FILE.                                       
//*---------------------------------------------------------------------        
//STEP49A  EXEC PGM=ICEGENER,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DSN=&&F800CH07,DISP=(OLD,PASS)                                    
//SYSUT2   DD DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(50,50),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000),                          
//            DSN=BP13.FD212.F800CH07.SD(+1)                                    
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*---------------------------------------------------------------------        
//* BACKUP TEMP PROCESSED DATA INTO FILE.                                       
//*---------------------------------------------------------------------        
//STEP49B  EXEC PGM=ICEGENER,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DSN=&&F800RQST,DISP=(OLD,PASS)                                    
//SYSUT2   DD DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(50,50),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000),                          
//            DSN=BP13.FD212.F800RQST.SD(+1)                                    
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*---------------------------------------------------------------------        
//* BACKUP TEMP PROCESSED DATA INTO FILE.                                       
//*---------------------------------------------------------------------        
//STEP49C  EXEC PGM=ICEGENER,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DSN=&&F800EXTS,DISP=(OLD,PASS)                                    
//SYSUT2   DD DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(50,50),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000),                          
//            DSN=BP13.FD212.F800EXTS.SD(+1)                                    
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*---------------------------------------------------------------------        
//* MERGE AND REMOVE DUPS FOR NEW NON-SELECTION LETTER                          
//*---------------------------------------------------------------------        
//STEP50   EXEC SORT,COND=(0,NE)                                                
//*SORTIN   DD DSN=&&F800CH07,DISP=(OLD,PASS)                                   
//*         DD DSN=&&F800RQST,DISP=(OLD,PASS)                                   
//*         DD DSN=&&F800EXTS,DISP=(OLD,PASS)                                   
//SORTIN   DD DISP=OLD,DSN=BP13.FD212.F800CH07.SD(+1)                           
//         DD DISP=OLD,DSN=BP13.FD212.F800RQST.SD(+1)                           
//         DD DISP=OLD,DSN=BP13.FD212.F800EXTS.SD(+1)                           
//SORTOUT  DD DSN=&&STEP50,DISP=(NEW,PASS,DELETE),                              
//            UNIT=CART,                                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SUM FIELDS=NONE                                                               
  SORT FIELDS=(4,8,CH,A)                                                        
  INCLUDE COND=(785,6,CH,GE,C'202310')                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT BY MODE/DTE-BALLOT/NT/FT/Q-NO                                          
//*---------------------------------------------------------------------        
//STEP51   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&STEP50,DISP=(OLD,DELETE,DELETE)                             
//SORTOUT  DD DSN=&&STEP51,                                                     
//            DISP=(NEW,PASS,DELETE),                                           
//            UNIT=CART,                                                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=(924,3,CH,A,                                                      
               785,6,CH,A,                                                      
               51,3,CH,A,                                                       
               30,2,CH,A,                                                       
               526,5,CH,A)                                                      
/*                                                                              
//*--------------------------------------------------------------------         
//* PRINT NEW NON-SELECTION LETTER USING IOMS                                   
//*--------------------------------------------------------------------         
//STEP52   EXEC PGM=BP13CH7A,COND=(0,NE)                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SY02F001 DD DISP=SHR,DSN=SY02.F001.DATE                                       
//BP13F800 DD DSN=&&STEP51,DISP=(OLD,DELETE,DELETE)                             
//BP13KH10 DD DISP=SHR,DSN=BP13.KH10.NOTBKCNT,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13KH15 DD DISP=SHR,DSN=BP13.KH15.NOTBKREG,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13KH11 DD DISP=SHR,DSN=BP13.KH15.NOTBKREG.PATH1,                            
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K060 DD DISP=SHR,DSN=BP13.K060.CODETAB,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K246 DD DISP=SHR,DSN=BP13.K246.SBF.LOOKUP,                                
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K813 DD DISP=SHR,DSN=BP13.K813.BTOBE,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K820 DD DISP=SHR,DSN=BP13.K820.OCCUP,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K830 DD DISP=SHR,DSN=BP13.K830.ADDR,                                      
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K831 DD DISP=SHR,DSN=BP13.K830.ADDR.PATH1,                                
//            AMP=('BUFNI=8','BUFND=4')                                         
//CP27K090 DD DISP=SHR,DSN=CP27.K090.HOLIDAY,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13B1031 DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP1331                        
//P13H1031 DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP1331                        
//P13B1032 DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP1332                        
//P13H1032 DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP1332                        
//P13B1033 DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP1333                        
//P13H1033 DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP1333                        
//P13B1034 DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP1334                        
//P13H1034 DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP1334                        
//P13B1035 DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP1335                        
//P13H1035 DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP1335                        
//P13B1036 DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP1336                        
//P13H1036 DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP1336                        
//P13B1037 DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP1337                        
//P13H1037 DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP1337                        
//P13B1038 DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP1338                        
//P13H1038 DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP1338                        
//P13B1039 DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP1339                        
//P13H1039 DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP1339                        
//P13B103A DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP133A                        
//P13H103A DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP133A                        
//P13B103B DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP133B                        
//P13H103B DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP133B                        
//P13B103C DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP133C                        
//P13H103C DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP133C                        
//P13B103D DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP133D                        
//P13H103D DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP133D                        
//P13B103E DD DISP=SHR,DSN=BP13.FIOMSB10.D212CH7A.BP133E                        
//P13H103E DD DISP=SHR,DSN=BP13.FIOMSH10.D212CH7A.BP133E                        
//BP13FTP  DD DISP=SHR,DSN=BP13.FIOMSFTP.D212CH7A                               
//BP13LH7A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSIN    DD *                                                                 
BP13D212                                                                        
BP13.FIOMSB10.D212CH7A                                                          
BP13.FIOMSH10.D212CH7A                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* FTP FILE TO IOMS SERVER FOR PRINTING OF NEW NON-SELECTION LETTERS           
//*--------------------------------------------------------------------         
//STEP53   EXEC FTP,PARM='HDBIOM3NFSP1 (EXIT',COND=(0,NE)                       
//SYSOUT   DD SYSOUT=*                                                          
//NETRC    DD DISP=SHR,DSN=SY08.FTP.NETRC.BP13                                  
//INPUT    DD DISP=SHR,DSN=BP13.FIOMSFTP.D212CH7A                               
/*                                                                              
//*---------------------------------------------------------------------        
