//BP13A522  JOB (BP13P),'BP13A522',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071,TYPRUN=HOLD                                 
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//* STEP02    SORT OUT MATURE NT CASES                                          
//* STEP03    COMPUTE NO OF RESIDENT AND NON-RESIDENT                           
//* STEP04-06 COMPUTE FLAT QUOAT FOR RESIDENT AND NON-RESIDENT                  
//* STEP07    PRINT REPORT FOR RESIDENT SCHEME                                  
//**************************************************************                
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP130652      19990825 EXPAND F520 RECL 300 TO 500                          
//* BP130857 SSS  20000626 ADD GROUPID                                          
//* BP132546 YCH  11062004 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K720.RESIDENT,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, WITH DUPLICATE COPIES                                             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALAP2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* REPRO VSAM TO SEQ FILE                                                      
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT1  DD DSN=&&F520MAT,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(48,5),RLSE)                                           
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* SORT SOC-RESIDENT FILE BY NT/FT ORDER                                       
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520MAT,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F500SORT,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(60,2),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(187,3,A,211,2,A,213,3,A),FORMAT=CH                              
//*--------------------------------------------------------------------         
//* COMPUTE NO OF RESIDENT AND NON-RESIDENT FOR MATURE NT                       
//* BY NT/FT/ALLOC-SCH                                                          
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=BP13C748,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F500SORT,DISP=(OLD,PASS)                                    
//BP13F720 DD DSN=BP13.F720.RESIDENT,DISP=OLD                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT SOC-RESIDENT FILE BY NT/FT ORDER                                       
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F720.RESIDENT,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F720,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=24000,LRECL=300,RECFM=FB),                           
//            SPACE=(CYL,(5,2),RLSE)                                            
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
//*--------------------------------------------------------------------         
//* DEFINE RESIDENT VSAM FILE                                                   
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&BP13F720,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEL (BP13.K720.RESIDENT) CL PURGE                                      
         DEF CL (NAME(BP13.K720.RESIDENT)       -                               
                 CYL(1 1)                        -                              
                 UNIQUE                          -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K720.RESIDENT.DATA) -                               
                 KEYS(5 0)                       -                              
                 RECSZ(300 300)                  -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K720.RESIDENT)                                        
//*-------------------------------------------------------------------          
//* COMPUTE THE MINIMUM FLAT QUOTA FOR RESIDENT AND                             
//*         THE MAXIMUM FLAT QUOTA FOR NON-RESIDENT                             
//*-------------------------------------------------------------------          
//STEP07   EXEC PGM=BP13C749,COND=(0,NE)                                        
//BP13K720 DD DSN=BP13.K720.RESIDENT,DISP=SHR                                   
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* PRINT REPORT ON RESIDENT FILE INFO ON TOTAL RES/NON-RES, FLAT QUOTA         
//* RES/NON-RES, TOTAL-REG-RES/NON-RES                                          
//*--------------------------------------------------------------------         
//STEP08   EXEC PGM=BP13C752,COND=(0,NE)                                        
//BP13K720 DD DSN=BP13.K720.RESIDENT,DISP=SHR                                   
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13F713 DD DSN=BP13.BLANK.CHAR20,DISP=SHR                                    
//BP13L752 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*      TO CREATE PATH/ALTX FOR MATURENT BALLOT FILE                           
//*--------------------------------------------------------------------         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SYSIN    DD  *                                                                
           DEF AIX (NAME(BP13.K740.MATUREBA.ALTX1)   -                          
               REL(BP13.K740.MATUREBA)               -                          
               REUSE                                 -                          
               KEYS(8 122)                            -                         
               SHR(2 3)                              -                          
               NUNQK)                                -                          
               DATA                                  -                          
               (NAME(BP13.K740.MATUREBA.ALTX1.DATA) -                           
               CYL(10 5)                              -                         
               RECSZ(31 354)                         -                          
               FSPC(10 10)                           -                          
               CISZ(4096))                           -                          
               INDEX                                 -                          
               (NAME(BP13.K740.MATUREBA.ALTX1.INDEX) -                          
               CISZ(4096))                                                      
         IF MAXCC = 0 THEN                           -                          
           DEF PATH (NAME(BP13.K740.MATUREBA.PATH1) -                           
               PENT(BP13.K740.MATUREBA.ALTX1))                                  
         IF MAXCC = 0 THEN                                                      
           BIX IDS(BP13.K740.MATUREBA)               -                          
               ODS(BP13.K740.MATUREBA.ALTX1)                                    
//****************************************************************              
//* END BP13A522                                                                
//****************************************************************              
