//BP13APPZ JOB (BP13P),'BP13APPZ',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*    4TH ROUND PIGEONHOLING                                  *                
//*                                                            *                
//*    NOTE:                                                   *                
//*    - RUN AFTER 3RD ROUND ONLY IF TOTAL SHORTLISTED IN      *                
//*      FIRST 3 ROUNDS < 3 X FLAT SUPPLY                      *                
//*    - INCLUDE  ONLY CASES WHICH ARE UNSUCC                  *                
//*    - NO HHTY AND NO RESIDENT CHECK                         *                
//**************************************************************                
//* CHG REF   BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP133913 IL5  20100610 NEW                                                  
//* BP134146 IL5  20110311 SHORTLIST FT BEFORE UPG FOR J9.                      
//* BP134263 IL5  20110608 SHORTLIST FT BEFORE UPG FOR J9.                      
//* BP134688 IL5  25102012 OMIT UNSHORTLISTED GRO RECORDS FROM                  
//*                        PUBLIC ROUND                                         
//* BP134782 IL5  20102013 SHORTLIST PPS ELIG BEFORE FT AND UPG                 
//* BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                               
//* BP134914 SMR2 14062013 INCLUDE PREGNANT IN ELIGIBLE PPS                     
//* BP135028 IL5  30082013 SEQUENCE SHORTLISTING FOR REMAINING                  
//*                        APPLICATIONS AS PPS/FT/AST/UPG/FTS                   
//* BP135392 SMR2 22072014 CATER FOR 3P FLAT TYPE                               
//* BP135492 SMR2 08092014 REVISE SEQUENCE OF SHORTLISTING FOR SHORTFALL        
//* BP135625 IL5  28012015 REMOVE DUPLICATES                                    
//* BP135625 SMR2 10022015 NEW PROGRAM ON SHORTLISTING FOR SHORTFALL            
//* BP135708 SMR2 31032015 CHANGE CLASS=2 TO CLASS=J                            
//* BP136055 SMR2 09122015 CATER FOR 2F FLAT TYPE                               
//* BP136096 IL5  13012016 CHANGE FOR SHORTLISTING PGM FROM BP13U532            
//*                        BP13U547 (NEW)                                       
//* BP136107 SMR2 17022016 ACCEPT PARAMETER FROM JCL IN BP13C525                
//* BP136291 SMR2 06062016 ADD NEW PROGRAM, BP13CB12 / ENHANCE PARAMETER        
//* BP137052 SMR2 25102017 BACKUP BP13F740 SUCCESSFUL APPLICATIONS              
//* BP138301 AM25 14052020 HARDCOPY REPORTS CONVERSION                          
//* BP139670 AM25 25082023 CATER FOR FT(PMC)                                    
//*                        COMMENT STEP05L (SA CASES)                           
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.PA3,DISP=OLD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.PA3,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* SORT OUT UNSUCC REQUEST CASES                                               
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.ARE2.R02,DISP=OLD                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,213,3,CH,NE,C'GRO',AND,                 
                 245,1,CH,EQ,C' ')                                              
//*---------------------------------------------------------------------        
//* TO OUTPUT REVISE SEQUENCE OF SHORTLISTING FOR SHORTFALL                     
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13CF52,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F740 DD DSN=BP13.F740.MATUREBA.ARE2.R02,DISP=SHR                          
//BP13F74A DD DSN=&&BP13F74A,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74B DD DSN=&&BP13F74B,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74C DD DSN=&&BP13F74C,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74D DD DSN=&&BP13F74D,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74E DD DSN=&&BP13F74E,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74F DD DSN=&&BP13F74F,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74G DD DSN=&&BP13F74G,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74H DD DSN=&&BP13F74H,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74I DD DSN=&&BP13F74I,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74J DD DSN=&&BP13F74J,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74K DD DSN=&&BP13F74K,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74L DD DSN=&&BP13F74L,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SEPARATE FPPS RECORDS INTO 2 GROUPS                                         
//* 1. PPS APPLY FOR 4-ROOM AND SMALLER FLATS UNDER BTO AND FTPMC               
//* 2. THE REST OF THE RECORDS                                                  
//*---------------------------------------------------------------------        
//STEP04A   EXEC PGM=BP13C52C,COND=(0,NE)                                       
//BP13F740  DD DSN=&&BP13F74A,DISP=(OLD,DELETE)                                 
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR                                     
//P13F740A  DD DSN=&&F74AGRP1,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(50,50),RLSE),DATACLAS=MULTIVOL,                      
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//P13F740B  DD DSN=&&F74AGRP2,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(50,50),RLSE),DATACLAS=MULTIVOL,                      
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - ELDERLY - SPS CASES                          
//*---------------------------------------------------------------------        
//STEP05A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74K,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - ELDERLY - NONSPS CASES                       
//*---------------------------------------------------------------------        
//STEP05B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74L,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SORT PPS RECORDS, GROUP1 FIRST FROM BP13C52C                                
//*---------------------------------------------------------------------        
//STEP05C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F74AGRP1,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SORT PPS RECORDS, GROUP2 ADDED AFTER GROUP1 FROM BP13C52C                   
//*---------------------------------------------------------------------        
//STEP05C2 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F74AGRP2,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - MCPS (FT) - WITH CASES                       
//*---------------------------------------------------------------------        
//STEP05D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74B,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - MCPS (FT) - NEAR CASES                       
//*---------------------------------------------------------------------        
//STEP05E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74C,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - FT CASES                                     
//*---------------------------------------------------------------------        
//STEP05F  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74D,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - AST CASES                                    
//*---------------------------------------------------------------------        
//STEP05G  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74E,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - MCPS (ST) - WITH CASES                       
//*---------------------------------------------------------------------        
//STEP05H  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74F,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - MCPS (ST) - NEAR CASES                       
//*---------------------------------------------------------------------        
//STEP05I  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74G,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - ST CASES                                     
//*---------------------------------------------------------------------        
//STEP05J  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74H,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - FTS CASES                                    
//*---------------------------------------------------------------------        
//STEP05K  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F74I,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MERGE ALL OUTPUT IN BP13CF52 - SA CASES                                     
//*---------------------------------------------------------------------        
//*STEP05L  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F74J,DISP=(OLD,DELETE)                                 
//*SORTOUT  DD DSN=&&F520SORT,DISP=(MOD,PASS),                                  
//*            UNIT=(SYSDA,1),SPACE=(CYL,(80,5),RLSE),                          
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//*SYSIN    DD *                                                                
//*   SORT FIELDS=(1,28,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR MATURE PA CASES, THE PROGRAM WI           
//* ONLY ALLOCATE THE PRIORITY SUPPLY QUOTA FOR ALL SCHEME                      
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13U547,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F740 DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L547 DD SYSOUT=8,DEST=IOM8                                                
//P13L547A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------              
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------              
//STEP09   EXEC  PGM=BP13C713,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//   AMP=('BUFND=23')                                                           
//P13UNSUC DD DUMMY                                                             
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(32,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* UPDATE ALLOC-SCH, PPS-SUCC AND AST-SUCC FOR ELIGIBLE APPLICATIONS           
//* SHORTLISTED IN BP13U547                                                     
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13CB12,COND=(0,NE)                                        
//BP13F740 DD DSN=&&P13SUCC,DISP=(OLD,PASS)                                     
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------              
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------              
//STEP11   EXEC  PGM=BP13C713,COND=(0,NE)                                       
//BP13F510 DD DSN=&&P13SUCC,DISP=(OLD,DELETE)                                   
//BP13K520 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//P13UNSUC DD DUMMY                                                             
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(32,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER(+1),DISP=(NEW,CATLG),                        
//            SPACE=(TRK,(5,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*--------------------------------------------------------------------         
//STEP14  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F525.APPL,DISP=SHR                                      
//OUTPUT1   DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY NT, FT, REGNO                                    
//* SHOW ALL THE APPLICATIONS SHORTLISTED                                       
//* SORT OUT RECORDS FOR ELDERLY (S1) & NON-ELDERLY (S2)                        
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT1 DD DSN=&&F740ELD,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(70,10),RLSE)                               
//SORTOUT2 DD DSN=&&F740NELD,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(70,10),RLSE)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,1,CH,EQ,C'2',AND,                        
              (210,1,CH,EQ,C'F',OR,210,1,CH,EQ,C'S'))                           
   OUTFIL FNAMES=SORTOUT2,INCLUDE=(211,1,CH,NE,C'2',OR,                         
              (210,1,CH,NE,C'F',AND,210,1,CH,NE,C'S'))                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON TOTAL CUMMULATIVE SUCC BY ALLOC-SCHEME (ELDERLY)            
//*---------------------------------------------------------------------        
//STEP16A  EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740ELD,DISP=(OLD,DELETE)                                   
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
EC1                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON TOTAL CUMMULATIVE SUCC BY ALLOC-SCHEME (NON-ELDERLY)        
//*---------------------------------------------------------------------        
//STEP16B  EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740NELD,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
NC1                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY NT, FT, REGNO                                    
//*---------------------------------------------------------------------        
//STEP17A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13SUCC,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY NT, FT, REGNO                                    
//* SHOW THE APPLICATIONS SHORTLISTED IN BP13APPZ                               
//* SORT OUT RECORDS FOR ELDERLY (S1) & NON-ELDERLY (S2)                        
//*---------------------------------------------------------------------        
//STEP17B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//SORTOUT1 DD DSN=&&F740ELD,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(70,10),RLSE)                               
//SORTOUT2 DD DSN=&&F740NELD,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(70,10),RLSE)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,1,CH,EQ,C'2',AND,                        
              (210,1,CH,EQ,C'F',OR,210,1,CH,EQ,C'S'))                           
   OUTFIL FNAMES=SORTOUT2,INCLUDE=(211,1,CH,NE,C'2',OR,                         
              (210,1,CH,NE,C'F',AND,210,1,CH,NE,C'S'))                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON SUCC WITHIN THIS ROUND BY ALLOC-SCHEME (ELDERLY)            
//*---------------------------------------------------------------------        
//STEP18A  EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740ELD,DISP=(OLD,DELETE)                                   
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
ER2                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON SUCC WITHIN THIS ROUND BY ALLOC-SCHEME (NON-ELDERLY)        
//*---------------------------------------------------------------------        
//STEP18B  EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740NELD,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
NER                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR PPS & NON-PPS APPLICANTS                                   
//*-----------------------------------------------------------------            
//STEP19   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*------------------------------------------------------------------           
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION FORM FOR COUNTER AND MAIL CASES                           
//* 3 DIFFERENT LETTERS DEPENDING ON MCPS OPTION                                
//*------------------------------------------------------------------           
//STEP21   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
ALC                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* PRINT REPORT ON SUCC FOR THIS COHORT BY ALLOC-SCHEME                        
//*------------------------------------------------------------------           
//STEP22   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
AR1                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT SUCCESSFUL APPLICATIONS SHORTLISTED IN BP13APPZ                    
//*---------------------------------------------------------------------        
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740SUCC,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.APPZ.SUCC,DISP=OLD                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
//****************************************************************              
//*            END OF BP13APPZ                                                  
//****************************************************************              
