//BP13M906 JOB (BP13P),'BP13M906',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//* ============================================================== *            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- --   ------   -----------                                          
//* BP136964 MRN1 29082017 VOUCHER DISTRIBUTION REPORT                          
//* BP137246 MRN1 19032018 REMOVE MATCHING WITH BP13KD10                        
//*---------------------------------------------------------------------        
//* SORT OUT EC CASES BY DTE-TRANS THEN BY REGNO                                
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.AG07.F630.VOUCHER.MTHBKUP,DISP=SHR                       
//SORTOUT  DD DSN=&&AG07F630,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=130,RECFM=FB)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(12,8,A,1,8,A),FORMAT=CH                                          
  INCLUDE COND=(1,1,CH,EQ,C'6')                                                 
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//AG07F630 DD DSN=&&AG07F630,DISP=(OLD,PASS)                                    
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13LB0H DD DSN=BP13.LB0H.REPORT,DISP=OLD                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CB0H) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
