//BP13M040 JOB (BP13P),'BP13M040',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-----------------------------------------------------------------            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- -------- -----------                                           
//* BP132231 CKK 20021025 NEW JOB TO GENERATE REPORT FOR FIN                    
//* BP132351 CKK 20030707 OUTPUT REPORT TO SEQ FILE FOR BP13C019                
//* BP132375 CKK 20030717 OUTPUT REPORT TO SEQ FILE FOR BP13C020                
//* BP132375 CKK 20030826 DON'T PRINT CASES IN L020 IF PRINTED IN L019          
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS  (DUPLEX)                   
//* PRT01 : COPIES = 1                                                          
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-FIFA1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=FIFA1A                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* SORT MONTHLY SALE ORDER FILE IN SO-EXECUTION DATE                           
//*-----------------------------------------------------------------            
//STEP01 EXEC  SORT,COND=(0,NE)                                                 
//SORTIN   DD  DSN=BP13.F410.MTHSO,                                             
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F410,                                                   
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(50,20),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=20000)                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(839,8,A,1,8,A),FORMAT=CH                                       
//*-----------------------------------------------------------------            
//* SORT KIV SALE ORDER FILE IN SO-EXECUTION DATE                               
//*-----------------------------------------------------------------            
//STEP02 EXEC  SORT,COND=(0,NE)                                                 
//SORTIN   DD  DSN=BP13.F405.KIVSO,                                             
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F410,                                                   
//             DISP=(MOD,PASS)                                                  
//SYSIN    DD  *                                                                
    SORT FIELDS=(839,8,A,1,8,A),FORMAT=CH                                       
//*-----------------------------------------------------------------            
//* SORT SALE ORDER FILE + KIV SALE ORDER FILE IN SO-EXECUTION DATE             
//*-----------------------------------------------------------------            
//STEP03 EXEC  SORT,COND=(0,NE)                                                 
//SORTIN   DD  DSN=&&P13F410,                                                   
//             DISP=(OLD,PASS)                                                  
//SORTOUT  DD  DSN=&&BP13F410,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(50,20),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=20000)                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(839,8,A,1,8,A),FORMAT=CH                                       
//*-----------------------------------------------------------------            
//*-----------------------------------------------------------------            
//* PRINT REPORT 1. TO SHOW ALL SALES FROM 1ST TO 22ND OF THE MTH               
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13C019,COND=(0,NE)                                        
//BP13F410 DD DSN=&&BP13F410,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13L019 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L019A DD DSN=BP13.M040.REPORT,DISP=OLD                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT APPOINTMENT FILE TO SEQ FILE                                           
//*-----------------------------------------------------------------            
//STEP05 EXEC  SORT,COND=(0,NE)                                                 
//SORTIN   DD  DSN=BP13.K454.APPTABLE,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F454,                                                   
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(50,20),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=10000)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,22,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* SORT MONTHLY SALE ORDER FILE IN SO-EXECUTION DATE                           
//*-----------------------------------------------------------------            
//STEP06 EXEC  SORT,COND=(0,NE)                                                 
//SORTIN   DD  DSN=&&P13F410,                                                   
//             DISP=(OLD,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F41A,                                                   
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(50,20),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=20000)                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* PRINT REPORT 2. TO SHOW ALL SCHEDULED CASES FOR TP FROM 23RD TO             
//* END OF THE MONTH                                                            
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=BP13C020,COND=(0,NE)                                        
//BP13F454 DD DSN=&&P13F454,DISP=(OLD,DELETE)                                   
//BP13F410 DD DSN=&&P13F41A,DISP=(OLD,DELETE)                                   
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13L020 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L020A DD DSN=BP13.M040.REPORT2,DISP=OLD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
