//BP13Y702 JOB (BP13P),'BP13Y702',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* 2ND LETTER ON TOP AND PARTICULAR FORM, SEND OUT BY SIM LIAN                 
//* 1ST LETTER ON TOP LETTER FOR SURVET FEE/STAMP FEE, SEND OUT BY              
//* HDB                                                                         
//*=================================================================            
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP135171 RJE1 20140211 TO CATER FOR DB2 UPGRADE                             
//*-------------------------------------------------------------------          
//*  PRT01 : 1 COPY                                                             
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* COVERING LETTER BY SIM LIAN                                                 
//*-----------------------------------------------------------------            
//PRT02   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1B CP-1',END;                                      
1$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13ID,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1B                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* PARTICULAR FORM                                                             
//*-----------------------------------------------------------------            
//PRT03   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1C CP-1',END;                                      
1$DJDE$ JDE=13C382,JDL=BP13,FORMS=BLANKF,DUPLEX=YES,END;                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1C                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* COVERING LETTER BY SOU                                                      
//*-----------------------------------------------------------------            
//PRT04   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1D CP-1',END;                                      
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13IA,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1D                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* AUTHORISATION FORM FOR PAYMENT ON STAMP FEE AND SURVEY FEE                  
//*-----------------------------------------------------------------            
//PRT05   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1D CP-1',END;                                      
1$DJDE$ JDE=13POT6,JDL=BP13,FORMS=BP13IB,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1D                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*===============================================================              
//* SORT OUT PROJECT DTE-BALLOT/MODE/SCH-ACC-NO                                 
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(10,3),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(155,11,A),FORMAT=CH                                              
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                924,3,CH,EQ,C'DBS',AND,                                         
                155,3,CH,NE,C'   ',AND,                                         
                785,6,CH,EQ,C'200810')                                          
//*---------------------------------------------------------------------        
//* PRINT DBSS TOP LETTER WITH PARTICULAR FORM                                  
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800  DD DSN=&&BP13F800,DISP=(OLD,PASS)                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//*BP13KB20  DD DSN=BP13.KB20.DBSBK,DISP=SHR,                                   
//*             AMP=('BUFNI=8','BUFND=4')                                       
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K857  DD DSN=BP13.K857.EMAIL,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KD00  DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13PD47D  DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                       
//P13PD47E  DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                       
//P13PD47F  DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                       
//P13PD47G  DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                       
//P13PD47H  DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                       
//BP13LD47  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSTSPRT  DD SYSOUT=*                                                         
//SYSTSIN   DD *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CD47) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
