//BP13A405  JOB (BP13P),'BP13A405',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=====================================================================        
//* CHG-NO   BY  ON                                                             
//*------------------                                                           
//* BP137091 LSB 211117 - NEW REPORT                                            
//*---------------------------------------------------------------------        
//* SORT BP13F217 BY POSTAL - INPUT FILE FROM BQG                               
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F217.PCD,DISP=SHR                                        
//SORTOUT  DD DSN=&&BP13F217,DISP=(,PASS),                                      
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=20,BLKSIZE=0),                                    
//        SPACE=(CYL,(5,2),RLSE)                                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(8,6,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* SORT BM06F130 BY POSTAL                                                     
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F130.BLOCK.PIDB,DISP=SHR                                 
//SORTOUT  DD DSN=&&BM06F130,DISP=(,PASS),                                      
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                                   
//        SPACE=(CYL,(20,10),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(521,6,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MATCH POSTAL, PRINT REPORT FOR CHECKING BEFORE UPDATE                       
//* NUM-PCD, DTE-PCD                                                            
//*-----------------------------------------------------------------            
//STEP03  EXEC PGM=BP13C27M,COND=(0,NE)                                         
//BP13F217 DD DSN=&&BP13F217,DISP=(OLD,PASS)                                    
//BM06F130 DD DSN=&&BM06F130,DISP=(OLD,PASS)                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13FOUT DD DSN=BP13.L27M.VFYPCD,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
