//BP13A805 JOB (BP13P),'BP13A805',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* JOB TO RUN AFTER BP13A810                                                   
//* BAND FLAT TYPE 3N, 4, 5 IN ONE QUEUE                                        
//*      2A, 2, 3B ALL SEPARATE QUEUE                                           
//*                                                                             
//*-----------------------------------------------------------------            
//* JUN 98 - CATHERINE RUN THE WRONG JOB (BP13A802 INSTEAD OF BP13A805)         
//*        - BP13K740 AND 4 BP17 FILES WERE RECOVERED TO RESTORE DATA           
//*        - THE JCL FOR THE RECOVERY ARE KEPT IN THIS LIBRARY UNDER            
//*                MEMBER NAME  RVY1A805 & RVY2A805                             
//*        - ALL THE RECOVERY PRG & JCL ARE IN BP13T.IT.REQ0510.DONE            
//*                                                                             
//*=================================================================            
//* BP130330 LSB 970626 - ASSIGN REGN TO ALL CASES, DO NOT CHECK                
//*                       SUCC NT, JB 4/5-RM GROUP TOGETHER                     
//* BP130328 IT1 971208 - FT '0' DO NOT ASSIGN REGN NO OR QUEUE NO              
//* BP130652     990826 - EXPAND F740,K740 RECL 300 TO 500                      
//* BP130778 YCH 991215 - EXPAND F565 FROM 350 TO 550                           
//* BP132317 JF4 030324 - BTO CHANGES FOR BP13C514                              
//* BP132338 YCH 190403 - TO CREATE ALTERNATE KEY FOR REG AND HDBREF            
//* BP132500 YCH 310304 - BAND FLAT TYPE SR, 3N, 4-RM , 5-RM AS ONE             
//*                       QUEUE, 2-RM 3B SEPARATE QUEUE                         
//* BP132540 YCH 280504 - INCLUDE PRODRLS                                       
//* BP132604 YCH 111004 - EXPAND BP17K000 FROM 80 TO 200                        
//* BP132618 YCH 061204 - DETERMINE WHETHER TO CREATE/UPDATE BP17K000           
//* BP132826 YCH 030406 - EXPAND REFNO FROM 6 TO 8 BYTES                        
//* BP133201 YCH 211107 - APPEND SERS                                           
//* BP135887 YCH 11042016 REMOVE UPD/CREATE BP17.K000.SCHREF                    
//* BP137724 YCH 27092019 CHANGE IOM2                                           
//*=================================================================            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1B CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=====================================================================        
//*  ***  ASSIGN QUEUE POSITION                                                 
//*=====================================================================        
//* EXTRACT SUCCESSFUL NEW TOWN NOT BLANK                                       
//*  SORT BY SUCCESSFUL NEW TOWN AND REGISTRATION NUMBER                        
//* SEPARATE QUEUE IF FLAT TYPE = 2-RM                                          
//*          QUEUE IF FLAT TYPE = 2A                                            
//*          QUEUE IF FLAT TYPE = 3-RM AND BUY-BACK = 'Y'                       
//*          QUEUE IF FLAT TYPE = 3N, 4-RM OR 5-RM                              
//*---------------------------------------------------------------------        
//STEP11   EXEC SAS,COND=(0,NE)                                                 
//BP13K740 DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR                              
//BP13FR02 DD DSN=&&F740R02,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//BP13FR2A DD DSN=&&F740R2A,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//BP13FR3B DD DSN=&&F740R3B,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//BP13FR45 DD DSN=&&F740R45,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S547),DISP=SHR                             
//*                                                                             
//*=====================================================================        
//* SORT BY REGISTRATION NUMBER SEQUENCE                                        
//*  FOR 2 ROOM FLAT ONLY                                                       
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740R02,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740F02,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,123,8,A),FORMAT=CH                                    
//*---------------------------------------------------------------------        
//*  TO PRINT SUCESSFUL REQUEST ASSIGNED WITH REGISTRATION NO.                  
//*  (2 ROOM ONLY)                                                              
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13C624,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740F02,DISP=(OLD,PASS)                                     
//BP13K740 DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP17.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L624 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=====================================================================        
//* SORT BY REGISTRATION NUMBER SEQUENCE                                        
//*  FOR STUDIO APARTMENT                                                       
//*---------------------------------------------------------------------        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740R2A,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740F2A,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,123,8,A),FORMAT=CH                                    
//*---------------------------------------------------------------------        
//*  TO PRINT SUCESSFUL REQUEST ASSIGNED WITH REGISTRATION NO.                  
//*  (STUDIO APARTMENT)                                                         
//*---------------------------------------------------------------------        
//STEP15   EXEC PGM=BP13C624,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740F2A,DISP=(OLD,PASS)                                     
//BP13K740 DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP17.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L624 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=====================================================================        
//* SORT BY REGISTRATION NUMBER SEQUENCE                                        
//*  FOR 3-RM BUY BACK                                                          
//*---------------------------------------------------------------------        
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740R3B,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740F3B,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,123,8,A),FORMAT=CH                                    
//*---------------------------------------------------------------------        
//*  TO PRINT SUCESSFUL REQUEST ASSIGNED WITH REGISTRATION NO.                  
//*  (3 RM BUY-BACK TO ISSUE QUEUE POSITION)                                    
//*---------------------------------------------------------------------        
//STEP17   EXEC PGM=BP13C624,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740F3B,DISP=(OLD,PASS)                                     
//BP13K740 DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP17.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L624 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=====================================================================        
//* SORT BY REGISTRATION NUMBER SEQUENCE                                        
//*  FOR 3N, 4-RM & 5-RM                                                        
//*---------------------------------------------------------------------        
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740R45,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740F45,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,123,8,A),FORMAT=CH                                    
//*=====================================================================        
//*  TO PRINT SUCESSFUL REQUEST ASSIGNED WITH REGISTRATION NO.                  
//*  FOR 3N, 4-RM & 5-RM                                                        
//*---------------------------------------------------------------------        
//STEP19   EXEC PGM=BP13C624,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740F45,DISP=(OLD,PASS)                                     
//BP13K740 DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP17.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L624 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=====================================================================        
//*   SORT REF-NO                                                               
//*---------------------------------------------------------------------        
//STEP21 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR                               
//SORTOUT DD DSN=&&F740SERS,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,                                                        
//           DCB=(RECFM=FB,LRECL=500),                                          
//           SPACE=(CYL,(2,1),RLSE)                                             
//SYSIN   DD *                                                                  
   SORT FIELDS=(33,8,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE BP17 SCH-ACC-NO/REF-NO/REGN-NO FILE                                  
//*---------------------------------------------------------------------        
//STEP22   EXEC PGM=BP13C886,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SERS,DISP=(OLD,PASS)                                    
//BP17K000 DD DSN=BP17.K000.SCHREF.SERSITE,DISP=SHR                             
//BP17K001 DD DSN=BP17.K000.SCHREF.SERSITE.PATH1,DISP=SHR                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* INCLUDE JB CASES                                                            
//*---------------------------------------------------------------------        
//STEP23 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR                               
//SORTOUT DD DSN=&&F740JB,DISP=(NEW,PASS),                                      
//           UNIT=SYSDA,                                                        
//           DCB=(RECFM=FB,LRECL=500),                                          
//           SPACE=(CYL,(2,1),RLSE)                                             
//SYSIN   DD *                                                                  
   SORT FIELDS=(33,8,A),FORMAT=CH                                               
   INCLUDE COND=(216,1,CH,EQ,C'8')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE JB-REF WITH JB-REGN-NO                                               
//*---------------------------------------------------------------------        
//STEP24   EXEC PGM=BP13C887,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740JB,DISP=(OLD,PASS)                                      
//BP13K740 DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR                              
//BP13K741 DD DSN=BP13.K740.MATUREBA.SERS.PATH1,DISP=SHR                        
//BP17K000 DD DSN=BP17.K000.SCHREF.SERSITE,DISP=SHR                             
//BP17K001 DD DSN=BP17.K000.SCHREF.SERSITE.PATH1,DISP=SHR                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*   PRINT REPORT ON ASSIGNED REGISTRATION TO SERS HDB-REF                     
//*---------------------------------------------------------------------        
//STEP25   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP17K000 DD DSN=BP17.K000.SCHREF.SERSITE,DISP=SHR                             
//FT42F001 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S715),DISP=SHR                             
//*---------------------------------------------------------------------        
//*  REPRO BALLOT FILE TO CARTRIDGE                                             
//*---------------------------------------------------------------------        
//STEP90   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.SERSQNO,DISP=OLD                           
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
