//BP13ACC5 JOB (BP13P),'BP13ACC5',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*    PIGEONHOLING OF GRO FOR MATURE NT                       *                
//*                            ---------                       *                
//*    - 2ND ROUND PIGEONHOLING FOR GRO TO ALLOW               *                
//*      UNSUCC SERVE GRO, ADJUST RANKING THRU ONLINE          *                
//*      SERVE GRO                                             *                
//*      FOE GRO, SORT BY RANK, RANDOM NUMBER                  *                
//*      UNSUCC REN TO TAKE RH QUOTA                           *                
//*                                                            *                
//*    NOTE THE DIFFERENCE                                     *                
//*    - TENDER PROGRAM ONLY HAVE NEW FLAT SUPPLY              *                
//*    - BP13K760 - CHECK FOR NON-SERVE QUOTA, ETHNIC          *                
//**************************************************************                
//* STEP 00 - 01 = LASER PRINTER JCL                           *                
//* STEP 02 - 03 = BACKUP TENDER AND BALLOT FILE               *                
//* STEP 04 - 4A = PRINT FLAT SYPPLY REPORT BF PIGEONHOLING    *                
//* STEP 06 - 08 = PROCESS PIGEONHOLING BP13U770. GRO ROUND 2  *                
//* STEP 09 - 10 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING    *                
//* STEP 11      = MATCH RELEVANT REQUEST TO GET SUCC & UNSUCC *                
//*                BALLOT RESULT FOR PRINT REPORT              *                
//* STEP 12      = PRINT SUMMARY RESULT OF ALL REQUEST BP13L522*                
//* STEP 13      = PRINT REPORT ON GRO RANKING                 *                
//* STEP 14      = BACKUP TENDER FILE                          *                
//* STEP 15      = ACCUM BP13F525                              *                
//**************************************************************                
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP131064 CKK 010924 - DUPLICATION OF BP13CCC1. CHANGE PIGEON-               
//*                       HOLING PROGRAM TO BP13U770.                           
//* BP132171 ED  120702 - INCLUDE STEPS FOR GROPA CASES.                        
//*                       (STEP19-21)                                           
//* BP132412 SK  061003 - INCLUDE BP13K520 FOR BP13C085.                        
//* BP132463 CKK 261203 - INCLUDE NEW REPORT FOR BP13C085                       
//* BP132596 PGS1 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E           
//* BP134861 EAA1 130422- EXPAND BP13K010 TO 600                                
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K765.WARDSRV,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, WITH DUPLICATE COPIES                                             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.CC1,DISP=OLD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K765.WARDSRV,DISP=SHR                                    
//OUTPUT3  DD DSN=BP13.F765.WARDSRV.CC2,DISP=OLD                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010N,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP4A    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010N,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.CC2,DISP=SHR                                
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* TRANSFER BALANCE FLAT OF SERVE TO NON-SERVE IN BP13K765                     
//*---------------------------------------------------------------------        
//STEP4B   EXEC PGM=BP13C779,COND=(0,NE)                                        
//BP13K765 DD DSN=BP13.K765.WARDSRV,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
/*                                                                              
//*---------------------------------------------------------------------        
//* PRINT REPORT ON FLAT/REGISTERED COUNT FOR GRO IN BP13K765                   
//*---------------------------------------------------------------------        
//STEP4C   EXEC PGM=BP13C746,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.CC2,DISP=SHR                                 
//BP13K765 DD DSN=BP13.K765.WARDSRV,DISP=SHR                                    
//BP13L746  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
/*                                                                              
//*-----------------------------------------------------------------            
//* INCLUDE RESIDENT GRO WITH CDE-SERVE = N                                     
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F740GR2,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(163,1,A,1,28,A),FORMAT=CH                                      
    INCLUDE COND=((119,1,CH,EQ,C'N'),OR,                                        
             (119,1,CH,EQ,C'Y',AND,226,3,CH,EQ,C'   '))                         
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR GRO CASES.                                
//* PROCESS NON-SERVING GRO + UNSUCCESSFUL SERVING GRO FROM 1ST ROUND           
//* GRO PIGEOHOLING                                                             
//* THIS IS 2ND ROUND GRO PIGEONHOLING                                          
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13U770,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13K765 DD DSN=BP13.K765.WARDSRV,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13F740 DD DSN=&&F740GR2,DISP=(OLD,PASS)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.CC2,DISP=SHR                                 
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L770 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//P13L770A DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010GR2,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP10    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010GR2,DISP=(OLD,DELETE)                                  
//BP13F713  DD DSN=BP13.F713.PIGEON.CC1,DISP=SHR                                
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP11   EXEC  PGM=BP13C713,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F740GR2,DISP=(OLD,DELETE)                                   
//BP13K520 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT SUMMARY BALLOT RESULT BY NT/FT/CAT                                    
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP12   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//P13FSUCC DD  DSN=&&P13SUCC,DISP=(OLD,PASS)                                    
//P13FUNSC DD  DSN=&&P13UNSUC,DISP=(OLD,PASS)                                   
//PRIOFMT  DD  DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT42F001 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                            
//*-----------------------------------------------------------------            
//* PRINT REPORT ON GRO RANKING                                                 
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP13   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13F740  DD DSN=&&P13SUCC,DISP=(OLD,DELETE)                                  
//          DD DSN=&&P13UNSUC,DISP=(OLD,DELETE)                                 
//FT42F001  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S516),DISP=SHR                            
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*  FOR WHOLE GRO PIGEONHOLING                                                 
//*-----------------------------------------------------------------            
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER(+1),DISP=(NEW,CATLG),                        
//            SPACE=(TRK,(5,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*-----------------------------------------------------------------            
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//OUTPUT1  DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT LAST SUCC REGN-NO IN NT/FT ORDER                                       
//*-----------------------------------------------------------------            
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F525,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=20000)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,4,2,A,53,3,A,11,1,A),FORMAT=CH                            
//*-----------------------------------------------------------------            
//* PRINT REPORT TO SHOW LAST SUCC REGN-NO HIT MAX ZONE/ALLOC/CAT               
//*-----------------------------------------------------------------            
//STEP17    EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                 
//BP13K525  DD DSN=&&BP13F525,DISP=(OLD,PASS)                                   
//FT18F001  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S502),DISP=SHR                            
//*---------------------------------------------------------------------        
//* PRINT REPORT ON FLAT/REGISTERED COUNT FOR GRO IN BP13K765                   
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=BP13C746,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.CC2,DISP=SHR                                 
//BP13K765 DD DSN=BP13.K765.WARDSRV,DISP=SHR                                    
//BP13L746  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
/*                                                                              
//*-----------------------------------------------------------------            
//* INCLUDE SUCC GRO CASES AND ASSIGN AS PA                                     
//*-----------------------------------------------------------------            
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&BP13F740,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(25,25),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=COPY                                                             
   INCLUDE COND=(226,3,CH,NE,C'   ')                                            
//*-----------------------------------------------------------------            
//* EXTRACT GRO CASES FOR INPUT TO BP13C085                                     
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=BP13C741,COND=(0,NE)                                        
//BP13F520 DD  DSN=&&BP13F740,DISP=(OLD,DELETE)                                 
//BP13GRO  DD  DSN=&&GROPA,DISP=(,PASS),                                        
//         UNIT=(SYSDA,1),SPACE=(CYL,(25,25),RLSE),                             
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//BP13MGP  DD  DUMMY                                                            
//BP13PR   DD  DUMMY                                                            
//BP13PUB  DD  DUMMY                                                            
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* CREATE DUPLICATE GRO APPLICATIONS AND CHG TO PA                             
//*-------------------------------------------------------------------*         
//STEP21   EXEC PGM=BP13C085,COND=(0,NE)                                        
//BP13F740 DD DSN=&&GROPA,DISP=(OLD,DELETE)                                     
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//P13F740B DD DSN=BP13.F740.MATUREBA.GROPA,DISP=OLD                             
//BP13L085 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
