//BP13D902 JOB (BP13P),'BP13D902',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* BP133387 ED1 10092007 DAILY REPORT FOR SVEY FEES PYMT                       
//* BP133907 JB8 16072010 CREATE BP13KD85 IN BP13CD51                           
//* BP133967 JB8 25112010 SEND EMAIL ALERT INSTEAD OF REPORT                    
//* BP134500 LSB 24042012 INCLUDE F120 WITH REGN(1:1) = 5 SERIES                
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY          AGREEMENT TEAM                                      
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13S,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* SORT OUT REGN-NO FOR TOP, PP-SCHEDULE=08                                    
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD45.PPAYHIST,DISP=SHR                                   
//SORTOUT  DD DSN=&&FD45SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=1550),                                        
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,8,A),FORMAT=CH                                                
   INCLUDE COND=(17,2,CH,EQ,C'01',OR,                                           
                 17,2,CH,EQ,C'08',OR,                                           
                 17,2,CH,EQ,C'8A',OR,                                           
                 17,2,CH,EQ,C'8B',OR,                                           
                 17,2,CH,EQ,C'TR')                                              
//*-----------------------------------------------------------------            
//* SORT BY REGN ASCENDING                                                      
//* INCLUDE ONLY DBSS CASES                                                     
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&F120SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=700),                                         
//            SPACE=(CYL,(3,3),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(180,8,A),FORMAT=CH                                              
   INCLUDE COND=(180,1,CH,EQ,C'5',AND,                                          
                 187,1,CH,NE,C' ')                                              
//*----------------------------------------------------------------             
//* PRODUCE EMAIL TO MA&B OFFICER ON SENDING CHEQUE TO DEVELOPER                
//* ON THE DUE DATE FOR PAYMENT DBSS PROGRESS PAYMENT                           
//* CREATE BP13KD85                                                             
//*----------------------------------------------------------------             
//STEP03   EXEC PGM=BP13CD51,COND=(0,NE)                                        
//BM06F120 DD DSN=&&F120SORT,DISP=(OLD,DELETE)                                  
//BP13FD45 DD DSN=&&FD45SORT,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR                                    
//BP13KD85 DD DSN=BP13.KD85.SURVCHR,DISP=OLD                                    
//BP13KD15 DD DSN=BP13.KD15.DBSSTP,DISP=SHR                                     
//BP13KD11 DD DSN=BP13.KD15.DBSSTP.PATH1,DISP=SHR                               
//BP13FOUT DD DSN=&&BP13FOUT,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,1),RLSE)                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BY PRJCT/DTE-CONFIRM                                                   
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FOUT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FOUT,DISP=(NEW,PASS),                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,1),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,23,8,A),FORMAT=CH                                         
//*----------------------------------------------------------------             
//*-CREATE MAIL REC                                                             
//*----------------------------------------------------------------             
//STEP05   EXEC PGM=BP13CD84,COND=(0,NE)                                        
//BP13FOUT DD DSN=&&FOUT,DISP=(OLD,DELETE)                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR                                      
//BP13MAIL DD DSN=BP13.MAILOUT.CD84,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SEND ALERT MAIL                                                             
//*-----------------------------------------------------------------            
//STEP06   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILOUT.CD84,DISP=SHR                                    
//*                                                                             
/*                                                                              
