//BP13D53I JOB (BP13P),'BP13D53I',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//*                                                                             
//*  THIS JOB IS USE                                                            
//*  1. TO CREATE THE ZIP FILE FOR FTP TO SIM LIAN                              
//*  2. TO FTP THE ZIP FILE TO SIM LIAN. THE ZIP FILE WILL BE POSTFIX           
//*     WITH DATE AND TIME                                                      
//*  3. TO FTP THE APPLICATION DATA                                             
//*                                                                             
//*  IMPORTANT : FOR CONNECTIVITY TESTING, RUN STEP03 ONWARDS.                  
//*              STEP 1 AND 2 WILL READ THE PROD DATASET AND RE-CREATE          
//*              THE FILE TO SEND TO SIM LIAN. DO NOT RUN STEP1 AND 2.          
//*                                                                             
//* NOTE : THIS JCL CONSIST OF FTP FILE FOR E21 ONWARDS                         
//*                                                                             
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP13XXXX HH17 20130925 NEW JOB FOR E21 ONWARDS                              
//* BP135441 ZDD1 20141202 ADD E29                                              
//* BP135609 HH17 20150623 FTP MIGRATION TO LANSFTPP01 SERVER                   
//* BP135738 HH17 20150623 ADD E31                                              
//* BP135771 HH17 230615   ADD E32                                              
//* BP135809 HH17 060715   ADD E33                                              
//* BP135866 HH17 010915   ADD E34,E35 AND E36                                  
//* BP136059 ZDD1 070116   ADD E37                                              
//* BP136127 MRN1 040416   ADD E39                                              
//* BP136194 MRN1 310516   ADD E41                                              
//* BP136194 MRN1 210616   ADD E40                                              
//* BP136492 ZDD1 081116   REMOVED E23                                          
//* BP136754 MRN1 210617   ADD E43                                              
//* BP137803 ZDD1 131117   REMOVED E24                                          
//* BP137152 MRN1 200218   ADD E44                                              
//* BP137661 SRG1 160119   REMOVED E32                                          
//* BP137716 SSR1 080319   ADD E45                                              
//* BP137844 PP11 240519   REMOVED E21 E22 E26 E28 E34 E35                      
//* BP137844 PP11 070619   REMOVED E29                                          
//* BP138077 CT2  090120   ADD E46                                              
//* BP138149 PP11 23012020 REMOVED E30 E33 E36                                  
//* BP138102 PP11 07022020 ADDED E47                                            
//* BP138502 PP11 04012021 ADDED E48                                            
//* BP138555 PP11 15042021 ADDED E49                                            
//* BP138737 PP11 18052021 REMOVED E25 E31 E37 E39 E40 E41 E42 E43              
//* BP139037 PP11 10032022 ADDED E51                                            
//* BP139246 PP11 01092022 ADDED E52                                            
//* BP139357 PP11 08112022 REMOVED E46 E48 AND ADDED E53                        
//* BP139606 MRR5 26062023 ADDED E54                                            
//* BP139802 EFAQ1 13122023 ADDED E55                                           
//* BP139558 MRR5  20022024 ADDED E48, E46                                      
//*==================================================================           
//*********************************************************************         
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//*-------------------------------------------------------------------*         
//* STEP0  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//D53FS000 EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FB66.FTPREQ.APPL.E44')                                          
     DEL ('BP13.FTP.ZIP.APPL.E44')                                              
     DEL ('BP13.FB66.FTPUNIT.E44')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E44')                                              
     DEL ('BP13.FB66.FTPREQ.APPL.E45')                                          
     DEL ('BP13.FTP.ZIP.APPL.E45')                                              
     DEL ('BP13.FB66.FTPUNIT.E45')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E45')                                              
     DEL ('BP13.FB66.FTPREQ.APPL.E46')                                          
     DEL ('BP13.FTP.ZIP.APPL.E46')                                              
     DEL ('BP13.FB66.FTPUNIT.E46')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E46')                                              
     DEL ('BP13.FB66.FTPREQ.APPL.E47')                                          
     DEL ('BP13.FTP.ZIP.APPL.E47')                                              
     DEL ('BP13.FB66.FTPUNIT.E47')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E47')                                              
     DEL ('BP13.FB66.FTPREQ.APPL.E48')                                          
     DEL ('BP13.FTP.ZIP.APPL.E48')                                              
     DEL ('BP13.FB66.FTPUNIT.E48')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E48')                                              
     DEL ('BP13.FB66.FTPREQ.APPL.E49')                                          
     DEL ('BP13.FTP.ZIP.APPL.E49')                                              
     DEL ('BP13.FB66.FTPUNIT.E49')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E49')                                              
     DEL ('BP13.FB66.FTPREQ.APPL.E51')                                          
     DEL ('BP13.FTP.ZIP.APPL.E51')                                              
     DEL ('BP13.FB66.FTPUNIT.E51')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E51')                                              
     DEL ('BP13.FB66.FTPREQ.APPL.E52')                                          
     DEL ('BP13.FTP.ZIP.APPL.E52')                                              
     DEL ('BP13.FB66.FTPUNIT.E52')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E52')                                              
     DEL ('BP13.FB66.FTPREQ.APPL.E53')                                          
     DEL ('BP13.FTP.ZIP.APPL.E53')                                              
     DEL ('BP13.FB66.FTPUNIT.E53')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E53')                                              
     DEL ('BP13.FB66.FTPREQ.APPL.E54')                                          
     DEL ('BP13.FTP.ZIP.APPL.E54')                                              
     DEL ('BP13.FB66.FTPUNIT.E54')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E54')                                              
     DEL ('BP13.FB66.FTPREQ.APPL.E55')                                          
     DEL ('BP13.FTP.ZIP.APPL.E55')                                              
     DEL ('BP13.FB66.FTPUNIT.E55')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E55')                                              
                                                                                
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E44                                                        
//*------------------------------------------------------------------           
//D53FS44A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E44,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E44')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS44B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E44)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E44";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E44";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS44C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS44D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E44/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E44' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS44E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E44                                                        
//*------------------------------------------------------------------           
//D53FS44F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E44,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E44')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS44G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E44)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E44";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E44";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS44H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS44I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E44/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E44' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS44J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E45                                                        
//*------------------------------------------------------------------           
//D53FS45A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E45,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E45')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS45B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E45)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E45";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E45";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS45C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS45D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E45/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E45' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS45E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E45                                                        
//*------------------------------------------------------------------           
//D53FS45F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E45,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E45')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS45G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E45)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E45";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E45";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS45H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS45I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E45/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E45' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS45J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E46                                                        
//*------------------------------------------------------------------           
//D53FS46A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E46,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E46')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS46B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E46)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E46";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E46";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS46C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS46D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E46/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E46' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS46E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E46                                                        
//*------------------------------------------------------------------           
//D53FS46F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E46,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E46')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS46G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E46)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E46";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E46";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS46H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS46I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E46/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E46' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS46J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E47                                                        
//*------------------------------------------------------------------           
//D53FS47A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E47,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E47')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS47B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E47)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E47";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E47";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS47C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS47D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E47/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E47' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS47E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E47                                                        
//*------------------------------------------------------------------           
//D53FS47F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E47,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E47')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS47G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E47)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E47";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E47";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS47H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS47I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E47/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E47' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS47J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E48                                                        
//*------------------------------------------------------------------           
//D53FS48A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E48,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E48')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS48B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E48)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E48";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E48";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS48C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS48D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E48/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E48' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS48E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E48                                                        
//*------------------------------------------------------------------           
//D53FS48F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E48,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E48')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS48G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E48)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E48";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E48";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS48H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS48I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E48/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E48' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS48J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E49                                                        
//*------------------------------------------------------------------           
//D53FS49A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E49,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E49')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS49B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E49)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E49";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E49";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS49C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS49D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E49/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E49' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS49E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E49                                                        
//*------------------------------------------------------------------           
//D53FS49F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E49,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E49')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS49G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E49)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E49";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E49";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS49H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS49I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E49/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E49' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS49J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E51                                                        
//*------------------------------------------------------------------           
//D53FS51A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E51,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E51')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS51B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E51)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E51";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E51";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS51C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS51D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E51/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E51' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS51E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E51                                                        
//*------------------------------------------------------------------           
//D53FS51F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E51,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E51')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS51G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E51)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E51";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E51";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS51H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS51I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E51/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E51' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS51J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E52                                                        
//*------------------------------------------------------------------           
//D53FS51A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E52,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E52')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS51B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E52)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E52";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E52";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS51C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS51D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E52/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E52' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS51E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E52                                                        
//*------------------------------------------------------------------           
//D53FS51F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E52,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E52')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS51G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E52)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E52";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E52";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS51H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS51I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E52/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E52' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS51J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E53                                                        
//*------------------------------------------------------------------           
//D53FS53A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E53,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E53')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS53B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E53)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E53";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E53";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS53C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS53D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E53/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E53' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS53E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E53                                                        
//*------------------------------------------------------------------           
//D53FS53F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E53,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E53')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS53G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E53)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E53";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E53";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS53H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS53I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E53/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E53' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS53J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E54                                                        
//*------------------------------------------------------------------           
//D53FS54A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E54,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E54')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS54B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E54)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E54";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E54";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS54C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS54D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E54/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E54' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS54E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E54                                                        
//*------------------------------------------------------------------           
//D53FS54F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E54,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E54')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS54G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E54)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E54";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E54";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS54H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS54I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E54/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E54' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS54J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E55                                                        
//*------------------------------------------------------------------           
//D53FS55A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.APPL,DISP=SHR                                
//SORTOUT  DD DSN=BP13.FB66.FTPREQ.APPL.E55,DISP=(NEW,CATLG),                   
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,3,CH,EQ,C'E55')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS55B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.E55)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.APPL.E55";                         
     STDPUT7  =",APPLD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.APPL.E55";                                     
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS55C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS55D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E55/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.E55' ";                                 
     STDPUT7  = "APPLD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS55E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E55                                                        
//*------------------------------------------------------------------           
//D53FS55F EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E55,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E55')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS55G EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E55)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E55";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E55";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS55H EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS55I EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E55/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E55' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS55J EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
