//BP13A50A JOB (BP13P),'BP13D507',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : EXTRACT DBSS REQUEST FOR HHTY CHECK                   *         
//* THIS JOB ONLY SCHEDULE TO RUN DURING DBSS LAUNCHING PERIOD        *         
//* BP13A50A - EXTRACT DBSS CASES FOR HOUSEHOLD CHECK                 *         
//* BP13A501 - SMS, RSL, DEBARMENT CHECK                              *         
//* BP13A533 - TENAT PRIORITY SCHEME                                  *         
//* BP13A534 - PARENT/CHILD                                           *         
//* BP13A535 - 5YR                                                    *         
//* BP13A737 - 5YR                                                    *         
//*                                                                   *         
//*===================================================================*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                    *         
//* PRT01 : CLASS = 2                                                 *         
//*-------------------------------------------------------------------*         
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*---------------------------------------------------------------------        
//*  DELETE AND DEFINE BP13K730 - DBSS REQUEST FILE                             
//*---------------------------------------------------------------------------  
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.BLANK.CHAR500,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K730.MATURERQ.DBS) CLUSTER PURGE                             
         DEF CL (NAME(BP13.K730.MATURERQ.DBS)          -                        
                 CYL(8 5)                             -                         
                 UNIQUE                                -                        
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SPEED                                 -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K730.MATURERQ.DBS.DATA)    -                        
                 KEYS(8 122)                           -                        
                 RECSZ(500 500)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K730.MATURERQ.DBS)                                    
//*---------------------------------------------------------------------        
//* DEFINE DBSS OCCUP FILE BP13K825                                     -----   
//*--------------------------------------------------------------------------   
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.BLANK.CHAR200,DISP=SHR                                   
//SYSIN    DD *                                                                 
   DEL (BP13.K825.REQOCCP.DBS) CLUSTER PURGE                                    
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K825.REQOCCP.DBS)                   -                  001   
        SHR(2,3)                                       -                  001   
        KEYS(17 0)                                     -                  001   
        CYL(8 3)                                      -                   001   
        RECSZ(200 200)                                 -                  001   
        FREESPACE(30 30)                               -                  001   
        CISZ(4096)                                     -                  001   
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                  001   
        UNQ)                                           -                  001   
      DATA                                             -                      00
        (NAME(BP13.K825.REQOCCP.DBS.DATA))             -                  001   
      INDEX                                            -                      00
        (NAME(BP13.K825.REQOCCP.DBS.INDEX))                               001   
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K825.REQOCCP.DBS)                                        
//*------------------------------------------------------------------           
//* DEFINE DBSB ADDRESS FILE                                                    
//*------------------------------------------------------------------           
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.BLANK.CHAR250,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
         DEL 'BP13.K830.ADDR.DBS' CL PURGE                                      
         DEF CL (NAME(BP13.K830.ADDR.DBS)              -                        
                 CYL(4 3)                           -                           
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K830.ADDR.DBS.DATA)             -                   
                 KEYS(9 0)                             -                        
                 RECSZ(250 250)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K830.ADDR.DBS)                                        
//*-------------------------------------------------------------------*         
//* INCLUDE CASES WITH DTE-SOC-UPDATED AND SCH-ACC-NO (BOOKED CASES)            
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13FB78,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=3300,RECFM=FB),                                        
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(6,8,A),FORMAT=CH                                                
//*-------------------------------------------------------------------*         
//*  CREATE THE REQUESTS FOR DBSS FORM BP13KB78                                 
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13C02B,COND=(0,NE)                                00581021
//BP13FB78 DD DSN=&&BP13FB78,DISP=(OLD,PASS)                            00583024
//BP13K730 DD DSN=BP13.K730.MATURERQ.DBS,DISP=OLD,                      00584022
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K830 DD DSN=BP13.K830.ADDR.DBS,DISP=OLD,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K825 DD DSN=BP13.K825.REQOCCP.DBS,DISP=OLD,                               
//             AMP=('BUFND=4','BUFNI=8')                                        
//BE01F500 DD DSN=&&BE01F500,DISP=(,PASS),                              00583024
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=50,RECFM=FB),                                          
//            SPACE=(CYL,(10,10),RLSE)                                          
//BP13L02B DD SYSOUT=*                                                  00585021
//SYSDBG   DD SYSOUT=*                                                  00585021
//SYSDBOUT DD SYSOUT=*                                                  00585021
//SYSOUT   DD SYSOUT=*                                                  00585021
//*-------------------------------------------------------------------*         
//* SORT OUT DBSS CASES                                                         
//*-------------------------------------------------------------------*         
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.DBS,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F730MAT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(123,1,CH,EQ,C'5')                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP.DBS,DISP=SHR,                               
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&OCCP,DISP=(NEW,PASS),                                       
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A,107,2,A,9,9,A),FORMAT=CH                                 
    INCLUDE COND=(1,8,CH,GT,C'        ')                                        
//*-------------------------------------------------------------------*         
//* TO UPDATE LESSEE CHECK                                            *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=BP13C834,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730MAT,DISP=(OLD,PASS)                                     
//BP13F825 DD DSN=&&OCCP,DISP=(OLD,PASS)                                        
//BP13K825 DD DSN=BP13.K825.REQOCCP.DBS,DISP=SHR,                               
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L834 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* FOR MATURE NT - WITHOUT HHTY                                                
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.DBS,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP.DBS,DISP=SHR,                               
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F825LESS,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(131,1,CH,EQ,C'Y')                                             
//*-------------------------------------------------------------------*         
//* OUTREC BP13F558 FROM BP13K825 REQUEST OCCUPIER FILE               *         
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE               *         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"       *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC  PGM=BP13C059,COND=(0,NE)                                       
//BP13F500 DD  DSN=&&F730MAT,DISP=(OLD,PASS)                                    
//BP13F825 DD  DSN=&&F825LESS,DISP=(OLD,PASS)                                   
//BP13F558 DD  DSN=BP13.F558.UPGOCCP,DISP=OLD                                   
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
