//BP13Y705 JOB (BP13P),'BP13Y705',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* PRINT APPOINTMENT LETTER AT TOP STAGE TO INVITE APPLICANT                   
//* TO COLLECT KEY AT DBSS SITE                                                 
//*=================================================================            
//*  PRT01 : 1 COPY                                                             
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//PRT02   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1B CP-1',END;                                      
1$DJDE$ JDE=13POT6,JDL=BP13,FORMS=BLANKF,DUPLEX=YES,END;                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1B                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//*=================================================================            
//*  PRT03 : 1 COPY                                                             
//*-----------------------------------------------------------------            
//PRT03    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1C CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1C                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//PRT04   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1D CP-1',END;                                      
1$DJDE$ JDE=13POT6,JDL=BP13,FORMS=BLANKF,DUPLEX=YES,END;                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1D                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* SORT BY BLK, LEVEL, UNIT-NO                                                 
//* INCLUDE TAP PROJECT, CASES THAT BOOKED IN THE 1ST BATCH EX                  
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F120,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=700),                                  
//        SPACE=(CYL,(300,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
  INCLUDE COND=(356,3,CH,EQ,C'DBS',AND,615,3,CH,EQ,C'BH ',AND,                  
                299,6,CH,GT,C'000000',AND,299,6,CH,LT,C'201104')                
//*---------------------------------------------------------------------        
//* PRINT DBSS APPOINTMENT LETTER FOR COLLECION OF KEY AT TOP STAGE             
//*---------------------------------------------------------------------        
//STEP03    EXEC PGM=BP13CD56,COND=(0,NE)                                       
//BM06F120  DD DSN=&&BM06F120,DISP=(OLD,PASS)                                   
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR                                     
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KB20  DD DSN=BP13.KB20.DBSBK,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13PD56  DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                       
//BP13LD56  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* PRINT DBSS APPOINTMENT LETTER FOR COLLECION OF KEY AT TOP STAGE             
//* 2ND COPY                                                                    
//*---------------------------------------------------------------------        
//STEP04    EXEC PGM=BP13CD56,COND=(0,NE)                                       
//BM06F120  DD DSN=&&BM06F120,DISP=(OLD,PASS)                                   
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR                                     
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KB20  DD DSN=BP13.KB20.DBSBK,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13PD56  DD SYSOUT=W,OUTPUT=(*.PRT04.FORMID),DEST=IOMW                       
//BP13LD56  DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
