//BP13A59O JOB (BP13P),'BP13A59O',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//*---------------------------------------------------------------------        
//* SELECTION 2 CASES FOR PRE EMAIL SENDING VERIFICATION                        
//*---------------------------------------------------------------------        
//*-------------------------------------------------------------------*         
//* EMPTY MONTHLY ACCUMULATED EMAIL FILES                             *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR200,DISP=OLD                                   
//OUTPUT01 DD DSN=BP13.F23A.EMAIL.SL.F100.VFY,DISP=OLD                          
//OUTPUT02 DD DSN=BP13.F23A.EMAIL.SL.F200.VFY,DISP=OLD                          
//OUTPUT03 DD DSN=BP13.F23A.EMAIL.SL.F300.VFY,DISP=OLD                          
//OUTPUT04 DD DSN=BP13.F23A.EMAIL.SL.F400.VFY,DISP=OLD                          
//OUTPUT05 DD DSN=BP13.F23A.EMAIL.SL.F500.VFY,DISP=OLD                          
//OUTPUT06 DD DSN=BP13.F23A.EMAIL.SL.F600.VFY,DISP=OLD                          
//OUTPUT07 DD DSN=BP13.F23A.EMAIL.SL.F700.VFY,DISP=OLD                          
//OUTPUT08 DD DSN=BP13.F23A.EMAIL.SL.F800.VFY,DISP=OLD                          
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT01)                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT02)                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT03)                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT04)                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT05)                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT06)                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT07)                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT08)                                 
//*---------------------------------------------------------------------        
//* SL                                                                          
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=ICETOOL                                                     
//DFSMSG   DD SYSOUT=*                                                          
//TOOLMSG  DD SYSOUT=*                                                          
//IN01 DD DSN=BP13.F23A.EMAIL.SL.F100,DISP=SHR                                  
//IN02 DD DSN=BP13.F23A.EMAIL.SL.F200,DISP=SHR                                  
//IN03 DD DSN=BP13.F23A.EMAIL.SL.F300,DISP=SHR                                  
//IN04 DD DSN=BP13.F23A.EMAIL.SL.F400,DISP=SHR                                  
//IN05 DD DSN=BP13.F23A.EMAIL.SL.F500,DISP=SHR                                  
//IN06 DD DSN=BP13.F23A.EMAIL.SL.F600,DISP=SHR                                  
//IN07 DD DSN=BP13.F23A.EMAIL.SL.F700,DISP=SHR                                  
//IN08 DD DSN=BP13.F23A.EMAIL.SL.F800,DISP=SHR                                  
//*                                                                             
//OUT01 DD DSN=BP13.F23A.EMAIL.SL.F100.VFY,DISP=MOD                             
//OUT02 DD DSN=BP13.F23A.EMAIL.SL.F200.VFY,DISP=MOD                             
//OUT03 DD DSN=BP13.F23A.EMAIL.SL.F300.VFY,DISP=MOD                             
//OUT04 DD DSN=BP13.F23A.EMAIL.SL.F400.VFY,DISP=MOD                             
//OUT05 DD DSN=BP13.F23A.EMAIL.SL.F500.VFY,DISP=MOD                             
//OUT06 DD DSN=BP13.F23A.EMAIL.SL.F600.VFY,DISP=MOD                             
//OUT07 DD DSN=BP13.F23A.EMAIL.SL.F700.VFY,DISP=MOD                             
//OUT08 DD DSN=BP13.F23A.EMAIL.SL.F800.VFY,DISP=MOD                             
//TOOLIN    DD *                                                                
  COPY FROM(IN01) USING(CT01)                                                   
  COPY FROM(IN02) USING(CT02)                                                   
  COPY FROM(IN03) USING(CT03)                                                   
  COPY FROM(IN04) USING(CT04)                                                   
  COPY FROM(IN05) USING(CT05)                                                   
  COPY FROM(IN06) USING(CT06)                                                   
  COPY FROM(IN07) USING(CT07)                                                   
  COPY FROM(IN08) USING(CT08)                                                   
//*                                                                             
//CT01CNTL  DD *                                                                
  OUTFIL FNAMES=OUT01,OUTREC=(1,73,C'CT2@HDB.GOV.SG',36X,124,77),               
         ACCEPT=2                                                               
//CT02CNTL  DD *                                                                
  OUTFIL FNAMES=OUT02,OUTREC=(1,73,C'CT2@HDB.GOV.SG',36X,124,77),               
         ACCEPT=2                                                               
//CT03CNTL  DD *                                                                
  OUTFIL FNAMES=OUT03,OUTREC=(1,73,C'CT2@HDB.GOV.SG',36X,124,77),               
         ACCEPT=2                                                               
//CT04CNTL  DD *                                                                
  OUTFIL FNAMES=OUT04,OUTREC=(1,73,C'CT2@HDB.GOV.SG',36X,124,77),               
         ACCEPT=2                                                               
//CT05CNTL  DD *                                                                
  OUTFIL FNAMES=OUT05,OUTREC=(1,73,C'CT2@HDB.GOV.SG',36X,124,77),               
         ACCEPT=2                                                               
//CT06CNTL  DD *                                                                
  OUTFIL FNAMES=OUT06,OUTREC=(1,73,C'CT2@HDB.GOV.SG',36X,124,77),               
         ACCEPT=2                                                               
//CT07CNTL  DD *                                                                
  OUTFIL FNAMES=OUT07,OUTREC=(1,73,C'CT2@HDB.GOV.SG',36X,124,77),               
         ACCEPT=2                                                               
//CT08CNTL  DD *                                                                
  OUTFIL FNAMES=OUT08,OUTREC=(1,73,C'CT2@HDB.GOV.SG',36X,124,77),               
         ACCEPT=2                                                               
//*                                                                             
