//BP13AAST JOB (BP13P),'BP13AAST',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* CHG REF   BY    DATE      DESCRIPTION                                       
//* --------  ----  --------  -----------------------------------------         
//* BP134914  SMR2  13062013  SHORTLIST APPLICATIONS ELIGIBLE                   
//* FOR DIVORCED/WIDOWED PERSONS PRIORITY SCHEME                                
//* BP134914  SMR2  24062013  VERIFY BP13K010/BP13K740/BP13K712                 
//* BP135170  IL5   15012014  TO OMIT MGPS RECORDS FROM C817.                   
//* BP135708  SMR2  31032015  CHANGE CLASS=2 TO CLASS=J                         
//* BP135998  IL5   02122015  OMIT FLAT TYPE 2F                                 
//* BP136096  IL5   13012016  OMIT ELDERLY APPLICATIONS                         
//* BP136107  SMR2  17022016  ACCEPT PARAMETER FROM JCL IN BP13C525             
//* BP138301  AM25  14052020  HARDCOPY REPORTS CONVERSION                       
//**********************************************************************        
//*      VERIFY FILES BEFORE JOB RUN                                            
//**********************************************************************        
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.AST,DISP=OLD                                 
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.AST,DISP=OLD                               
//INPUT3   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F740.MATUREBA.AST,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS UNDER DIVORCED/WIDOWED PERSONS PRIORITY SCHEME         
//*---------------------------------------------------------------------        
//STEP02  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=BP13.F740.MATUREBA.PAAST,DISP=OLD                              
//SYSIN   DD  *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,471,1,CH,EQ,C'Y',AND,                  
                 (210,1,CH,EQ,C' ',OR,210,1,CH,EQ,C'N'))                        
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR PPS & NON-PPS APPLICANTS / AST & NON-AST / SAP             
//*-----------------------------------------------------------------            
//STEP02A  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=BP13.F740.MATUREBA.PAAST,DISP=SHR                             
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR DIVORCED/WIDOWED PRIORITY SCHEME          
//* REMAINING ETHNIC AND HH QUOTAS WILL BE USED FOR PUBLIC APPLICANTS           
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13U543,COND=(0,NE)                                        
//STEPLIB   DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                           
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13K010  DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//BP13F740  DD DSN=BP13.F740.MATUREBA.PAAST,DISP=SHR                            
//BP13K740  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K712  DD DSN=BP13.K712.FLATNHUG,DISP=SHR,                                 
//             AMP=('BUFND=23')                                                 
//BP13F525  DD DSN=BP13.F525.APPL,DISP=OLD                                      
//BP13L543  DD SYSOUT=8,DEST=IOM8                                               
//P13L543A  DD SYSOUT=8,DEST=IOM8                                               
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 4,5,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP04A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'4P',OR,                                                      
       4,2,CH,EQ,C'5P',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP04B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010AFN,DISP=(OLD,PASS)                                    
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 1,2 FLATS TO PRINT FLAT SUPPLY BEFORE ADJUST PA FLAT               
//*-----------------------------------------------------------------            
//STEP04C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K0104RM1,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE ADJUST PA FLAT SUPPLY            
//*-----------------------------------------------------------------            
//STEP04D   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K0104RM1,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG AFTER PIGEONHOLING                 
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13L552 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY REGN                                                                
//* INCLUDE ONLY APPLICATIONS UNDER DIVORCED/WIDOWED PRIORITY SCHEME            
//*---------------------------------------------------------------------        
//STEP06  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F520REGN,DISP=(,PASS),                                       
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,471,1,CH,EQ,C'Y',AND,                  
                 (210,1,CH,EQ,C' ',OR,210,1,CH,EQ,C'N'))                        
//*-----------------------------------------------------------------            
//* SORT BY REGN ON BALLOT FILE TO GET RESULT                                   
//*-----------------------------------------------------------------            
//STEP07  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                   
//        AMP=('BUFND=23')                                                      
//SORTOUT DD DSN=&&F520BALT,DISP=(,PASS),                                       
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OMIT COND=(245,1,CH,EQ,C'P',OR,245,1,CH,EQ,C'C')                            
//*---------------------------------------------------------------------        
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------------        
//STEP08   EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520REGN,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,PASS)                                    
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13SUCC,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT REPORT ON SUCC FOR THIS ROUND BY ALLOC-SCHEME                         
//*------------------------------------------------------------------           
//STEP10   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
AST                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS UNDER DIVORCED/WIDOWED PERSONS PRIORITY SCHEME         
//*---------------------------------------------------------------------        
//STEP11  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=&&F740SUCC,DISP=(SHR,PASS)                                     
//SORTOUT DD DSN=BP13.F740.MATUREBA.PAAST.SUCC,DISP=MOD                         
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* PRINT REPORT ON SUCC PPS & NON-PPS APPLICANTS / AST & NON-AST / SAP         
//*---------------------------------------------------------------------        
//STEP12   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,DELETE)                                  
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*------------------------------------------------------------------           
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=(471,1,CH,EQ,C'Y')                                              
//*------------------------------------------------------------------           
//* PRINT REPORT ON TOTAL CUMULATIVE SUCC BY ALLOC-SCHEME                       
//*------------------------------------------------------------------           
//STEP14   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=8,DEST=IOM8                                                
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
ALA                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* FOR MATURE NT                                                               
//* SORT UNSUCC PRIORITY,SAS AND PUBLIC CASES FOR PA PIGEONHOLONG               
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.PA,DISP=OLD                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,213,3,CH,NE,C'GRO',AND,                 
                 245,1,CH,EQ,C' ')                                              
//*--------------------------------------------------------------------         
//* END BP13AAST                                                                
//*--------------------------------------------------------------------         
