//BP13A202 JOB (BP13P),'BP13A202',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR UPDATING OF BOOKING APPMT DATE AND TIME FOR                 
//* NON-MATURE NEW TOWNS ONLY (BOOKING EXERCISE ON ZONE BASIS).                 
//*CHG REQ  OIC   DATE    DESCRIPTION                                           
//*=====================================                                        
//*BP131017 LMS1 25/05/01 DO NOT WRITE TO BP13K222, BP13K230, BP13K240.         
//*BP132278 JF4  28/03/03 CHGE BP13F230/F240 LRECL TO 450.                      
//*BP132452 MJ16 29/12/03 INCLUDED NEW PGM BP13C207 TO UPDATE BB14K500          
//*                       & BB14K580,REMOVE BP13K800 FROM PGM BP13C241          
//*                       & FROM STEP1                                          
//*BP132560 LMS1 28/07/04 TO CATER FOR PINNACLE@DUXTON                          
//*BP132634 LMS1 02/12/04 TO REMOVE BP13C20G (FOR THE PINNACLE@DUXTON)          
//*BP132708 LMS1 27/06/05 TO ADD BP13C27A                                       
//*BP132851 CT2  09/11/06 TO ADD BP13CB07 TO UPDATE BP13K203                    
//*BP133056 RB12 14/06/07 RE-ADD STEP FOR BP13C20G                              
//*BP133271 CT2  13/03/08 TO FILTER BP13F200 TO PASS TO BP13CB07                
//*BP133392 LMS1 28/07/08 JCL FOR MAIN SELECTION ONLY                           
//*BP133610 ESA1 01/06/09 REPLACE BP13K767 WITH BP13K816                        
//*BP133724 DW5  06/11/09 TO ADD SENDING OF INTV FLATLIST TO EQMS               
//*BP133851 ESA1 10/03/10 TO ADD BP13K800 IN BP13C241                           
//*BP133851 ESA1 12/03/10 TO ADD READING OF BP13KQ30 IN BP13C227                
//*BP133896 ESA1 07/05/10 TO EXPAND SIZE OF BACKUP DATA                         
//*BP133684 DW5  14/05/10 TO UPDATE EQMS FILE NAME                              
//*BP134043 ESA1 01/12/10 TO UPDATING SORTING IN STEP25 & STEP27                
//*BP134086 ESD1 30/12/10 CATER TO STOP SENDING TXT TO MEDIACORP                
//*                       PERMANENTLY.                                          
//*BP134253 DW5  03/06/11 CATER FOR OFFICE HOUR SCHEDULING CONTINUE             
//*                       WITH BP13D216 AFTER OFFICE HOUR                       
//*BP134253 DW5  05/07/11 TO INCLUDE UPDATING BP13K222                          
//*BP134513 ESA1 12/04/12 TO ADD BP13K200 ALT FILE IN BP13C241                  
//*BP134769 EL27 04/02/13 REMOVED STEP09 ACCUM INTO CTRL REC                    
//*                       BP13.F205.APZNREC. THIS WILL PREVENT THE              
//*                       TRIGGERING OF BP13D216, CREATE INTV FLATLIST          
//*BP13XXXX EL27 06/11/13 UNIT=(SYSDA,10) FOR 200.BKAPPMT FILES                 
//*BP135404 ESA1 03/07/14 TO REMOVE PRINTING OF CNTRL RRT FOR BP13C240          
//*BP135178 ESA1 11/11/14 TO ROUTE PRINTING TO CLASS 'J'                        
//*BP136442 ESA1 26/09/16 TO ADD BP13F205 FILE IN BP13C241                      
//*BP13XXXX EL27 20190920 REMOVE BP13.F200.BKAPPMT DUPLICATES                   
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=J,                                                        
//             OUTPUT=(*.FORMID),DEST=IOMJ                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=OLD                                                         
//INPUT3   DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 5 - SCHEDULE BOOKING APPMT (ZONE)                       
//*--------------------------------------------------------------------         
//STEP1A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&F205,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=80),                                             
//        SPACE=(CYL,(5,2),RLSE)                                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'UZ')                                              
//*--------------------------------------------------------------------*        
//*  TO BACKUP FILES BEFORE UPDATE                                              
//*--------------------------------------------------------------------*        
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F200.BKAPPMT.BACKUP(+1),                                
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=300,RECFM=FB)                  
//INPUT2   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.F210.BKWKPLAN.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                  
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
/*                                                                              
//*--------------------------------------------------------------------*        
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO                       
//*--------------------------------------------------------------------*        
//STEP03 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SUM FIELDS=NONE                                                             
    SORT FIELDS=(9,3,A,12,2,A,50,6,A,57,5,A),FORMAT=CH                          
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CANCELLATION CASES                                                          
//*--------------------------------------------------------------------*        
//STEP04 EXEC    PGM=BP13C240,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,DELETE)                                                
//P13F200O DD  DSN=&&P13F200B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//P13F240O DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CASES WITH SHORTLIST-QTR NOT THE SAME AS BALLOT-QTR.                        
//*--------------------------------------------------------------------*        
//STEP05 EXEC    PGM=BP13C273,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L273 DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK SOC MASTER FILE FOR CASES ALREADY ACCEPTED A FLAT.                 
//*--------------------------------------------------------------------*        
//STEP06 EXEC    PGM=BP13C285,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200C,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L285 DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*00000690
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE      00000700
//* CASES WITH DIFFERENT ZONE/NT/FT.                                    00000710
//*--------------------------------------------------------------------*00000720
//STEP6A EXEC    PGM=BP13C27A,COND=(0,NE)                               00000730
//BP13F200 DD  DSN=&&P13F200D,                                          00000740
//             DISP=(SHR,PASS)                                          00000750
//BP13F205 DD  DSN=&&F205,                                              00000760
//             DISP=(SHR,PASS)                                          00000770
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000780
//             DISP=SHR                                                 00000790
//P13F200O DD  DSN=&&P13F200E,                                          00000800
//             DISP=(NEW,PASS),                                         00000810
//             UNIT=(SYSDA,10),                                         00000820
//             SPACE=(CYL,(10,5),RLSE),                                 00000830
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00000840
//BP13L27A DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                 00000870
//SYSDBOUT DD  SYSOUT=*                                                 00000880
//SYSOUT   DD  SYSOUT=*                                                 00000890
/*                                                                      00000900
//*--------------------------------------------------------------------*        
//*  TO SCHEDULE BOOKING APPOINTMENT BY NT/FT/REGN-NO BASED ON THE     *        
//*  BOOKING WORK PLAN                                                 *        
//*--------------------------------------------------------------------*        
//STEP07 EXEC    PGM=BP13C241,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13F200 DD  DSN=&&P13F200E,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13K200 DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K201 DD  DSN=BP13.K200.BKAPPMT.PATH1,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
/*                                                                              
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP08 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//*     TO CREATE ALLOCATION SUMMARY FILE (BP13K222)                            
//*---------------------------------------------------------------------        
//STEP10    EXEC PGM=BP13C24F,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&F205,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13F222 DD  DSN=&&P13F222,                                                   
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                               
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT SUMALLOC IN KEY FLD ORDER                                              
//*---------------------------------------------------------------------        
//STEP11 EXEC    SORT                                                           
//SORTIN   DD  DSN=&&P13F222,                                                   
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&A202F222,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,13,A),FORMAT=CH                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE SUMMARY ALLOCATION FILE                                              
//*---------------------------------------------------------------------        
//STEP12 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&A202F222,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                              
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC WTOG,COND=(0,NE)                                                
   ----> ############################################                           
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13A202                             
   ---->    PLEASE GROUP OPEN BP13H.                                            
   ----> ############################################                           
