//BP13NTT1 JOB (BP13P),'BP13NTT1',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//*                                                                             
//*  THIS JOB IS USE                                                            
//*  1. TO FTP THE TXT FILE TO MOE.                                             
//*     DATASET(BP13.F216.MOEBOOK)  FILENAME(PU_HDB_HDBBOOK_IN.TXT)             
//*     DATASET(BP13.F216.MOEKEY)   FILENAME(PU_HDB_HDBKEY_IN.TXT)              
//*     DATASET(BP13.F216.MOEPREYR) FILENAME(PU_HDB_MOEPREYR_IN.TXT)            
//*                                                                             
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP133376 DW5  100609   NEW JCL FOR FTP FILE TO MOE                          
//* BP135581 LJL1 281114   MIGRATION OF FTP SCRIPT (MOE) TO LANSFTPP01          
//*                        & HBSFTPP01.                                         
//*==================================================================           
//******************************************************************            
//* FTP MOE FILE TO LANSFTPP01 SERVER                                           
//******************************************************************            
//*-------------------------------------------------------------------*         
//* STEP1  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.SEQ.PUTGET.MOE')                                                
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//* STEP 2: PREPARE THE FTP STATEMENT FOR FTP                                   
//******************************************************************            
//STEP02   EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.MOE,DISP=(,CATLG),                            
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=225,BLKSIZE=0),                    
//            SPACE=(CYL,(1,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     PUT    'CD \PROD\APPN\DATA\BP13\FROM-HDB\MOE\MF';                          
     PUT    'ASCII';                                                            
     STDPUT1  = "PUT 'BP13.F216.MOEBOOK' ";                                     
     STDPUT2  = "PU_HDB_HDBBOOK_IN.TXT";                                        
     STDPUT3  = "PUT 'BP13.F216.MOEKEY' ";                                      
     STDPUT4  = "PU_HDB_HDBKEY_IN.TXT";                                         
     STDPUT5  = "PUT 'BP13.F216.MOEPREYR' ";                                    
     STDPUT6  = "PU_HDB_MOEPREYR_IN.TXT";                                       
     STDPUT7  = "QUIT";                                                         
     PUT STDPUT1 STDPUT2;                                                       
     PUT STDPUT3 STDPUT4;                                                       
     PUT STDPUT5 STDPUT6;                                                       
     PUT STDPUT7;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO IDEAL2 SERVER (OLD)                                                 
//*  FTP TO SERVER LANSFTPP01 (PROD)                                            
//*  FTP TO SERVER LANSFTPT01 (DEVT)                                            
//******************************************************************            
//STEP03   EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.MOE,DISP=SHR                                  
//*                                                                             
