//BP13A50F JOB (BP13P),'BP13A50F',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//        NOTIFY=CSD0071                                                        
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : TO BACKUP DATASET GENERATED AT LAUNCH                 *         
//*             FOR S MODE / BALLOT DATE / NT / FT /                  *         
//*             FIRST-TIMER COUNT / FIRST-TIMER PERCENTAGE            *         
//* THIS JOB IS SCHDULED TO RUN DURING  LAUNCH PERIOD                 *         
//* BP13A50D - EXTRACT CASES FOR HOUSEHOLD CHECK                      *         
//* BP13A507 - CLEARS BP13.FF01.SALES.DEMAND.ACCUM                    *         
//*===================================================================*         
//STEP1    EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.FF01.SALES.DEMAND,                                       
//         DISP=SHR                                                             
//OUTPUT   DD DSN=BP13.FF01.SALES.DEMAND.ACCUM,DISP=MOD                         
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT) OFILE(OUTPUT)                                          
//*===============================================================              
//STEP2    EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR                               
//OUTPUT   DD DSN=BP13.F730.MATURERQ.SBF.BKUP(+1),DISP=(NEW,CATLG),             
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT) OFILE(OUTPUT)                                          
//*===============================================================              
//*===============================================================              
//STEP3    EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.K825.REQOCCP.SBF,DISP=SHR                                
//OUTPUT   DD DSN=BP13.F825.REQOCCP.SBF.BKUP(+1),DISP=(NEW,CATLG),              
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT) OFILE(OUTPUT)                                          
//*===============================================================              
