//BP13REV5  JOB (BP13P),'BP13REV5',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//*---------------------------------------------------------------              
//*- RECOVERY JOB FOR BP13D403                                                  
//*---------------------------------------------------------------------        
//*  TO OMIT OVERTIME STAFF RECORDS FROM                                        
//*  BP13F860 - SECURITY USER BACKUP FILE                                       
//*BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                  
//*--------------------------------------------------------------------         
//STEP01  EXEC SORT                                                             
//SORTIN  DD DSN=BP13.F860.USER,DISP=SHR                                        
//SORTOUT DD DSN=&&BP13F860,DISP=(NEW,PASS),                            00040010
//        UNIT=3380,SPACE=(TRK,(20,10),RLSE),                           00050006
//        DCB=(RECFM=FB,LRECL=80,BLKSIZE=32720)                         00051006
//SYSIN   DD  *                                                                 
    SORT FIELDS=(1,9,A),FORMAT=CH                                               
    OMIT COND=(41,1,CH,EQ,C'Y')                                                 
//*--------------------------------------------------------------------         
//*  TO DEFINE BP13.K860.USER                                           00020004
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                  00030000
//SYSPRINT DD SYSOUT=*                                                  00040000
//INPUT1   DD DSN=&&BP13F860,DISP=(SHR,DELETE)                          00040010
//SYSIN    DD *                                                         00050000
  DEL (BP13.K860.USER) CL PURGE                                         001     
  DEF CLUSTER                                         -                 001     
        (NAME(BP13.K860.USER)                         -                   001   
        SHAREOPTIONS(2,3)                             -                   001   
        RECSZ(80 80)                                  -                   001   
        KEYS(9 0)                                     -                   001   
        TRK(20 10)                                    -                   001   
        CISZ(4096)                                    -                   001   
        STORCLAS(PRODRLS)                             -                         
        LOG(NONE)                                     -                         
        INDEXED                                       -                   001   
        UNIQUE)                                       -                   001   
      DATA                                            -                       00
        (NAME(BP13.K860.USER.DATA))                   -                   001   
      INDEX                                           -                       00
        (NAME(BP13.K860.USER.INDEX))                                      001   
      IF MAXCC = 0  THEN                              -                 00033818
         REPRO IFILE(INPUT1)                          -                 00033918
              ODS(BP13.K860.USER)                     -                 00034018
               REUSE                                                            
         IF MAXCC = 0 THEN                            -                         
           DEF AIX (NAME(BP13.K860.USER.ALTX1)        -                         
               REL(BP13.K860.USER)                    -                         
               TRK(10 5)                              -                         
               SHR(2 3)                               -                         
               UNIQUE                                 -                         
               KEYS(1 8)                              -                         
               CISZ(4096)                             -                         
               RECSZ(906 5000)                        -                         
               NUNQK)                                                           
         IF LASTCC = 0 THEN                           -                         
           DEF PATH(NAME(BP13.K860.USER.PATH1)        -                         
               PENT(BP13.K860.USER.ALTX1))                                      
         IF LASTCC = 0 THEN                           -                         
           BIX IDS(BP13.K860.USER)                    -                         
               ODS(BP13.K860.USER.ALTX1)                                        
//*--------------------------------------------------------------------         
//*  TO OMIT OVERTIME STAFF RECORDS FROM                                        
//*  BP13F870 - SECURITY PANEL BACKUP FILE                                      
//*--------------------------------------------------------------------         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F870.PANEL,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F870,DISP=(NEW,PASS),                           00040010
//         UNIT=3380,SPACE=(TRK,(50,25),RLSE),                          00050006
//         DCB=(RECFM=FB,LRECL=30,BLKSIZE=32760)                        00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,13,A),FORMAT=CH                                              
    OMIT COND=(15,1,CH,EQ,C'Y')                                                 
//*--------------------------------------------------------------------         
//*  TO DEFINE BP13.K870.PANEL                                          00020004
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                  00030000
//SYSPRINT DD SYSOUT=*                                                  00040000
//INPUT1   DD DSN=&&BP13F870,DISP=(SHR,DELETE)                          00040010
//SYSIN    DD *                                                         00050000
  DEL (BP13.K870.PANEL) CL PURGE                                        001     
  DEF CLUSTER                                         -                 001     
        (NAME(BP13.K870.PANEL)                        -                   001   
        SHAREOPTIONS(2,3)                             -                   001   
        RECSZ(30 30)                                  -                   001   
        KEYS(13 0)                                    -                   001   
        TRK(50 25)                                    -                   001   
        CISZ(4096)                                    -                   001   
        STORCLAS(PRODRLS)                             -                         
        LOG(NONE)                                     -                         
        INDEXED                                       -                   001   
        UNIQUE)                                       -                   001   
      DATA                                            -                       00
        (NAME(BP13.K870.PANEL.DATA))                  -                   001   
      INDEX                                           -                       00
        (NAME(BP13.K870.PANEL.INDEX))                                     001   
      IF MAXCC = 0  THEN                              -                 00033818
         REPRO IFILE(INPUT1)                          -                 00033918
              ODS(BP13.K870.PANEL)                    -                 00034018
               REUSE                                                            
         IF MAXCC = 0 THEN                            -                         
           DEF AIX (NAME(BP13.K870.PANEL.ALTX1)       -                         
               REL(BP13.K870.PANEL)                   -                         
               TRK(20 10)                             -                         
               SHR(2 3)                               -                         
               UNIQUE                                 -                         
               KEYS(5 8)                              -                         
               CISZ(4096)                             -                         
               RECSZ(8000 8000)                       -                         
               NUNQK)                                                           
         IF LASTCC = 0 THEN                           -                         
           DEF PATH(NAME(BP13.K870.PANEL.PATH1)       -                         
               PENT(BP13.K870.PANEL.ALTX1))                                     
         IF LASTCC = 0 THEN                           -                         
           BIX IDS(BP13.K870.PANEL)                   -                         
               ODS(BP13.K870.PANEL.ALTX1)                                       
