//BP13D414  JOB (BP13P),'BP13D414',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*==================================================================           
//* THIS JOB IS RUN AT 1:00AM EVERYDAY                                          
//*==================================================================           
//*                                                                             
//* AGREEMENT TEAM DAILY EMAIL ALERT                                            
//*                                                                             
//*==================================================================           
//* CHG REF  DATE     BY   DESC                                                 
//* -------- -------- ---- -----                                                
//* BP135893 PCL4 270915 - BP13C38N TO GENERATE TP/SATP VERIFICATION            
//*                        CASES REPORT FROM K429(MOVED FROM BP13D108)          
//* BP135711 RJB1 120815 - TO INCLUDE REPORT SUBMISSION OF PPO DISPOSAL         
//*                        /TRANSFER DOCUMENTS FOR STUDIO APT CASES             
//* BP135782 KAM4 270815   ADDED STEP09-12 FOR CRM SOCA EMAIL ALERT             
//* BP136020 RJB1 161215   ADDED STEPS FOR TOL REPORTS                          
//* BP136263 PCL4 010916   BP13C38W/BP13C38V - REPORT ON NOTIFY                 
//*                        APPROVAL TO WAIVE/REDUCE CASH PROCEED                
//* BP136263 PCL4 111016   TO UPDATE TO COND=(4,LT) FROM STEP28                 
//* BP136548 PCL4 191216   TO CATER OF (BC/BL) BP13C38W                         
//* BP136548 PCL4 030117   TO ADD BP13C38Y                                      
//* BP136925 PCL4 150817   TO READ BM06K110 IN BP13C38V                         
//* BP137665 DN8  070219   TO CATER OF REPORTS ON 1ST BUY/1ST SELL CASES        
//*==================================================================           
//*-------------------------------------------------------------------*         
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                         *         
//*-------------------------------------------------------------------*         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K429.VERIFY,DISP=SHR                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------------        
//* SORT BP13K429                                                               
//*---------------------------------------------------------------------        
//STEP01  EXEC SORT,COND=(4,LT)                                                 
//SORTIN   DD DSN=BP13.K429.VERIFY,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F429,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=400)                                             
//SYSIN    DD *                                                                 
       SORT FIELDS=(1,8,A),FORMAT=CH                                            
       INCLUDE COND=(1,1,CH,NE,C' ')                                            
//*--------------------------------------------------------------------         
//* BP13C38N - PRINT VERIFICATION REPORT                                        
//*--------------------------------------------------------------------         
//STEP02 EXEC    PGM=BP13C38N,COND=(4,LT)                                       
//BP13F429 DD  DSN=&&BP13F429,DISP=(OLD,PASS)                                   
//BP13K429 DD  DSN=BP13.K429.VERIFY,DISP=SHR                                    
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BP13L38N DD  DSN=BP13.L38N.BP13L38N,DISP=SHR                                  
//MAILC38N DD  DSN=BP13.MAILRPT.BP13L38N,DISP=SHR                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13C38N)                                            
//*-----------------------------------------------------------------            
//STEP03   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L38N,DISP=SHR                                
//*---------------------------------------------------------------------        
//* DEFINE 'BP13.K429.VERIFY'                                           00810000
//*       DEL 'BP13.K429.VERIFY' CL PURGE                               00800000
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IDCAMS,COND=(4,LT)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1    DD DSN=BP13.BLANK.CHAR400,DISP=SHR                                  
//SYSIN    DD  *                                                                
          DEL 'BP13.K429.VERIFY' CL PURGE                               00800000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K429.VERIFY)                -                  00810000
              CYL(50 50)                             -                  00830000
              DATACLAS(MULTIVOL)                     -                          
              UNIQUE                                 -                  00840000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K429.VERIFY.DATA)           -                  00870000
              KEYS(8 0)                              -                  00880000
              RECSZ(400 400)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K429.VERIFY.INDEX)          -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K429.VERIFY)                                     00720000
//*-------------------------------------------------------------------*         
//*  SORT BM06F190 TO GET TRANS TYPE B21500                                     
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BM06.F190.LOG.DAILY(0),DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F190,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=650)                                             
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
  INCLUDE COND=(637,6,CH,EQ,C'B21500')                                          
//*-------------------------------------------------------------------*         
//* SORT BM06F190 TO GET SYS-DATE EQUAL TO CURRENT DATE                         
//*-----------------------------------------------------------------            
//STEP05  EXEC PGM=BP13CH5A,COND=(4,LT)                                         
//BM06F190 DD DSN=&&BM06F190,DISP=(OLD,PASS)                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BM06F100 DD DSN=&&BM06F100,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=500)                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SUBMISSION OF PPO DISPOSAL/TRANSFER DOCUMENTS FOR STUDIO APT CASES          
//*-----------------------------------------------------------------            
//STEP06 EXEC    PGM=IKJEFT01,COND=(4,LT),                              00001650
//             DYNAMNBR=20                                              00001660
//BM06F100 DD DSN=&&BM06F100,DISP=(OLD,PASS)                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                              
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BR10K010 DD DSN=BR10.K010.PTEPPTY,DISP=SHR                                    
//BR10K011 DD DSN=BR10.K010.PTEPPTY.PATH1,DISP=SHR                              
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13LH51 DD DSN=BP13.MAILRPT.BP13CH51,DISP=SHR                                
//P13LH51A DD DSN=BP13.MAILRPT.P13LH51A,DISP=SHR                                
//SYSPRINT DD  SYSOUT=*                                                 00001900
//SYSTSPRT DD  SYSOUT=*                                                 00001910
//SYSOUT   DD  SYSOUT=*                                                 00001920
//SYSABOUT DD  SYSOUT=*                                                 00001930
//SYSTSIN  DD  *                                                        00001940
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13CH51) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                      00001950
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13CH51)                                            
//*-----------------------------------------------------------------            
//STEP07   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13CH51,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (P13LH51A)                                            
//*-----------------------------------------------------------------            
//STEP08   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.P13LH51A,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*  TO SORT BP13K022 BY ALERT-CDE, ALERT-TYPE AND MAIL-SENT          *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.K022.WISOIC,DISP=SHR                             00940001
//SORTOUT  DD DSN=&&P13F022,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=100),                              
//            SPACE=(CYL,(8,5),RLSE)                                            
//SYSIN   DD *                                                                  
  SORT FIELDS=(1,13,A),FORMAT=CH                                                
  INCLUDE COND=(18,1,CH,EQ,C'Y',AND,                                            
                19,2,CH,EQ,C'SA',AND,                                           
                36,2,CH,NE,C'Y')                                                
//*-----------------------------------------------------------------            
//* CREATE CRM EMAIL ALERT FOR TP/SOCA                                          
//* TO RETURN 99 WHEN INPUT FILE IS EMPTY                                       
//*-----------------------------------------------------------------            
//STEP10   EXEC PGM=IKJEFT01,COND=(4,LT),                                       
//             DYNAMNBR=20                                                      
//BP13F022 DD  DSN=&&P13F022,DISP=(OLD,DELETE)                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//             AMP=('BUFND=8','BUFNI=4')                                        
//P13MAIL1 DD  DSN=BP13.MAILOUT.C17A1,DISP=SHR                                  
//P13MAIL2 DD  DSN=BP13.MAILOUT.C17A2,DISP=SHR                                  
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C17A) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*------------------------------------------------------------         00028000
//*  SEND MAINFRAME EMAIL TO CRM (BP13.MAILOUT.C17A1)                           
//*------------------------------------------------------------         00028000
//STEP11 EXEC SENDMAIL,COND=(4,LT)                                              
//INPUT  DD DSN=BP13.MAILOUT.C17A1,DISP=SHR                                     
//*------------------------------------------------------------         00028000
//*  SEND MAINFRAME EMAIL TO SIEW HONG (BP13.MAILOUT.C17A2)                     
//*------------------------------------------------------------         00028000
//STEP12 EXEC SENDMAIL,COND=(4,LT)                                              
//INPUT  DD DSN=BP13.MAILOUT.C17A2,DISP=SHR                                     
//*---------------------------------------------------------------------        
//* SORT RECORDS WITH K462-DTE-TOL-SIGNED NOT EQUAL TO SPACES AND               
//* K462-TOL-REPORT-TAG EQUAL TO SPACES                                         
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD  DSN=BP13.K462.SOC.TOL,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&STEP13,DISP=(NEW,PASS),                                    
//             SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                             
//             DCB=(RECFM=FB,LRECL=1000)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(562,08,CH,NE,C'        ',AND,                                   
                723,01,CH,EQ,C' ')                                              
//*=================================================================*           
//* CREATE A REPORT FOR STAMPING OF TOL DOCUMENTS                     *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=BP13CCAL,COND=(4,LT)                                        
//BP13F462 DD DSN=&&STEP13,DISP=(OLD,PASS)                                      
//BP13K462 DD DSN=BP13.K462.SOC.TOL.PATH2,DISP=SHR                              
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13MAIL DD DSN=BP13.MAILRPT.BP13CCAL,DISP=SHR                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------         00028000
//*  SEND MAINFRAME EMAIL REPORT                                                
//*------------------------------------------------------------         00028000
//STEP15 EXEC SENDMAIL,COND=(4,LT)                                              
//INPUT  DD DSN=BP13.MAILRPT.BP13CCAL,DISP=SHR                                  
//*=================================================================*           
//* SORT RECORDS WITH K462-DTE-TOL-REQ NOT EQUAL SPACES AND                     
//* K462-DTE-TOL-SIGNED EQUAL SPACES                                            
//*---------------------------------------------------------------------        
//STEP16   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD  DSN=BP13.K462.SOC.TOL,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&STEP16,DISP=(NEW,PASS),                                    
//             SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                             
//             DCB=(RECFM=FB,LRECL=1000)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(715,08,CH,NE,C'        ',AND,                                   
                562,08,CH,EQ,C'        ')                                       
//*=================================================================*           
//* CREATE A REPORT FOR RECORDS WITH NO TOL SIGN DATE                 *         
//*-------------------------------------------------------------------*         
//STEP17   EXEC PGM=IKJEFT01,COND=(4,LT),                               00001650
//             DYNAMNBR=20                                              00001660
//BP13F462 DD DSN=&&STEP16,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13MAIL DD DSN=BP13.MAILRPT.BP13CCAM,DISP=SHR                                
//P13MAIL2 DD DSN=BP13.MAILRPT.P13CCAMA,DISP=SHR                                
//SYSPRINT DD SYSOUT=*                                                  00001900
//SYSTSPRT DD  SYSOUT=*                                                 00001910
//SYSOUT   DD  SYSOUT=*                                                 00001920
//SYSABOUT DD  SYSOUT=*                                                 00001930
//SYSTSIN  DD  *                                                        00001940
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13CCAM) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                      00001950
//*------------------------------------------------------------         00028000
//*  SEND MAINFRAME EMAIL REPORT                                                
//*------------------------------------------------------------         00028000
//STEP18 EXEC SENDMAIL,COND=(4,LT)                                              
//INPUT  DD DSN=BP13.MAILRPT.BP13CCAM,DISP=SHR                                  
//*------------------------------------------------------------         00028000
//STEP19 EXEC SENDMAIL,COND=(4,LT)                                              
//INPUT  DD DSN=BP13.MAILRPT.P13CCAMA,DISP=SHR                                  
//*-------------------------------------------------------------------*         
//* EXTRACT FROM SOC MASTER ALL PAYMENT OF SALES LEVY WITH DIFF LOAN: *         
//* K800-NUM-LOAN-TAG    = 'H' OR 'B' OR 'N' OR 'P'                   *         
//* K800-NUM-HOUSEHOLD   = 'G' AND                                    *         
//* K800-AMT-PREMIUM     =  0  OR BLANK                               *         
//* K800-NUM-STATUS     NE 'C'                                        *         
//* K800-NUM-REGN(1:1)  LT '5'                                        *         
//* IN ASCENDING SCHEME ACCOUNT                                       *         
//*-------------------------------------------------------------------*         
//STEP20   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(4,LT)                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=BP13.F800.BP13L35I,DISP=SHR                                   
//SYSIN    DD *                                                                 
  SORT FIELDS=(155,11,A),FORMAT=CH                                              
  INCLUDE COND=((963,1,CH,EQ,C'H',OR,963,1,CH,EQ,C'B',OR,                       
                 963,1,CH,EQ,C'N',OR,963,1,CH,EQ,C'P'),AND,                     
                 525,1,CH,EQ,C'G',AND,1170,9,ZD,EQ,0,AND,                       
                 1,1,CH,NE,C'C',AND,4,1,CH,LT,C'5')                             
  SUM    FIELDS=NONE                                                            
/*                                                                              
//*-------------------------------------------------------------------*         
//* EXTRACT BLOCKS UPDATED BY OIC:                                    * 11      
//* F190-3-TRANS-TYPE = 'B21500'                                      * 11      
//*-------------------------------------------------------------------*         
//STEP21   EXEC SORT,COND=(4,LT),PARM='DYNALLOC=(,255)'                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BM06.F190.LOG.DAILY(0),DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F190,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(BLKSIZE=27950,LRECL=650,RECFM=FB)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
  INCLUDE COND=(637,6,CH,EQ,C'B21500')                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* EXTRACT BM06F190 TO WITH SYS-DATE EQUAL TO CURRENT DATE           * 11      
//*-------------------------------------------------------------------*         
//STEP22   EXEC PGM=BP13CH5A,COND=(4,LT)                                        
//BM06F190 DD DSN=&&BM06F190,DISP=(OLD,DELETE)                                  
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BM06F100 DD DSN=&&BM06F100,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* EXTRACT CORRESPONDING SCHEME ACCOUNT OF UPDATED BLOCKS            * 11      
//*-------------------------------------------------------------------*         
//STEP23  EXEC PGM=BP13C35G,COND=(4,LT)                                         
//BM06F100 DD DSN=&&BM06F100,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//BM06K112 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                              
//BP13L35G DD DSN=&&BP13L35G,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(BLKSIZE=27995,LRECL=11,RECFM=FB)                             
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT IN ASCENDING SCHEME ACCOUNT                                  *         
//*-------------------------------------------------------------------*         
//STEP24   EXEC SORT,COND=(4,LT),PARM='DYNALLOC=(,255)'                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=&&BP13L35G,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.F011.BP13L35G,DISP=SHR                                   
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
/*                                                                              
//*-------------------------------------------------------------------*         
//* EXTRACT CASES WITH RESALE STATUS OF QN / LN / SN CASES            * 11      
//*-------------------------------------------------------------------*         
//STEP25   EXEC  PGM=IKJEFT01,COND=(4,LT),DYNAMNBR=20                           
//BP13F800 DD DSN=BP13.F800.BP13L35I,DISP=SHR                                   
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K162 DD DSN=BP13.K162.LVYTAG,DISP=SHR                                     
//BP13L35G DD DSN=BP13.F011.BP13L35G,DISP=SHR                                   
//BP13L35H DD DSN=BP13.F200.BP13L35H,DISP=SHR                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                        00001940
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13C35H) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                      00001950
//*-------------------------------------------------------------------*         
//* GENERATE SUMMARY EMAIL                                            * 11      
//*-------------------------------------------------------------------*         
//STEP26   EXEC PGM=BP13C35I,COND=(4,LT)                                        
//BP13L35H DD DSN=BP13.F200.BP13L35H,DISP=SHR                                   
//MAILFILE DD DSN=BP13.MAILRPT.BP13L35I,DISP=SHR                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//* SEND MAINFRAME SUMMARY EMAIL                                      * 11      
//*-------------------------------------------------------------------*         
//STEP27   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L35I,DISP=SHR                                
//*---------------------------------------------------------------------        
//* SORT BP13K800 - K800-TAG-SUB-APPRV                                          
//*---------------------------------------------------------------------        
//STEP28   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=2000)                                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1790,2,CH,EQ,C'AL',OR,                                         
                 1790,2,CH,EQ,C'BC',OR,                                         
                 1790,2,CH,EQ,C'BL')                                            
//*--------------------------------------------------------------------         
//* BP13C38W - PRINT NOTIFICATION/WAIVE CASES OF CASH PROCEEDS                  
//*--------------------------------------------------------------------         
//STEP29 EXEC  PGM=BP13C38W,COND=(4,LT)                                         
//BP13F800 DD  DSN=&&BP13F800,DISP=(OLD,PASS)                                   
//BP27K025 DD  DSN=BP27.K025.CAOIC,DISP=SHR                                     
//BP27K021 DD  DSN=BP27.K025.CAOIC.PATH1,DISP=SHR                               
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BP27K800 DD  DSN=BP27.K800.HLAPPLN,DISP=SHR                                   
//BP13L38W DD  DSN=&&MAILF38V,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                            
//             DCB=(RECFM=FB,LRECL=50)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT MAILF38V                                                               
//*---------------------------------------------------------------------        
//STEP30   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=&&MAILF38V,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F38V,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=50)                                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
//*--------------------------------------------------------------------         
//* BP13C38V - PRINT NOTIFICATION/WAIVE CASES OF CASH PROCEEDS                  
//*--------------------------------------------------------------------         
//STEP31 EXEC    PGM=IKJEFT01,COND=(4,LT),                              00001650
//             DYNAMNBR=20                                              00001660
//BP13F38V DD  DSN=&&BP13F38V,DISP=(OLD,PASS)                                   
//BP13F800 DD  DSN=&&BP13F800,DISP=(OLD,PASS)                                   
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR                                    
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                              
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BP13L38V DD  DSN=BP13.L38V.BP13L38V,DISP=SHR                                  
//BP27K025 DD  DSN=BP27.K025.CAOIC,DISP=SHR                                     
//BP27K021 DD  DSN=BP27.K025.CAOIC.PATH1,DISP=SHR                               
//BP27K800 DD  DSN=BP27.K800.HLAPPLN,DISP=SHR                                   
//MAILC38V DD  DSN=BP13.MAILRPT.BP13L38V,DISP=SHR                               
//SYSPRINT DD  SYSOUT=*                                                 00001900
//SYSTSPRT DD  SYSOUT=*                                                 00001910
//SYSOUT   DD  SYSOUT=*                                                 00001920
//SYSABOUT DD  SYSOUT=*                                                 00001930
//SYSTSIN  DD  *                                                        00001940
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13C38V) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
//*---------------------------------------------------------------------        
//* SORT BP13K800 - K800-TAG-SUB-APPRV                                          
//*---------------------------------------------------------------------        
//STEP32   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F801,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=2000)                                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1790,2,CH,EQ,C'AL',OR,                                         
                 1790,2,CH,EQ,C'AC',OR,                                         
                 1790,2,CH,EQ,C'BC',OR,                                         
                 1790,2,CH,EQ,C'BL')                                            
//*--------------------------------------------------------------------         
//* BP13C38Y - PRINT BUY FIRST CASES                                            
//*--------------------------------------------------------------------         
//STEP33 EXEC    PGM=IKJEFT01,COND=(4,LT),                              00001650
//             DYNAMNBR=20                                              00001660
//BP13F800 DD  DSN=&&BP13F801,DISP=(OLD,PASS)                                   
//MAILC38Y DD  DSN=BP13.MAILRPT.BP13L38Y,DISP=SHR                               
//SYSPRINT DD  SYSOUT=*                                                 00001900
//SYSTSPRT DD  SYSOUT=*                                                 00001910
//SYSOUT   DD  SYSOUT=*                                                 00001920
//SYSABOUT DD  SYSOUT=*                                                 00001930
//SYSTSIN  DD  *                                                        00001940
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13C38Y) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13C38V)                                            
//*-----------------------------------------------------------------            
//STEP34   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L38V,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13C38Y)                                            
//*-----------------------------------------------------------------            
//STEP35   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L38Y,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*- SORT BY PURCHASE FLAT                                                      
//*- INCLUDE REGISTRATION NUMBER STARTS WITH 2 AND 3                            
//*-------------------------------------------------------------------*         
//STEP36   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.K482.FLATSOLD.BFSL,DISP=SHR                              
//SORTOUT  DD DSN=&&BP13F482,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=1000)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,11,A),FORMAT=CH                                              
    INCLUDE COND=(28,1,CH,GE,C'0')                                              
//*--------------------------------------------------------------------         
//* BP13C38H - CREATE REPORT ON BUY 1ST /SELL 1ST CASES                         
//*--------------------------------------------------------------------         
//STEP37 EXEC  PGM=BP13C38H,COND=(4,LT)                                         
//BP13F482 DD DSN=&&BP13F482,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BB24K010 DD DSN=BB24.K010.MASTER,DISP=SHR                                     
//BB24K011 DD DSN=BB24.K010.MASTER.PATH1,DISP=SHR                               
//BP13BUY  DD DSN=BP13.MAILRPT.BUY1ST,DISP=SHR                                  
//BP13SELL DD DSN=BP13.MAILRPT.SELL1ST,DISP=SHR                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*------------------------------------------------------------         00028000
//*  SEND MAINFRAME EMAIL REPORT                                                
//*------------------------------------------------------------         00028000
//STEP38 EXEC SENDMAIL,COND=(4,LT)                                              
//INPUT  DD DSN=BP13.MAILRPT.BUY1ST,DISP=SHR                                    
//*-----------------------------------------------------------------*           
//*  SEND MAINFRAME EMAIL REPORT                                                
//*------------------------------------------------------------         00028000
//STEP39 EXEC SENDMAIL,COND=(4,LT)                                              
//INPUT  DD DSN=BP13.MAILRPT.SELL1ST,DISP=SHR                                   
//*-----------------------------------------------------------------*           
//*          E N D      O F     J O B                                 *         
//*-------------------------------------------------------------------*         
