//BP13A551 JOB (BP13P),'BP13A551',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM      LINECT=0                                                         
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* PRINT UNDERTAKING LETTER                                                    
//*=================================================================            
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=13C399,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//*-----------------------------------------------------------------            
//PRT02    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1B CP-1',END;                                      
1$DJDE$ JDE=13C399,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL1B                                     
//SYSUT2   DD  SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT SUCCESSFUL BTO CASES                                                   
//*-----------------------------------------------------------------            
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F740,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(226,3,A,211,2,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=(226,3,CH,NE,C'   ')                                            
//*-----------------------------------------------------------------            
//* PRINT UNDERTAKING LETTERS                                                   
//*-----------------------------------------------------------------            
//STEP02   EXEC  PGM=BP13C39A,COND=(0,NE)                                       
//BP13F520 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR,                             
//            AMP=('BUFND=23')                                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//BP13F398 DD DSN=BP13.F398.APPLDOC,DISP=OLD                                    
//P13P399A DD SYSOUT=W,OUTPUT=(*.PRT01.FORMID),DEST=IOMW                        
//P13P399B DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F398.APPLDOC,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F398.APPLDOC.ACCUM,DISP=MOD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
