//BP13D203  JOB (BP13P),'BP13D203',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//*- RUN DAILY TO FILE MANAGEMENT SYSTEM AT 8 PM                                
//*- SALES WILL DOWMLOAD THE FILE TO PC SYSTEM                                  
//*---------------------------------------------------------------------        
//* CHG-NO    BY   ON   - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130285 LSB 970510 - CHANGE FROM WEEKLY JOB BP13W200 TO DAILY JOB          
//* BP130418 SIA 980922 - Y2K COMPLIANCE CHANGES                                
//*---------------------------------------------------------------------        
//* INCLUDE ONLY FOR CASES WITH APPOINTMENT BOOKING/SALES-AGREEMENT             
//*                                      OR TAKE POSSESSION                     
//* BK-APPT = 509                                                               
//* AO-APPT = 365                                                               
//* SO-APPT = 475                                                               
//*---------------------------------------------------------------------        
//STEP01 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//   AMP=('BUFND=23')                                                           
//SORTOUT DD DSN=&&BP13F800,DISP=(,PASS),                                       
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(200,100),RLSE)                                            
//SYSIN     DD  *                                                               
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=((365,8,CH,GT,C'00000000',OR,                                   
                  475,8,CH,GT,C'00000000',OR,                                   
                  509,8,CH,GT,C'00000000'),AND,                                 
                 (1,1,CH,NE,C'C'),AND,                                          
                 (4,1,CH,NE,C'9'))                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* CREATE FILE TO QUEUE MANAGEMENT SYSTEM                                      
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=BP13C892,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13F214 DD DSN=BP13.F214.APPTFILE,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
