//BP13DBK1  JOB (BP13P),'BP13DBK1',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : DAILY BACKUP                                          *         
//*                                                                   *         
//*===================================================================*         
//* CHG NO   BY   ON      DESCRIPTION                                 *         
//* -------- --- ------   -----------                                 *         
//* BP130718 CLT 011099 - REMOVE BACKUP OF BP13K500                   *         
//* BP130839 CLT 220500 - REMOVE BP13K453                             *         
//* BP132168 CLT 280802 - REMOVE BACKUP OF APPT FILES                 *         
//* BP132387 SSS 080903 - DELETE BALLOTING MODULE UNDER WIS           *         
//* BP132627 SSS 301104 - DELETE K515                                 *         
//* BP134861 EAA1 30042013 EXPAND BP13K010 TO 600                               
//* BP136181 CT2  22052016 ADD BP13.AB02.F930.GRNT.DAILY FILE.                  
//*-------------------------------------------------------------------*         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                              *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F010.TENDER(+1),DISP=(NEW,CATLG),                        
//            SPACE=(TRK,(2,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                       
//*                                                                             
//INPUT2   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F730.MATURERQ(+1),DISP=(NEW,CATLG),                      
//            SPACE=(CYL,(50,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                              *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F520.BALLOT.DAILY(+1),DISP=(NEW,CATLG),                  
//            SPACE=(CYL,(50,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT4   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT4  DD DSN=BP13.F740.MATUREBA.DAILY(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(50,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
//*-------------------------------------------------------------------*         
//*                           END OF JOB                              *         
//*-------------------------------------------------------------------*         
