//BP13ADB1  JOB (BP13P),'BP13ADB1',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*************************************************************                 
//* THIS JCL IS USED FOR CAPTURING THE NRIC OF SPOUSE IN MCPS                   
//* SO AS TO DEBAR THEM ACCORDINGLY. SPOUSE NRIC NOT FOUND IN                   
//* CDB WILL BE SEND TO ROM FOR FURTHER VERIFICATION.                           
//* BP13ADB2 IS USED FOR CHECKING ON THE RETURNED ROM DATA.                     
//*************************************************************                 
//* CHG-NO   BY   DATE      - DESCRIPTION                                       
//*--------------------------------------                                       
//* BP132113 LSB 07/03/2002 - NEW JCL                                           
//* BP132162 ANC 03/07/2002 - TO CATER FOR RES-NRIC2                            
//* BP132290 CKK 13/03/2003 - ADD VERIFY STEP                                   
//* BP132463 CKK 13/01/2004 - CHECK FOR INELIGIBLE CASES                        
//* BP135171 RJE 10/02/2014 - TO CATER FOR DB2 UPGRADE                          
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-------------------------------------------------------------                
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                         *         
//*-------------------------------------------------------------------*         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K517.ROMDATA,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------------        
//* INCLUDE MCPS CASES FOR 'P' AND 'C' ONLY. NO 'M' CASES                       
//*---------------------------------------------------------------------        
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F853,DISP=(NEW,PASS),                                  
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                                 
//         SPACE=(CYL,(25,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,28,A),FORMAT=CH                                                
  INCLUDE COND=(226,3,CH,NE,C'   ',AND,                                         
               (253,1,CH,NE,C'H',AND,                                           
                253,1,CH,NE,C'P',AND,                                           
                253,1,CH,NE,C'M'),AND,                                          
                325,9,CH,NE,C'         ')                                       
  OUTREC FIELDS=(123,8,325,9,142X,187,3,211,2,334,6,80X)                        
//*---------------------------------------------------------------------        
//* OUTREC RES-NRIC2                                                            
//*---------------------------------------------------------------------        
//STEP1A EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F853,DISP=(MOD,PASS),                                  
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                                 
//         SPACE=(CYL,(25,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,28,A),FORMAT=CH                                                
  INCLUDE COND=(226,3,CH,NE,C'   ',AND,                                         
               (253,1,CH,NE,C'H ',AND,                                          
                253,1,CH,NE,C'P',AND,                                           
                253,1,CH,NE,C'M'),AND,                                          
                379,9,CH,NE,C'         ')                                       
  OUTREC FIELDS=(123,8,379,9,142X,187,3,211,2,334,6,80X)                        
//*---------------------------------------------------------------------        
//* DROP DUPLICATE NRIC                                                         
//*---------------------------------------------------------------------        
//STEP1B EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F853,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&BP13SORT,DISP=(,PASS),                                     
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                                 
//         SPACE=(CYL,(25,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(9,9,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* WRITE OUTPUT TO F853.MCPS.CDB FILE WHEN FOUND IN CDB                        
//* WRITE OUTPUT TO K517.ROMDATA WHEN NOT FOUND IN CDB.                         
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F853 DD DSN=&&BP13SORT,DISP=(OLD,PASS)                                    
//P13F853A DD DSN=BP13.F853.MCPS.CDB,DISP=OLD                                   
//BP13K517 DD DSN=BP13.K517.ROMDATA,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13L008 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C008) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*---------------------------------------------------------------------        
//* INCLUDE MCPS CASES FOR 'M' CASES ONLY.                                      
//*---------------------------------------------------------------------        
//STEP03 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F740,DISP=(NEW,PASS),                                  
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(25,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,28,A),FORMAT=CH                                                
  INCLUDE COND=(226,3,CH,NE,C'   ',AND,                                         
                253,1,CH,NE,C'M',AND,                                           
                118,1,CH,EQ,C'M')                                               
//*--------------------------------------------------------------------         
//* TO CREATE MCPS FOR MTF APPLN                                                
//* TO WRITE PRINT 3 REPORTS                                                    
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=BP13C030,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//P13F853A DD DSN=BP13.F853.MCPS.MTF,DISP=OLD                                   
//P13L030A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L030B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L030C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=2                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*********************************************************************         
