//BP13D236 JOB (BP13P),'BP13D236',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* SEND SALES CASES TO HDB FLAT PORTAL FOR WATCHLIST NOTIFICATION              
//* 20 DEC 2033 : MOVED FTP JOB FROM BP13D235                                   
//*=================================================================            
//*---------------------------------------------------------------------        
//* EXTRACT K800 CASES AFTER THE LAUNCH OF BP28 HDB FLAT PORTAL                 
//*   - ONE OF THE FOUR MAIN SALES LAUNCHES (EXCLUDE DIRECT ALLO)               
//*   - HAVE BOOKING APPT DATE (GRO/PA OR MGPS)                                 
//*---------------------------------------------------------------------        
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F800,                                                    
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            SPACE=(CYL,(50,50),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C'C',AND,                                            
                 22,8,CH,GE,C'20220201',AND,                                    
                (924,3,CH,EQ,C'BTO',OR,                                         
                 924,3,CH,EQ,C'SBF',OR,                                         
                 924,3,CH,EQ,C'OBF',OR,                                         
                 924,3,CH,EQ,C'SER'),AND,                                       
                (509,8,CH,NE,C'        ',OR,                                    
                1580,8,CH,NE,C'        '))                                      
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&P13F800,                                                    
//            DISP=(SHR,DELETE)                                                 
//SORTJNF2 DD DSN=BP13.K857.EMAIL,                                              
//            DISP=SHR                                                          
//SORTOUT  DD DSN=BP13.L857.EMAIL.CSV,                                          
//            DISP=OLD                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   JOINKEYS FILES=F1,FIELDS=(4,8,A)                                             
   JOINKEYS FILES=F2,FIELDS=(1,8,A)                                             
   JOIN UNPAIRED,F1                                                             
   REFORMAT FIELDS=(F1:4,8,1,1,1352,8,22,8,155,11,F2:35,50)                     
//*---------------------------------------------------------------------        
//* REGN,STATUS,DTE-ACCEPT,DTE-REGN AS BLANK,HDBREF,EMAIL                       
//*---------------------------------------------------------------------        
//STEP03  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.L857.EMAIL.CSV,DISP=OLD                                  
//SORTOUT  DD DSN=BP13.L857.EMAIL.CSV,DISP=OLD                                  
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   OUTREC FIELDS=(1,8,C',',9,1,C',',                                            
                  10,8,C',',8X,C',',                                            
                  26,11,C',',37,50)                                             
//*---------------------------------------------------------------------        
//******************************************************************            
//* FTP FILES TO LANSFTPP01 FOR RYSNC TO LANSFTPP21 THEN HBSFTPP21              
//******************************************************************            
//STEPFTP  EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  COMMON/FROM-HDB/BP28/INTERFACE                                            
  ASCII                                                                         
  PUT 'BP13.L857.EMAIL.CSV' Sales-Status-Email.csv                              
  QUIT                                                                          
//*                                                                             
//******************************************************************            
//*=================================================================            
//* END JOB BP13D236                                                            
//*=================================================================            
