//BP13D22C JOB (BP13P),'BP13D22C',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
/*JOBPARM SYSAFF=MVS2                                                           
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* DROP CASES IF FOUND IN RESALE, SOC, EC, SMS                                 
//*=================================================================            
//* BP13AY0A WITH CUT-OFF POINT AT 200901                                       
//* FT HARDLUCK = BP13.F595.SOCNOTFD.AFQUE.AY0H, OUTPUT IN JOB BP13D22B         
//*             = JOB BP13D220, BP13D22A, BP13D22B, BP13D22C, BP13D22D          
//*             = BP13CY89 - COMPUTE HARDLUCK                                   
//* FT/2T HARDLUCK = BP13.F595.AY0J.RDBCHK, OUTPUT IN JOB BP13D22G              
//* 2T HARDLUCK = BP13.F595.AY0J.PURE2T, OUTPUT IN JOB BP13D221                 
//*=================================================================            
//* CHG-NO   BY    ON   - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP133835 LSB 160410 - ADD SBF ALLOC-CAT                                     
//* BP133835 LSB 010710 - DELETE OMIT HH=G, BTO MATURE EST                      
//* BP133891 LSB 070810 - NEW REPORT BYPASS NE                                  
//* BP133921 LSB 240810 - BYPASS JUN BTO FOR AFTER SOC, AFTER QUEUE             
//* BP133840 LSB 010910 - BYPASS JUN BTO PG FOR AFTER QUEUE REPORT              
//* BP134205 LSB 110511 - ADD BP13K813 TO BP13CB91 BYPASS HARDLUCK              
//*                       BP13CY82 REPLACE CY64                                 
//* BP134247 LSB 110611 - CB78 ADD K893,CY82 CHK MATURE-TAG,ADD PPO/EC          
//* BP134247 LSB 110711 - DELETE CB90, ENHANCE CB71, CB91                       
//* BP134388 LSB 210212 - ADD OCCUPIER SPOUSE/FS IN CB80 GET FR K828            
//* BP134598 LSB 010812 - TAKE OUT SY02F001                                     
//* BP134780 IMC 270113 - REPLACE CB78 WITH CY49                                
//* BP135237 LSB 280214 - REFER TO BP13.K595.BP13D220 CUTOFF=201101             
//*                       INSTEAD OF BP13.K595.BALLOT.LOG                       
//* BP135635 LSB 030215 - ADD BP18K440/K445 EC TOP FILE                         
//* BP135921 LSB 01102015 - ADD BP13K730 TO BP13CD86                            
//*=================================================================            
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y1                                  
//*-----------------------------------------------------------------            
//STEP0A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K20H.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YH')                                               
//*-----------------------------------------------------------------            
//*------------------------------------------------------------------           
//* SORT OUT NRIC1                                                              
//* ONLY TAKE IN 469 = N CASES TO CHECK SBF/BE WITH BOOK-STATUS                 
//*------------------------------------------------------------------           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.AY0H.CB71,DISP=SHR                                   
//SORTOUT DD DSN=BP13.F595.AY0H,DISP=OLD                                        
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
   INCLUDE COND=(469,1,CH,EQ,C'N')                                              
//*------------------------------------------------------------------           
//*==================================================================           
//* CONTINUE TO CHECK SMS/RSL.SOC (BP13K595)                                    
//*==================================================================           
//*--------------------------------------------------------------------         
//* CHECK UNSUCC REQUEST BUY RESALE FLATS                                       
//*--------------------------------------------------------------------         
//STEP02   EXEC  PGM=BP13C994,COND=(0,NE)                                       
//BP13F595 DD  DSN=BP13.F595.AY0H,DISP=SHR                                      
//BB24K020 DD DSN=BB24.K020.OCCUPIER.INET,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//BB24K021 DD DSN=BB24.K020.OCCUPIER.INET.PATH1,DISP=SHR,                       
//         AMP=('BUFND=4','BUFNI=8')                                            
//BB24K010 DD DSN=BB24.K010.MASTER.INET,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595F DD DSN=BP13.F595.AY0H.FDRSL,DISP=OLD                                 
//P13F595N DD DSN=&&F595RESL,DISP=(,PASS),                                      
//            UNIT=(SYSDA,3),                                                   
//            SPACE=(CYL,(180,30),RLSE),                                        
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* CHECK UNSUCC REQUEST BOOKED SOC FLAT                                00000280
//*---------------------------------------------------------------------00000290
//STEP03   EXEC PGM=BP13CY49,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595RESL,DISP=(OLD,DELETE)                                  
//BP13K803 DD DSN=BP13.K803.BKNRIC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K801 DD DSN=BP13.K803.BKNRIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F595F DD DSN=BP13.F595.AY0H.FDSOC,DISP=OLD                         00000310
//P13F595N DD DSN=BP13.F595.AY0H.NOTBK,DISP=OLD                         00000310
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------00031706
//* CHECK FOUND BOUGHT EC                                               00031706
//*---------------------------------------------------------------------00031706
//STEP04    EXEC PGM=BP13CD87,COND=(0,NE)                               00031806
//BP13F595 DD  DSN=BP13.F595.AY0H.NOTBK,DISP=SHR                        00000310
//BP18K310  DD DSN=BP18.K310.OCCUPIER.INET,DISP=SHR,                    00032006
//             AMP=('BUFND=4','BUFNI=8')                                00032106
//BP18K311  DD DSN=BP18.K310.OCCUPIER.INET.PATH1,DISP=SHR,              00032206
//             AMP=('BUFND=4','BUFNI=8')                                00032306
//BP18K300  DD DSN=BP18.K300.MASTER.INET,DISP=SHR,                      00032406
//             AMP=('BUFND=4','BUFNI=8')                                00032506
//BP18K440  DD DSN=BP18.K440.APLCTN.HIST.TP,DISP=SHR,                   00032406
//             AMP=('BUFND=4','BUFNI=8')                                00032506
//BP18K450  DD DSN=BP18.K450.OCPR.HIST.TP,DISP=SHR,                     00032006
//             AMP=('BUFND=4','BUFNI=8')                                00032106
//BP18K451  DD DSN=BP18.K450.OCPR.HIST.TP.PATH1,DISP=SHR,               00032206
//             AMP=('BUFND=4','BUFNI=8')                                00032306
//P13F595F  DD DSN=&&F595ECFD,DISP=(,PASS),                             00032606
//             UNIT=SYSDA,                                              00034406
//             SPACE=(CYL,(80,30),RLSE),                                00032706
//             DCB=(RECFM=FB,LRECL=500)                                 00032806
//P13F595N  DD DSN=&&F595ECNO,DISP=(,PASS),                             00032906
//             UNIT=(SYSDA,3),                                                  
//             SPACE=(CYL,(180,30),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL               00033106
//SYSPRINT  DD SYSOUT=*                                                 00033206
//SYSDBG    DD SYSOUT=*                                                 00033306
//SYSDBOUT  DD SYSOUT=*                                                 00033406
//SYSOUT    DD SYSOUT=*                                                 00033506
//*-------------------------------------------------------------------* 00033606
//* MATCH PPOS BYPASS PPOS CODE                                         00033606
//*-------------------------------------------------------------------* 00033606
//*STEP05B  EXEC PGM=BP13CD86,COND=(0,NE)                               00033706
//*BP13F595  DD DSN=&&F595ECNO,DISP=(OLD,PASS)                          00033806
//*BR10K010 DD DSN=BR10.K010.PTEPPTY.INET,DISP=SHR,                     00033906
//*            AMP=('BUFND=4','BUFNI=8')                                00034006
//*BR10K080 DD DSN=BR10.K080.PTEPPTY.HIST.INET,DISP=SHR,                00034106
//*            AMP=('BUFND=4','BUFNI=8')                                00034206
//*BP13K730 DD DUMMY                                                    00034306
//*P13F595F DD DSN=&&F595PPOF,DISP=(,PASS),                             00034306
//*            UNIT=SYSDA,                                              00034406
//*            DCB=(RECFM=FB,LRECL=500),                                00034406
//*            SPACE=(CYL,(20,10),RLSE)                                 00034506
//*P13F595N DD DSN=&&F595NOPO,DISP=(,PASS),                             00034306
//*            UNIT=SYSDA,                                              00034406
//*            DCB=(RECFM=FB,LRECL=500),                                00034406
//*            SPACE=(CYL,(180,10),RLSE)                                00034506
//*SYSOUT   DD SYSOUT=*                                                 00034906
//*SYSTSPRT DD SYSOUT=*                                                 00035006
//*SYSPRINT DD SYSOUT=*                                                 00035106
//*SYSDBG   DD SYSOUT=*                                                 00035206
//*SYSDBOUT DD SYSOUT=*                                                 00035306
//*--------------------------------------------------------------------         
//* CHECK SMS ON BUYING FLAT AFTER NEW BE/BTO APPLICATION                       
//*--------------------------------------------------------------------         
//STEP05   EXEC  PGM=BP13C993,COND=(0,NE)                                       
//BP13F595 DD  DSN=&&F595ECNO,DISP=(OLD,PASS)                           00000310
//AB03K080 DD DSN=AB03.K080.UINACC.INET,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST.INET,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595F DD DSN=BP13.F595.SMSFD.AY0H,DISP=OLD,                        00000310
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(50,10),RLSE)                                             
//P13F595N DD DSN=BP13.F595.SMSNOTFD.AY0H,DISP=OLD,                     00000310
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                          
//         SPACE=(CYL,(180,20),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
