//BP13M710 JOB (BP13P),BP13M710,CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),              
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*====================================================================         
//* RUN ON 4TH OF THE MONTH                                                     
//*====================================================================         
//* ROLL OVER BALANCES IN THE ACCOUNT HISTORY AND                               
//* CREATE OFFSITE BACKUP FILE                                                  
//*====================================================================         
//* BP132772 020506 LSB DBSS JOB                                                
//* BP133209 180308 LSB STEP02 ONLY CHECK CURRENT STATUS                        
//* BP133209 010408 LSB ADD CD20 TO GET LOAN-SCH FOR BP13F136                   
//* BP133398 180509 JB8 EXPAND KD10 LENGTH FR 450 TO 1400                       
//* BP133682 071009 LSB MOVE CC33 FROM BP13M711 TO BP13M710                     
//* BP134040 181011 JB8 ADD F136 TO BP13CC33                                    
//* BP134040 181011 LSB ADD FD03 TO BP13CD20 MATCHING                           
//* BP134707 270513 LSB MOVE OUTPUT F136 ON CONVERSION TO HDB LOAN              
//*                     M713 JOB                                                
//*-------------------------------------------------------------------*         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                          *         
//*-------------------------------------------------------------------*         
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.KD00.DBSMAST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.KD65.PDATE,DISP=OLD                                      
//INPUT3   DD DSN=BP13.KD60.ACCHIST,DISP=OLD                                    
//INPUT4   DD DSN=BP13.KD61.ACCHIST,DISP=OLD                                    
//INPUT5   DD DSN=BP13.KD69.OPENSUM,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
//*-------------------------------------------------------------------*         
//* BACKUP FINANTIAL TRANSACTION FILES                                *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.KD60.ACCHIST,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.FD60.ACCHIST.MBKUP,DISP=SHR                              
//INPUT2   DD DSN=BP13.KD65.PDATE,DISP=SHR                                      
//OUTPUT2  DD DSN=BP13.FD65.PDATE.MBKUP,DISP=SHR                                
//*                                                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     REPRO IFILE(INPUT1) OFILE(OUTPUT1)                                         
     REPRO IFILE(INPUT2) OFILE(OUTPUT2)                                         
//*-------------------------------------------------------------------*         
//* SORT BP13KD00 AND INCLUDE ACCT-STATUS=C WITH O/S LOAN             *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                          00000220
//SORTOUT  DD DSN=&&BP13FD00,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,CH,A),FORMAT=CH                                             
   INCLUDE COND=(33,1,CH,EQ,C'C',OR,                                            
                 33,1,CH,EQ,C'X')                                               
//*-----------------------------------------------------------------    00001850
//*  ROLL OVER TO NEW MONTH                                                     
//*-----------------------------------------------------------------    00001850
//STEP03   EXEC PGM=BP13CC13,COND=(0,NE)                                        
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                          00000220
//BP13KD65 DD DSN=BP13.KD65.PDATE,DISP=OLD                                      
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=OLD                                    
//BP13KD61 DD DSN=BP13.KD61.ACCHIST,DISP=OLD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------    00000150
//*  REPRO VSAM FILE TO CARTRIDGE                                       00000160
//*-----------------------------------------------------------------    00000170
//STEP04   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00000180
//SYSPRINT DD  SYSOUT=*                                                 00000190
//INPUT1   DD  DSN=BP13.KD00.DBSMAST,                                   00000200
//             DISP=SHR,                                                00000210
//             AMP=('BUFND=23')                                         00000220
//OUTPUT1  DD  DSN=BP13.FD00.DBSMAST.MONTH(+1),                         00000230
//             DISP=(NEW,PASS),                                         00000240
//             UNIT=CART,                                               00000250
//             LABEL=(1,SL),                                            00000260
//             DCB=(BP13.GDG,BLKSIZE=27200,LRECL=1600,RECFM=FB)         00000270
//*                                                                     00000280
//INPUT2   DD  DSN=BP13.KD10.VOUCHOIC,                                  00000290
//             DISP=SHR,                                                00000300
//             AMP=('BUFND=23')                                         00000310
//OUTPUT2  DD  DSN=BP13.FD10.VOUCHOIC.MBKUP(+1),                        00000320
//             DISP=(NEW,PASS),                                         00000330
//             UNIT=CART,                                               00000340
//             LABEL=(2,SL),                                            00000350
//             VOL=REF=*.OUTPUT1,                                       00000360
//             DCB=(BP13.GDG,BLKSIZE=18200,LRECL=1400,RECFM=FB)         00000370
//*                                                                     00000280
//INPUT3   DD  DSN=BP13.KD30.PPDUEDTE,                                  00000380
//             DISP=SHR                                                 00000390
//OUTPUT3  DD  DSN=BP13.FD30.PPDUEDTE.MONTH(+1),                        00000400
//             DISP=(NEW,PASS),                                         00000410
//             UNIT=CART,                                               00000420
//             LABEL=(3,SL),                                            00000430
//             VOL=REF=*.OUTPUT1,                                       00000440
//             DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)         00000450
//*                                                                     00000280
//INPUT4   DD  DSN=BP13.KD35.APPSCHDL,                                  00000460
//             DISP=SHR                                                 00000470
//OUTPUT4  DD  DSN=BP13.FD35.APPSCHDL.MONTH(+1),                        00000480
//             DISP=(NEW,PASS),                                         00000490
//             UNIT=CART,                                               00000500
//             LABEL=(4,SL),                                            00000510
//             VOL=REF=*.OUTPUT1,                                       00000520
//             DCB=(BP13.GDG,BLKSIZE=17500,LRECL=3500,RECFM=FB)         00000530
//*                                                                     00000280
//INPUT5   DD  DSN=BP13.KD38.PPTRANS,                                   00000460
//             DISP=SHR                                                 00000470
//OUTPUT5  DD  DSN=BP13.FD38.PPTRANS.MONTH(+1),                         00000480
//             DISP=(NEW,PASS),                                         00000490
//             UNIT=CART,                                               00000500
//             LABEL=(5,SL),                                            00000510
//             VOL=REF=*.OUTPUT1,                                       00000520
//             DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)          00000530
//*                                                                     00000280
//INPUT6   DD  DSN=BP13.KD40.APPLPAY,                                   00000460
//             DISP=SHR                                                 00000470
//OUTPUT6  DD  DSN=BP13.FD40.APPLPAY.MONTH(+1),                         00000480
//             DISP=(NEW,PASS),                                         00000490
//             UNIT=CART,                                               00000500
//             LABEL=(6,SL),                                            00000510
//             VOL=REF=*.OUTPUT1,                                       00000520
//             DCB=(BP13.GDG,BLKSIZE=27000,LRECL=1500,RECFM=FB)         00000530
//*                                                                     00000280
//INPUT7   DD  DSN=BP13.KD45.PPAYHIST,                                  00000460
//             DISP=SHR                                                 00000470
//OUTPUT7  DD  DSN=BP13.FD45.PPAYHIST.MONTH(+1),                        00000480
//             DISP=(NEW,PASS),                                         00000490
//             UNIT=CART,                                               00000500
//             LABEL=(7,SL),                                            00000510
//             VOL=REF=*.OUTPUT1,                                       00000520
//             DCB=(BP13.GDG,BLKSIZE=27900,LRECL=1550,RECFM=FB)         00000530
//*                                                                     00000280
//INPUT8   DD  DSN=BP13.KD60.ACCHIST,                                   00000460
//             DISP=SHR                                                 00000470
//OUTPUT8  DD  DSN=BP13.FD60.ACCHIST.MONTH(+1),                         00000480
//             DISP=(NEW,PASS),                                         00000490
//             UNIT=CART,                                               00000500
//             LABEL=(8,SL),                                            00000510
//             VOL=REF=*.OUTPUT1,                                       00000520
//             DCB=(BP13.GDG,BLKSIZE=27750,LRECL=250,RECFM=FB)          00000530
//*                                                                     00000280
//INPUT9   DD  DSN=BP13.KD63.TXHIST,                                    00000460
//             DISP=SHR                                                 00000470
//OUTPUT9  DD  DSN=BP13.FD63.TXHIST.MONTH(+1),                          00000480
//             DISP=(NEW,PASS),                                         00000490
//             UNIT=CART,                                               00000500
//             LABEL=(9,SL),                                            00000510
//             VOL=REF=*.OUTPUT1,                                       00000520
//             DCB=(BP13.GDG,BLKSIZE=27900,LRECL=150,RECFM=FB)          00000530
//*                                                                     00000280
//SYSIN    DD  *                                                        00000540
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
   REPRO INFILE(INPUT7)  OUTFILE(OUTPUT7)                                       
   REPRO INFILE(INPUT8)  OUTFILE(OUTPUT8)                                       
   REPRO INFILE(INPUT9)  OUTFILE(OUTPUT9)                                       
//*---------------------------------------------------------------------00001100
//*  CATALOG GDG                                                        00001110
//*---------------------------------------------------------------------00001120
//STEP05   EXEC  PGM=IEFBR14,COND=(0,NE)                                00001130
//INPUT1   DD  DSN=BP13.FD00.DBSMAST.MONTH(+1),                         00000230
//             DISP=(OLD,CATLG),                                        00001150
//             UNIT=(,,DEFER)                                           00001160
//INPUT2   DD  DSN=BP13.FD10.VOUCHOIC.MBKUP(+1),                        00000320
//             DISP=(OLD,CATLG),                                        00001180
//             UNIT=(,,DEFER)                                           00001190
//INPUT3   DD  DSN=BP13.FD30.PPDUEDTE.MONTH(+1),                        00000400
//             DISP=(OLD,CATLG),                                        00001210
//             UNIT=(,,DEFER)                                           00001220
//INPUT4   DD  DSN=BP13.FD35.APPSCHDL.MONTH(+1),                        00000480
//             DISP=(OLD,CATLG),                                        00001240
//             UNIT=(,,DEFER)                                           00001250
//INPUT5   DD  DSN=BP13.FD38.PPTRANS.MONTH(+1),                         00000480
//             DISP=(OLD,CATLG),                                        00001270
//             UNIT=(,,DEFER)                                           00001280
//INPUT6   DD  DSN=BP13.FD40.APPLPAY.MONTH(+1),                         00000480
//             DISP=(OLD,CATLG),                                        00001300
//             UNIT=(,,DEFER)                                           00001310
//INPUT7   DD  DSN=BP13.FD45.PPAYHIST.MONTH(+1),                        00000480
//             DISP=(OLD,CATLG),                                        00001330
//             UNIT=(,,DEFER)                                           00001340
//INPUT8   DD  DSN=BP13.FD60.ACCHIST.MONTH(+1),                         00000480
//             DISP=(OLD,CATLG),                                        00001360
//             UNIT=(,,DEFER)                                           00001370
//INPUT9   DD  DSN=BP13.FD63.TXHIST.MONTH(+1),                          00000480
//             DISP=(OLD,CATLG),                                        00001360
//             UNIT=(,,DEFER)                                           00001370
//*-----------------------------------------------------------------    00001850
//*  REPRO CPF SFTP MONTH FILE TO GDG                                           
//*-----------------------------------------------------------------    00001850
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F128.CPFDBSS.ACCUM,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.F128.CPFDBSS.BKUP(+1),DISP=(NEW,CATLG),                  
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=280,RECFM=FB)                       
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*                                                                             
//*-----------------------------------------------------------------    00001830
//* EMPTY CPF SFTP FILE                                                 00001840
//*-----------------------------------------------------------------    00001850
//STEP07   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00001860
//SYSPRINT DD SYSOUT=*                                                  00001870
//INPUT1   DD DUMMY                                                     00001880
//OUTPUT1  DD DSN=BP13.F128.CPFDBSS.ACCUM,DISP=OLD                              
//SYSIN    DD  *                                                        00002010
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-----------------------------------------------------------------    00001850
//* BACKUP INTERFACE FILE TO PENALTY FEE                                        
//*-----------------------------------------------------------------    00001850
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.AC15.F510.DBSSARR,DISP=SHR                               
//OUTPUT1   DD DSN=BP13.AC15.F510.DBSSARR.MBKUP,DISP=SHR                        
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*--------------------------------------------------------------------         
//* OUTPUT FILE TO PENALTY FEE SYSTEM ON ARREARS                                
//*--------------------------------------------------------------------         
//STEP09   EXEC PGM=BP13CC36,COND=(0,NE)                                        
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//AC15F530 DD DSN=BP13.AC15.F510.DBSSARR,DISP=OLD                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT BY REGN-NO                                                             
//*--------------------------------------------------------------------         
//STEP10 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SORTOUT  DD DSN=&&FD00SCH,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1600),                                 
//        SPACE=(CYL,(50,30),RLSE)                                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   OMIT COND=(1,8,CH,EQ,C'        ')                                            
//*--------------------------------------------------------------------         
//* SORT BY PP-HISTORY WHERE RECORD PASSED DOWN TO SMS                          
//*--------------------------------------------------------------------         
//STEP10A EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.KD03.DBSHIST,DISP=SHR                                    
//SORTOUT  DD DSN=&&FD00SCH,DISP=(MOD,PASS),                                    
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1600),                                 
//        SPACE=(CYL,(50,30),RLSE)                                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(1501,6,CH,GT,C'201205')                                        
//*--------------------------------------------------------------------         
//* SORT BY REGN-NO                                                             
//*--------------------------------------------------------------------         
//STEP10B EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=&&FD00SCH,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&FD00LNSH,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1600),                                 
//        SPACE=(CYL,(50,30),RLSE)                                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
//*--------------------------------------------------------------------         
//* SORT BY REGN-NO                                                             
//*--------------------------------------------------------------------         
//STEP11 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&F136SCH,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                  
//        SPACE=(CYL,(50,10),RLSE)                                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OMIT COND=(5,8,CH,EQ,C'        ')                                            
//*-------------------------------------------------------------------*         
//* UPDATE BP13F136 WITH LOAN-SCH                                               
//*-------------------------------------------------------------------*         
//STEP12 EXEC PGM=BP13CD20,COND=(0,NE)                                          
//BP13FD00 DD DSN=&&FD00LNSH,DISP=(OLD,PASS)                                    
//BP13F136 DD DSN=&&F136SCH,DISP=(OLD,PASS)                             00398002
//P13F136A DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=OLD                       00398002
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES, BACKUP BP13KD69             *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KD69.OPENSUM,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.FD69.OPENSUM,DISP=OLD                                    
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-------------------------------------------------------------------*         
//* SORT BP13KD00 CONCESSIONARY                                                 
//*-------------------------------------------------------------------*         
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                          00000220
//SORTOUT  DD DSN=&&FD00CON,                                                    
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,CH,A),FORMAT=CH                                          
      INCLUDE COND=(361,1,CH,EQ,C'P')                                           
//*-------------------------------------------------------------------*         
//* SORT BP13KD60 CONCESSIONARY                                                 
//*-------------------------------------------------------------------*         
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD60.ACCHIST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                          00000220
//SORTOUT  DD DSN=&&FD60CON,                                                    
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,CH,A),FORMAT=CH                                          
      INCLUDE COND=(69,1,CH,EQ,C'P')                                            
//*-------------------------------------------------------------------*         
//* TO FIND OPENING AND CLOSING AMOUNT WITH TOTAL NUMBER OF RECORDS.            
//* (CONCESSIONARY)                                                             
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=BP13CC33,COND=(0,NE)                                        
//BP13FD00 DD DSN=&&FD00CON,DISP=(OLD,PASS)                                     
//BP13FD60 DD DSN=&&FD60CON,DISP=(OLD,PASS)                                     
//BP13KD69 DD DSN=BP13.KD69.OPENSUM,DISP=SHR                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BP13KD00 NON-CONCESSIONARY                                             
//*-------------------------------------------------------------------*         
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                          00000220
//SORTOUT  DD DSN=&&FD00NCON,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,CH,A),FORMAT=CH                                          
      OMIT COND=(361,1,CH,EQ,C'P')                                              
//*-------------------------------------------------------------------*         
//* SORT BP13KD60 NON-CONCESSIONARY                                             
//*-------------------------------------------------------------------*         
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD60.ACCHIST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                          00000220
//SORTOUT  DD DSN=&&FD60NCON,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,CH,A),FORMAT=CH                                          
      OMIT COND=(69,1,CH,EQ,C'P')                                               
//*-------------------------------------------------------------------*         
//* TO FIND OPENING AND CLOSING AMOUNT WITH TOTAL NUMBER OF RECORDS.            
//* (NON-CONCESSIONARY)                                                         
//*-------------------------------------------------------------------*         
//STEP19   EXEC PGM=BP13CC33,COND=(0,NE)                                        
//BP13FD00 DD DSN=&&FD00NCON,DISP=(OLD,PASS)                                    
//BP13FD60 DD DSN=&&FD60NCON,DISP=(OLD,PASS)                                    
//BP13KD69 DD DSN=BP13.KD69.OPENSUM,DISP=SHR                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
