//BP13DM28 JOB (BP13P),'CS94324',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),             
//             COND=(0,NE),NOTIFY=CSD0071                                       
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*                                                                             
//**********************************************************************        
//*TO GENERATE FTPMC INELIGIBLE REPORTS AND TO PRINT NIL LISTING IF NO          
//*REPORT TO PRINT                                                              
//**********************************************************************        
//*STEP01:SORT FTPMC INELIGIBLE FILES                                           
//**********************************************************************        
//STEP01   EXEC PGM=SORT                                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDUMP  DD SYSOUT=*                                                          
//SORTIN   DD DISP=SHR,DSN=BP13.FDM24004.REJECTED.SD(0)                         
//         DD DISP=SHR,DSN=BP13.FDM26002.REJECTED.SD(0)                         
//         DD DISP=SHR,DSN=BP13.FDM25002.REJECTED.SD(0)                         
//SORTOUT  DD DISP=(NEW,PASS,DELETE),                                           
//            UNIT=CART,                                                        
//            DCB=(RECFM=FB,LRECL=100),                                         
//            DSN=&&STEP01                                                      
//SYSIN    DD *                                                                 
   SORT FIELDS=(07,08,CH,A)                                                     
   OMIT COND=(07,08,CH,EQ,X'0000000000000000',OR,                               
              07,08,CH,EQ,X'FFFFFFFFFFFFFFFF')                                  
/*                                                                              
//**********************************************************************        
//*STEP02:SORT AND MERGE FTPMC INELIGIBLE FILES WITH UPDATE EXCEPTION           
//*       FILE                                                                  
//**********************************************************************        
//STEP02   EXEC PGM=SORT                                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDUMP  DD SYSOUT=*                                                          
//SORTIN   DD DISP=(OLD,DELETE,DELETE),DSN=&&STEP01                             
//         DD DISP=SHR,DSN=BP13.FDM29001.REJECTED.SD(0)                         
//SORTOUT  DD DISP=(NEW,PASS,DELETE),                                           
//            UNIT=CART,                                                        
//            DCB=(RECFM=FB,LRECL=100),                                         
//            DSN=&&STEP02                                                      
//SYSIN    DD *                                                                 
   SORT FIELDS=(07,08,CH,A)                                                     
/*                                                                              
//**********************************************************************        
//*STEP03:TO APPEND FTPMC INELIGIBLE AND EXCEPTION FILES TO CONSOLIDATED        
//*       FILE                                                                  
//**********************************************************************        
//STEP03   EXEC PGM=ICEGENER                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DISP=SHR,DSN=BP13.FDM24004.REJECTED.SD(0)                         
//         DD DISP=SHR,DSN=BP13.FDM26002.REJECTED.SD(0)                         
//         DD DISP=SHR,DSN=BP13.FDM25002.REJECTED.SD(0)                         
//         DD DISP=SHR,DSN=BP13.FDM29001.REJECTED.SD(0)                         
//SYSUT2   DD DISP=MOD,DSN=BP13.FDM28001.REJECTED.SD                            
//SYSIN    DD DUMMY                                                             
//*                                                                             
//**********************************************************************        
//*STEP04:TO GENERATE FTPMC INELIGIBLE REPORTS                                  
//**********************************************************************        
//STEP04   EXEC PGM=BP13CM27                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//BP13FIN1 DD DISP=(OLD,DELETE,DELETE),DSN=&&STEP02                             
//BP13FIN2 DD *                                                                 
BP13DM28                                                                        
/*                                                                              
//BP13LRP1 DD SYSOUT=8,DEST=IOM8                                                
//BP13LRP2 DD SYSOUT=8,DEST=IOM8                                                
//*                                                                             
