//BP13A249 JOB (BP13P),'BP13A249',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*                                                                             
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------00001790
//* TO SORT RECORDS                                                     00001800
//*---------------------------------------------------------------------00001810
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.F310.BP13C22Q,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F310,DISP=(NEW,PASS),                                   
//         SPACE=(CYL,(1,1),RLSE),DSORG=PS,AVGREC=K,                            
//         RECFM=FB,LRECL=150,BLKSIZE=0                                         
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,10,A),FORMAT=CH                                            
/*                                                                              
//*---------------------------------------------------------------------00001790
//* TO CANCEL APPLICATIONS                                              00001800
//*---------------------------------------------------------------------00001810
//STEP02   EXEC PGM=BP13C22S,COND=(0,NE)                                        
//BP13F310 DD DSN=&&BP13F310,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=OLD                                   
//BP13F915 DD DSN=BP13.F915.CDBTRANS,DISP=OLD                                   
//BP13FOUT DD DSN=BP13.FOUT.BP13C22S,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
/*                                                                      00001790
//*---------------------------------------------------------------------00001790
//* TO PRINT REPORT ON CANCELLATION CASES                               00001800
//*---------------------------------------------------------------------00001810
//STEP03 EXEC    SAS,COND=(0,NE)                                        00001820
//WORK     DD  UNIT=SYSDA,                                              00001830
//             SPACE=(CYL,(10,10),,,ROUND)                              00001840
//BP13FOUT DD  DSN=BP13.FOUT.BP13C22S,                                  00001850
//             DISP=SHR                                                 00001860
//FT42F001 DD  SYSOUT=2,                                                00001870
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S221),                            00001880
//             DISP=SHR                                                 00001890
/*                                                                      00001900
//*---------------------------------------------------------------------00001790
//* END OF JOB BP13A249                                                 00001800
//*---------------------------------------------------------------------00001810
