//BP13Y711 JOB (BP13P),'BP13Y711',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*====================================================================         
//* PRINT FIRE INSURANCE LETTER FOR DBSS CASES WITH OUTSTANDING HDB             
//* LOAN (WITH REFERENCE TO BP13M711 & BP13CB49)                                
//* NEW PROGRAM BP13CB48 PRINT BASED ON AB03 K030-AMT-LOAN-BAL > 0              
//*====================================================================         
//* CHGNO     ONNN   BY                                                         
//*-----------------------------------                                          
//* BP134862 130409 NST PRINT FIRE INSURANCE LETTER (BP13AZ)                    
//* BP135171 140211 RJE TO CATER FOR DB2 UPGRADE                                
//*====================================================================         
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - AGREEMENT TEAM               
//*-----------------------------------------------------------------            
//PRT05   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                         
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//*-----------------------------------------------------------------            
//* SEND DJDE AHEAD OF THE PRINT DATASET                                        
//* PRT06 : COPIES = 1 (BP13AZ)                                                 
//*-----------------------------------------------------------------            
//PRT06    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POT5,FORM=BP13AZ,JDL=BP13,END;                                     
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALST1C                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//*-----------------------------------------------------------------            
//* SORT BP13KD15 BY PROJECT, BLK, UNIT-NO                                      
//*-----------------------------------------------------------------            
//STEP64   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD15.DBSSTP,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13FD15,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(LRECL=300,RECFM=FB)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(90,8,CH,NE,C'        ')                                         
//*            (1,3,CH,EQ,C'D03',OR,1,3,CH,EQ,C'D06'))                          
//*--------------------------------------------------------------------         
//* CHECK SMS ON BUYING FIRE INSURANCE AFTER TOP                                
//*--------------------------------------------------------------------         
//STEP65    EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K              
//BP13FD15 DD DSN=&&BP13FD15,DISP=(OLD,PASS)                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB20K050 DD DSN=AB20.K050.PREMIUM,DISP=SHR                                    
//*BP13LB49 DD DSN=BP13T.LB49.A130409A,DISP=(,CATLG),                   00000310
//*        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=133),                                 
//*        SPACE=(CYL,(80,30),RLSE)                                             
//*BP13PB49 DD SYSOUT=*                                                 00000310
//BP13LB49 DD SYSOUT=2,OUTPUT=(*.PRT05.FORMID)                          00000310
//BP13PB49 DD SYSOUT=2,OUTPUT=(*.PRT06.FORMID)                          00000310
//SUMMARY  DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CB48) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
