//BP13A529 JOB (BP13P),'BP13A529',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,REGION=4096K                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*--------------------------------------------------------------------         
//* 1) LASER PRINTER                                                            
//* 2) BP13C788 - SPLIT FILE INTO TWO DIFFERENT FORMAT                          
//* 3) BP13C754 - EXTRACT NT-RESIDE AND FLAT-TYPE RESIDE                        
//* 4) SORT UPGRADER FILE IN REF NO AND CDE-FILE SEQUENCE                       
//* 5) BP13C789 - EXTRACT NT-REQ AND FLAT-TYPE REQ AND DROP DUPLICATE           
//* 6) BP13X748 - EXTRACT INFO FROM RDB BASE ON NRIC                            
//* 7) SORT OUT LESSEE, CO-LESSEE, OCCUPIER AND TENANT CASES                    
//* 8) BP13C754 - EXTRACT NT-RESIDE AND FLAT-TYPE RESIDE                        
//* 9) SORT RDB INFO FILE AND EXTRACT NT-REQ AND FLAT-TYPE REQ                  
//*10) BP13C789 - EXTRACT NT-REQ AND FLAT-TYPE REQ AND DROP DUPLICATE           
//*11) TO PRINT REPORT ON UPGRADER, NEWHOUSEHOLD (OCCUPIERS & TENANTS)          
//*********************************************************************         
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130643 LSB 990805   TAKE OUT BP13S802                                     
//* BP130652 NOR 990825   EXPAND F500,F520 RECL 300 TO 500                      
//* BP130871 SSS 000609   LISTING FOR EAALSS                                    
//* BP132002 LSB 010914   ADD BP13K558 TO BP13S758                              
//* BP135171 RJE 140210   TO CATER FOR DB2 UPGRADE                              
//*********************************************************************         
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                     (STATISTICS TEAM)                   
//*---------------------------------------------------------------------        
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* SPLIT F558 FILE FROM THE OUTPUT OF DETERMINE THE HOUSEHOLD TYPE             
//* IF - HHTYPE='G' OR '3' OR                                                   
//*      (HHTYPE='H' AND FILE-STATUS-SMS OR FILE-STATUS-RSL = 'OM')             
//*          OUTPUT TO BP13F716                                                 
//* ELSE                                                                        
//*      OUTPUT TO BP13F716 TO CHECK RDB                                        
//*---------------------------------------------------------------------        
//* 1)  P13F716A - TO FURTHER CHECK WITH RDB                                    
//* 2)  BP13F716 - INFO ALREADY FOUND IN SMS & RESALE                           
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13C788,COND=(0,NE)                                        
//BP13F558 DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//P13F716A DD DSN=&&P13F716A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*---------------------------------------------------------------------        
//* SORT OUT IN NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F716A,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                                   
//P13F716A DD DSN=BP13.F716.A529Q748,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//*  SORT BY SCH-ACC AND DATE OF PURCHASE IN DESCENDING ORDER                   
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.A529Q748,DISP=SHR                                   
//SORTOUT  DD DSN=&&F716RDB,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(9,9,A,107,8,D),FORMAT=CH                                      
//*---------------------------------------------------------------------        
//* OUTPUT RECORDS FROM EXTRACTED RDB RECORDS AND F716                          
//*        DROP MUTLITPLE REC                                                   
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=BP13C818,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716RDB,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//P13F716O DD DSN=&&ALLNHH,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),SPACE=(CYL,(90,30),RLSE),                          
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT IN SCHEME/ACCOUNT SEQUENCE                                             
//* INCLUDE SCHEME/ACCOUNT NOT EQUAL SPACES FOR EXTRACTION OF FLAT TYPE         
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&ALLNHH,DISP=(OLD,PASS)                                      
//         DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13NHH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(51,9,A),FORMAT=CH                                               
   INCLUDE COND=(51,9,CH,NE,C'         ')                                       
//*---------------------------------------------------------------------        
//* USE SCH-ACC-NO TO GET NEW TOWN AND FLAT TYPE FROM PBF FILE FOR              
//*     NEW HOUSEHOLD CASES                                                     
//*---------------------------------------------------------------------        
//STEP16   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&BP13NHH,DISP=(OLD,PASS)                                     
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=&&P13NHHNT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT IN SCHEME/ACCOUNT SEQUENCE                                             
//*---------------------------------------------------------------------        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&ALLNHH,DISP=(OLD,PASS)                                      
//         DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&NOTINRDB,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(51,9,A),FORMAT=CH                                               
   INCLUDE COND=(51,9,CH,EQ,C'         ')                                       
//*---------------------------------------------------------------------        
//*  SORT BY NRIC NO/SCH-ACC-NO,DTE AND RELATIONSHIP SEQUENCE                   
//*  TO COMPUTE LENGTH OF RESIDE BASE ON DATE RUN                               
//*---------------------------------------------------------------------        
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13NHHNT,DISP=(OLD,PASS)                                    
//         DD DSN=&&NOTINRDB,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716RDBS,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(9,9,A,51,9,A,107,8,A,99,2,A),FORMAT=CH                        
//*---------------------------------------------------------------------        
//* COMPUTE THE LENGTH OF OCCUPATION BASE ON MOVING-IN-DATE AND                 
//* CURRENT DATE                                                                
//* FOR DUPLICATE HH TAKE IN LSE/CO-LSE OR LATEST DATE ACCEPTED                 
//* IF RECORD NOT MATCH IN RDB, UPDATE 9999 TO MTH-RESIDE                       
//* NOTES : SIMILAR AS BP13C805                                                 
//*--------------------------------------------------------------------         
//STEP19   EXEC PGM=BP13C872,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716RDBS,DISP=(OLD,PASS)                                    
//P13F716A DD DSN=&&F716LEN,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(20,3),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* COMPUTE THE LENGTH RESIDE BASED ON DTE-SOLD-TO-SELLER AND CURRENT           
//*   DATE FOR THOSE NUM-RDB-DP-OM =                                            
//*    'O' => UPG - EX-LESSEE AND EXISTING FLAT BOUGHT FROM OM                  
//*    'R' => UPG - EX-LESSEE AND NOT EXISTING LESSEE                           
//*    'X' => NHH - PREVIOUS FLAT BOUGHT FROM OM                                
//*---------------------------------------------------------------------        
//STEP20   EXEC PGM=BP13C715,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716LEN,DISP=(OLD,PASS)                                     
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F716O DD DSN=&&F716COMP,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(45,9),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*---------------------------------------------------------------------        
//*  SORT BY NRIC NO/SCH-ACC-NO,DTE AND RELATIONSHIP SEQUENCE                   
//*  TO COMPUTE LENGTH OF RESIDE BASE ON DATE RUN                               
//*---------------------------------------------------------------------        
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716COMP,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716REG,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
//*--------------------------------------------------------------               
//*  TO COMPUTE THE HOUSEHOLD SIZE OF THE APPLICATION                           
//*--------------------------------------------------------------               
//STEP22   EXEC PGM=BP13C699,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716REG,DISP=(OLD,PASS)                                     
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F716O DD DSN=&&F716HHSZ,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*  SORT BY REG-NO IN ASCENDING SEQUENCE,                                      
//*  CDE-FILE AND FLAT TYPE IN DESCENDING SEQUENCE                              
//*---------------------------------------------------------------------        
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716HHSZ,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F716.CURNTFT,DISP=OLD                                    
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A,91,1,D,82,2,D,9,9,A),FORMAT=CH                          
//*---------------------------------------------------------------------        
//*  SORT BY REG-NO IN ASCENDING SEQUENCE,                                      
//*---------------------------------------------------------------------        
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.BALLOT,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13F520,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),SPACE=(CYL,(60,20),RLSE),                          
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//* OUTPUT RECORD FROM UPGRADER FILE AND                                        
//*        DROP MUTLITPLE REC AND MATCH K500 TO EXTRACT NT-REQ                  
//*        AND FLAT-TYPE-REQ AND DTE-BALLOT                                     
//*---------------------------------------------------------------------        
//STEP25   EXEC PGM=BP13C789,COND=(0,NE)                                        
//BP13F716 DD DSN=BP13.F716.CURNTFT,DISP=SHR                                    
//BP13F500 DD DSN=&&P13F520,DISP=(OLD,PASS)                                     
//P13F716O DD DSN=BP13.F716.ADHCFILE,DISP=OLD                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*  TABULATE REPORT ON NEWHOUSEHOLD FOR BOOKING SYSTEM                         
//*  ON OCCUPIER AND TENANTS                                                    
//*---------------------------------------------------------------------        
//STEP26   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP13UPG  DD DSN=BP13.F716.ADHCFILE,DISP=SHR                                   
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S755),DISP=SHR                             
//*---------------------------------------------------------------------        
//*  TABULATE REPORT ON HOUSEHOLD TYPE AND LENGTH RESIDE                        
//*---------------------------------------------------------------------        
//STEP27   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP13UPG  DD DSN=BP13.F716.ADHCFILE,DISP=SHR                                   
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S792),DISP=SHR                             
//*---------------------------------------------------------------------        
//*  TABULATE REPORT ON NEWHOUSEHOLD FOR BOOKING SYSTEM                         
//*  ON OCCUPIER AND TENANTS                                                    
//*---------------------------------------------------------------------        
//STEP28   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP13UPG  DD DSN=BP13.F716.ADHCFILE,DISP=SHR                                   
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S795),DISP=SHR                             
//*---------------------------------------------------------------------        
//*  TABULATE REPORT ON HOUSEHOLD TYPE AND LENGTH RESIDE                        
//*---------------------------------------------------------------------        
//STEP29   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP13UPG  DD DSN=BP13.F716.ADHCFILE,DISP=SHR                                   
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S796),DISP=SHR                             
//*---------------------------------------------------------------------        
//*  TABULATE REPORT ON HOUSEHOLD TYPE AND LENGTH RESIDE                        
//* DELETE BP13S802 ON 5/8/99                                                   
//*---------------------------------------------------------------------        
//*STEP29A  EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                  
//*BP13UPG  DD DSN=BP13.F716.ADHCFILE,DISP=SHR                                  
//*FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//*SYSIN    DD DSN=BP13.BATCH.SRC(BP13S802),DISP=SHR                            
//*=====================================================================        
//* PRINT REQUESTS UNDER TCP AND MTS NOT COMPLYING TO UPGRADING                 
//*=====================================================================        
//* INCLUDE ON REQUESTS UNDER TCP AND MTS                                       
//*---------------------------------------------------------------------        
//STEP30   EXEC SORT                                                            
//SORTIN   DD DSN=BP13.F520.BALLOT,DISP=SHR                                     
//SORTOUT  DD DSN=&&MTSTCP,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(40,8),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH,FILSZ=E5000                                   
  INCLUDE COND=(213,3,CH,EQ,C'TCP',OR,                                          
                213,3,CH,EQ,C'MTS')                                             
//*---------------------------------------------------------------------        
//* SORT BY REFNO & NRIC                                                        
//*---------------------------------------------------------------------        
//STEP31   EXEC SORT                                                            
//SORTIN   DD DSN=BP13.F716.CURNTFT,DISP=SHR                                    
//SORTOUT  DD DSN=&&P13F716,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,SPACE=(CYL,(20,4),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A,9,9,A),FORMAT=CH,FILSZ=E5000                               
//*---------------------------------------------------------------------        
//* PRINT REPORT                                                                
//*---------------------------------------------------------------------        
//STEP32   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F520 DD DSN=&&MTSTCP,DISP=(OLD,PASS)                                      
//BP13F716 DD DSN=&&P13F716,DISP=(OLD,PASS)                                     
//BP13K558 DD DSN=BP13.K558.UPGOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L310 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S758),DISP=SHR                             
//*---------------------------------------------------------------------        
//* END BP13A529                                                                
//*---------------------------------------------------------------------        
