//BP13D700  JOB (BP13P),'BP13D700',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* OBJECTIVE : DAILY JOB TO DELETE/DEFINE FILES REQUIRED FOR USE               
//*             IN THE INTERNET WHEN ORIGINAL FILES ARE CLOSED FOR              
//*             BATCH RUN                                                       
//*-----------------------------------------------------------------            
//* CHG REF   DATE       BY    DESCRIPTION                                      
//* ========  ========== ====  ===========                                      
//* BP131034  17/09/2001 CLT1  ENQUIRY ON APPT                                  
//* BP132065  19/02/2002 SSS2  ADD BP13K820                                     
//* BP132161  29/07/2002 SSS2  ADD BP13K830                                     
//* BP132198  20/08/2002 SSS2  ADD BP13K400 & BP13K410                          
//* BP132234  03/11/2002 CLT1  ADD BP13K640                                     
//* BP132546  11/06/2004 YCH   INCLUDE STORCLAS(PRODRLS) & LOG(NONE)            
//* BP132623  01/12/2004 SSS   AMEND REDEFINE OF K410 INET DATASET              
//* BP132891  11/12/2006 SD10  ADD BP13K022, BP13K024, BP13K060,                
//*                            BP13K454, BP13K705, BP13K730,                    
//*                            BP13K752, BP13K823, BP13K825                     
//* BP133472  01/12/2008 DW5   ADD BP13KD15, BP13KA20                           
//* BP134387  29/11/2011 DW5   ADD BP13KQ10, BP13KP00                           
//* BP134424  13/02/2012 DW5   ADD BP13KQ60                                     
//* BP135339  08/07/2014 LSB   ADD BP13KD30                                     
//* BP135683  16/04/2015 LJL   ADD BP13KL00                                     
//* BP135747  23/04/2015 LJL   ADD BP13KL05                                     
//* BP135791  20/05/2015 LJL   ADD BP13FL05, BP13FL00                           
//* BP135959  15/09/2015 LJL   SORT OUT DUPLICATES FOR BP13FL05,BP13FL00        
//* BP135825  12/11/2015 LJL   ADD BP13KH50                                     
//* BP135986  13/11/2015 LJL   REPLACE BP13FH50 WITH BP13KH50                   
//* BP135796  18/11/2015 EL27  ADD BP13K857                                     
//* BP136065  28/04/2016 EL27  INCREASE INET KL00 KL05 SIZE FOR BK EINV         
//* BP136319  30/06/2016 ZDD1  ADD BP13K859 INET                                
//* BP136307  21/09/2016 KSJ3  SORT TO PASS DS IN STEP31A AND REUSE             
//*                            SAME PASS DS TO MERGE IN STEP31B                 
//* BP136539  29/11/2016 RJB1  ADD BP13CAA4 FOR HOUSEKEEPING OR RECS            
//* BP136539  30/11/2016 RJB1  TRANSFER BP13CAA4 TO BP13D524                    
//* BP136989  25/09/2017 CCC5  EXPAND ALLOCATION FOR F410 IN STEP10             
//* BP138258  20/03/2020 LSB1  CHANGE WTOG MESSSAGE,ADD BP13D70A JOB            
//* BP138295  19/06/2020 MRR5  ADD INET FILES FOR BP13K940                      
//* BP138645  15/09/2021 CCC5  UPDATE STEP 31A TO EXPAND &&BP13FH50             
//* BP13XXXX  06/06/2023 AM25  UPDATE BP13K730 INET ALT1 & ALT2 RECSZ           
//*=================================================================            
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                                   
//*-----------------------------------------------------------------            
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K800.APPLN.INET,DISP=OLD                                 
//INPUT2   DD DSN=BP13.K820.OCCUP.INET,DISP=OLD                                 
//INPUT3   DD DSN=BP13.K820.OCCUP.INET.ALTX1,DISP=OLD                           
//INPUT4   DD DSN=BP13.K830.ADDR.INET,DISP=OLD                                  
//INPUT5   DD DSN=BP13.K830.ADDR.INET.ALTX1,DISP=OLD                            
//INPUT6   DD DSN=BP13.K400.SALEORD.INET,DISP=OLD                               
//INPUT7   DD DSN=BP13.K410.ACCUMSO.INET,DISP=OLD                               
//INPUT8   DD DSN=BP13.K410.ACCUMSO.INET.ALTX,DISP=OLD                          
//INPUT9   DD DSN=BP13.K640.CA.ACTION.INET,DISP=OLD                             
//INPUT10  DD DSN=BP13.K943.OCPR.BO.INET,DISP=OLD                               
//INPUT11  DD DSN=BP13.K022.WISOIC.INET,DISP=OLD                                
//INPUT12  DD DSN=BP13.K024.WISLAST.INET,DISP=OLD                               
//INPUT13  DD DSN=BP13.K060.CODETAB.INET,DISP=OLD                               
//INPUT14  DD DSN=BP13.K454.APPTABLE.INET,DISP=OLD                              
//INPUT15  DD DSN=BP13.K705.SOCLIST.INET,DISP=OLD                               
//INPUT16  DD DSN=BP13.K730.MATURERQ.INET,DISP=OLD                              
//INPUT17  DD DSN=BP13.K752.OTBUIN.INET,DISP=OLD                                
//INPUT18  DD DSN=BP13.K823.RSVOCCP.INET,DISP=OLD                               
//INPUT19  DD DSN=BP13.K825.REQOCCP.INET,DISP=OLD                               
//INPUT20  DD DSN=BP13.KD15.DBSSTP.INET,DISP=OLD                                
//INPUT21  DD DSN=BP13.KA20.BLOCK.INET,DISP=OLD                                 
//INPUT22  DD DSN=BP13.KP00.DOC.INET,DISP=OLD                                   
//INPUT23  DD DSN=BP13.KQ10.DOC.TBL.INET,DISP=OLD                               
//INPUT24  DD DSN=BP13.KQ60.LAST.QUEUE.INET,DISP=OLD                            
//INPUT25  DD DSN=BP13.KD30.PPDUEDTE.INET,DISP=OLD                              
//INPUT26  DD DSN=BP13.KL00.LETTER.INET,DISP=OLD                                
//INPUT27  DD DSN=BP13.KL05.LETTER.HISTORY.INET,DISP=OLD                        
//INPUT28  DD DSN=BP13.KH50.UPD.FP.INET,DISP=OLD                                
//INPUT29  DD DSN=BP13.K857.EMAIL.INET,DISP=OLD                                 
//INPUT30  DD DSN=BP13.K859.PCD.EMAIL.INET,DISP=OLD                             
//INPUT31  DD DSN=BP13.K940.APLCTN.BO.INET,DISP=OLD                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
          VFY FILE(INPUT10)                                                     
          VFY FILE(INPUT11)                                                     
          VFY FILE(INPUT12)                                                     
          VFY FILE(INPUT13)                                                     
          VFY FILE(INPUT14)                                                     
          VFY FILE(INPUT15)                                                     
          VFY FILE(INPUT16)                                                     
          VFY FILE(INPUT17)                                                     
          VFY FILE(INPUT18)                                                     
          VFY FILE(INPUT19)                                                     
          VFY FILE(INPUT20)                                                     
          VFY FILE(INPUT21)                                                     
          VFY FILE(INPUT22)                                                     
          VFY FILE(INPUT23)                                                     
          VFY FILE(INPUT24)                                                     
          VFY FILE(INPUT25)                                                     
          VFY FILE(INPUT26)                                                     
          VFY FILE(INPUT27)                                                     
          VFY FILE(INPUT28)                                                     
          VFY FILE(INPUT29)                                                     
          VFY FILE(INPUT30)                                                     
          VFY FILE(INPUT31)                                                     
//*                                                                             
//*=================================================================            
//*  SORT BP13K800 ACCORDING TO REGN NO                                         
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFND=13')                                                 
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(500,250),RLSE),                            
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
/*                                                                              
//*-----------------------------------------------------------------            
//*  DELETE & REDEFINE OF BP13.K800.APPLN.INET                                  
//*-----------------------------------------------------------------            
//STEP03    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=&&BP13F800,DISP=(OLD,PASS)                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL (BP13.K800.APPLN.INET) CL PURGE                                   
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K800.APPLN.INET)            -                  00810000
              CYL(700 120)                           -                  00830000
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K800.APPLN.INET.DATA)       -                  00870000
              KEYS(8 3)                              -                  00880000
              RECSZ(2000 2000)                       -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K800.APPLN.INET.INDEX)      -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K800.APPLN.INET)                                 00720000
//*=================================================================            
//*  SORT BP13K820 ACCORDING TO REGN NO / UIN                                   
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13K820,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(300,150),RLSE),                            
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*-----------------------------------------------------------------            
//*  DELETE & REDEFINE BP13.K820.OCCUP.INET                                     
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13K820,DISP=(OLD,PASS)                                    
//SYSIN    DD  *                                                                
          DEL (BP13.K820.OCCUP.INET) CL PURGE                                   
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K820.OCCUP.INET)            -                  00810000
              CYL(60 30)                           -                    00830000
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K820.OCCUP.INET.DATA)       -                  00870000
              KEYS(17 0)                             -                  00880000
              RECSZ(400 400)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K820.OCCUP.INET.INDEX) -                       00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K820.OCCUP.INET)                                 00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.K820.OCCUP.INET.ALTX1) -                  00980000
               REL(BP13.K820.OCCUP.INET)             -                  00990000
               REUSE                                 -                  01010000
               KEYS(9 8)                             -                  01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.K820.OCCUP.INET.ALTX1.DATA) -                 01070000
               CYL(15 5)                          -                     01080000
               RECSZ(31 354)                         -                  01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.K820.OCCUP.INET.ALTX1.INDEX) -                01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.K820.OCCUP.INET.PATH1) -                 01160000
               PENT(BP13.K820.OCCUP.INET.ALTX1))                        01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.K820.OCCUP.INET)             -                  01190000
               ODS(BP13.K820.OCCUP.INET.ALTX1)                          01200000
//*=================================================================            
//*  SORT BP13K830                                                              
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K830.ADDR,DISP=SHR                               00045012
//SORTOUT  DD DSN=&&F830SORT,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                              
//            SPACE=(CYL,(150,25),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//*  DELETE & REDEFINE BP13.K830.ADDR.INET                                      
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&F830SORT,DISP=(OLD,PASS)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
         DEL (BP13.K830.ADDR.INET) CL PURGE                                     
         DEF CL (NAME(BP13.K830.ADDR.INET)             -                        
                 CYL(180 50)                           -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 DATACLAS(MULTIVOL)                     -                       
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K830.ADDR.INET.DATA)       -                        
                 KEYS(9 0)                             -                        
                 RECSZ(250 250)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K830.ADDR.INET)                                       
           DEF AIX (NAME(BP13.K830.ADDR.INET.ALTX1)    -                        
               REL(BP13.K830.ADDR.INET)                -                        
               CYL(20 8)                               -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K830.ADDR.INET.ALTX1.DATA)   -                        
               KEYS(8 19)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 3000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K830.ADDR.INET.PATH1)    -                        
               PENT(BP13.K830.ADDR.INET.ALTX1))                                 
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K830.ADDR.INET)                -                        
               ODS(BP13.K830.ADDR.INET.ALTX1)                                   
//*=================================================================            
//*  SORT BP13K400                                                              
//*-----------------------------------------------------------------            
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K400.SALEORD,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F400,DISP=(NEW,PASS),                                   
//            SPACE=(TRK,(20,5),RLSE),UNIT=SYSDA,                               
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,8,A),FORMAT=CH                                             
      SUM  FIELDS=NONE                                                          
//*-----------------------------------------------------------------            
//*  DELETE & REDEFINE BP13.K400.SALEORD.INET                                   
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&BP13F400,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEL (BP13.K400.SALEORD.INET) CL PURGE                                  
         DEF CL (NAME(BP13.K400.SALEORD.INET) -                                 
                 TRK(30 5)                       -                              
                 UNIQUE                          -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K400.SALEORD.INET.DATA) -                           
                 KEYS(8 0)                       -                              
                 RECSZ(2000 2000)                -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096)) -                                                  
                 INDEX                           -                              
                 (NAME(BP13.K400.SALEORD.INET.INDEX) -                          
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K400.SALEORD.INET)                                    
//*=================================================================            
//*  SORT BP13K410                                                              
//*-----------------------------------------------------------------            
//STEP10  EXEC SORT,COND=(0,NE)                                         00010000
//SORTIN  DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                            00120000
//           AMP=('BUFND=13')                                                   
//SORTOUT DD DSN=&&BP13F410,DISP=(NEW,PASS),                                    
//           UNIT=(SYSDA,20),                                           03880012
//           DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                       03890012
//           SPACE=(CYL,(250,10),RLSE)                                  03890112
//SYSIN   DD *                                                          00150000
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*-----------------------------------------------------------------    ------  
//*  DELETE & REDEFINE BP13.K410.ACCUMSO.INET                                   
//*-----------------------------------------------------------------    ------  
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&BP13F410,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEL (BP13.K410.ACCUMSO.INET) CL PURGE                                  
         DEF CL (NAME(BP13.K410.ACCUMSO.INET)          -                        
                 CYL(700 180)                          -                        
                 DATACLAS(MULTIVOL)                    -                        
                 UNIQUE                                -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SPEED                                 -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K410.ACCUMSO.INET.DATA)    -                        
                 KEYS(8 0)                             -                        
                 RECSZ(2000 2000)                      -                        
                 FSPC(20 20)                           -                        
                 CISZ(4096))                           -                        
                 INDEX                                 -                        
                 (NAME(BP13.K410.ACCUMSO.INET.INDEX)   -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
            REPRO IFILE(INPUT)                         -                        
                  ODS(BP13.K410.ACCUMSO.INET)                                   
      IF MAXCC = 0  THEN                               -                        
          DEF AIX                                      -                        
               (NAME(BP13.K410.ACCUMSO.INET.ALTX)      -                        
                REL(BP13.K410.ACCUMSO.INET)               -                     
                KEYS(9 137)                          -                          
                BUFSP(25088)                         -                          
                SHR(2 3)                             -                          
                NUNQK)                               -                          
              DATA                                   -                          
               (NAME(BP13.K410.ACCUMSO.INET.ALTX.DATA) -                        
                CYL(50 25)                      -                               
                RECSZ(23 213)                        -                          
                FSPC(15 15)                          -                          
                CISZ(4096))                          -                          
              INDEX                                  -                          
               (NAME(BP13.K410.ACCUMSO.INET.ALTX.INDEX) -                       
                CISZ(4096))                                                     
         IF MAXCC = 0 THEN                           -                          
           DEF PATH (NAME(BP13.K410.ACCUMSO.INET.PATH) -                        
               PENT(BP13.K410.ACCUMSO.INET.ALTX))                               
         IF MAXCC = 0 THEN                           -                          
           BIX IDS(BP13.K410.ACCUMSO.INET)          -                           
               ODS(BP13.K410.ACCUMSO.INET.ALTX)                                 
//*                                                                             
//*-----------------------------------------------------------------    ------  
//*  DELETE & REDEFINE BP13.K640.CA.ACTION.INET                                 
//*-----------------------------------------------------------------    ------  
//STEP12 EXEC PGM=IDCAMS,COND=(0,NE)                                    00930021
//BP13F640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR                                  
//SYSPRINT DD SYSOUT=*                                                  00960000
//SYSIN    DD *                                                         00970000
         DEL (BP13.K640.CA.ACTION.INET) CL PURGE                                
         DEF CL (NAME(BP13.K640.CA.ACTION.INET) -                       00990000
                 TRK(500 250)   -                                       01010000
                 UNIQUE                   -                             01020000
                 SPEED                    -                                     
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                -                             01030000
                 DATA                     -                             01040000
                 (NAME(BP13.K640.CA.ACTION.INET.DATA) -                 01050000
                 KEYS(8 0)               -                              01060000
                 RECSZ(500 500)           -                             01070000
                 CISZ(4096)) -                                          01080000
                 INDEX                    -                             01090000
                 (NAME(BP13.K640.CA.ACTION.INET.INDEX))                 01100000
        IF MAXCC = 0 THEN                                               01110000
           REPRO INFILE(BP13F640) ODS(BP13.K640.CA.ACTION.INET)         01120000
//*---------------------------------------------------------------------00000550
//* DEFINE BP13.K943.OCPR.BO.INET                                       00000560
//*---------------------------------------------------------------------00000570
//STEP13 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00000580
//SYSPRINT DD  SYSOUT=*                                                 00000590
//INPUT    DD  DSN=BP13.K943.OCPR.BO,                                   00000600
//             DISP=SHR                                                 00000610
//SYSIN    DD  *                                                        00000620
  DEL   (BP13.K943.OCPR.BO.INET) CL PURGE                                 001   
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K943.OCPR.BO.INET)                  -                  001   
        SHR(2,3)                                       -                  001   
        KEYS(17 0)                                     -                  001   
        CYL(20 10)                                     -                  001   
        RECSZ(200 200)                                 -                  001   
        FREESPACE(30 30)                               -                  001   
        CISZ(4096)                                     -                  001   
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                  001   
        UNQ)                                           -                  001   
      DATA                                             -                      00
        (NAME(BP13.K943.OCPR.BO.INET.DATA))            -                  001   
      INDEX                                            -                      00
        (NAME(BP13.K943.OCPR.BO.INET.INDEX))                              001   
      IF MAXCC = 0 THEN                                -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K943.OCPR.BO.INET)                                       
      IF MAXCC = 0  THEN                               -                00970000
           DEF AIX (NAME(BP13.K943.OCPR.BO.INET.ALTX1) -                00980000
               REL(BP13.K943.OCPR.BO.INET)             -                00990000
               REUSE                                   -                01010000
               KEYS(9 8)                               -                01020000
               SHR(2 3)                                -                01040000
               NUNQK)                                  -                01050000
               DATA                                    -                01060000
               (NAME(BP13.K943.OCPR.BO.INET.ALTX1.DATA) -               01070000
               CYL(10 5)                               -                01080000
               RECSZ(31 354)                           -                01090000
               FSPC(10 10)                             -                01100000
               CISZ(4096))                             -                01110000
               INDEX                                   -                01120000
               (NAME(BP13.K943.OCPR.BO.INET.ALTX1.INDEX) -              01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                             -                01150000
           DEF PATH (NAME(BP13.K943.OCPR.BO.INET.PATH1) -               01160000
               PENT(BP13.K943.OCPR.BO.INET.ALTX1))                      01170000
         IF LASTCC = 0 THEN                                             01180000
           BIX IDS(BP13.K943.OCPR.BO.INET)             -                01190000
               ODS(BP13.K943.OCPR.BO.INET.ALTX1)                        01200000
//*                                                                             
//******************************************************************            
//*  TO RE-DEFINE THE VSAM FILE BP13K022 (BP13.K022.WISOIC.INET)   *            
//******************************************************************            
//STEP14    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K022.WISOIC,DISP=SHR                                    
//SYSIN     DD  *                                                               
            DEL 'BP13.K022.WISOIC.INET' CLUSTER PURGE                   00800000
            DEF CLUSTER                                     -           00800000
                (NAME(BP13.K022.WISOIC.INET)              -             00810000
                 TRK(15 10)                                -            00830000
                 STORCLAS(PRODRLS)                          -                   
                 LOG(NONE)                                  -                   
                 UNIQUE                                     -           00840000
                 SHR(2 3))                                  -           00850000
                DATA                                        -           00860000
                (NAME(BP13.K022.WISOIC.INET.DATA)         -             00870000
                 KEYS(13 0)                                 -           00880000
                 RECSZ(100 100)                             -           00890000
                 CISZ(4096)                                 -           00900000
                 FSPC(10 10))                               -           00910000
                INDEX                                       -           00920000
                (NAME(BP13.K022.WISOIC.INET.INDEX)        -             00930000
                 CISZ(4096))                                            00940000
            IF MAXCC = 0  THEN                              -           00950000
               REPRO IFILE(INPUT1)                          -           00960000
               ODS(BP13.K022.WISOIC.INET)                               00720000
      IF MAXCC = 0 THEN                                -                        
        DEF AIX (NAME(BP13.K022.WISOIC.INET.ALTX1)    -                         
            REL(BP13.K022.WISOIC.INET)                -                         
            TRK(5 3)                                  -                         
            UNIQUE                                     -                        
            SHR(2 3))                                  -                        
            DATA                                       -                        
            (NAME(BP13.K022.WISOIC.INET.ALTX1.DATA)   -                         
            KEYS(8 5)                                  -                        
            CISZ(4096)                                 -                        
            RECSZ(100 1000)                              -                      
            NUNQK)                                                              
      IF MAXCC = 0 THEN                                -                        
        DEF PATH(NAME(BP13.K022.WISOIC.INET.PATH1)    -                         
            PENT(BP13.K022.WISOIC.INET.ALTX1))                                  
      IF MAXCC = 0 THEN                                -                        
        BIX IDS(BP13.K022.WISOIC.INET)                -                         
            ODS(BP13.K022.WISOIC.INET.ALTX1)                                    
//*---------------------------------------------------------------------        
//* TO DELETE & REDEFINE BP13K024                                       00020004
//*---------------------------------------------------------------------        
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                  00030000
//SYSPRINT DD SYSOUT=*                                                  00040000
//INPUT    DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//SYSIN    DD *                                                         00050000
  DEL (BP13.K024.WISLAST.INET) CL PURGE                                 001     
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K024.WISLAST.INET)                  -                  001   
        SHAREOPTIONS(2,3)                              -                  001   
        KEYS(5 0)                                      -                  001   
        TRK(5 3)                                       -                  001   
        RECSZ(100 100)                                 -                  001   
        FREESPACE(10 10)                               -                  001   
        CISZ(4096)                                     -                  001   
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                  001   
        UNQ)                                           -                  001   
      DATA                                             -                      00
        (NAME(BP13.K024.WISLAST.INET.DATA))            -                  001   
      INDEX                                            -                      00
        (NAME(BP13.K024.WISLAST.INET.INDEX))                              001   
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K024.WISLAST.INET)                                    
/*                                                                              
//******************************************************************            
//*  TO CREATE SOC MASTER FILE (BP13.K060.CODETAB.INET)                         
//******************************************************************            
//STEP16    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=BP13.K060.CODETAB,DISP=SHR                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL 'BP13.K060.CODETAB.INET' CLUSTER PURGE                    00800000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K060.CODETAB.INET)         -                   00810000
              TRK(10  05)                            -                  00830000
              UNIQUE                                 -                  00840000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K060.CODETAB.INET.DATA)    -                   00870000
              KEYS(5 0)                              -                  00880000
              RECSZ(25   25)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K060.CODETAB.INET.INDEX)   -                   00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K060.CODETAB.INET)                               00720000
//*-----------------------------------------------------------------            
//*  DELETE & REDEFINE OF BP13.K454.APPTABLE.INET                               
//*-----------------------------------------------------------------            
//STEP17   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K454.APPTABLE,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K454.APPTABLE.INET) CLUSTER PURGE                            
         DEF CL (NAME(BP13.K454.APPTABLE.INET) -                                
                 CYL(3 1)                 -                                     
                 SHR(2 3)                 -                                     
                 KEYS(22 0)              -                                      
                 RECSZ(100 100)           -                                     
                 CISZ(4096)               -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 IXD                      -                                     
                 UNQ)                     -                                     
              DATA                        -                                     
              (NAME(BP13.K454.APPTABLE.INET.DATA)) -                            
              INDEX                           -                                 
              (NAME (BP13.K454.APPTABLE.INET.INDEX))                            
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K454.APPTABLE.INET)                                        
         IF MAXCC = 0 THEN                        -                             
           DEF AIX (NAME(BP13.K454.APPTABLE.INET.ALTX1) -                       
               REL(BP13.K454.APPTABLE.INET)            -                        
               CYL(2 1)                    -                                    
               UNIQUE                         -                                 
               SHR(2 3))                -                                       
               DATA                       -                                     
               (NAME(BP13.K454.APPTABLE.INET.ALTX1.DATA) -                      
               KEYS(10 12)                      -                               
               CISZ(4096)                    -                                  
               RECSZ(100 500)          -                                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                   -                                  
           DEF PATH(NAME(BP13.K454.APPTABLE.INET.PATH1)-                        
               PENT(BP13.K454.APPTABLE.INET.ALTX1))                             
         IF MAXCC = 0 THEN                   -                                  
           BIX IDS(BP13.K454.APPTABLE.INET) -                                   
               ODS(BP13.K454.APPTABLE.INET.ALTX1)                               
         IF MAXCC = 0 THEN                        -                             
           DEF AIX (NAME(BP13.K454.APPTABLE.INET.ALTX2) -                       
               REL(BP13.K454.APPTABLE.INET)            -                        
               CYL(2 1)                    -                                    
               UNIQUE                         -                                 
               SHR(2 3))                -                                       
               DATA                       -                                     
               (NAME(BP13.K454.APPTABLE.ALTX2.INET.DATA) -                      
               KEYS(22 22)                     -                                
               CISZ(4096)                    -                                  
               RECSZ(100 500)          -                                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                   -                                  
           DEF PATH(NAME(BP13.K454.APPTABLE.INET.PATH2)-                        
               PENT(BP13.K454.APPTABLE.INET.ALTX2))                             
         IF MAXCC = 0 THEN                   -                                  
           BIX IDS(BP13.K454.APPTABLE.INET) -                                   
               ODS(BP13.K454.APPTABLE.INET.ALTX2)                               
//*-----------------------------------------------------------------            
//*  DELETE & REDEFINE OF BP13.K705.SOCLIST.INET                                
//*-----------------------------------------------------------------            
//STEP18    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT     DD DSN=BP13.K705.SOCLIST,DISP=SHR                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN    DD *                                                                 
         DEL (BP13.K705.SOCLIST.INET) CLUSTER PURGE                             
         DEF CL (NAME(BP13.K705.SOCLIST.INET)          -                        
                 CYL(30 10)                            -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K705.SOCLIST.INET.DATA)    -                        
                 KEYS(49 0)                            -                        
                 RECSZ(500 500)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K705.SOCLIST.INET)                                    
           DEF AIX (NAME(BP13.K705.SOCLIST.INET.ALTX1) -                        
               REL(BP13.K705.SOCLIST.INET)             -                        
               CYL(10 5)                               -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K705.SOCLIST.INET.ALTX1.DATA) -                       
               KEYS(8 122)                              -                       
               CISZ(4096)                              -                        
               RECSZ(63 954)                           -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K705.SOCLIST.INET.PATH1) -                        
               PENT(BP13.K705.SOCLIST.INET.ALTX1))                              
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K705.SOCLIST.INET)             -                        
               ODS(BP13.K705.SOCLIST.INET.ALTX1)                                
//*-----------------------------------------------------------------            
//*  DELETE & REDEFINE OF BP13.K730.MATURERQ.INET                               
//*-----------------------------------------------------------------            
//STEP19   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K730.MATURERQ.INET) CLUSTER PURGE                            
         DEF CL (NAME(BP13.K730.MATURERQ.INET)         -                        
                 CYL(8 5)                              -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K730.MATURERQ.INET.DATA)   -                        
                 KEYS(8 122)                           -                        
                 RECSZ(500 500)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K730.MATURERQ.INET)                                   
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K730.MATURERQ.INET.ALTX1) -                       
               REL(BP13.K730.MATURERQ.INET)            -                        
               CYL(5 3)                                -                        
              UNIQUE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K730.MATURERQ.INET.ALTX1.DATA) -                      
               KEYS(9 40)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 400)                           -                        
               NUNQK)                                                           
         IF LASTCC = 0 THEN                            -                        
           DEF PATH(NAME(BP13.K730.MATURERQ.INET.PATH1) -                       
               PENT(BP13.K730.MATURERQ.INET.ALTX1))                             
         IF LASTCC = 0 THEN                            -                        
           BIX IDS(BP13.K730.MATURERQ.INET)            -                        
               ODS(BP13.K730.MATURERQ.INET.ALTX1)                               
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K730.MATURERQ.INET.ALTX2) -                       
               REL(BP13.K730.MATURERQ.INET)            -                        
               CYL(5  3)                               -                        
              UNIQUE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K730.MATURERQ.INET.ALTX2.DATA) -                      
               KEYS(9 81)                              -                        
               CISZ(4096)                              -                        
               RECSZ(100 400)                          -                        
               NUNQK)                                                           
         IF LASTCC = 0 THEN                            -                        
           DEF PATH(NAME(BP13.K730.MATURERQ.INET.PATH2) -                       
               PENT(BP13.K730.MATURERQ.INET.ALTX2))                             
         IF LASTCC = 0 THEN                             -                       
           BIX IDS(BP13.K730.MATURERQ.INET)             -                       
               ODS(BP13.K730.MATURERQ.INET.ALTX2)                               
//*-----------------------------------------------------------------            
//*  DELETE & REDEFINE OF BP13.K752.OTBUIN.INET                                 
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.K752.OTBUIN,DISP=SHR                                     
//SYSIN    DD *                                                                 
  DEL (BP13.K752.OTBUIN.INET) CLUSTER PURGE                                     
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K752.OTBUIN.INET)                   -                  001   
              CYL(350 100)                           -                          
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K752.OTBUIN.INET.DATA)      -                          
              KEYS(12 0)                             -                          
              RECSZ(150 150)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K752.OTBUIN.INET.INDEX)     -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT)                          -                  00960000
              ODS(BP13.K752.OTBUIN.INET)                                00720000
//*-----------------------------------------------------------------            
//*  DELETE & REDEFINE OF BP13.K823.RSVOCCP.INET                                
//*-----------------------------------------------------------------            
//STEP21   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.K823.RSVOCCP,DISP=SHR                                    
//SYSIN    DD *                                                                 
  DEL (BP13.K823.RSVOCCP.INET) CLUSTER PURGE                                    
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K823.RSVOCCP.INET)                  -                  001   
        SHR(2,3)                                       -                  001   
        KEYS(17 0)                                     -                  001   
        CYL(10 5)                                      -                  001   
        RECSZ(200 200)                                 -                  001   
        FREESPACE(30 30)                               -                  001   
        CISZ(4096)                                     -                  001   
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                  001   
        UNQ)                                           -                  001   
      DATA                                             -                      00
        (NAME(BP13.K823.RSVOCCP.INET.DATA))            -                  001   
      INDEX                                            -                      00
        (NAME(BP13.K823.RSVOCCP.INET.INDEX))                              001   
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K823.RSVOCCP.INET)                                       
      IF MAXCC = 0 THEN                                -                        
        DEF AIX (NAME(BP13.K823.RSVOCCP.INET.ALTX1)    -                        
            REL(BP13.K823.RSVOCCP.INET)                -                        
            CYL(5 2)                                   -                        
            UNIQUE                                     -                        
            SHR(2 3))                                  -                        
            DATA                                       -                        
            (NAME(BP13.K823.RSVOCCP.INET.ALTX1.DATA)   -                        
            KEYS(9 8)                                  -                        
            CISZ(4096)                                 -                        
            RECSZ(60 300)                              -                        
            NUNQK)                                                              
      IF MAXCC = 0 THEN                                -                        
        DEF PATH(NAME(BP13.K823.RSVOCCP.INET.PATH1)    -                        
            PENT(BP13.K823.RSVOCCP.INET.ALTX1))                                 
      IF MAXCC = 0 THEN                                -                        
        BIX IDS(BP13.K823.RSVOCCP.INET)                -                        
            ODS(BP13.K823.RSVOCCP.INET.ALTX1)                                   
//*--------------------------------------------------------------------------   
//*  DELETE & REDEFINE OF BP13.K825.REQOCCP.INET                                
//*--------------------------------------------------------------------         
//STEP22   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//SYSIN    DD *                                                                 
  DEL (BP13.K825.REQOCCP.INET) CLUSTER PURGE                                    
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K825.REQOCCP.INET)                  -                  001   
        SHR(2,3)                                       -                  001   
        KEYS(17 0)                                     -                  001   
        CYL(10 5)                                      -                  001   
        RECSZ(200 200)                                 -                  001   
        FREESPACE(30 30)                               -                  001   
        CISZ(4096)                                     -                  001   
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                  001   
        UNQ)                                           -                  001   
      DATA                                             -                      00
        (NAME(BP13.K825.REQOCCP.INET.DATA))            -                  001   
      INDEX                                            -                      00
        (NAME(BP13.K825.REQOCCP.INET.INDEX))                              001   
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K825.REQOCCP.INET)                                       
      IF MAXCC = 0 THEN                                -                        
        DEF AIX (NAME(BP13.K825.REQOCCP.INET.ALTX1) -                           
            REL(BP13.K825.REQOCCP.INET)                -                        
            CYL(5 2)                                   -                        
            UNIQUE                                     -                        
            SHR(2 3))                                  -                        
            DATA                                       -                        
            (NAME(BP13.K825.REQOCCP.INET.ALTX1.DATA)   -                        
            KEYS(9 8)                                  -                        
            CISZ(4096)                                 -                        
            RECSZ(60 300)                              -                        
            NUNQK)                                                              
      IF MAXCC = 0 THEN                                -                        
        DEF PATH(NAME(BP13.K825.REQOCCP.INET.PATH1)    -                        
            PENT(BP13.K825.REQOCCP.INET.ALTX1))                                 
      IF MAXCC = 0 THEN                                -                        
        BIX IDS(BP13.K825.REQOCCP.INET)                -                        
            ODS(BP13.K825.REQOCCP.INET.ALTX1)                                   
//*---------------------------------------------------------------------        
//*  DELETE & REDEFINE OF BP13.KD15.DBSSTP.INET                                 
//*--------------------------------------------------------------------         
//STEP23   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.KD15.DBSSTP,DISP=SHR                                    
//SYSIN     DD  *                                                               
            DEL (BP13.KD15.DBSSTP.INET) CL PURGE                                
            DEF CLUSTER (NAME(BP13.KD15.DBSSTP.INET)     -              00800000
                TRK(50 10)                         -                    00830000
                UNIQUE                                -                 00840000
                STORCLAS(PRODRLS)                     -                         
                LOG(NONE)                             -                         
                SHR(2 3))                             -                 00850000
              DATA                                    -                 00860000
                (NAME(BP13.KD15.DBSSTP.INET.DATA)         -             00870000
                 KEYS(17 0)                           -                 00880000
                 RECSZ(300 300)                       -                 00890000
                 CISZ(4096)                           -                 00900000
                 FSPC(10 10))                         -                 00910000
              INDEX                                   -                 00920000
                (NAME(BP13.KD15.DBSSTP.INET.INDEX)       -              00930000
                 CISZ(4096))                                            00940000
            IF MAXCC = 0  THEN                        -                 00950000
               REPRO IFILE(INPUT1)                    -                 00960000
               ODS(BP13.KD15.DBSSTP.INET)                               00720000
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.KD15.DBSSTP.INET.ALTX1)      -                      
              REL(BP13.KD15.DBSSTP.INET)                 -                      
              CYL(5  2)                              -                          
              SHR(2 3)                               -                          
              KEYS(11 17)                             -                         
              CISZ(4096)                             -                          
              RECSZ(300 300))                                                   
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.KD15.DBSSTP.INET.PATH1)      -                      
             PENT(BP13.KD15.DBSSTP.INET.ALTX1))                                 
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.KD15.DBSSTP.INET)                  -                      
             ODS(BP13.KD15.DBSSTP.INET.ALTX1)                                   
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.KD15.DBSSTP.INET.ALTX2)      -                      
              REL(BP13.KD15.DBSSTP.INET)                 -                      
              CYL(5  2)                              -                          
              SHR(2 3)                               -                          
              KEYS(11 28)                            -                          
              CISZ(4096)                             -                          
              RECSZ(300 300))                                                   
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.KD15.DBSSTP.INET.PATH2)      -                      
             PENT(BP13.KD15.DBSSTP.INET.ALTX2))                                 
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.KD15.DBSSTP.INET)                  -                      
             ODS(BP13.KD15.DBSSTP.INET.ALTX2)                                   
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.KD15.DBSSTP.INET.ALTX3)      -                      
              REL(BP13.KD15.DBSSTP.INET)                 -                      
              CYL(5  2)                              -                          
              SHR(2 3)                               -                          
              KEYS(19 39)                            -                          
              CISZ(4096)                             -                          
              RECSZ(300 300))                                                   
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.KD15.DBSSTP.INET.PATH3)      -                      
             PENT(BP13.KD15.DBSSTP.INET.ALTX3))                                 
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.KD15.DBSSTP.INET)                  -                      
             ODS(BP13.KD15.DBSSTP.INET.ALTX3)                                   
//*---------------------------------------------------------------------        
//*  DELETE & REDEFINE OF BP13.KA20.BLOCK.INET                                  
//*--------------------------------------------------------------------         
//STEP24    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.KA20.BLOCK,DISP=SHR                                     
//SYSIN     DD  *                                                               
            DEL (BP13.KA20.BLOCK.INET) CL PURGE                         00800000
            DEF CLUSTER (NAME(BP13.KA20.BLOCK.INET)        -            00800000
                TRK(20 10)                              -               00830000
                UNIQUE                                -                 00840000
                STORCLAS(PRODRLS)                     -                         
                LOG(NONE)                             -                         
                SHR(2 3))                             -                 00850000
              DATA                                    -                 00860000
                (NAME(BP13.KA20.BLOCK.INET.DATA)           -            00870000
                 KEYS(8 0)                           -                  00880000
                 RECSZ(200 200)                       -                 00890000
                 CISZ(4096)                           -                 00900000
                 FSPC(10 10))                         -                 00910000
              INDEX                                   -                 00920000
                (NAME(BP13.KA20.BLOCK.INET.INDEX)          -            00930000
                 CISZ(4096))                                            00940000
            IF MAXCC = 0  THEN                        -                 00950000
               REPRO IFILE(INPUT1)                    -                 00960000
               ODS(BP13.KA20.BLOCK.INET)                                00720000
//*--------------------------------------------------------------------         
//* CREATE BP13.KP00.DOC.INET                                                   
//*--------------------------------------------------------------------         
//STEP25   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.KP00.DOC,DISP=SHR                                        
//SYSIN    DD *                                                                 
         DELETE BP13.KP00.DOC.INET CL PURGE                                     
         DEF CL (NAME(BP13.KP00.DOC.INET)        -                              
                 CYL(20 10)                       -                             
                 UNIQUE                          -                              
                 DATACLAS(MULTIVOL)              -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.KP00.DOC.INET.DATA)  -                              
                 KEYS(17 0)                      -                              
                 RECSZ(3800 3800)                -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.KP00.DOC.INET)                                        
//*---------------------------------------------------------------------        
//* DEFINE HEADFLAT VSAM FILE BP13KQ10                                          
//*---------------------------------------------------------------------        
//STEP26 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.KQ10.DOC.TBL,                                           
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL BP13.KQ10.DOC.TBL.INET CL PURGE                                   
          DEF CLUSTER                                -                          
              (NAME(BP13.KQ10.DOC.TBL.INET)         -                           
              CYL(20 10)                               -                        
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.KQ10.DOC.TBL.INET.DATA)     -                          
              KEYS(8 0)                              -                          
              RECSZ(400 400)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.KQ10.DOC.TBL.INET.INDEX)   -                           
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.KQ10.DOC.TBL.INET)             -                           
            REUSE                                                               
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.KQ10.DOC.TBL.INET.ALTX1) -                          
              REL(BP13.KQ10.DOC.TBL.INET)           -                           
              CYL(5  2)                              -                          
              SHR(2 3)                               -                          
              UNIQUE                                 -                          
              KEYS(16 8)                             -                          
              CISZ(4096)                             -                          
              RECSZ(29 29))                                                     
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.KQ10.DOC.TBL.INET.PATH1) -                          
             PENT(BP13.KQ10.DOC.TBL.INET.ALTX1))                                
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.KQ10.DOC.TBL.INET)             -                          
             ODS(BP13.KQ10.DOC.TBL.INET.ALTX1)                                  
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.KQ10.DOC.TBL.INET.ALTX2) -                          
              REL(BP13.KQ10.DOC.TBL.INET)           -                           
              CYL(5  2)                              -                          
              SHR(2 3)                               -                          
              UNIQUE                                 -                          
              KEYS(19 24)                            -                          
              CISZ(4096)                             -                          
              RECSZ(32 32))                                                     
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.KQ10.DOC.TBL.INET.PATH2) -                          
             PENT(BP13.KQ10.DOC.TBL.INET.ALTX2))                                
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.KQ10.DOC.TBL.INET)             -                          
             ODS(BP13.KQ10.DOC.TBL.INET.ALTX2)                                  
//*--------------------------------------------------------------------         
//* CREATE BP13.KQ60.LAST.QUEUE.INET                                            
//*--------------------------------------------------------------------         
//STEP27    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=BP13.KQ60.LAST.QUEUE,DISP=SHR                                
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL 'BP13.KQ60.LAST.QUEUE.INET' CL PURGE                              
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.KQ60.LAST.QUEUE.INET)       -                  00810000
              CYL(30  10)                            -                  00830000
              DATACLAS(MULTIVOL)                     -                          
              SPEED                                  -                          
              STORCLAS(PRODRLS)               -                                 
              LOG(NONE)                       -                                 
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.KQ60.LAST.QUEUE.INET.DATA) -                   00870000
              KEYS(22 0)                            -                   00880000
              RECSZ(100 100)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.KQ60.LAST.QUEUE.INET.INDEX) -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.KQ60.LAST.QUEUE.INET)                            00720000
//*-----------------------------------------------------------------            
//* DELETE/DEFINE BP13KD30                                                      
//*-----------------------------------------------------------------            
//STEP28   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.KD30.PPDUEDTE,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
          DEL 'BP13.KD30.PPDUEDTE.INET' CLUSTER PURGE                   00800000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.KD30.PPDUEDTE.INET)         -                  00810000
              CYL(8 3)                              -                   00830000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.KD30.PPDUEDTE.INET.DATA)    -                  00870000
              KEYS(8 0)                              -                  00880000
              RECSZ(2000 2000)                       -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.KD30.PPDUEDTE.INET.INDEX) -                    00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.KD30.PPDUEDTE.INET)                              00720000
//*--------------------------------------------------------------------         
//STEP29A  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KL00.LETTER.INET,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.FL00.LETTER.INET,DISP=MOD                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-------------------------------------------------------------------- 00130010
//* SORT OUT DUPLICATES FOR BP13FL00                                    00010000
//*---------------------------------------                              00010000
//STEP29B  EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.FL00.LETTER.INET,DISP=SHR                                 
//SORTOUT DD DSN=BP13.FL00.LETTER.INET,DISP=SHR                                 
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,18,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------------  
//* DELETE AND DEFINE BP13KL00                                          ------  
//*---------------------------------------------------------------------------  
//STEP29   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.KL00.LETTER,DISP=SHR                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.KL00.LETTER.INET) CL PURGE                                   
         DEF CL (NAME(BP13.KL00.LETTER.INET)    -                               
                 CYL(120 60)                -                                   
                 UNIQUE                    -                                    
                 SPEED                     -                                    
                 DATACLAS(MULTIVOL)              -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3)                  -                                    
                 KEYS(18 0)                -                                    
                 CISZ(4096)                -                                    
                 RECSZ(200 200))                                                
         IF LASTCC = 0 THEN                -                                    
           REPRO IFILE(INPUT)              -                                    
               ODS(BP13.KL00.LETTER.INET)                                       
//*--------------------------------------------------------------------         
//STEP30A  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KL05.LETTER.HISTORY.INET,DISP=SHR                        
//OUTPUT1  DD DSN=BP13.FL05.LETTER.HISTORY.INET,DISP=MOD                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-------------------------------------------------------------------- 00130010
//* SORT OUT DUPLICATES FOR FL05                                        00010000
//*--------------------------------------------------------------------         
//STEP30B  EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.FL05.LETTER.HISTORY.INET,DISP=SHR                         
//SORTOUT DD DSN=BP13.FL05.LETTER.HISTORY.INET,DISP=SHR                         
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,135,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------------  
//* DELETE AND DEFINE BP13KL05                                          ------  
//*---------------------------------------------------------------------------  
//STEP30   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.KL05.LETTER.HISTORY,DISP=SHR                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.KL05.LETTER.HISTORY.INET) CL PURGE                           
         DEF CL (NAME(BP13.KL05.LETTER.HISTORY.INET) -                          
                 CYL(160 80)                -                                   
                 UNIQUE                    -                                    
                 SPEED                     -                                    
                 DATACLAS(MULTIVOL)              -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3)                  -                                    
                 KEYS(35 0)                -                                    
                 CISZ(4096)                -                                    
                 RECSZ(250 250))                                                
         IF LASTCC = 0 THEN                -                                    
           REPRO IFILE(INPUT)              -                                    
               ODS(BP13.KL05.LETTER.HISTORY.INET)                               
//*--------------------------------------------------------------------         
//STEP31A  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KH50.UPD.FP.INET,DISP=SHR                                
//OUTPUT1  DD DSN=&&BP13FH50,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,20),SPACE=(CYL,(100,50),RLSE),                        
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-------------------------------------------------------------------- 00130010
//* SORT OUT DUPLICATES FOR BP13FH50                                    00010000
//*-------------------------------------------------------------------- 00010000
//STEP31B  EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.FH50.UPD.FP.INET,DISP=SHR                                 
//        DD DSN=&&BP13FH50,DISP=(OLD,DELETE)                                   
//SORTOUT DD DSN=BP13.FH50.UPD.FP.INET,DISP=SHR                                 
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------------  
//* DELETE AND DEFINE BP13KL00                                          ------  
//*---------------------------------------------------------------------------  
//STEP31   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.KH50.UPD.FP,DISP=SHR                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.KH50.UPD.FP.INET) CL PURGE                                   
         DEF CL (NAME(BP13.KH50.UPD.FP.INET)    -                               
                 CYL(100 50)                -                                   
                 UNIQUE                    -                                    
                 SPEED                     -                                    
                 DATACLAS(MULTIVOL)              -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3)                  -                                    
                 KEYS(8 0)                -                                     
                 CISZ(4096)                -                                    
                 RECSZ(3000 3000))                                              
         IF LASTCC = 0 THEN                -                                    
           REPRO IFILE(INPUT)              -                                    
               ODS(BP13.KH50.UPD.FP.INET)                                       
//*-----------------------------------------------------------------            
//* DELETE AND DEFINE BP13.K857.EMAIL.INET                                      
//*-----------------------------------------------------------------            
//STEP32   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
          DEL 'BP13.K857.EMAIL.INET' CL PURGE                           00810000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K857.EMAIL.INET)          -                    00810000
              CYL(300 50)                           -                   00830000
              UNIQUE                                 -                  00840000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K857.EMAIL.INET.DATA)     -                    00870000
              KEYS(8 0)                              -                  00880000
              RECSZ(200 200)                       -                    00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K857.EMAIL.INET.INDEX) -                       00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K857.EMAIL.INET)                                 00720000
//*-----------------------------------------------------------------            
//*DELETE DEFINE BP13K859J (BP13K859 INET)                                      
//*-----------------------------------------------------------------            
//STEP33   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K859.PCD.EMAIL,DISP=SHR                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
          DEL 'BP13.K859.PCD.EMAIL.INET' CL PURGE                       00810000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K859.PCD.EMAIL.INET)      -                    00810000
              CYL(5 5)                           -                      00830000
              UNIQUE                                 -                  00840000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K859.PCD.EMAIL.INET.DATA) -                    00870000
              KEYS(8 0)                              -                  00880000
              RECSZ(200 200)                       -                    00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K859.PCD.EMAIL.INET.INDEX) -                   00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K859.PCD.EMAIL.INET)                             00720000
//*-----------------------------------------------------------------            
//*DELETE DEFINE BP13K94C  (BP13K940 INET)                                      
//*-----------------------------------------------------------------            
//STEP34   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K940.APLCTN.BO,DISP=SHR                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
         DEL 'BP13.K940.APLCTN.BO.INET' CLUSTER PURGE                           
         DEF CL (NAME(BP13.K940.APLCTN.BO.INET)       -                         
                 CYL(20 10)                            -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K940.APLCTN.BO.INET.DATA)  -                        
                 KEYS(8 122)                          -                         
                 RECSZ(400 400)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT1)                         -                        
                 ODS(BP13.K940.APLCTN.BO.INET)                                  
//********************** E N D  O F  J O B *************************            
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//*STEP33   EXEC WTOG,COND=(0,NE)                                               
//*   ----> BOTH BP13D700/D70A COMPLETED, THEN GROUP OPEN BP13F.                
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
