//BP13D53H JOB (BP13P),'BP13D53H',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//* 1. SFTP DAILY ACCUM FILE TO DEVELOPER                                       
//* 2. RUN AT 8.05 PM                                                           
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP134015 ZDD  150910   NEW JCL FOR FTP FILE (PATTERN TO BP13D538)           
//* BP134060 ZDD  011110   CATER FOR E03                                        
//* BP134060 IL5  230211   REMOVE T04                                           
//* BP134206 IL5  090511   ADD E06                                              
//* BP134283 IL5  250611   ADD E07                                              
//* BP134284 IL5  120711   ADD E05                                              
//* BP134266 IL5  180811   ADD E08                                              
//* BP134443 IL5  170112   ADD K11                                              
//* BP134416 IL5  260112   ADD E10                                              
//* BP134401 IL5  020212   ADD E09                                              
//* BP134624 IL5  311012   ADD E14                                              
//* BP134639 IL5  311012   ADD E15                                              
//* BP134734 IL5  141212   REMOVE E03 AND E06                                   
//*                        ADD E17 E18                                          
//* BP134734 IL5  220213   REINSTATE E03 AND E06                                
//* BP134789 IL5  200313   ADD E20                                              
//* BP134929 ZDD1 260613   ADD E19 AND E21                                      
//* BP13XXXX ZDD1 300713   ADD E22                                              
//* BP135031 CT2  250913   REPLACE WITH APP3.EC AND APP4.EC                     
//* BP135441 ZDD1 021214   ADD E29                                              
//* BP135669 ZDD1 130215   REMOVE E04                                           
//* BP135764 ZDD1 240415   REMOVE E03 AND E06                                   
//* BP135738 HH17 230615   ADD E31, REMOVE E01                                  
//* BP135609 HH17 230615   FTP MIGRATION TO LANSFTPP01                          
//* BP135771 HH17 230615   ADD E32                                              
//* BP135809 HH17 060715   ADD E33                                              
//* BP135866 HH17 010915   ADD E34, E35 AND E36                                 
//* BP136059 ZDD1 070116   ADD E37                                              
//* BP136137 HH17 030316   REMOVE E05                                           
//* BP136127 MRN1 040416   ADD E39                                              
//* BP136194 MRN1 310516   ADD E41                                              
//* BP136194 MRN1 210616   ADD E40                                              
//* BP136492 ZDD1 081116   REMOVED E23                                          
//* BP136564 HH17 030117   ADD E42                                              
//* BP136754 MRN1 210617   ADD E43                                              
//* BP137803 ZDD1 131117   REMOVE E11 AND E20 AND E24                           
//* BP137152 MRN1 210617   ADD E44                                              
//* BP137352 MRN1 310518   REMOVE E18                                           
//* BP137661 SRG1 160119   REMOVED E32                                          
//* BP137716 SSR1 080319   ADD E45                                              
//* BP139357 PP11 311022   ADD E52 E53                                          
//* BP139606 MRR5 260623   ADDED E54                                            
//* BP139802 EFAQ1 131223  ADDED E55                                            
//*==================================================================           
//*********************************************************************         
//*NOTE --- DIRECTORY USED /TEST/APPN/DATA/BP13/FROM-HDB/EC/E01/MF    *         
//*********************************************************************         
//* SORT BP13FB78 NEW AND UPDATED RECORD IN REGN-NO ORDER                       
//*------------------------------------------------------------------           
//D53HS00A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB25.DBSELIG,DISP=SHR                                    
//SORTOUT  DD DSN=&&FB78,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=3300,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(6,8,A),FORMAT=CH                                                
   INCLUDE COND=(3245,1,CH,EQ,C'Y',AND,                                         
                 3246,8,CH,NE,C' ',AND,                                         
                 101,1,CH,EQ,C'E')                                              
   OUTREC FIELDS=(101,3300)                                                     
//*------------------------------------------------------------------           
//* READ NEW CASES, FORMAT RECORD FOR DEVELOPER FORMAT (BP13FB66)               
//*------------------------------------------------------------------           
//D53HS00B EXEC PGM=BP13CD03,COND=(0,NE)                                        
//BP13FB20 DD DSN=&&FB78,DISP=(OLD,DELETE)                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//P13FB20A DD DSN=&&FB20,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=3300,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*------------------------------------------------------------------           
//* READ NEW CASES, FORMAT RECORD FOR DEVELOPER FORMAT (BP13FB66)               
//*------------------------------------------------------------------           
//D53HS00C EXEC PGM=BP13C12A,COND=(0,NE)                                        
//BP13FB20 DD DSN=&&FB20,DISP=(OLD,DELETE)                                      
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR                                      
//BP13KA30 DD DSN=BP13.KA30.UNIT,DISP=SHR                                       
//BP13KA31 DD DSN=BP13.KA30.UNIT.PATH1,DISP=SHR                                 
//BP13FB66 DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=OLD                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* BACKUP FILE TO DISK                                                         
//*--------------------------------------------------------------------         
//D53HS00D EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//OUTPUT1  DD DSN=BP13.FB66.FTPREQ.ASSESS.BACKUP(+1),DISP=(NEW,CATLG),          
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//* STEPE  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//D53HS00E EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FB66.FTPREQ.ASSESS.E02')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E02')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E07')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E07')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E08')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E08')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E10')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E10')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E09')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E09')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E12')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E12')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E13')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E13')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E14')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E14')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E15')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E15')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E17')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E17')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E19')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E19')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E21')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E21')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E22')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E22')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E25')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E25')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E26')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E26')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E28')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E28')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E29')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E29')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E30')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E30')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E31')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E31')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E33')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E33')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E34')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E34')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E35')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E35')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E36')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E36')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E37')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E37')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E39')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E39')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E40')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E40')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E41')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E41')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E42')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E42')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E43')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E43')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E44')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E44')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E45')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E45')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E52')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E52')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E53')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E53')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E54')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E54')                                       
     DEL ('BP13.FB66.FTPREQ.ASSESS.E55')                                        
     DEL ('BP13.FTP.ZIP.APPL.ASSESS.E55')                                       
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E02        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS02A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E02,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E02')                            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS02B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E02)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E02";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E02";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS02C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS02D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E02/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E02' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS02E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E07        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS07A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E07,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E07')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS07B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E07)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E07";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E07";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS07C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS07D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E07/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E07' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS07E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E08        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS08A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E08,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E08')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS08B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E08)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E08";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E08";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS08C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS08D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E08/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E08' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS08E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E09        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS09A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E09,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E09')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS09B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E09)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E09";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E09";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS09C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS09D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E09/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E09' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS09E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E10        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS10A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E10,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E10')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS10B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E10)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E10";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E10";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS10C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS10D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E10/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E10' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS10E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E12        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS12A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E12,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E12')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS12B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E12)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E12";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E12";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS12C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS12D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E12/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E12' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS12E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E13        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS13A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E13,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E13')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS13B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E13)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E13";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E13";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS13C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS13D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E13/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E13' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS13E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E14        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS14A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E14,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E14')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS14B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E14)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E14";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E14";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS14C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS14D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E14/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E14' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS14E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E15        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS15A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E15,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E15')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS15B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E15)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E15";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E15";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS15C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS15D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E15/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E15' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS15E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E17        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS17A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E17,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E17')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS17B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E17)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E17";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E17";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS17C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS17D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E17/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E17' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS17E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E19        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS19A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E19,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E19')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS19B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E19)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E19";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E19";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS19C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS19D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E19/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E19' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS19E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E21        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS21A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E21,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E21')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS21B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E21)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E21";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E21";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS21C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS21D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E21/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E21' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS21E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E22        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS22A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E22,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E22')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS22B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E22)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E22";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E22";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS22C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS22D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E22/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E22' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS22E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E25        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS25A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E25,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E25')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS25B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E25)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E25";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E25";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS25C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS25D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E25/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E25' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS25E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E26        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS26A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E26,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E26')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS26B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E26)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E26";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E26";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS26C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS26D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E26/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E26' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS26E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E28        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS28A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E28,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E28')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS28B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E28)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E28";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E28";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS28C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS28D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E28/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E28' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS28E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E29        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS29A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E29,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E29')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS29B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E29)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E29";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E29";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS29C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS29D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E29/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E29' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS29E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E30        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS30A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E30,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E30')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS30B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E30)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E30";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E30";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS30C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS30D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E30/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E30' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS30E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E31        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS21A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E31,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E31')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS21B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E31)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E31";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E31";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS21C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS21D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E31/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E31' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS21E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E33        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS30A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E33,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E33')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS30B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E33)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E33";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E33";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS30C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS30D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E33/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E33' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS30E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E34        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS30A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E34,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E34')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS30B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E34)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E34";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E34";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS30C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS30D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E34/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E34' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS30E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E35        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS30A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E35,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E35')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS30B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E35)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E35";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E35";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS30C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS30D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E35/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E35' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS30E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E36        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS30A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E36,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E36')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS30B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E36)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E36";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E36";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS30C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS30D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E36/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E36' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS30E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E37        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS37A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E37,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E37')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS37B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E37)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E37";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E37";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS37C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS37D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E37/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E37' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS37E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E39        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS39A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E39,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E39')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS39B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E39)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E39";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E39";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS39C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS39D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E39/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E39' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS39E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E40        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS40A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E40,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E40')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS40B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E40)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E40";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E40";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS40C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS40D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E40/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E40' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS40E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E41        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS41A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E41,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E41')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS41B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E41)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E41";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E41";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS41C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS41D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E41/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E41' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS41E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E42        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS42A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E42,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E42')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS42B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E42)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E42";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E42";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS42C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS42D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E42/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E42' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS42E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E43        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS43A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E43,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E43')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS43B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E43)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E43";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E43";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS43C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS43D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E43/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E43' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS43E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E44        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS44A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E44,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E44')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS44B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E44)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E44";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E44";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS44C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS44D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E44/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E44' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS44E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E45        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS45A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E45,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E45')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS45B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E45)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E45";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E45";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS45C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS45D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E45/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E45' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS45E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E52        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS52A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E52,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E52')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS52B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E52)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E52";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E52";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS52C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS52D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E52/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E52' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS52E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E53        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS53A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E53,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E53')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS53B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E53)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E53";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E53";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS53C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS53D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E53/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E53' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS53E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E54        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS54A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E54,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E54')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS54B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E54)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E54";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E54";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS54C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS54D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E54/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E54' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS54E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
//* ((((((((((((      FILE FOR PROJECT E55        ))))))))))))                  
//*------------------------------------------------------------------           
//D53HS55A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPREQ.DAILY.ASSESS,DISP=SHR                        
//SORTOUT1 DD DSN=BP13.FB66.FTPREQ.ASSESS.E55,DISP=(NEW,CATLG),                 
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(1,3,CH,EQ,C'E55')                            
//*==================================================================           
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS55B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.APPL4.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.APPL.ASSESS.E55)';                              
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPREQ.ASSESS.E55";                       
     STDPUT7  =",ELIGD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPREQ.ASSESS.E55";                                   
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53HS55C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.APPL4.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53HS55D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.APPL3.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E55/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.APPL.ASSESS.E55' ";                          
     STDPUT7  = "ELIGD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53HS55E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.APPL3.EC,DISP=SHR                             
//*                                                                             
//*------------------------------------------------------------------           
