//BP13D209 JOB (BP13P),'BP13D209',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//*=================================================================*           
//*                  S O C A       J O B                            *           
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP136627  25/10/2017  PCL4 TO UPDATE EMAIL REPORT SIZE (100 CHARS)          
//*                            - BP13C966                           *           
//*=================================================================*           
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*-----------------------------------------------------------------            
//* MATCH CDB BROADCAST FILE WITH BP13K820 BY CUSTOMER-ID                       
//*-----------------------------------------------------------------            
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BE01.F713.BROAD.PERCIDSR.DAYBKUP(0),DISP=SHR                 
//SORTOUT  DD  DSN=&&BE01F713,DISP=(,PASS),                                     
//             SPACE=(CYL,(50,20),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=560,BLKSIZE=27440)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(10,9,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* SORT BY KEY FIELD                                                           
//*-----------------------------------------------------------------            
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=&&P13K820,DISP=(,PASS),                                      
//             SPACE=(CYL,(50,20),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(245,9,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//*   MATCH BROADCAST FILE FOR REPORT                                           
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13C965,COND=(0,NE)                                        
//BP13F820 DD DSN=&&P13K820,DISP=(OLD,PASS)                                     
//BE01F713 DD DSN=&&BE01F713,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13FOUT DD DSN=&&BP13FOUT,DISP=(,PASS),                                      
//            SPACE=(CYL,(10,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=230,BLKSIZE=0)                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BY OIC                                                                 
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FOUT,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&BP13FSRT,DISP=(,PASS),                                      
//            SPACE=(CYL,(10,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=230,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(18,5,A),FORMAT=CH                                                
  INCLUDE COND=(18,5,CH,NE,C'     ')                                            
//*                                                                             
//*-----------------------------------------------------------------            
//*   GENERATE REPORT                                                           
//*-----------------------------------------------------------------            
//STEP05  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                
//BP13FIN  DD DSN=&&BP13FSRT,DISP=(OLD,DELETE)                                  
//P13L966A DD DSN=BP13.MAILRPTA.BP13C966,DISP=OLD                               
//P13L966B DD DSN=BP13.MAILRPTB.BP13C966,DISP=OLD                               
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C966) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL (P13L966A)                                            
//*-----------------------------------------------------------------            
//STEP06   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPTA.BP13C966,DISP=SHR                               
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL (P13L966B)                                            
//*-----------------------------------------------------------------            
//STEP07   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPTB.BP13C966,DISP=SHR                               
/*                                                                              
