//BP13D407 JOB (BP13P),'BP13D407',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010007
//      NOTIFY=CSD0071                                                  00020007
//*=================================================================*   00030007
//* OBJECTIVE : THIS JOB PROCESSES ALL STAMPING REQUEST FOR SOCA,   *   00040007
//*             SUB TRANSFER, TP & SA/TP.                           *   00050007
//*-----------------------------------------------------------------*   00060007
//* CHGE REQ  DATE        BY   DESCRIPTION                          *   00070007
//* ========  ==========  ==== ===========                          *   00080007
//* BP130696  01/08/1999  CLT1 E-STAMPING IMPLEMENTATION.           *   00090007
//* BP130821  24/04/2000  CLT1 TAG RELEASE PAYMENT FOR SUB-TRANSFER.*   00100007
//* BP132185  20/08/2002  CLT1 UPDATE JOBSTEP BP13C416/BP13C314.    *   00110007
//* BP132118  01/10/2002  MALC CHANGE STEP28 AND STEP29 TO CATER    *   00120007
//*                            WRITING OF REGN, SCH-ACCT AND        *   00130007
//*                            DTE-PRINCIPAL-SALES-AGMT FRM BP13K410*   00140007
//* BP132270  02/01/2003  MALC TO ADD READING OF K330 IN BP13C325   *   00150007
//*                            TO GET SF-DISC                       *   00160007
//* BP132546  12/06/2004  YCH2 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)*   00170007
//* BP133781  23/07/2010  ESD1 EDITED TO PROCESS DS TRANS CODE      *   00180007
//* BP133976  15/06/2011  ESD1 ADDED AB05K902                       *   00190007
//* BP134779  29/05/2013  PCL4 TO UPDATE BP13L446 INTO EMAIL FORMAT *   00200007
//* BP134810  28/06/2013  JGO1 CHANGE OUTPUT TO F225 FROM F234.     *   00210007
//*                            CHANGE INPUT  TO K960 FROM K962 AND  *   00220007
//*                            REMOVE K650 AS OUTPUT                *   00230007
//* BP134809  19/07/2013  JGO1 ADD BP13K410 AS INPUT TO BP13C355.   *   00240007
//* BP134760  15/08/2013  LSB1 MOVE BP13C410 FROM BP13D400 TO D407  *   00250007
//* BP135032  02/09/2013  JGO1 ADD DBSS SUBTRANSFER STAMPING (C43A) *   00260007
//* BP135032  03/09/2013  JGO1 UPDATE INPUT FOR BP13C43A            *   00270007
//* BP134998  10/09/2013  JGO1 ADD STAMPING FOR SA AFTER TP         *   00280007
//* BP134998  18/09/2013  JGO1 UPDATE ON STEP11C DISP CHANGE TO MOD *   00290007
//* BP135061  11/11/2013  JGO1 INCLUDE K410 AND K893 IN C43A PGM    *   00300007
//* BP135096  05/12/2013  JGO1 ADD NEW INPUT FOR AG07 SUBROUTINE    *   00310007
//* BP135017  27/01/2014  JGO1 ADD C32C AND C31H FOR SUA/TOL STAMP  *   00320007
//* BP135171  11/02/2014  RJE1 TO CATER FOR DB2 UPGRADE                 00330007
//* BP135247  05/03/2014  LJL1 TO CATER FOR TOL/SUA CASES.              00340007
//* BP135193  19/03/2014  JGO1 ADD K462 AS INPUT TO C31H.               00350007
//* BP135193  24/03/2014  JGO1 CHANGE OUTPUT OF C416 TO F225            00360007
//* BP135120  11/07/2014  JGO1 CHANGE OUTPUT OF C436 TO F225            00370007
//* BP135120  11/07/2014  JGO1 CHANGE OUTPUT OF C43A TO F225            00380007
//* BP135309  03/09/2014  JGO1 CHANGE OUTPUT OF C355 TO F225            00390007
//* BP135650  12/05/2015  ADD CALL OF BP13C35F                          00400007
//* BP135965  20/11/2015  KSJ3 ADD BP13K315 ALT INDEX                   00410007
//*                            ADD BP13CL10 PROCESSING FOR BP13KH70     00420007
//* BP135906  04/12/2015  KSJ3 PRINT BP13LL10 TO CLASS 2                00430007
//* BP136306  01/08/2016  KSJ3 INCL BP13C43B FOR DBSS ADHOC SOLIC FEE   00440007
//* BP137140  19/12/2017  LJL1 MOVE BP13C42H FROM BP13D401 DUE TO       00450007
//*                            AG07K960 BEEN HELD UP                    00460007
//* BP137668  15/03/2018  DN8  CATER NEW PROGRAM BP13C43D FOR DBSS CASE 00461007
//* BP138197  12/02/2020  LJL1 CATER FOR STAMPING FOR SO BP13K413       00462008
//*                            F315-FLAG-UPDSO-AFTER-TP = Y             00463008
//* BP138339  29/06/2020  KR13 RMVE L42HA REPORT FROM BP13C42H.                 
//* BP138849  16/09/2021  LJL1 CATER FOR UPDATE AFTER TP (HAC).                 
//*=================================================================*   00470007
//*                                                                     00480007
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00490007
//*                                                                     00500007
//*-------------------------------------------------------------------* 00510007
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                * 00520007
//*    PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGREEMENT TEAM)      * 00530007
//*-------------------------------------------------------------------* 00540007
//PRT01    EXEC PGM=IEBGENER                                            00550007
//SYSUT1   DD *                                                         00560007
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                            00570007
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                         00580007
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                           00590007
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                      00600007
//SYSPRINT DD SYSOUT=*                                                  00610007
//SYSIN    DD DUMMY                                                     00620007
//*                                                                     00630007
//*-------------------------------------------------------------------* 00640007
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                * 00650007
//*    PRT02 : CLASS = 2, COPIES = 1 ** (SALES - AGREEMENT TEAM)      * 00660007
//*-------------------------------------------------------------------* 00670007
//PRT02   EXEC PGM=IEBGENER                                             00680007
//SYSUT1   DD *                                                         00690007
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1B CP-1',END;                            00700007
1$DJDE$ JDE=13C645,JDL=BP13,COPIES=1,END;                               00710007
//FORMID   OUTPUT FORMS=1OS2,GROUPID=EAALAG1B                           00720007
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                      00730007
//SYSPRINT DD SYSOUT=*                                                  00740007
//SYSIN    DD DUMMY                                                     00750007
//*                                                                     00760007
//*-------------------------------------------------------------------* 00770007
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETENT                 * 00780007
//* PRT03 : CLASS = 2, 1 COPY        (SALES - AGREEMENT TEAM)         * 00790007
//*-------------------------------------------------------------------* 00800007
//PRT03    EXEC PGM=IEBGENER                                            00810007
//SYSUT1   DD *                                                         00820007
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1B CP-1',END;                            00830007
1$DJDE$ JDE=13C645,JDL=BP13,COPIES=1,END;                               00840007
//FORMID   OUTPUT FORMS=1OS2,GROUPID=EAALAG1B                           00850007
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                      00860007
//SYSPRINT DD SYSOUT=*                                                  00870007
//SYSIN    DD DUMMY                                                     00880007
//*-------------------------------------------------------------------* 00890007
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                           00900007
//*-----------------------------------------------------------------    00910007
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                  00920007
//INPUT1   DD DSN=AG07.K960.VRNO,DISP=OLD                               00930007
//INPUT2   DD DSN=AB05.K006.SFMAST,DISP=OLD                             00940007
//INPUT3   DD DSN=AB05.K009.EARMHIST,DISP=OLD                           00950007
//INPUT4   DD DSN=AB05.K902.EARMLOG,DISP=OLD                            00960007
//SYSPRINT DD SYSOUT=*                                                  00970007
//SYSIN   DD *                                                          00980007
          VFY FILE(INPUT1)                                              00990007
          VFY FILE(INPUT2)                                              01000007
          VFY FILE(INPUT3)                                              01010007
          VFY FILE(INPUT4)                                              01020007
//*-------------------------------------------------------------------* 01030007
//*  BACKUP STAMPING TRANSACTION FILE BEFORE RUN                      * 01040007
//*-------------------------------------------------------------------* 01050007
//STEP0A EXEC PGM=IDCAMS,COND=(0,NE)                                    01060007
//SYSPRINT  DD SYSOUT=*                                                 01070007
//INPUT     DD DSN=BP13.K315.TRANS,DISP=SHR                             01080007
//OUTPUT    DD DSN=BP13.F315.TRANS.BKUP(+1),DISP=(NEW,CATLG),           01090007
//          SPACE=(CYL,(10,5)),                                         01100007
//          DCB=(BP13.GDG,BLKSIZE=22500,LRECL=500,RECFM=FB)             01110007
//SYSIN     DD  *                                                       01120007
   REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                 01130007
//*                                                                     01140007
//*-------------------------------------------------------------------* 01150007
//**                                                                  * 01160007
//**                  PROCESS "SOCA" STAMPING                         * 01170007
//**                                                                  * 01180007
//*-------------------------------------------------------------------* 01190007
//*-------------------------------------------------------------------* 01200007
//* SORT BP13F315 BY REGN NO                                          * 01210007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = SPACES AND NON ADHOC SF CASES * 01220007
//*-------------------------------------------------------------------* 01230007
//STEP01  EXEC SORT,COND=(0,NE)                                         01240007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              01250007
//SORTOUT  DD DSN=&&P13F315A,DISP=(NEW,PASS),                           01260007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        01270007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           01280007
//SYSIN    DD *                                                         01290007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        01300007
   INCLUDE COND=(9,2,CH,EQ,C'SA',AND,203,1,CH,NE,C'Y',AND,              01310007
                 116,1,CH,EQ,C' ',AND,133,1,CH,EQ,C' ')                 01320007
//*-------------------------------------------------------------------* 01330007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR STAMPING OF SALES AGREEMENT * 01340007
//* WHITE VOUCHER FORM WILL BE PRINTED                                * 01350007
//*-------------------------------------------------------------------* 01360007
//STEP02  EXEC PGM=BP13C325,COND=(0,NE)                                 01370007
//BP13F315 DD DSN=&&P13F315A,DISP=(OLD,PASS)                            01380007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                           01390007
//            AMP=('BUFND=4','BUFNI=8')                                 01400007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             01410007
//            AMP=('BUFND=4','BUFNI=8')                                 01420007
//BP13L325 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  01440007
//SYSOUT   DD SYSOUT=*                                                  01450007
//SYSDBG   DD SYSOUT=*                                                  01460007
//SYSDBOUT DD SYSOUT=*                                                  01470007
/*                                                                      01480007
//*-------------------------------------------------------------------* 01490007
//* SORT BP13F315 BY REGN NO                                          * 01500007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = SPACES AND ADHOC SF CASES     * 01510007
//*-------------------------------------------------------------------* 01520007
//STEP03  EXEC SORT,COND=(0,NE)                                         01530007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              01540007
//SORTOUT  DD DSN=&&P13F315B,DISP=(NEW,PASS),                           01550007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        01560007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           01570007
//SYSIN    DD *                                                         01580007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        01590007
   INCLUDE COND=(9,2,CH,EQ,C'SA',AND,203,1,CH,NE,C'Y',AND,              01600007
                 116,1,CH,EQ,C' ',AND,133,1,CH,EQ,C'Y')                 01610007
//*                                                                     01620007
//*-------------------------------------------------------------------* 01630007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR STAMPING OF SALES AGREEMENT * 01640007
//* WHITE VOUCHER FORM WILL BE PRINTED                                * 01650007
//*-------------------------------------------------------------------* 01660007
//STEP04  EXEC PGM=BP13C325,COND=(0,NE)                                 01670007
//BP13F315 DD DSN=&&P13F315B,DISP=(OLD,PASS)                            01680007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             01690007
//            AMP=('BUFND=4','BUFNI=8')                                 01700007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                           01710007
//            AMP=('BUFND=4','BUFNI=8')                                 01720007
//BP13L325 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  01740007
//SYSOUT   DD SYSOUT=*                                                  01750007
//SYSDBG   DD SYSOUT=*                                                  01760007
//SYSDBOUT DD SYSOUT=*                                                  01770007
/*                                                                      01780007
//*------------------------------------------------------------------*  01790007
//*  TO SORT INPUT FILE BP13F315 BY SCH-ACC & REGNO FOR PRINTED      *  01800007
//*  BY NOT RELEASE CASES                                            *  01810007
//*------------------------------------------------------------------*  01820007
//STEP05   EXEC SORT,COND=(0,NE)                                        01830007
//SORTIN   DD DSN=&&P13F315A,DISP=(SHR,PASS)                            01840007
//         DD DSN=&&P13F315B,DISP=(SHR,PASS)                            01850007
//SORTOUT  DD DSN=BP13.F315.KIVTRAN,DISP=OLD                            01860007
//SYSIN    DD *                                                         01870007
   SORT FIELDS=(1,10,A),FORMAT=CH                                       01880007
   INCLUDE COND=(9,2,CH,EQ,C'SA',AND,203,1,CH,NE,C'Y',AND,              01890007
                 116,1,CH,EQ,C'U')                                      01900007
//*                                                                     01910007
//* TO SORT INPUT FILE BP13F315 BY REGNO FOR RELEASE CASES            * 01920007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = 'V' AND NON ADHOC SF CASES    * 01930007
//*-------------------------------------------------------------------* 01940007
//STEP06   EXEC SORT,COND=(0,NE)                                        01950007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              01960007
//SORTOUT  DD DSN=&&P13F315C,DISP=(NEW,PASS),                           01970007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        01980007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           01990007
//SYSIN    DD *                                                         02000007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        02010007
   INCLUDE COND=(9,2,CH,EQ,C'SA',AND,203,1,CH,NE,C'Y',AND,              02020007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C' ')                 02030007
//*-------------------------------------------------------------------* 02040007
//* PROGRAM TO PRINT A LIST OF STAMPING AFTER SALES AGREEMENT         * 02050007
//* TO PASS TO PAYMENT SYSTEM                                         * 02060007
//* PINK VOUCHER FORM WILL BE PRINTED                                 * 02070007
//*-------------------------------------------------------------------* 02080007
//STEP07  EXEC PGM=BP13C314,COND=(0,NE)                                 02090007
//BP13F315 DD DSN=&&P13F315C,DISP=(SHR,PASS)                            02100007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              02110007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                            02120007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            02130007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           02140007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             02150007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           02160007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            02170007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       02180007
//BP13L314 DD SYSOUT=8,DEST=IOM8                                                
//P13L314B DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               02220007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            02230007
//SYSOUT   DD SYSOUT=*                                                  02240007
//SYSABOUT DD SYSOUT=*                                                  02250007
//SYSDBOUT DD SYSOUT=*                                                  02260007
/*                                                                      02270007
//*------------------------------------------------------------------*  02280007
//*  PROGRAM TO UPDATE SOC APPLICATION MASTER FILE (BP13K800)        *  02290007
//*  THAT CASE HAD BEEN STAMPED FOR SA.                              *  02300007
//*------------------------------------------------------------------*  02310007
//STEP08  EXEC PGM=BP13C324,COND=(0,NE)                                 02320007
//BP13F315 DD DSN=&&P13F315C,DISP=(OLD,DELETE)                          02330007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             02340007
//            AMP=('BUFND=4','BUFNI=8')                                 02350007
//SYSOUT   DD SYSOUT=*                                                  02360007
//SYSDBG   DD SYSOUT=*                                                  02370007
//SYSDBOUT DD SYSOUT=*                                                  02380007
//SYSPRINT DD SYSOUT=*                                                  02390007
/*                                                                      02400007
//*-------------------------------------------------------------------* 02410007
//* TO SORT INPUT FILE BP13F315 BY REGNO FOR RELEASE CASES            * 02420007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = 'V' AND ADHOC SF CASES        * 02430007
//*-------------------------------------------------------------------* 02440007
//STEP09   EXEC SORT,COND=(0,NE)                                        02450007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              02460007
//SORTOUT  DD DSN=&&P13F315D,DISP=(NEW,PASS),                           02470007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        02480007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           02490007
//SYSIN    DD *                                                         02500007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        02510007
   INCLUDE COND=(9,2,CH,EQ,C'SA',AND,203,1,CH,NE,C'Y',AND,              02520007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C'Y')                 02530007
//*-------------------------------------------------------------------* 02540007
//* PROGRAM TO PRINT A LIST OF STAMPING AFTER SALES AGREEMENT         * 02550007
//* TO PASS TO PAYMENT SYSTEM                                         * 02560007
//* PINK VOUCHER FORM WILL BE PRINTED                                 * 02570007
//*-------------------------------------------------------------------* 02580007
//STEP10  EXEC PGM=BP13C314,COND=(0,NE)                                 02590007
//BP13F315 DD DSN=&&P13F315D,DISP=(SHR,PASS)                            02600007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              02610007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                            02620007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            02630007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           02640007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             02650007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           02660007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            02670007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       02680007
//BP13L314 DD SYSOUT=8,DEST=IOM8                                                
//P13L314B DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               02720007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            02730007
//SYSOUT   DD SYSOUT=*                                                  02740007
//SYSABOUT DD SYSOUT=*                                                  02750007
//SYSDBOUT DD SYSOUT=*                                                  02760007
//*                                                                     02770007
//*------------------------------------------------------------------*  02780007
//*  PROGRAM TO UPDATE SOC APPLICATION MASTER FILE (BP13K800)        *  02790007
//*  THAT CASE HAD BEEN STAMPED FOR SA.                              *  02800007
//*------------------------------------------------------------------*  02810007
//STEP11  EXEC PGM=BP13C324,COND=(0,NE)                                 02820007
//BP13F315 DD DSN=&&P13F315D,DISP=(OLD,DELETE)                          02830007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             02840007
//            AMP=('BUFND=4','BUFNI=8')                                 02850007
//SYSOUT   DD SYSOUT=*                                                  02860007
//SYSDBG   DD SYSOUT=*                                                  02870007
//SYSDBOUT DD SYSOUT=*                                                  02880007
//SYSPRINT DD SYSOUT=*                                                  02890007
/*                                                                      02900007
//*-------------------------------------------------------------------* 02910007
//* SORT BP13F315 BY REGN NO                                          * 02920007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = SPACES AND NON ADHOC SF CASES * 02930007
//*-------------------------------------------------------------------* 02940007
//STEP11A EXEC SORT,COND=(0,NE)                                         02950007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              02960007
//SORTOUT  DD DSN=&&P13F315P,DISP=(NEW,PASS),                           02970007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        02980007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           02990007
//SYSIN    DD *                                                         03000007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        03010007
   INCLUDE COND=(9,2,CH,EQ,C'SA',AND,203,1,CH,EQ,C'Y',AND,              03020007
                 116,1,CH,EQ,C' ',AND,133,1,CH,EQ,C' ')                 03030007
//*-------------------------------------------------------------------* 03040007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR STAMPING OF SALES AGREEMENT * 03050007
//* WHITE VOUCHER FORM WILL BE PRINTED                                * 03060007
//*-------------------------------------------------------------------* 03070007
//STEP11B EXEC PGM=BP13C32A,COND=(0,NE)                                 03080007
//BP13F315 DD DSN=&&P13F315P,DISP=(OLD,PASS)                            03090007
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     03100007
//            AMP=('BUFND=4','BUFNI=8')                                 03110007
//BP13L32A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  03130007
//SYSOUT   DD SYSOUT=*                                                  03140007
//SYSDBG   DD SYSOUT=*                                                  03150007
//SYSDBOUT DD SYSOUT=*                                                  03160007
/*                                                                      03170007
//*------------------------------------------------------------------*  03180007
//*  TO SORT INPUT FILE BP13F315 BY SCH-ACC & REGNO FOR PRINTED      *  03190007
//*  BY NOT RELEASE CASES                                            *  03200007
//*------------------------------------------------------------------*  03210007
//STEP11C  EXEC SORT,COND=(0,NE)                                        03220007
//SORTIN   DD DSN=&&P13F315P,DISP=(SHR,PASS)                            03230007
//SORTOUT  DD DSN=BP13.F315.KIVTRAN,DISP=MOD                            03240007
//SYSIN    DD *                                                         03250007
   SORT FIELDS=(1,10,A),FORMAT=CH                                       03260007
   INCLUDE COND=(9,2,CH,EQ,C'SA',AND,203,1,CH,EQ,C'Y',AND,              03270007
                 116,1,CH,EQ,C'U')                                      03280007
//*                                                                     03290007
//*-------------------------------------------------------------------* 03300007
//* SORT BP13F315 BY REGN NO                                          * 03310007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = SPACES AND NON ADHOC SF CASES * 03320007
//*-------------------------------------------------------------------* 03330007
//STEP11D EXEC SORT,COND=(0,NE)                                         03340007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              03350007
//SORTOUT  DD DSN=&&P13F315Q,DISP=(NEW,PASS),                           03360007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        03370007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           03380007
//SYSIN    DD *                                                         03390007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        03400007
   INCLUDE COND=(9,2,CH,EQ,C'SA',AND,203,1,CH,EQ,C'Y',AND,              03410007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C' ')                 03420007
//*-------------------------------------------------------------------* 03430007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR STAMPING OF SALES AGREEMENT * 03440007
//* PINK VOUCHER FORM WILL BE PRINTED                                 * 03450007
//*-------------------------------------------------------------------* 03460007
//STEP11E EXEC PGM=BP13C31G,COND=(0,NE)                                 03470007
//BP13F315 DD DSN=&&P13F315Q,DISP=(SHR,PASS)                            03480007
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                      03490007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                            03500007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            03510007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           03520007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             03530007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           03540007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            03550007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       03560007
//BP13L31G DD SYSOUT=8,DEST=IOM8                                                
//P13L31GB DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               03600007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            03610007
//SYSOUT   DD SYSOUT=*                                                  03620007
//SYSABOUT DD SYSOUT=*                                                  03630007
//SYSDBOUT DD SYSOUT=*                                                  03640007
//*------------------------------------------------------------------*  03650007
//*  PROGRAM TO UPDATE SOC APPLICATION MASTER FILE (BP13K800)        *  03660007
//*  THAT CASE HAD BEEN STAMPED FOR SA.                              *  03670007
//*------------------------------------------------------------------*  03680007
//STEP11F EXEC PGM=BP13C32B,COND=(0,NE)                                 03690007
//BP13F315 DD DSN=&&P13F315Q,DISP=(OLD,DELETE)                          03700007
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     03710007
//            AMP=('BUFND=4','BUFNI=8')                                 03720007
//SYSOUT   DD SYSOUT=*                                                  03730007
//SYSDBG   DD SYSOUT=*                                                  03740007
//SYSDBOUT DD SYSOUT=*                                                  03750007
//SYSPRINT DD SYSOUT=*                                                  03760007
/*                                                                      03770007
/*                                                                      03780007
//*-------------------------------------------------------------------* 03790007
//**                                                                  * 03800007
//**                  PROCESS "TP" STAMPING                           * 03810007
//**                                                                  * 03820007
//*-------------------------------------------------------------------* 03830007
//*--------------------------------------------------------------------*03840007
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *03850007
//* INCLUDE TP, CDE-RELEASE-PAYMENT = ' ' AND NON ADHOC SF CASES       *03860007
//*--------------------------------------------------------------------*03870007
//STEP12   EXEC SORT,COND=(0,NE)                                        03880007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              03890007
//SORTOUT  DD DSN=&&P13F315E,DISP=(NEW,PASS),                           03900007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       03910007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          03920007
//SYSIN    DD *                                                         03930007
   SORT FIELDS=(40,2,A,115,1,A,1,8,A),FORMAT=CH                         03940007
   INCLUDE COND=(9,2,CH,EQ,C'ST',AND,                                   03950007
                 116,1,CH,EQ,C' ',AND,133,1,CH,EQ,C' ',AND,             03960008
                 484,1,CH,NE,C'Y')                                      03961008
/*                                                                      03970007
//*--------------------------------------------------------------------*03980007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR TP STAMPING                  *03990007
//* WHITE VOUCHER FORM WILL BE PRINTED                                 *04000007
//*--------------------------------------------------------------------*04010007
//STEP13   EXEC PGM=BP13C445,COND=(0,NE)                                04020007
//BP13F315 DD DSN=&&P13F315E,DISP=(OLD,PASS)                            04030007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                           04040007
//            AMP=('BUFND=4','BUFNI=8')                                 04050007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             04060007
//P13445AA DD SYSOUT=8,DEST=IOM8                                                
//P13445AD DD SYSOUT=*                                                          
//P13445AE DD SYSOUT=*                                                          
//P13445AG DD SYSOUT=*                                                          
//P13445AH DD SYSOUT=*                                                          
//P13445AI DD SYSOUT=*                                                          
//P13445AJ DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                  04140007
//SYSOUT   DD SYSOUT=*                                                  04150007
//SYSDBG   DD SYSOUT=*                                                  04160007
//SYSDBOUT DD SYSOUT=*                                                  04170007
/*                                                                      04180007
//*--------------------------------------------------------------------*04190007
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *04200007
//* INCLUDE TP, CDE-RELEASE-PAYMENT = ' ' AND ADHOC SF CASES           *04210007
//*--------------------------------------------------------------------*04220007
//STEP14   EXEC SORT,COND=(0,NE)                                        04230007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              04240007
//SORTOUT  DD DSN=&&P13F315F,DISP=(NEW,PASS),                           04250007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       04260007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          04270007
//SYSIN    DD *                                                         04280007
   SORT FIELDS=(40,2,A,115,1,A,1,8,A),FORMAT=CH                         04290007
   INCLUDE COND=(9,2,CH,EQ,C'ST',AND,                                   04311009
                 116,1,CH,EQ,C' ',AND,133,1,CH,EQ,C'Y',AND,             04312009
                 484,1,CH,NE,C'Y')                                      04313009
/*                                                                      04314009
/*                                                                      04320007
//*--------------------------------------------------------------------*04330007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR TP STAMPING                  *04340007
//* WHITE VOUCHER FORM WILL BE PRINTED                                 *04350007
//*--------------------------------------------------------------------*04360007
//STEP15   EXEC PGM=BP13C445,COND=(0,NE)                                04370007
//BP13F315 DD DSN=&&P13F315F,DISP=(OLD,PASS)                            04380007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                           04390007
//            AMP=('BUFND=4','BUFNI=8')                                 04400007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             04410007
//P13445AA DD SYSOUT=8,DEST=IOM8                                                
//P13445AD DD SYSOUT=*                                                          
//P13445AE DD SYSOUT=*                                                          
//P13445AG DD SYSOUT=*                                                          
//P13445AH DD SYSOUT=*                                                          
//P13445AI DD SYSOUT=*                                                          
//P13445AJ DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                  04490007
//SYSOUT   DD SYSOUT=*                                                  04500007
//SYSDBG   DD SYSOUT=*                                                  04510007
//SYSDBOUT DD SYSOUT=*                                                  04520007
/*                                                                      04530007
//*-------------------------------------------------------------------* 04531010
//**                                                                  * 04532010
//**                  PROCESS "TP" STAMPING FOR SO-UPD-AFTER-TP       * 04533010
//**                                                                  * 04534010
//*-------------------------------------------------------------------* 04535010
//*--------------------------------------------------------------------*04536010
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *04537010
//* INCLUDE TP, CDE-RELEASE-PAYMENT = ' ' AND NON ADHOC SF CASES       *04538010
//*--------------------------------------------------------------------*04539010
//STEP12A  EXEC SORT,COND=(0,NE)                                        04539110
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              04539210
//SORTOUT  DD DSN=&&STEP12A,DISP=(NEW,PASS),                            04539310
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       04539410
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          04539510
//SYSIN    DD *                                                         04539610
   SORT FIELDS=(40,2,A,115,1,A,1,8,A),FORMAT=CH                         04539710
   INCLUDE COND=(9,2,CH,EQ,C'ST',AND,                                   04539810
                 116,1,CH,EQ,C' ',AND,133,1,CH,EQ,C' ',AND,             04539910
                 484,1,CH,EQ,C'Y')                                      04540010
/*                                                                      04540110
//*--------------------------------------------------------------------*04540210
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR TP STAMPING                  *04540310
//* WHITE VOUCHER FORM WILL BE PRINTED                                 *04540410
//*--------------------------------------------------------------------*04540510
//STEP13A  EXEC PGM=BP13C44G,COND=(0,NE)                                04540610
//BP13F315 DD DSN=&&STEP12A,DISP=(OLD,PASS)                             04540810
//BP13K413 DD DSN=BP13.K413.ACCUMSO.UPD,DISP=SHR,                       04540911
//            AMP=('BUFND=4','BUFNI=8')                                 04541010
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             04541110
//P1344GAA DD SYSOUT=8,DEST=IOM8                                                
//P1344GAD DD SYSOUT=*                                                          
//P1344GAE DD SYSOUT=*                                                          
//P1344GAG DD SYSOUT=*                                                          
//P1344GAH DD SYSOUT=*                                                          
//P1344GAI DD SYSOUT=*                                                          
//P1344GAJ DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                  04541910
//SYSOUT   DD SYSOUT=*                                                  04542010
//SYSDBG   DD SYSOUT=*                                                  04542110
//SYSDBOUT DD SYSOUT=*                                                  04542210
/*                                                                      04542310
//*--------------------------------------------------------------------*04542410
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *04542510
//* INCLUDE TP, CDE-RELEASE-PAYMENT = ' ' AND ADHOC SF CASES           *04542610
//*--------------------------------------------------------------------*04542710
//STEP14A  EXEC SORT,COND=(0,NE)                                        04542810
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              04542910
//SORTOUT  DD DSN=&&STEP14A,DISP=(NEW,PASS),                            04543010
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       04543110
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          04543210
//SYSIN    DD *                                                         04543310
   SORT FIELDS=(40,2,A,115,1,A,1,8,A),FORMAT=CH                         04543410
   INCLUDE COND=(9,2,CH,EQ,C'ST',AND,                                   04543510
                 116,1,CH,EQ,C' ',AND,133,1,CH,EQ,C'Y',AND,             04543610
                 484,1,CH,EQ,C'Y')                                      04543710
/*                                                                      04543810
/*                                                                      04543910
//*--------------------------------------------------------------------*04544010
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR TP STAMPING                  *04544110
//* WHITE VOUCHER FORM WILL BE PRINTED                                 *04544210
//*--------------------------------------------------------------------*04544310
//STEP15A  EXEC PGM=BP13C44G,COND=(0,NE)                                04544410
//BP13F315 DD DSN=&&STEP14A,DISP=(OLD,PASS)                             04544512
//BP13K413 DD DSN=BP13.K413.ACCUMSO.UPD,DISP=SHR,                       04544611
//            AMP=('BUFND=4','BUFNI=8')                                 04544710
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             04544810
//P1344GAA DD SYSOUT=8,DEST=IOM8                                                
//P1344GAD DD SYSOUT=*                                                          
//P1344GAE DD SYSOUT=*                                                          
//P1344GAG DD SYSOUT=*                                                          
//P1344GAH DD SYSOUT=*                                                          
//P1344GAI DD SYSOUT=*                                                          
//P1344GAJ DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                  04545610
//SYSOUT   DD SYSOUT=*                                                  04545710
//SYSDBG   DD SYSOUT=*                                                  04545810
//SYSDBOUT DD SYSOUT=*                                                  04545910
/*                                                                      04546010
//*--------------------------------------------------------------------*04547007
//* TO SORT INPUT FILE BP13F315 BY SCH-ACC & REGNO FOR SA-TP CASE      *04550007
//*--------------------------------------------------------------------*04560007
//STEP16   EXEC SORT,COND=(0,NE)                                        04570007
//SORTIN   DD DSN=&&P13F315E,DISP=(SHR,PASS)                            04580007
//         DD DSN=&&P13F315F,DISP=(SHR,PASS)                            04590007
//         DD DSN=&&STEP12A,DISP=(SHR,PASS)                             04591010
//         DD DSN=&&STEP14A,DISP=(SHR,PASS)                             04592010
//SORTOUT  DD DSN=BP13.F315.KIVTRAN,DISP=MOD                            04600007
//SYSIN    DD *                                                         04610007
   SORT FIELDS=(1,10,A),FORMAT=CH                                       04620007
   INCLUDE COND=(9,2,CH,EQ,C'ST',AND,                                   04630007
                 116,1,CH,EQ,C'U')                                      04640007
/*                                                                      04650007
//*--------------------------------------------------------------------*04660007
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *04670007
//* INCLUDE TP, CDE-RELEASE-PAYMENT = 'V' AND NON ADHOC SF CASES       *04680007
//*--------------------------------------------------------------------*04690007
//STEP17   EXEC SORT,COND=(0,NE)                                        04700007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              04710007
//SORTOUT  DD DSN=&&P13F315G,DISP=(NEW,PASS),                           04720007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       04730007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          04740007
//SYSIN    DD *                                                         04750007
   SORT FIELDS=(40,2,A,115,1,A,1,8,A),FORMAT=CH                         04760007
   INCLUDE COND=(9,2,CH,EQ,C'ST',AND,                                   04770007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C' ',AND,             04781015
                 484,1,CH,NE,C'Y')                                      04782015
/*                                                                      04790007
//*--------------------------------------------------------------------*04800007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR TP STAMPING                  *04810007
//* PINK FORM WILL BE PRINTED                                          *04820007
//*--------------------------------------------------------------------*04830007
//STEP18   EXEC PGM=BP13C416,COND=(0,NE)                                04840007
//BP13F315 DD DSN=&&P13F315G,DISP=(OLD,PASS)                            04850007
//BP13F316 DD DSN=&&BP13F316,DISP=(NEW,PASS),                           04860007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       04870007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          04880007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                           04890007
//           AMP=('BUFND=4','BUFNI=8')                                  04900007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            04910007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           04920007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             04930007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           04940007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            04950007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       04960007
//BP13416A DD SYSOUT=8,DEST=IOM8                                                
//BP13416D DD SYSOUT=8,DEST=IOM8                                                
//BP13416E DD SYSOUT=8,DEST=IOM8                                                
//BP13416G DD SYSOUT=*                                                          
//BP13416H DD SYSOUT=8,DEST=IOM8                                                
//BP13416I DD SYSOUT=8,DEST=IOM8                                                
//BP13416J DD SYSOUT=8,DEST=IOM8                                                
//BP13416K DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               05120007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            05130007
//SYSPRINT DD SYSOUT=*                                                  05140007
//SYSOUT   DD SYSOUT=*                                                  05150007
//SYSDBG   DD SYSOUT=*                                                  05160007
//SYSDBOUT DD SYSOUT=*                                                  05170007
/*                                                                      05180007
//*--------------------------------------------------------------------*05181013
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *05182013
//* INCLUDE TP, CDE-RELEASE-PAYMENT = 'V' AND NON ADHOC SF CASES       *05183013
//* AND SALES ORDER CASES AFTER TP I,E BP13K413                        *05183113
//*--------------------------------------------------------------------*05184013
//STEP17A  EXEC SORT,COND=(0,NE)                                        05185013
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              05186013
//SORTOUT  DD DSN=&&STEP17A,DISP=(NEW,PASS),                            05187013
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       05188013
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          05189013
//SYSIN    DD *                                                         05189113
   SORT FIELDS=(40,2,A,115,1,A,1,8,A),FORMAT=CH                         05189213
   INCLUDE COND=(9,2,CH,EQ,C'ST',AND,                                   05189313
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C' ',AND,             05189413
                 484,1,CH,EQ,C'Y')                                      05189513
/*                                                                      05189613
//*--------------------------------------------------------------------*05189713
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR TP STAMPING                  *05189813
//* PINK FORM WILL BE PRINTED                                          *05189913
//*--------------------------------------------------------------------*05190013
//STEP18A  EXEC PGM=BP13C41P,COND=(0,NE)                                05190113
//BP13F315 DD DSN=&&STEP17A,DISP=(OLD,PASS)                             05190214
//BP13F316 DD DSN=&&BP13F316,DISP=(MOD,PASS),                           05190313
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       05190413
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          05190513
//BP13K413 DD DSN=BP13.K413.ACCUMSO.UPD,DISP=SHR,                       05190613
//           AMP=('BUFND=4','BUFNI=8')                                  05190713
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            05190813
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           05190913
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             05191013
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           05191113
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            05191213
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       05191313
//BP1341PA DD SYSOUT=8,DEST=IOM8                                                
//BP1341PD DD SYSOUT=8,DEST=IOM8                                                
//BP1341PE DD SYSOUT=8,DEST=IOM8                                                
//BP1341PG DD SYSOUT=*                                                          
//BP1341PH DD SYSOUT=8,DEST=IOM8                                                
//BP1341PI DD SYSOUT=8,DEST=IOM8                                                
//BP1341PJ DD SYSOUT=8,DEST=IOM8                                                
//BP1341PK DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               05192913
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            05193013
//SYSPRINT DD SYSOUT=*                                                  05193113
//SYSOUT   DD SYSOUT=*                                                  05193213
//SYSDBG   DD SYSOUT=*                                                  05193313
//SYSDBOUT DD SYSOUT=*                                                  05193413
/*                                                                      05193513
//*---------------------------------------------------------------------05194007
//*  SORT RECORD FOR PRINTING OF LIST FOR STAMPING OF SUPPL AGREEMENT.  05200007
//*---------------------------------------------------------------------05210007
//STEP19   EXEC SORT,COND=(0,NE)                                        05220007
//SORTIN   DD DSN=&&BP13F316,DISP=(OLD,DELETE)                          05230007
//SORTOUT  DD DSN=&&P13F316A,DISP=(NEW,PASS,DELETE),                    05240007
//          UNIT=SYSDA,SPACE=(CYL,(3,4),RLSE),                          05250007
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                          05260007
//SYSIN    DD *                                                         05270007
   SORT FIELDS=(469,12,CH,A,481,4,CH,A)                                 05280007
/*                                                                      05290007
//*---------------------------------------------------------------------05300007
//*  PRINT LIST OF STAMPING OF SUPPL AGREEMENT.                         05310007
//*---------------------------------------------------------------------05320007
//STEP20   EXEC PGM=BP13C446,COND=(0,NE)                                05330007
//BP13F315 DD DSN=&&P13F316A,DISP=(OLD,DELETE)                          05340007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                            05350007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                            05360007
//*BP13L446 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2               05370007
//BP13L446 DD DSN=BP13.L446.BP13C446,DISP=SHR                           05380007
//SYSPRINT DD SYSOUT=*                                                  05390007
//SYSOUT   DD SYSOUT=*                                                  05400007
/*                                                                      05410007
//*--------------------------------------------------------------------*05420007
//* PROGRAM TO UPDATE ACCUM-SO FILE (BP13K410) ON CASES SENT FOR       *05430007
//*            STAMPING.                                               *05440007
//*--------------------------------------------------------------------*05450007
//STEP21   EXEC PGM=BP13C422,COND=(0,NE)                                05460007
//BP13F315 DD DSN=&&P13F315G,DISP=(OLD,PASS)                            05470007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                           05480007
//            AMP=('BUFND=4','BUFNI=8')                                 05490007
//SYSOUT   DD SYSOUT=*                                                  05500007
//SYSDBG   DD SYSOUT=*                                                  05510007
//SYSDBOUT DD SYSOUT=*                                                  05520007
//SYSPRINT DD SYSOUT=*                                                  05530007
/*                                                                      05540007
//*--------------------------------------------------------------------*05550007
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *05560007
//* INCLUDE TP, CDE-RELEASE-PAYMENT = 'V' AND ADHOC SF CASES           *05570007
//*--------------------------------------------------------------------*05580007
//STEP22   EXEC SORT,COND=(0,NE)                                        05590007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              05600007
//SORTOUT  DD DSN=&&P13F315H,DISP=(NEW,PASS),                           05610007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       05620007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          05630007
//SYSIN    DD *                                                         05640007
   SORT FIELDS=(40,2,A,115,1,A,1,8,A),FORMAT=CH                         05650007
   INCLUDE COND=(9,2,CH,EQ,C'ST',AND,                                   05660007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C'Y',AND,             05671015
                 484,1,CH,NE,C'Y')                                      05672015
/*                                                                      05680007
//*--------------------------------------------------------------------*05690007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR TP STAMPING                  *05700007
//* PINK FORM WILL BE PRINTED                                          *05710007
//*--------------------------------------------------------------------*05720007
//STEP23   EXEC PGM=BP13C416,COND=(0,NE)                                05730007
//BP13F315 DD DSN=&&P13F315H,DISP=(OLD,PASS)                            05740007
//BP13F316 DD DSN=&&BP13F316,DISP=(NEW,PASS),                           05750007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       05760007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          05770007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                           05780007
//           AMP=('BUFND=4','BUFNI=8')                                  05790007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            05800007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           05810007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             05820007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           05830007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            05840007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       05850007
//BP13416A DD SYSOUT=8,DEST=IOM8                                                
//BP13416D DD SYSOUT=8,DEST=IOM8                                                
//BP13416E DD SYSOUT=8,DEST=IOM8                                                
//BP13416G DD SYSOUT=*                                                          
//BP13416H DD SYSOUT=8,DEST=IOM8                                                
//BP13416I DD SYSOUT=8,DEST=IOM8                                                
//BP13416J DD SYSOUT=8,DEST=IOM8                                                
//BP13416K DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               06010007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            06020007
//SYSPRINT DD SYSOUT=*                                                  06030007
//SYSOUT   DD SYSOUT=*                                                  06040007
//SYSDBG   DD SYSOUT=*                                                  06050007
//SYSDBOUT DD SYSOUT=*                                                  06060007
/*                                                                      06070007
//*--------------------------------------------------------------------*06071013
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *06072013
//* INCLUDE TP, CDE-RELEASE-PAYMENT = 'V' AND ADHOC SF CASES           *06073013
//* AND SALES ORDER AFTER TP BP13K413                                  *06073113
//*--------------------------------------------------------------------*06074013
//STEP22A  EXEC SORT,COND=(0,NE)                                        06075013
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              06076013
//SORTOUT  DD DSN=&&STEP22A,DISP=(NEW,PASS),                            06077013
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       06078013
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          06079013
//SYSIN    DD *                                                         06079113
   SORT FIELDS=(40,2,A,115,1,A,1,8,A),FORMAT=CH                         06079213
   INCLUDE COND=(9,2,CH,EQ,C'ST',AND,                                   06079313
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C'Y',AND,             06079413
                 484,1,CH,EQ,C'Y')                                      06079513
/*                                                                      06079613
//*--------------------------------------------------------------------*06079713
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR TP STAMPING                  *06079813
//* PINK FORM WILL BE PRINTED                                          *06079913
//*--------------------------------------------------------------------*06080013
//STEP23A  EXEC PGM=BP13C41P,COND=(0,NE)                                06080113
//BP13F315 DD DSN=&&STEP22A,DISP=(OLD,PASS)                             06080214
//BP13F316 DD DSN=&&BP13F316,DISP=(MOD,PASS),                           06080313
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       06080413
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          06080513
//BP13K413 DD DSN=BP13.K413.ACCUMSO.UPD,DISP=SHR,                       06080614
//           AMP=('BUFND=4','BUFNI=8')                                  06080713
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            06080813
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           06080913
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             06081013
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           06081113
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            06081213
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       06081313
//BP1341PA DD SYSOUT=8,DEST=IOM8                                                
//BP1341PD DD SYSOUT=8,DEST=IOM8                                                
//BP1341PE DD SYSOUT=8,DEST=IOM8                                                
//BP1341PG DD SYSOUT=*                                                          
//BP1341PH DD SYSOUT=8,DEST=IOM8                                                
//BP1341PI DD SYSOUT=8,DEST=IOM8                                                
//BP1341PJ DD SYSOUT=8,DEST=IOM8                                                
//BP1341PK DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               06082913
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            06083013
//SYSPRINT DD SYSOUT=*                                                  06083113
//SYSOUT   DD SYSOUT=*                                                  06083213
//SYSDBG   DD SYSOUT=*                                                  06083313
//SYSDBOUT DD SYSOUT=*                                                  06083413
/*                                                                      06083513
//*---------------------------------------------------------------------06084007
//*  SORT RECORD FOR PRINTING OF LIST FOR STAMPING OF SUPPL AGREEMENT.  06090007
//*---------------------------------------------------------------------06100007
//STEP24   EXEC SORT                                                    06110007
//SORTIN   DD DSN=&&BP13F316,DISP=(OLD,DELETE)                          06120007
//SORTOUT  DD DSN=&&P13F316B,DISP=(NEW,PASS,DELETE),                    06130007
//          UNIT=SYSDA,SPACE=(CYL,(3,4),RLSE),                          06140007
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                          06150007
//SYSIN    DD *                                                         06160007
   SORT FIELDS=(469,12,CH,A,481,4,CH,A)                                 06170007
/*                                                                      06180007
//*---------------------------------------------------------------------06190007
//*  PRINT LIST OF STAMPING OF SUPPL AGREEMENT.                         06200007
//*---------------------------------------------------------------------06210007
//STEP25   EXEC PGM=BP13C446,COND=(0,NE)                                06220007
//BP13F315 DD DSN=&&P13F316B,DISP=(OLD,DELETE)                          06230007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                            06240007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                            06250007
//*BP13L446 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2               06260007
//BP13L446 DD DSN=BP13.L446.BP13C446.TP,DISP=SHR                        06270007
//SYSPRINT DD SYSOUT=*                                                  06280007
//SYSOUT   DD SYSOUT=*                                                  06290007
/*                                                                      06300007
//*--------------------------------------------------------------------*06310007
//* PROGRAM TO UPDATE ACCUM-SO FILE (BP13K410) ON CASES SENT FOR       *06320007
//*            STAMPING.                                               *06330007
//*--------------------------------------------------------------------*06340007
//STEP26   EXEC PGM=BP13C422,COND=(0,NE)                                06350007
//BP13F315 DD DSN=&&P13F315H,DISP=(OLD,PASS)                            06360007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                           06370007
//            AMP=('BUFND=4','BUFNI=8')                                 06380007
//SYSOUT   DD SYSOUT=*                                                  06390007
//SYSDBG   DD SYSOUT=*                                                  06400007
//SYSDBOUT DD SYSOUT=*                                                  06410007
//SYSPRINT DD SYSOUT=*                                                  06420007
/*                                                                      06430007
//*---------------------------------------------------------------------06440007
//* SORT OUT CASES WITH DTE-PRINCIPAL-SALES-AGMT                        06450007
//*---------------------------------------------------------------------06460007
//STEP28   EXEC  SORT,CYL=30,COND=(0,NE)                                06470007
//SORTIN   DD  DSN=BP13.F410.DAILYSO,DISP=SHR                           06480007
//SORTOUT  DD  DSN=&&BP13F410,DISP=(NEW,PASS),                          06490007
//             UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                     06500007
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      06510007
//SYSIN    DD  *                                                        06520007
  SORT FIELDS=(1,8,A),FORMAT=CH                                         06530007
  INCLUDE COND=(972,8,CH,NE,C'        ',AND,                            06540007
                972,8,CH,NE,C'00000000')                                06550007
//*                                                                     06560007
//*-------------------------------------------------------------------* 06570007
//* TO PASS REGN, SCH-ACCT AND DTE-PRINCIPAL-SALES-AGMT               * 06580007
//*-------------------------------------------------------------------* 06590007
//STEP29   EXEC PGM=BP13C632,COND=(0,NE)                                06600007
//BP13F410 DD  DSN=&&BP13F410,DISP=(OLD,PASS)                           06610007
//P13F630A DD  DSN=BP13.F630.STAMP.DOPA,DISP=MOD                        06620007
//SYSOUT   DD SYSOUT=*                                                  06630007
/*                                                                      06640007
//*-------------------------------------------------------------------* 06650007
//**                                                                  * 06660007
//**                  PROCESS "SUB TRANSFER" CASES                    * 06670007
//**                                                                  * 06680007
//*-------------------------------------------------------------------* 06690007
//*-------------------------------------------------------------------* 06700007
//* SORT BP13F315 BY REGN NO                                          * 06710007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = SPACES AND NON ADHOC SF CASES * 06720007
//*-------------------------------------------------------------------* 06730007
//STEP30  EXEC SORT,COND=(0,NE)                                         06740007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              06750007
//SORTOUT  DD DSN=&&P13F315I,DISP=(NEW,PASS),                           06760007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        06770007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           06780007
//SYSIN    DD *                                                         06790007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        06800007
   INCLUDE COND=(9,2,CH,EQ,C'SF',AND,                                   06810007
                 116,1,CH,EQ,C' ',AND,133,1,CH,EQ,C'Y',AND,             06820007
                 212,1,CH,NE,C'Y')                                      06830007
//*-------------------------------------------------------------------* 06840007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR STAMPING OF SALES AGREEMENT * 06850007
//* WHITE VOUCHER FORM WILL BE PRINTED                                * 06860007
//*-------------------------------------------------------------------* 06870007
//STEP31  EXEC PGM=BP13C355,COND=(0,NE)                                 06880007
//BP13F315 DD DSN=&&P13F315I,DISP=(OLD,PASS)                            06890007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             06900007
//            AMP=('BUFND=4','BUFNI=8')                                 06910007
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     06920007
//            AMP=('BUFND=4','BUFNI=8')                                 06930007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                            06940007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                            06950007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            06960007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           06970007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             06980007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           06990007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            07000007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       07010007
//P13L355A DD SYSOUT=8,DEST=IOM8                                                
//P13L355B DD SYSOUT=*                                                          
//P13L355D DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               07060007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            07070007
//SYSPRINT DD SYSOUT=*                                                  07080007
//SYSOUT   DD SYSOUT=*                                                  07090007
//SYSDBG   DD SYSOUT=*                                                  07100007
//SYSDBOUT DD SYSOUT=*                                                  07110007
/*                                                                      07120007
//*------------------------------------------------------------------*  07130007
//*  TO SORT INPUT FILE BP13F315 BY SCH-ACC & REGNO FOR PRINTED      *  07140007
//*  BY NOT RELEASE CASES                                            *  07150007
//*------------------------------------------------------------------*  07160007
//STEP32   EXEC SORT,COND=(0,NE)                                        07170007
//SORTIN   DD DSN=&&P13F315I,DISP=(SHR,PASS)                            07180007
//SORTOUT  DD DSN=BP13.F315.KIVTRAN,DISP=MOD                            07190007
//SYSIN    DD *                                                         07200007
   SORT FIELDS=(1,10,A),FORMAT=CH                                       07210007
   INCLUDE COND=(9,2,CH,EQ,C'SF',AND,                                   07220007
                 116,1,CH,EQ,C'U')                                      07230007
//*                                                                     07240007
//*-------------------------------------------------------------------* 07250007
//* SORT BP13F315 BY REGN NO                                          * 07260007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = 'V' AND NON ADHOC SF CASES    * 07270007
//*-------------------------------------------------------------------* 07280007
//STEP33  EXEC SORT,COND=(0,NE)                                         07290007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              07300007
//SORTOUT  DD DSN=&&P13F315K,DISP=(NEW,PASS),                           07310007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        07320007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           07330007
//SYSIN    DD *                                                         07340007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        07350007
   INCLUDE COND=(9,2,CH,EQ,C'SF',AND,                                   07360007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C'Y',AND,             07370007
                 212,1,CH,NE,C'Y')                                      07380007
//*                                                                     07390007
//*-------------------------------------------------------------------* 07400007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR STAMPING OF SALES AGREEMENT * 07410007
//* PINK  VOUCHER FORM WILL BE PRINTED                                * 07420007
//*-------------------------------------------------------------------* 07430007
//STEP34  EXEC PGM=BP13C355,COND=(0,NE)                                 07440007
//BP13F315 DD DSN=&&P13F315K,DISP=(OLD,PASS)                            07450007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             07460007
//            AMP=('BUFND=4','BUFNI=8')                                 07470007
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     07480007
//            AMP=('BUFND=4','BUFNI=8')                                 07490007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                            07500007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                            07510007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            07520007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           07530007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             07540007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           07550007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            07560007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       07570007
//P13L355A DD SYSOUT=*                                                          
//P13L355B DD SYSOUT=8,DEST=IOM8                                                
//P13L355D DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               07620007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            07630007
//SYSPRINT DD SYSOUT=*                                                  07640007
//SYSOUT   DD SYSOUT=*                                                  07650007
//SYSDBG   DD SYSOUT=*                                                  07660007
//SYSDBOUT DD SYSOUT=*                                                  07670007
//*                                                                     07680007
//*------------------------------------------------------------------*  07690007
//*  PROGRAM TO UPDATE SOC APPLICATION MASTER FILE (BP13K800)        *  07700007
//*  THAT CASE HAD BEEN STAMPED FOR SF.                              *  07710007
//*------------------------------------------------------------------*  07720007
//STEP35  EXEC PGM=BP13C324,COND=(0,NE)                                 07730007
//BP13F315 DD DSN=&&P13F315K,DISP=(OLD,DELETE)                          07740007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             07750007
//            AMP=('BUFND=4','BUFNI=8')                                 07760007
//SYSOUT   DD SYSOUT=*                                                  07770007
//SYSDBG   DD SYSOUT=*                                                  07780007
//SYSDBOUT DD SYSOUT=*                                                  07790007
//SYSPRINT DD SYSOUT=*                                                  07800007
/*                                                                      07810007
//*-------------------------------------------------------------------* 07820007
//**                                                                  * 07830007
//**                  PROCESS "SUB TRANSFER" CASES  (DAWSON)          * 07840007
//**                                                                  * 07850007
//*-------------------------------------------------------------------* 07860007
//*-------------------------------------------------------------------* 07870007
//* SORT BP13F315 BY REGN NO                                          * 07880007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = SPACES AND NON ADHOC SF CASES * 07890007
//*-------------------------------------------------------------------* 07900007
//STEP35A EXEC SORT,COND=(0,NE)                                         07910007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              07920007
//SORTOUT  DD DSN=&&P13F315U,DISP=(NEW,PASS),                           07930007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        07940007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           07950007
//SYSIN    DD *                                                         07960007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        07970007
   INCLUDE COND=(9,2,CH,EQ,C'SF',AND,                                   07980007
                 116,1,CH,EQ,C' ',AND,133,1,CH,EQ,C'Y',AND,             07990007
                 212,1,CH,EQ,C'Y')                                      08000007
//*-------------------------------------------------------------------* 08010007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR STAMPING OF SALES AGREEMENT * 08020007
//* WHITE VOUCHER FORM WILL BE PRINTED                                * 08030007
//*-------------------------------------------------------------------* 08040007
//STEP35B EXEC PGM=BP13C35F,COND=(0,NE)                                 08050007
//BP13F315 DD DSN=&&P13F315U,DISP=(OLD,PASS)                            08060007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             08070007
//            AMP=('BUFND=4','BUFNI=8')                                 08080007
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     08090007
//            AMP=('BUFND=4','BUFNI=8')                                 08100007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                            08110007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                            08120007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            08130007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           08140007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             08150007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           08160007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            08170007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       08180007
//P13L35FA DD SYSOUT=8,DEST=IOM8                                                
//P13L35FB DD SYSOUT=*                                                          
//P13L35FD DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               08230007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            08240007
//SYSPRINT DD SYSOUT=*                                                  08250007
//SYSOUT   DD SYSOUT=*                                                  08260007
//SYSDBG   DD SYSOUT=*                                                  08270007
//SYSDBOUT DD SYSOUT=*                                                  08280007
/*                                                                      08290007
//*------------------------------------------------------------------*  08300007
//*  TO SORT INPUT FILE BP13F315 BY SCH-ACC & REGNO FOR PRINTED      *  08310007
//*  BY NOT RELEASE CASES                                            *  08320007
//*------------------------------------------------------------------*  08330007
//STEP35C  EXEC SORT,COND=(0,NE)                                        08340007
//SORTIN   DD DSN=&&P13F315U,DISP=(SHR,PASS)                            08350007
//SORTOUT  DD DSN=BP13.F315.KIVTRAN,DISP=MOD                            08360007
//SYSIN    DD *                                                         08370007
   SORT FIELDS=(1,10,A),FORMAT=CH                                       08380007
   INCLUDE COND=(9,2,CH,EQ,C'SF',AND,                                   08390007
                 116,1,CH,EQ,C'U')                                      08400007
//*                                                                     08410007
//*-------------------------------------------------------------------* 08420007
//* SORT BP13F315 BY REGN NO                                          * 08430007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = 'V' AND NON ADHOC SF CASES    * 08440007
//*-------------------------------------------------------------------* 08450007
//STEP35D EXEC SORT,COND=(0,NE)                                         08460007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              08470007
//SORTOUT  DD DSN=&&P13F315V,DISP=(NEW,PASS),                           08480007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        08490007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           08500007
//SYSIN    DD *                                                         08510007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        08520007
   INCLUDE COND=(9,2,CH,EQ,C'SF',AND,                                   08530007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C'Y',AND,             08540007
                 212,1,CH,EQ,C'Y')                                      08550007
//*                                                                     08560007
//*-------------------------------------------------------------------* 08570007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR STAMPING OF SALES AGREEMENT * 08580007
//* PINK  VOUCHER FORM WILL BE PRINTED                                * 08590007
//*-------------------------------------------------------------------* 08600007
//STEP35E EXEC PGM=BP13C35F,COND=(0,NE)                                 08610007
//BP13F315 DD DSN=&&P13F315V,DISP=(OLD,PASS)                            08620007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             08630007
//            AMP=('BUFND=4','BUFNI=8')                                 08640007
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     08650007
//            AMP=('BUFND=4','BUFNI=8')                                 08660007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                            08670007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                            08680007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            08690007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           08700007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             08710007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           08720007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            08730007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       08740007
//P13L35FA DD SYSOUT=*                                                          
//P13L35FB DD SYSOUT=8,DEST=IOM8                                                
//P13L35FD DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               08790007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            08800007
//SYSPRINT DD SYSOUT=*                                                  08810007
//SYSOUT   DD SYSOUT=*                                                  08820007
//SYSDBG   DD SYSOUT=*                                                  08830007
//SYSDBOUT DD SYSOUT=*                                                  08840007
//*                                                                     08850007
//*------------------------------------------------------------------*  08860007
//*  PROGRAM TO UPDATE SOC APPLICATION MASTER FILE (BP13K800)        *  08870007
//*  THAT CASE HAD BEEN STAMPED FOR SF.                              *  08880007
//*------------------------------------------------------------------*  08890007
//STEP35F EXEC PGM=BP13C324,COND=(0,NE)                                 08900007
//BP13F315 DD DSN=&&P13F315V,DISP=(OLD,DELETE)                          08910007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             08920007
//            AMP=('BUFND=4','BUFNI=8')                                 08930007
//SYSOUT   DD SYSOUT=*                                                  08940007
//SYSDBG   DD SYSOUT=*                                                  08950007
//SYSDBOUT DD SYSOUT=*                                                  08960007
//SYSPRINT DD SYSOUT=*                                                  08970007
/*                                                                      08980007
//*-------------------------------------------------------------------* 08990007
//**                                                                  * 09000007
//**                  PROCESS " DBSS " CASES                          * 09010007
//**                                                                  * 09020007
//*-------------------------------------------------------------------* 09030007
//*--------------------------------------------------------------------*09040007
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *09050007
//* INCLUDE DB, CDE-RELEASE-PAYMENT = 'V' AND NON ADHOC SF CASES       *09060007
//*--------------------------------------------------------------------*09070007
//STEP36   EXEC SORT,COND=(0,NE)                                        09080007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              09090007
//SORTOUT  DD DSN=&&P13F315N,DISP=(NEW,PASS),                           09100007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       09110007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          09120007
//SYSIN    DD *                                                         09130007
   SORT FIELDS=(190,3,A,40,2,A,115,1,A,1,8,A),FORMAT=CH                 09140007
   INCLUDE COND=(9,2,CH,EQ,C'DB',AND,1,8,CH,NE,C'5042686F',AND,         09150007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C' ')                 09160007
/*                                                                      09170007
//*--------------------------------------------------------------------*09180007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR DBSS STAMPING                *09190007
//* PINK FORM WILL BE PRINTED                                          *09200007
//*--------------------------------------------------------------------*09210007
//STEP37   EXEC PGM=BP13C436,COND=(0,NE)                                09220007
//BP13F315 DD DSN=&&P13F315N,DISP=(OLD,PASS)                            09230007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             09240007
//            AMP=('BUFND=4','BUFNI=8')                                 09250007
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                           09260007
//           AMP=('BUFND=4','BUFNI=8')                                  09270007
//BP13KD45 DD DSN=BP13.KD45.PPAYHIST,DISP=SHR,                          09280007
//           AMP=('BUFND=4','BUFNI=8')                                  09290007
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                           09300007
//           AMP=('BUFND=4','BUFNI=8')                                  09310007
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR,                             09320007
//           AMP=('BUFND=4','BUFNI=8')                                  09330007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            09340007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           09350007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             09360007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           09370007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            09380007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       09390007
//BP13436J DD SYSOUT=8,DEST=IOM8                                                
//BP13436L DD DUMMY                                                     09410007
//BP13436K DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               09440007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            09450007
//SYSPRINT DD SYSOUT=*                                                  09460007
//SYSOUT   DD SYSOUT=*                                                  09470007
//SYSDBG   DD SYSOUT=*                                                  09480007
//SYSDBOUT DD SYSOUT=*                                                  09490007
/*                                                                      09500007
//*--------------------------------------------------------------------*09513007
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *09520007
//* INCLUDE DS, CDE-RELEASE-PAYMENT = 'V' AND NON ADHOC SF CASES       *09530007
//*--------------------------------------------------------------------*09540007
//STEP36A  EXEC SORT,COND=(0,NE)                                        09550007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              09560007
//SORTOUT  DD DSN=&&P13F315S,DISP=(NEW,PASS),                           09570007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       09580007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          09590007
//SYSIN    DD *                                                         09600007
   SORT FIELDS=(190,3,A,40,2,A,115,1,A,1,8,A),FORMAT=CH                 09610007
   INCLUDE COND=(9,2,CH,EQ,C'DS',AND,                                   09620007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C' ')                 09630007
/*                                                                      09640007
//*--------------------------------------------------------------------*09650007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR DBSS STAMPING                *09660007
//* PINK FORM WILL BE PRINTED                                          *09670007
//*--------------------------------------------------------------------*09680007
//STEP37A  EXEC PGM=BP13C436,COND=(0,NE)                                09690007
//BP13F315 DD DSN=&&P13F315S,DISP=(OLD,PASS)                            09700007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             09710007
//            AMP=('BUFND=4','BUFNI=8')                                 09720007
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                           09730007
//           AMP=('BUFND=4','BUFNI=8')                                  09740007
//BP13KD45 DD DSN=BP13.KD45.PPAYHIST,DISP=SHR,                          09750007
//           AMP=('BUFND=4','BUFNI=8')                                  09760007
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                           09770007
//           AMP=('BUFND=4','BUFNI=8')                                  09780007
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR,                             09790007
//           AMP=('BUFND=4','BUFNI=8')                                  09800007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            09810007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           09820007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             09830007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           09840007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            09850007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       09860007
//BP13436J DD DUMMY                                                     09870007
//BP13436L DD SYSOUT=8,DEST=IOM8                                                
//BP13436K DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               09910007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            09920007
//SYSPRINT DD SYSOUT=*                                                  09930007
//SYSOUT   DD SYSOUT=*                                                  09940007
//SYSDBG   DD SYSOUT=*                                                  09950007
//SYSDBOUT DD SYSOUT=*                                                  09960007
/*                                                                      09970007
//*--------------------------------------------------------------------*09971007
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *09972007
//* INCLUDE DB, CDE-RELEASE-PAYMENT = 'V' AND NON ADHOC SF CASES       *09973007
//* ADHOC RUN STEP FOR '5042686F' CASE                                 *09973107
//*--------------------------------------------------------------------*09974007
//STEP36B  EXEC SORT,COND=(0,NE)                                        09975007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              09976007
//SORTOUT  DD DSN=&&P13F315N,DISP=(NEW,PASS),                           09977007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       09978007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          09979007
//SYSIN    DD *                                                         09979107
   SORT FIELDS=(190,3,A,40,2,A,115,1,A,1,8,A),FORMAT=CH                 09979207
   INCLUDE COND=(9,2,CH,EQ,C'DB',AND,1,8,CH,EQ,C'5042686F',AND,         09979307
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C' ')                 09979407
/*                                                                      09979507
//*--------------------------------------------------------------------*09979607
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR DBSS STAMPING                *09979707
//* PINK FORM WILL BE PRINTED                                          *09979807
//*--------------------------------------------------------------------*09979907
//STEP36C  EXEC PGM=BP13C43D,COND=(0,NE)                                09980007
//BP13F315 DD DSN=&&P13F315N,DISP=(OLD,PASS)                            09980107
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                            09980207
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            09981207
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           09981307
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             09981407
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           09981507
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            09981607
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       09981707
//BP13436J DD SYSOUT=*                                                          
//BP13436L DD DUMMY                                                     09981907
//BP13436K DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               09982207
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            09982307
//SYSPRINT DD SYSOUT=*                                                  09982407
//SYSOUT   DD SYSOUT=*                                                  09982507
//SYSDBG   DD SYSOUT=*                                                  09982607
//SYSDBOUT DD SYSOUT=*                                                  09982707
/*                                                                      09982807
//*--------------------------------------------------------------------*09983007
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *09990007
//* INCLUDE DT, CDE-RELEASE-PAYMENT = 'V' AND NON ADHOC SF CASES       *10000007
//*--------------------------------------------------------------------*10010007
//STEP37B  EXEC SORT,COND=(0,NE)                                        10020007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              10030007
//SORTOUT  DD DSN=&&P13F315X,DISP=(NEW,PASS),                           10040007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       10050007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          10060007
//SYSIN    DD *                                                         10070007
   SORT FIELDS=(190,3,A,40,2,A,115,1,A,1,8,A),FORMAT=CH                 10080007
   INCLUDE COND=(9,2,CH,EQ,C'DT',AND,                                   10090007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C' ')                 10100007
/*                                                                      10110007
//*--------------------------------------------------------------------*10120007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR DBSS SUBTRANSFER STAMPING    *10130007
//* PINK FORM WILL BE PRINTED                                          *10140007
//*--------------------------------------------------------------------*10150007
//STEP37C  EXEC PGM=BP13C43A,COND=(0,NE)                                10160007
//BP13F315 DD DSN=&&P13F315X,DISP=(OLD,PASS)                            10170007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                           10180007
//            AMP=('BUFND=4','BUFNI=8')                                 10190007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             10200007
//            AMP=('BUFND=4','BUFNI=8')                                 10210007
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     10220007
//            AMP=('BUFND=4','BUFNI=8')                                 10230007
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                           10240007
//           AMP=('BUFND=4','BUFNI=8')                                  10250007
//BP13KD45 DD DSN=BP13.KD45.PPAYHIST,DISP=SHR,                          10260007
//           AMP=('BUFND=4','BUFNI=8')                                  10270007
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                           10280007
//           AMP=('BUFND=4','BUFNI=8')                                  10290007
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                           10300007
//           AMP=('BUFND=4','BUFNI=8')                                  10310007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            10320007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           10330007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             10340007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           10350007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            10360007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       10370007
//BP1343AJ DD SYSOUT=8,DEST=IOM8                                                
//BP1343AK DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               10410007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            10420007
//SYSPRINT DD SYSOUT=*                                                  10430007
//SYSOUT   DD SYSOUT=*                                                  10440007
//SYSDBG   DD SYSOUT=*                                                  10450007
//SYSDBOUT DD SYSOUT=*                                                  10460007
/*                                                                      10470007
//*-------------------------------------------------------------------* 10480007
//* SORT BP13F315 BY REGN NO                                          * 10490007
//* INCLUDE SOCA, CDE-RELEASE-PAYMENT = SPACES AND NON ADHOC SF CASES * 10500007
//*-------------------------------------------------------------------* 10510007
//STEP37D EXEC SORT,COND=(0,NE)                                         10520007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              10530007
//SORTOUT  DD DSN=&&P13F315R,DISP=(NEW,PASS),                           10540007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        10550007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           10560007
//SYSIN    DD *                                                         10570007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        10580007
   INCLUDE COND=(9,2,CH,EQ,C'TO',AND,203,1,CH,NE,C'Y',AND,              10590007
                 116,1,CH,EQ,C' ',AND,133,1,CH,EQ,C' ')                 10600007
//*-------------------------------------------------------------------* 10610007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR STAMPING OF SUA/TOL         * 10620007
//* WHITE VOUCHER FORM WILL BE PRINTED                                * 10630007
//*-------------------------------------------------------------------* 10640007
//STEP37E EXEC PGM=BP13C32C,COND=(0,NE)                                 10650007
//BP13F315 DD DSN=&&P13F315R,DISP=(OLD,PASS)                            10660007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             10670007
//            AMP=('BUFND=4','BUFNI=8')                                 10680007
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     10690007
//            AMP=('BUFND=4','BUFNI=8')                                 10700007
//BP13L32C DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  10720007
//SYSOUT   DD SYSOUT=*                                                  10730007
//SYSDBG   DD SYSOUT=*                                                  10740007
//SYSDBOUT DD SYSOUT=*                                                  10750007
/*                                                                      10760007
//*------------------------------------------------------------------*  10770007
//*  TO SORT INPUT FILE BP13F315 BY SCH-ACC & REGNO FOR PRINTED      *  10780007
//*  BY NOT RELEASE CASES                                            *  10790007
//*------------------------------------------------------------------*  10800007
//STEP37F  EXEC SORT,COND=(0,NE)                                        10810007
//SORTIN   DD DSN=&&P13F315R,DISP=(SHR,PASS)                            10820007
//SORTOUT  DD DSN=BP13.F315.KIVTRAN,DISP=MOD                            10830007
//SYSIN    DD *                                                         10840007
   SORT FIELDS=(1,10,A),FORMAT=CH                                       10850007
   INCLUDE COND=(9,2,CH,EQ,C'TO',AND,203,1,CH,NE,C'Y',AND,              10860007
                 116,1,CH,EQ,C'U')                                      10870007
//*                                                                     10880007
//*-------------------------------------------------------------------* 10890007
//*-------------------------------------------------------------------* 10900007
//* TO SORT INPUT FILE BP13F315 BY REGNO FOR RELEASE CASES            * 10910007
//* OF SUA/TOL                                                        * 10920007
//*-------------------------------------------------------------------* 10930007
//STEP37G  EXEC SORT,COND=(0,NE)                                        10940007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              10950007
//SORTOUT  DD DSN=&&P13F315W,DISP=(NEW,PASS),                           10960007
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                        10970007
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                           10980007
//SYSIN    DD *                                                         10990007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        11000007
   INCLUDE COND=(9,2,CH,EQ,C'TO',AND,203,1,CH,NE,C'Y',AND,              11010007
                 116,1,CH,EQ,C'V',AND,133,1,CH,EQ,C' ')                 11020007
//*-------------------------------------------------------------------* 11030007
//* PROGRAM TO PRINT A LIST OF STAMPING AFTER SUA/TOL                 * 11040007
//* PINK VOUCHER FORM WILL BE PRINTED                                 * 11050007
//*-------------------------------------------------------------------* 11060007
//STEP37H EXEC PGM=BP13C31H,COND=(0,NE)                                 11070007
//BP13F315 DD DSN=&&P13F315W,DISP=(SHR,PASS)                            11080007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              11090007
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     11100007
//            AMP=('BUFND=4','BUFNI=8')                                 11110007
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                            11120007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            11130007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                           11140007
//BP13K462 DD DSN=BP13.K462.SOC.TOL,DISP=SHR                            11150007
//BP13K461 DD DSN=BP13.K462.SOC.TOL.PATH2,DISP=SHR                      11160007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             11170007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           11180007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            11190007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       11200007
//BP13L31H DD SYSOUT=8,DEST=IOM8                                                
//P13L31HB DD SYSOUT=*                                                          
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               11240007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            11250007
//SYSOUT   DD SYSOUT=*                                                  11260007
//SYSABOUT DD SYSOUT=*                                                  11270007
//SYSDBOUT DD SYSOUT=*                                                  11280007
/*                                                                      11290007
//*--------------------------------------------------------------------*11300007
//* TO SORT INPUT FILE BP13F315 BY CDE-SALES-TYPE, CDE-SATP-TAG, REGN  *11310007
//* INCLUDE DB, CDE-RELEASE-PAYMENT = 'V' AND ADHOC SF CASES           *11320007
//*--------------------------------------------------------------------*11330007
//STEP37I  EXEC SORT,COND=(0,NE)                                        11340007
//SORTIN   DD DSN=BP13.K315.TRANS,DISP=SHR                              11350007
//SORTOUT  DD DSN=&&P13F315O,DISP=(NEW,PASS),                           11360007
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                       11370007
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                          11380007
//SYSIN    DD *                                                         11390007
   SORT FIELDS=(190,3,A,40,2,A,115,1,A,1,8,A),FORMAT=CH                 11400007
   INCLUDE COND=(9,2,CH,EQ,C'DS',AND,                                   11410007
                 116,1,CH,EQ,C'V',AND,                                  11420007
                 133,1,CH,EQ,C'Y')                                      11430007
/*                                                                      11440007
//*--------------------------------------------------------------------*11450007
//* PROGRAM TO PRINT PAYMENT SCHEDULE FOR DBSS STAMPING                *11460007
//* PINK FORM WILL BE PRINTED                                          *11470007
//*--------------------------------------------------------------------*11480007
//STEP37J  EXEC PGM=BP13C43B,COND=(0,NE)                                11490007
//BP13F315 DD DSN=&&P13F315O,DISP=(OLD,PASS)                            11500007
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                            11510007
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR                            11520007
//BP13KD45 DD DSN=BP13.KD45.PPAYHIST,DISP=SHR                           11530007
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR                              11540007
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                            11550007
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=OLD                           11560007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             11570007
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                           11580007
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                            11590007
//AG07F225 DD DSN=BP13.F225.SOC.STAMPFEE,DISP=MOD                       11600007
//BP1343BJ DD SYSOUT=8,DEST=IOM8                                                
//BP1343BL DD DUMMY                                                     11620007
//BP1343BK DD SYSOUT=8,DEST=IOM8                                                
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               11650007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            11660007
//SYSPRINT DD SYSOUT=*                                                  11670007
//SYSOUT   DD SYSOUT=*                                                  11680007
//SYSDBG   DD SYSOUT=*                                                  11690007
//SYSDBOUT DD SYSOUT=*                                                  11700007
/*                                                                      11710007
//*-------------------------------------------------------------------- 11720007
//* TO SORT STAMPING TRANS FILE BY REGN NO AND TRAN CODE                11730007
//*-------------------------------------------------------------------- 11740007
//STEP38   EXEC SORT,COND=(0,NE)                                        11750007
//SORTIN   DD DSN=BP13.F315.TRANS,DISP=SHR                              11760007
//         DD DSN=BP13.F315.KIVTRAN,DISP=SHR                            11770007
//SORTOUT  DD DSN=&&P13F315L,DISP=(NEW,PASS),                           11780007
//          SPACE=(TRK,(50,10),RLSE),UNIT=SYSDA,                        11790007
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                          11800007
//SYSIN    DD *                                                         11810007
     SORT FIELDS=(1,10,A),FORMAT=CH                                     11820007
     INCLUDE COND=(116,1,CH,EQ,C'U')                                    11830007
//*                                                                     11840007
//*-------------------------------------------------------------------- 11850007
//* TO INCLUDE DUMMY REC IN CASE FILE IS EMPTY                          11860007
//*-------------------------------------------------------------------- 11870007
//STEP39   EXEC SORT,COND=(0,NE)                                        11880007
//SORTIN   DD DSN=BP13.CHAR500,DISP=SHR                                 11890007
//         DD DSN=&&P13F315L,DISP=(SHR,PASS)                            11900007
//SORTOUT  DD DSN=&&P13F315M,DISP=(NEW,PASS),                           11910007
//          SPACE=(TRK,(50,10),RLSE),UNIT=SYSDA,                        11920007
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                          11930007
//SYSIN    DD *                                                         11940007
     SORT FIELDS=(1,10,A),FORMAT=CH                                     11950007
//*                                                                     11960007
//*--------------------------------------------------------------------*11970007
//*  DEFINE STAMPING TRANSACTION FILE                                  *11980007
//*--------------------------------------------------------------------*11990007
//STEP40 EXEC PGM=IDCAMS,COND=(0,NE)                                    12000007
//BP13F315 DD DSN=&&P13F315M,DISP=(OLD,PASS)                            12010007
//SYSPRINT DD SYSOUT=*                                                  12020007
//SYSIN    DD *                                                         12030007
     DEL 'BP13.K315.TRANS' CL PURGE                                     12040007
     DEF CL    (NAME(BP13.K315.TRANS)                   -               12050007
                CYL(5 2)                                -               12060007
                UNIQUE                                  -               12070007
                STORCLAS(PRODRLS)                       -               12080007
                LOG(NONE)                               -               12090007
                SHR(2 3))                               -               12100007
         DATA  (NAME(BP13.K315.TRANS.DATA)              -               12110007
                KEYS(10 0)                              -               12120007
                RECSZ(500 500)                          -               12130007
                CISZ(4096))                             -               12140007
         INDEX (NAME(BP13.K315.TRANS.INDEX))                            12150007
     IF LASTCC = 0 THEN                                                 12160007
        REPRO INFILE(BP13F315)                          -               12170007
              ODS(BP13.K315.TRANS) REUSE                                12180007
     IF MAXCC = 0 THEN                                                  12190007
        DEF AIX (NAME(BP13.K315.TRANS.ALTX1)            -               12200007
                 REL(BP13.K315.TRANS)                   -               12210007
                 CYL(5 2)                               -               12220007
                 SHR(2 3)                               -               12230007
                 UNIQUE                                 -               12240007
                 KEYS(18 212)                           -               12250007
                 CISZ(4096)                             -               12260007
                 RECSZ(1023 1023)                       -               12270007
                 NUNQK)                                                 12280007
        IF LASTCC = 0 THEN                              -               12290007
           DEF PATH(NAME(BP13.K315.TRANS.PATH1)         -               12300007
               PENT(BP13.K315.TRANS.ALTX1))                             12310007
        IF LASTCC = 0 THEN                              -               12320007
           BIX IDS(BP13.K315.TRANS)                     -               12330007
               ODS(BP13.K315.TRANS.ALTX1)                               12340007
//*                                                                     12350007
//*-------------------------------------------------------------------* 12360007
//* TO SORT DAILY SO FILE TO INCLUDE ONLY DEFERRED PREMIUM CASES      * 12370007
//*-------------------------------------------------------------------* 12380007
//STEP40A  EXEC SORT,COND=(0,NE)                                        12390007
//SORTIN   DD DSN=BP13.F410.DAILYSO,DISP=(SHR,PASS)                     12400007
//SORTOUT  DD DSN=&&F410PREM,DISP=(,PASS),                              12410007
//         UNIT=SYSDA,SPACE=(CYL,(60,10),RLSE),                         12420007
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                          12430007
//SYSIN   DD *                                                          12440007
   SORT FIELDS=(1,8,A),FORMAT=CH                                        12450007
   INCLUDE COND=(507,1,CH,EQ,C'Y')                                      12460007
//*                                                                     12470007
//*-------------------------------------------------------------------* 12480007
//* PROGRAM TO CREATE PAYMENT VOUCHER FOR DEFERRED PREMIUM CASES      * 12490007
//* CLOSE FILE : AG07K960                                             * 12500007
//*-------------------------------------------------------------------* 12510007
//STEP40B EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K        12520007
//BP13F410 DD DSN=&&F410PREM,DISP=(SHR,PASS)                            12530007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              12540007
//AG07F220 DD DSN=BP13.AG07.F220.SOC,DISP=MOD                           12550007
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               12560007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            12570007
//BP13L410 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  12610007
//SYSABOUT DD SYSOUT=*                                                  12620007
//SYSOUT   DD SYSOUT=*                                                  12630007
//SYSTSPRT DD SYSOUT=*                                                  12640007
//SYSTSIN DD *                                                          12650007
     DSN SYSTEM(DSN)                                                    12660007
     RUN PROGRAM(BP13C410) PLAN(BP13PCC) -                              12670007
         LIB('BP13.BATCH.LOADCOB')                                      12680007
     END                                                                12690007
/*                                                                      12700007
//*-----------------------------------------------------------------    12710007
//*  CREATE RESALE LEVY JOURNAL VOUCHERS FOR SO RAISED FOR THE DAY      12720007
//*-----------------------------------------------------------------    12730007
//STEP40C  EXEC PGM=BP13C42H,COND=(0,NE)                                12740007
//BP13F410 DD DSN=BP13.F410.DAILYSO,DISP=SHR                            12750007
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              12760007
//BP13K162 DD DSN=BP13.K162.LVYTAG,DISP=SHR                             12770007
//BP13K470 DD DSN=BP13.K470.PREMIUM,DISP=SHR                            12780007
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                             12790007
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                       12800007
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                               12810007
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                            12820007
//BP13KC10 DD DSN=BP13.KC10.LVYVCHR,DISP=OLD                            12830007
//P13L42HB DD DSN=BP13.MAILRPT.P13L42HB,DISP=OLD                        12850007
//P13L42HC DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                  12870007
//SYSDBG   DD SYSOUT=*                                                  12880007
//SYSDBOUT DD SYSOUT=*                                                  12890007
//SYSOUT   DD SYSOUT=*                                                  12900007
//*                                                                     12910007
//*-------------------------------------------------------------------* 12920007
//* BACKUP BP13.F680.STAMP                                            * 12930007
//*-------------------------------------------------------------------* 12940007
//STEP41   EXEC PGM=IDCAMS,COND=(0,NE)                                  12950007
//SYSPRINT DD SYSOUT=*                                                  12960007
//INPUT1   DD DSN=BP13.F680.STAMP,DISP=SHR                              12970007
//OUTPUT1  DD DSN=BP13.F680.STAMP.BKUP(+1),DISP=(NEW,CATLG),            12980007
//         SPACE=(CYL,(3,2)),                                           12990007
//         DCB=(BP13.GDG,BLKSIZE=23400,LRECL=450,RECFM=FB)              13000007
//SYSIN    DD *                                                         13010007
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                             13020007
//*-------------------------------------------------------------------* 13030007
//* BACKUP BP13.F225.SOC.STAMPFEE                                     * 13040007
//*-------------------------------------------------------------------* 13050007
//STEP42   EXEC PGM=IDCAMS,COND=(0,NE)                                  13060007
//SYSPRINT DD SYSOUT=*                                                  13070007
//INPUT1   DD DSN=BP13.F225.SOC.STAMPFEE,DISP=SHR                       13080007
//OUTPUT1  DD DSN=BP13.F225.SOC.STAMPFEE.BKUP(+1),DISP=(NEW,CATLG),     13090007
//         SPACE=(CYL,(3,2)),                                           13100007
//         DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)              13110007
//SYSIN    DD *                                                         13120007
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                             13130007
//*-------------------------------------------------------------------* 13140007
//*  SEND MAINFRAME EMAIL (BP13L446)                                    13150007
//*-----------------------------------------------------------------    13160007
//STEP43   EXEC SENDMAIL,COND=(4,LT)                                    13170007
//INPUT    DD DSN=BP13.L446.BP13C446,DISP=SHR                           13180007
//*-------------------------------------------------------------------* 13190007
//*-------------------------------------------------------------------* 13200007
//*  SEND MAINFRAME EMAIL (BP13L446)                                    13210007
//*-----------------------------------------------------------------    13220007
//STEP44   EXEC SENDMAIL,COND=(4,LT)                                    13230007
//INPUT    DD DSN=BP13.L446.BP13C446.TP,DISP=SHR                        13240007
//*-------------------------------------------------------------------* 13250007
//*  SEND MAINFRAME EMAIL (BP13C42H)                                    13260007
//*-----------------------------------------------------------------    13270007
//STEP44A  EXEC SENDMAIL,COND=(4,LT)                                    13280007
//INPUT    DD DSN=BP13.MAILRPT.P13L42HB,DISP=SHR                        13290007
//*--------------------------------------------------------------------*13300007
//*  SORT TRANS FILE TO GET SA/ST/SF/TO ONLY                            13310007
//*-----------------------------------------------------------------    13320007
//STEP45   EXEC SORT,COND=(0,NE)                                        13330007
//SORTIN   DD DSN=BP13.K315.TRANS,DISP=SHR                              13340007
//SORTOUT  DD DSN=&&BP13F315,DISP=(NEW,PASS),                           13350007
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                       13360007
//            DCB=(RECFM=FB,LRECL=500)                                  13370007
//SYSIN    DD *                                                         13380007
     SORT FIELDS=(213,18,A),FORMAT=CH                                   13390007
     INCLUDE COND=((1,8,CH,NE,C'        ',AND,1,8,BI,NE,X'00'),AND,     13400007
                   (9,2,CH,EQ,C'SA',OR,9,2,CH,EQ,C'ST',OR,              13410007
                    9,2,CH,EQ,C'SF',OR,                                 13420007
                   (9,2,CH,EQ,C'TO',AND,193,3,CH,EQ,C'TOL')),AND,       13430007
                   (213,8,CH,NE,C'        ',AND,213,8,BI,NE,X'00',AND,  13440007
                    213,8,CH,NE,C'00000000'))                           13450007
//*                                                                     13460007
//*-----------------------------------------------------------------    13470007
//* EXTRACT ESTAMPING COUNT                                             13480007
//*-----------------------------------------------------------------    13490007
//STEP46   EXEC PGM=BP13CL10,COND=(0,NE)                                13500007
//BP13F315 DD DSN=&&BP13F315,DISP=(OLD,DELETE)                          13510007
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                             13520007
//BP13FH70 DD DSN=&&BP13FH70,DISP=(NEW,PASS),                           13530007
//            DCB=(BLKSIZE=0,LRECL=400,RECFM=FB),                       13540007
//            SPACE=(CYL,(10,5),RLSE)                                   13550007
//BP13LL10 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                  13570007
//SYSDBG   DD SYSOUT=*                                                  13580007
//SYSDBOUT DD SYSOUT=*                                                  13590007
//SYSOUT   DD SYSOUT=*                                                  13600007
//*                                                                     13610007
//*-----------------------------------------------------------------    13620007
//STEP47   EXEC SORT,COND=(0,NE)                                        13630007
//SORTIN   DD DSN=&&BP13FH70,DISP=(OLD,DELETE)                          13640007
//SORTOUT  DD DSN=&&BP13FH7B,DISP=(NEW,PASS),                           13650007
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                       13660007
//            DCB=(RECFM=FB,LRECL=400)                                  13670007
//SYSIN    DD *                                                         13680007
     SORT FIELDS=(1,9,A),FORMAT=CH                                      13690007
//*                                                                     13700007
//*-----------------------------------------------------------------    13710007
//STEP48 EXEC PGM=IDCAMS,COND=(0,NE)                                    13720007
//BP13FH70 DD DSN=&&BP13FH7B,DISP=(OLD,DELETE)                          13730007
//SYSPRINT DD SYSOUT=*                                                  13740007
//SYSIN    DD *                                                         13750007
     DEL 'BP13.KH70.ESTMPCNT' CL PURGE                                  13760007
     DEF CL    (NAME(BP13.KH70.ESTMPCNT)                -               13770007
                CYL(5 2)                                -               13780007
                UNIQUE                                  -               13790007
                STORCLAS(PRODRLS)                       -               13800007
                LOG(NONE)                               -               13810007
                SHR(2 3))                               -               13820007
         DATA  (NAME(BP13.KH70.ESTMPCNT.DATA)           -               13830007
                KEYS(9 0)                               -               13840007
                RECSZ(400 400)                          -               13850007
                CISZ(4096))                             -               13860007
         INDEX (NAME(BP13.KH70.ESTMPCNT.INDEX))                         13870007
     IF LASTCC = 0 THEN                                                 13880007
        REPRO INFILE(BP13FH70)                          -               13890007
              ODS(BP13.KH70.ESTMPCNT)                                   13900007
//*                                                                     13910007
//*-------------------------------------------------------------------* 13920007
//*   END OF BP13D407                                                 * 13930007
//*-------------------------------------------------------------------* 13940007
//*=================================================================*   13950007
