//BP13D050  JOB (BP13P),'BP13D050',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//* CHG-NO   BY  ON    -  DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130718 LSB 000201 - REPRO AC17 FILE TO SEQ FOR BP13A533                   
//*                       JOB RUN AT 5PM DAILY                                  
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//* OUTREC NRIC1 FROM RENTAL SYSTEM FILE                                        
//* INCLUDE PROPERTY-CODE = ZEROS, RENTAL FLATS                                 
//* OMIT NRIC = BLANK                                                           
//* OMIT CDE-TENLIVE NOT = 'L'                                                  
//* OMIT MODE ALLOCATION = 'THS' OR 'INC' OR 'USW'                              
//*---------------------------------------------------------------------        
//STEP01 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=AC17.K010.RENTAL,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&AC17F010,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,SPACE=(CYL,(10,3),RLSE),                                   
//        DCB=(RECFM=FB,LRECL=30,BLKSIZE=23460)                                 
//SYSIN     DD  *                                                               
   SORT FIELDS=(120,9,A),FORMAT=CH                                              
   OUTREC FIELDS=(120,9,1,11,23,8,2X)                                           
   OMIT COND=(120,9,CH,EQ,C'         ',OR,                                      
              12,1,CH,NE,C'L',OR,                                               
             300,1,CH,NE,C'1',OR,                                               
             383,3,CH,EQ,C'THS',OR,                                             
             383,3,CH,EQ,C'INC',OR,                                             
             383,3,CH,EQ,C'USW')                                                
//*---------------------------------------------------------------------        
//* SORT RENTAL RECORDS IN NRIC ORDER                                           
//*---------------------------------------------------------------------        
//STEP02 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=&&AC17F010,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.AC17.F010.RENTAL,DISP=SHR                                
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,9,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
