//BP13AL09 JOB (BP13P),'BP13AL09',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000100
//             NOTIFY=CSD0071                                           00000200
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                          00000300
//********************************************************************* 00000400
//* THIS JCL IS FOR REPORT FOR MORE THAN 7 WEEK OLD LOF CASES           00000500
//********************************************************************* 00000600
//STEP02 EXEC PGM=BP13C10D                                              00000700
//BP13KD00  DD DSN=BP13.KD00.DBSMAST,DISP=SHR                           00000800
//BP13K024  DD DSN=BP13.K024.WISLAST,DISP=SHR                           00000900
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                            00001000
//             AMP=('BUFND=8','BUFNI=4')                                00002000
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                      00003000
//             AMP=('BUFND=8','BUFNI=4')                                00004000
//BP27K025 DD DSN=BP27.K025.CAOIC,DISP=SHR,                             00005000
//             AMP=('BUFND=8','BUFNI=4')                                00006000
//BP27K021 DD DSN=BP27.K025.CAOIC.PATH1,DISP=SHR,                       00007000
//             AMP=('BUFND=8','BUFNI=4')                                00008000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00009000
//             AMP=('BUFND=8','BUFNI=4')                                00010000
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR,                           00020000
//             AMP=('BUFND=8','BUFNI=4')                                00030000
//BP13FOUT  DD  SYSOUT=A,                                               00040000
//             DEST=X9AL                                                00050000
//SYSDBG    DD SYSOUT=*                                                 00060000
//SYSDBOUT  DD SYSOUT=*                                                 00070000
//SYSOUT    DD SYSOUT=*                                                 00080000
/*                                                                      00090000
