//BP13VFYD JOB (BP13P),'BP13VFYD',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================*           
//* BP133793  16/12/2009  LSB  CHG SORT FIELDS IN STEP11            *           
//*=================================================================*           
//*-----------------------------------------------------------------            
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                                   
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K440.CPFSNP,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K310.TRANS,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
