//BP13D800 JOB (BP13P),'BP13D800',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*================================================================*            
//*  DO NOT CHANGE STEP NUMBER !!!                                 *            
//*                                                                *            
//*  THIS JOB                                                      *            
//*  1) EMAIL CSM ON KEY AVAILABILITY                              *            
//*                                                                *            
//*================================================================*            
//* CHG REF  BY  ON       DESCRIPTION                              *            
//* -------- --- -------- -----------                              *            
//* BP132495 CKK 20040311 NEW JCL FOR EMAIL ALERT                  *            
//* BP132810 CKK 20060330 VIEW RP & ST FLATS                       *            
//* BP132878 SSS 20060615 MOVE VIEWING OF RP/ST FLATS TO D801      *            
//* BP134603 IMC 20120815 CHANGE SORT COND FOR NON-BO CASES FOR C172            
//* BP134603 LJL 20120929 TO INCLUDE BP13K435 FOR STEPS 8 AND 10.               
//* BP135171 RJE 20140211 TO CATER FOR DB2 UPGRADE                              
//* BP136082 KVL 20160128 TO CHANGE STEPS 8,10,12,14 TO DB2 FORMAT              
//*=================================================================            
//*   MOVE NULLFILE TO BM06.F120.EMAIL.BORROWER                                 
//*=================================================================            
//STEP0A    EXEC PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSUT1    DD DSN=NULLFILE,DCB=BM06.F120.EMAIL.BORROWER                        
//SYSUT2    DD DSN=BM06.F120.EMAIL.BORROWER,DISP=OLD                            
//SYSIN     DD DUMMY                                                            
//*=================================================================            
//* SORT OUT TRANSACTION THAT HAS KEY AVAILABLE                                 
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F310,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(9,2,CH,EQ,C'KA')                                                
//*----------------------------------------------------------------             
//*  GENERATE EMAIL HEADER AND BODY FOR KEY AVAILABILITY ALERT                  
//*  IF THERE'S NO ALERT, I.E. INPUT F310 IS EMPTY, RETURN CC=99                
//*----------------------------------------------------------------             
//STEP02   EXEC PGM=BP13C171,COND=(0,NE)                                        
//BP13F310 DD DSN=&&P13F310,DISP=(OLD,DELETE)                                   
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BM06F120 DD DSN=BM06.F120.EMAIL.BORROWER,DISP=OLD                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
// IF (STEP02.RC = 99 OR STEP02.RC = 0) THEN                                    
//*=================================================================            
//* SORT OUT TRANSACTION THAT HAS EMAIL ALERT SET FOR BO                        
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,CYL=30                                                     
//SORTIN   DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13F022A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=100),                              
//            SPACE=(CYL,(8,5),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,13,A),FORMAT=CH                                                
  INCLUDE COND=(19,2,CH,EQ,C'BO')                                               
//*-----------------------------------------------------------------            
//* CHECK FOR ALERTS THAT HAS REQUESTED TO SEND BO EMAIL                        
//*-----------------------------------------------------------------            
//STEP04   EXEC  PGM=IKJEFT01,                                                  
//             REGION=4096K,DYNAMNBR=20                                         
//BP13F022 DD  DSN=&&P13F022A,DISP=(OLD,DELETE)                                 
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K431 DD  DSN=BP13.K431.BORROWER.CODE,DISP=SHR,                            
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K435 DD  DSN=BP13.K435.KEY.BORROW,DISP=SHR,                               
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06F120 DD  DSN=BM06.F120.EMAIL.BORROWER,DISP=MOD                            
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C173) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* SORT OUT TRANSACTION THAT HAS EMAIL ALERT SET FOR SO                        
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,CYL=30                                                     
//SORTIN   DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13F022B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=100),                              
//            SPACE=(CYL,(8,5),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,13,A),FORMAT=CH                                                
  INCLUDE COND=(19,2,CH,EQ,C'SO')                                               
//*-----------------------------------------------------------------            
//* CHECK FOR ALERTS THAT HAS KEYS RETURNED                                     
//*-----------------------------------------------------------------            
//STEP06   EXEC  PGM=IKJEFT01,                                                  
//             REGION=4096K,DYNAMNBR=20                                         
//BP13F022 DD  DSN=&&P13F022B,DISP=(OLD,DELETE)                                 
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K431 DD  DSN=BP13.K431.BORROWER.CODE,DISP=SHR,                            
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K435 DD  DSN=BP13.K435.KEY.BORROW,DISP=SHR,                               
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06F120 DD  DSN=BM06.F120.EMAIL.BORROWER,DISP=MOD                            
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C173) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
// ENDIF                                                                        
//*---------------------------------------------------------------------        
//* SORT OUT TRANSACTION THAT ARE SO CASES. KEYS RETURNED.                      
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,CYL=30                                                     
//SORTIN   DD DSN=BM06.F120.EMAIL.BORROWER,DISP=SHR                             
//SORTOUT  DD DSN=&&M06F120,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=700),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(690,10,A),FORMAT=CH                                              
  INCLUDE COND=(688,2,CH,EQ,C'SO')                                              
//*-----------------------------------------------------------------            
//*  GENERATE EMAIL FOR CSM TO INFORM THEM OF KEYS RETURNED                     
//*  IF THERE'S NO ALERT, I.E. INPUT F120 IS EMPTY, RETURN CC=99                
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BM06F120 DD DSN=&&M06F120,DISP=(OLD,DELETE)                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K435 DD DSN=BP13.K435.KEY.BORROW,DISP=SHR                                 
//BP13MAIL DD DSN=BP13.MAILOUT.C172.SO,DISP=OLD                                 
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C172) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
// IF (STEP08.RC = 99 OR STEP08.RC = 0) THEN                                    
//*-----------------------------------------------------------------            
//* SORT OUT TRANSACTION THAT ARE BO CASES. SEND TO BOADMIN                     
//*-----------------------------------------------------------------            
//STEP09   EXEC SORT,CYL=30                                                     
//SORTIN   DD DSN=BM06.F120.EMAIL.BORROWER,DISP=SHR                             
//SORTOUT  DD DSN=&&M06F120,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=700),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(509,2,A,690,10,A),FORMAT=CH                                      
  INCLUDE COND=(688,2,CH,EQ,C'BO',AND,                                          
                509,2,CH,NE,C'  ')                                              
//*-----------------------------------------------------------------            
//*  GENERATE EMAIL FOR REQUEST FOR KEY RETURN FROM BO                          
//*  IF THERE'S NO ALERT, I.E. INPUT F120 IS EMPTY, RETURN CC=99                
//*-----------------------------------------------------------------            
//STEP10   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BM06F120 DD DSN=&&M06F120,DISP=(OLD,DELETE)                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K435 DD DSN=BP13.K435.KEY.BORROW,DISP=SHR                                 
//BP13MAIL DD DSN=BP13.MAILOUT.C172.BO1,DISP=OLD                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C172) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
// ENDIF                                                                        
// IF (STEP10.RC = 99 OR STEP10.RC = 0) THEN                                    
//*-----------------------------------------------------------------            
//* SORT OUT TRANSACTION THAT ARE BO CASES. SEND TO BORROWER EMAIL              
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,CYL=30                                                     
//SORTIN   DD DSN=BM06.F120.EMAIL.BORROWER,DISP=SHR                             
//SORTOUT  DD DSN=&&M06F120,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=700),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(690,10,A),FORMAT=CH                                              
  INCLUDE COND=(688,2,CH,EQ,C'NB',AND,                                          
                509,2,CH,NE,C'  ')                                              
//*-----------------------------------------------------------------            
//*  GENERATE EMAIL FOR REQUEST FOR KEY RETURN FROM OTHER DEPT                  
//*  IF THERE'S NO ALERT, I.E. INPUT F120 IS EMPTY, RETURN CC=99                
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BM06F120 DD DSN=&&M06F120,DISP=(OLD,DELETE)                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K435 DD DSN=BP13.K435.KEY.BORROW,DISP=SHR                                 
//BP13MAIL DD DSN=BP13.MAILOUT.C172.BO2,DISP=OLD                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C172) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
// ENDIF                                                                        
// IF (STEP12.RC = 99 OR STEP12.RC = 0) THEN                                    
//*-----------------------------------------------------------------            
//* SORT OUT TRANSACTION THAT ARE KA CASES                                      
//*-----------------------------------------------------------------            
//STEP13   EXEC SORT,CYL=30                                                     
//SORTIN   DD DSN=BM06.F120.EMAIL.BORROWER,DISP=SHR                             
//SORTOUT  DD DSN=&&M06F120,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=700),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(690,10,A),FORMAT=CH                                              
  INCLUDE COND=(688,2,CH,EQ,C'KA')                                              
//*-----------------------------------------------------------------            
//*  GENERATE EMAIL FOR KEY AVAILABILITY ALERT                                  
//*  IF THERE'S NO ALERT, I.E. INPUT F120 IS EMPTY, RETURN CC=99                
//*-----------------------------------------------------------------            
//STEP14   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(4,LT),REGION=4096K               
//BM06F120 DD DSN=&&M06F120,DISP=(OLD,DELETE)                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K435 DD DSN=BP13.K435.KEY.BORROW,DISP=SHR                                 
//BP13MAIL DD DSN=BP13.MAILOUT.C172.KA,DISP=OLD                                 
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C172) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
// ENDIF                                                                        
// IF (STEP08.RC = 0) THEN                                                      
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO CSM ON KEY RETURN                                  
//*-----------------------------------------------------------------            
//STEP15   EXEC SENDMAIL                                                        
//INPUT    DD DSN=BP13.MAILOUT.C172.SO,DISP=SHR                                 
//*                                                                             
// ENDIF                                                                        
// IF (STEP10.RC = 0) THEN                                                      
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO BO ON KEYS RETURN                                  
//*-----------------------------------------------------------------            
//STEP16   EXEC SENDMAIL                                                        
//INPUT    DD DSN=BP13.MAILOUT.C172.BO1,DISP=SHR                                
//*                                                                             
// ENDIF                                                                        
// IF (STEP12.RC = 0) THEN                                                      
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO BORROWERS ON KEY RETURN                            
//*-----------------------------------------------------------------            
//STEP17   EXEC SENDMAIL                                                        
//INPUT    DD DSN=BP13.MAILOUT.C172.BO2,DISP=SHR                                
//*                                                                             
// ENDIF                                                                        
// IF (STEP14.RC = 0) THEN                                                      
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO CSM ON KA                                          
//*-----------------------------------------------------------------            
//STEP18   EXEC SENDMAIL                                                        
//INPUT    DD DSN=BP13.MAILOUT.C172.KA,DISP=SHR                                 
//*                                                                             
// ENDIF                                                                        
/*                                                                              
//*=================================================================            
//* END JOB BP13D800                                                            
//*=================================================================            
