//BP13DM30 JOB (BP13P),'CS94324',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),             
//             COND=(4,LT),NOTIFY=CSD0071                                       
//**********************************************************************        
//*TO EXTRACT DATA FILES FOR USER VERIFICATION                                  
//**********************************************************************        
//*STEP01: TO CHECH IF THERE IS DETAILS TO FTP FOR THE DAY.                     
//**********************************************************************        
//STEP01   EXEC SORT,PARM='NULLOUT=RC4'                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DISP=SHR,DSN=BP13.FDM24004.REJECTED.SD(0)                        
//         DD  DISP=SHR,DSN=BP13.FDM25002.REJECTED.SD(0)                        
//         DD  DISP=SHR,DSN=BP13.FDM26002.REJECTED.SD(0)                        
//         DD  DISP=SHR,DSN=BP13.FDM29001.REJECTED.SD(0)                        
//         DD  DISP=SHR,DSN=BP13.FDM25001.ACCEPTED.SD(0)                        
//SORTOUT  DD  DUMMY                                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  OMIT COND=(7,8,CH,EQ,X'0000000000000000',OR,                                  
             7,8,CH,EQ,X'FFFFFFFFFFFFFFFF')                                     
/*                                                                              
//IF1    IF (STEP01.SORT.RC = 0) THEN                                           
//**********************************************************************        
//*STEP02: EXTRACT DAILY INELIGIBLE FILES                                       
//**********************************************************************        
//STEP02   EXEC PGM=ICEGENER                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DISP=SHR,DSN=BP13.FDM24004.REJECTED.SD(0)                         
//         DD DISP=SHR,DSN=BP13.FDM26002.REJECTED.SD(0)                         
//         DD DISP=SHR,DSN=BP13.FDM25002.REJECTED.SD(0)                         
//SYSUT2   DD DISP=(NEW,PASS,DELETE),                                           
//            UNIT=CART,                                                        
//            DCB=(RECFM=FB,LRECL=100),                                         
//            DSN=&&STEP02                                                      
//SYSIN    DD DUMMY                                                             
/*                                                                              
//**********************************************************************        
//*STEP03: EXTRACT DAILY PERSON FILES                                           
//**********************************************************************        
//STEP03   EXEC SORT                                                            
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DISP=SHR,DSN=BP13.K825.REQOCCP                                   
//SORTOUT  DD  DISP=(NEW,PASS,DELETE),                                          
//             UNIT=CART,                                                       
//             DCB=(RECFM=FB,LRECL=32),                                         
//             DSN=&&STEP03                                                     
//SYSIN    DD  *                                                                
  OPTION DYNALLOC=(SYSDA,10)                                                    
  SORT FIELDS=(1,8,CH,A,97,8,CH,D)                                              
  INCLUDE COND=(1,1,CH,EQ,C'8')                                                 
  OUTREC FIELDS=(1,8,                                                           
                 9,9,                                                           
                 96,1,                                                          
                 97,8,                                                          
                 107,2,                                                         
                 131,1,                                                         
                 157,1,                                                         
                 105,2)                                                         
/*                                                                              
//**********************************************************************        
//*STEP04: SYMBOL TRANSLATOR TO APPEND TIMESTAMP TO DEST. FILE NAME             
//**********************************************************************        
//STEP04   EXEC PGM=EZACFSM1                                                    
//SYSIN    DD   *                                                               
PUT '//DD:INFILE1 ' +                                                           
    'BP13DM30_FTPMC_ELIGIBLE_&LYR4&LMON&LDAY_&LHR&LMIN..TXT'                    
PUT '//DD:INFILE2 ' +                                                           
    'BP13DM30_FTPMC_INELIGIBLE_&LYR4&LMON&LDAY_&LHR&LMIN..TXT'                  
PUT '//DD:INFILE3 ' +                                                           
    'BP13DM30_FTPMC_SYSTEMISSUE_&LYR4&LMON&LDAY_&LHR&LMIN..TXT'                 
PUT '//DD:INFILE4 ' +                                                           
    'BP13DM30_FTPMC_FIRST_TIMER_&LYR4&LMON&LDAY_&LHR&LMIN..TXT'                 
PUT '//DD:INFILE5 ' +                                                           
    'BP13DM30_FTPMC_PERSON_&LYR4&LMON&LDAY_&LHR&LMIN..TXT'                      
QUIT                                                                            
/*                                                                              
//SYSOUT   DD DISP=(NEW,PASS,DELETE),                                           
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0),                                
//            DSN=&&STEP04                                                      
/*                                                                              
//**********************************************************************        
//*STEP05: FTP FILES TO USER FOLDER                                             
//**********************************************************************        
//STEP05   EXEC FTP,PARM='HDBWINFS1 (EXIT'                                      
//NETRC    DD DISP=SHR,DSN=SY08.FTP.NETRC.BP13                                  
//INFILE1  DD DISP=SHR,DSN=BP13.FDM25001.ACCEPTED.SD(0)                         
//INFILE2  DD DISP=(OLD,DELETE,DELETE),DSN=&&STEP02                             
//INFILE3  DD DISP=SHR,DSN=BP13.FDM29001.REJECTED.SD(0)                         
//INFILE4  DD DISP=SHR,DSN=BP13.FDM24002.FRSTIMER.SD(0)                         
//INFILE5  DD DISP=(OLD,DELETE,DELETE),DSN=&&STEP03                             
//INPUT    DD *                                                                 
CD /GROUP/EAPG/APPS/BP13/PREEREPORTS                                            
ASCII                                                                           
/*                                                                              
//         DD DSN=&&STEP04,DISP=(OLD,DELETE,DELETE)                             
/*                                                                              
//IF1      ENDIF                                                                
