//BP13AY0D JOB (BP13P),'BP13AY0D',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//      NOTIFY=CSD0071                                                  00020000
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030000
//*===================================================================*         
//* CHG-NO   BY   ON      DESCRIPTION                                           
//* ---------------------------------                                           
//* BP133921 LSB 07092010 ADD SBF, EXPAND BP13F55A                              
//* BP134018 LSB 07092010 ADD REPORT FROM BP13AY01                              
//* BP134247 LSB 10062011 EXPAND F55A, L55A, CY67 READ K800                     
//* BP134303 LSB 22072011 ADD SPECIAL ASSISTED SCHEME,USE K813 IN CB95          
//* BP134924 LSB 29052013 DELETE F557 REPORT, ADD IN DWP, SA POLICY             
//* BP134931 LSB 22072013 ADD IN PPS REPORT SHOW DTE-CITIZENSHIP                
//* BP134996 LSB 02082013 OMIT FTS (G), EXLCUDE OCCUPIER INCOME                 
//* BP135089 IMC 01102013 ADD NEW BP13L55B OUTPUT FOR BP13CY67                  
//* BP135251 LSB 25032014 CHG BP13CY67 TO BP13CY5D                              
//* BP135251 LSB 25032014 CHG BP13K816 TO BP13K813                              
//* BP135338 LSB 19062014 - ADD BP13F55Y, F55Z                                  
//* BP136902 LSB 10072017 - ADD ROF                                             
//* BP137358 FNP 30052018 - EXPAND F55A FROM 800 TO 1200                        
//*===================================================================*         
//* PRINT REPORT TO SHOW SPH/SPR AFTER BTO CLOSING                              
//*-------------------------------------------------------------------*         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                  *         
//*  PRT01 : COPIES = 1                                               *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y1                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YD')                                               
//*-----------------------------------------------------------------            
//* SORT BP13K816 BY K816-DTE-OPEN-BTO                                          
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F813,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(25,3),RLSE),                               
//            DCB=(LRECL=1000,RECFM=FB)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,3,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* MATCH F205 WITH F813 TO GET NT OFFERED UNDER THE BTO LAUNCH                 
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13CY01,COND=(0,NE)                                        
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13F813 DD DSN=&&BP13F813,DISP=(OLD,PASS)                                    
//P13F813A DD DSN=&&F813NT,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(25,3),RLSE),                               
//            DCB=(LRECL=1000,RECFM=FB)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* TO EXTRACT BTO                                                              
//* SORT BP13K730 BY K730-CDE-NT1                                               
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR,                      00584022
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD DSN=&&F730BTO,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A),FORMAT=CH                                               
  INCLUDE COND=(376,3,CH,EQ,C'BTO')                                             
//*---------------------------------------------------------------------        
//*- EXTRACT APPLICATION UNDER LAUNCH-DATE AND NT                               
//*-IF 2 DIFF NT OFFER UNDER BTO LAUNCH, SYSTEM TO PRINT SEPARATE REPORT        
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13CY02,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730BTO,DISP=(OLD,PASS)                                     
//BP13F813 DD DSN=&&F813NT,DISP=(OLD,PASS)                                      
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F730A DD DSN=&&F730NT,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//P13F730B DD DSN=&&F730HIST,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* TO EXTRACT SBF                                                              
//* SORT BP13K730 BY K730-CDE-NT1                                               
//*-----------------------------------------------------------------            
//STEP5A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR,                      00584022
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD DSN=&&F730SBF,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A),FORMAT=CH                                               
  INCLUDE COND=(376,3,CH,EQ,C'SBF')                                             
//*---------------------------------------------------------------------        
//*- EXTRACT APPLICATION UNDER LAUNCH-DATE AND NT                               
//*-IF 2 DIFF NT OFFER UNDER BTO LAUNCH, SYSTEM TO PRINT SEPARATE REPORT        
//*---------------------------------------------------------------------        
//STEP5A   EXEC PGM=BP13CY02,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730SBF,DISP=(OLD,PASS)                                     
//BP13F813 DD DSN=&&F813NT,DISP=(OLD,PASS)                                      
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F730A DD DUMMY                                                             
//P13F730B DD DSN=&&NEWSBF,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BP13F730 BY REGN                                                       
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730NT,DISP=(OLD,PASS)                              00584022
//         DD DSN=&&NEWSBF,DISP=(OLD,PASS)                              00584022
//SORTOUT  DD DSN=BP13.F730.MATURERQ.AY0D,DISP=OLD                              
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  OMIT COND=(187,3,CH,EQ,C'XXX')                                                
//*-----------------------------------------------------------------            
//*-----------------------------------------------------------------    00170000
//* GET ALL BTO QTR                                                     00180000
//* EXCLUDE OCCUPIER INCOME FOR SINGLE SCHEME                           00180000
//*-----------------------------------------------------------------    00210000
//STEP29   EXEC  PGM=BP13CB95,COND=(0,NE)                               00220000
//BP13F730 DD  DSN=BP13.F730.MATURERQ.AY0D,DISP=SHR                     00230000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00240000
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                          00250000
//             AMP=('BUFND=4','BUFNI=8')                                00260000
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                            00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00290000
//             AMP=('BUFND=4','BUFNI=8')                                00300000
//BP13K825 DD  DSN=BP13.K825.REQOCCP.SBF,DISP=SHR,                      00310000
//             AMP=('BUFND=4','BUFNI=8')                                00320000
//BP13K828 DD  DSN=BP13.K590.CANOCCP,DISP=SHR,                          00330001
//             AMP=('BUFND=4','BUFNI=8')                                00340000
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                          00350001
//             AMP=('BUFND=4','BUFNI=8')                                00360000
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR,                    00370001
//             AMP=('BUFND=4','BUFNI=8')                                00380000
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR,                    00390001
//             AMP=('BUFND=4','BUFNI=8')                                00400000
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                        00401001
//             AMP=('BUFND=4','BUFNI=8')                                00402001
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                  00403001
//             AMP=('BUFND=4','BUFNI=8')                                00404001
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR,                  00405001
//             AMP=('BUFND=4','BUFNI=8')                                00406001
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR,                  00410000
//             AMP=('BUFND=4','BUFNI=8')                                00420000
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR,                  00430000
//             AMP=('BUFND=4','BUFNI=8')                                00440000
//BP13K585 DD DSN=BP13.K585.HARDLUCK,DISP=SHR,                          00430000
//             AMP=('BUFND=4','BUFNI=8')                                00440000
//BP13K587 DD DSN=BP13.K587.HARDLUCK.HIST,DISP=SHR,                     00430000
//             AMP=('BUFND=4','BUFNI=8')                                00440000
//BP13F55A DD  DSN=BP13.F55A.APPLN,DISP=OLD                             00450000
//BP13F55Y DD  DUMMY                                                    00450000
//BP13F55Z DD  DUMMY                                                    00450000
//P13F730A DD  DSN=BP13.F730.MATURERQ.AY0D,DISP=OLD                     00450000
//SYSPRINT DD  SYSOUT=*                                                 00460000
//SYSOUT   DD  SYSOUT=*                                                 00470000
//*---------------------------------------------------------------------00480000
//* SORT REGN-NO                                                        00490000
//* OMIT ALLOC-SCHEME=FTS, HHTY=G                                       00490000
//*---------------------------------------------------------------------00500000
//STEP30   EXEC SORT,COND=(0,NE)                                        00510000
//SORTIN   DD DSN=BP13.F55A.APPLN,DISP=SHR                              00520000
//SORTOUT  DD DSN=&&F55ACY5D,DISP=(NEW,PASS),                           00530000
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1200),                         00540000
//        SPACE=(CYL,(80,20),RLSE)                                      00550000
//SYSIN    DD  *                                                        00560000
  SORT FIELDS=(2,8,A),FORMAT=CH                                         00570000
  OMIT COND=(42,1,CH,EQ,C'G',AND,                                               
             46,3,CH,EQ,C'FTS')                                                 
//*-----------------------------------------------------------------    00580000
//* OUTPUT FILE ON BTO REQUEST FROM E-APPLICATION WITH APPLICATION      00590000
//* PROFILE, SMS DATA, RESALE DATA, LATEST BTO APPLICATION              00600000
//* FORMAT AND ADD IN HEADER FOR MPU. NET BTO APPLICATION               00610000
//*-----------------------------------------------------------------    00620000
//STEP31   EXEC PGM=BP13CY5D,COND=(0,NE)                                00630000
//BP13F55A DD DSN=&&F55ACY5D,DISP=(OLD,PASS)                            00640000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00640000
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13L55A DD DSN=BP13.L55A.APPLN,DISP=OLD                              00650000
//BP13L55B DD DSN=BP13.L55A.APPLN.NEW,DISP=OLD                          00650000
//SYSDBG   DD SYSOUT=*                                                  00660000
//SYSDBOUT DD SYSOUT=*                                                  00670000
//SYSOUT   DD SYSOUT=*                                                  00680000
//*-----------------------------------------------------------------            
//* STEPS FROM BP13AY01                                                         
//* TO EXTRACT BE/WIA                                                           
//* SORT BP13K730 BY K730-CDE-NT1                                               
//*-----------------------------------------------------------------            
//STEP33   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.AY0D,DISP=SHR                              
//SORTOUT  DD DSN=&&F730REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* STEPS FROM BP13AY01                                                         
//* TO EXTRACT BE/WIA                                                           
//* SORT BP13K730 BY K730-CDE-NT1                                               
//*-----------------------------------------------------------------            
//STEP33A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.AY0D,DISP=SHR                              
//SORTOUT  DD DSN=&&F730NRIC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(41,9,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* SORT BY NRIC/ALLO-CAT/DTE-BALLOT                                            
//* INCLUDE BE/BTO SORTLISTED CASES                                             
//*-----------------------------------------------------------------            
//STEP41   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F595HIST,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN   DD  *                                                                 
  SORT FIELDS=(41,9,A,376,3,A,334,6,A,123,8,A),FORMAT=CH                        
   INCLUDE COND=(260,1,CH,NE,C'C',AND,                                          
                 260,1,CH,NE,C' ')                                              
//*-----------------------------------------------------------------            
//* SORT BY NRIC/ALLO-CAT/DTE-BALLOT                                            
//* INCLUDE OTHER QTR FOUND IN BP13F730                                         
//*-----------------------------------------------------------------            
//STEP41A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595HIST,DISP=(OLD,PASS)                                    
//         DD DSN=&&F730HIST,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F595TOTL,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN   DD  *                                                                 
  SORT FIELDS=(41,9,A,376,3,A,334,6,A,123,8,A),FORMAT=CH                        
//*-----------------------------------------------------------------            
//* MATCH BTO AND BALLOT HOSTORY REC, COMPUTE NO OF BE/BTO REQUEST              
//* BP13OUT - SUM UP NUMBER OF PREVIOUS BE/BTO ATTEMPTS                         
//* BP13OUTA - DETAIL RECORD ON PREVIOUS BE/BTO ATTEMPTS                        
//*-----------------------------------------------------------------            
//STEP42   EXEC PGM=BP13CY05,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730NRIC,DISP=(OLD,PASS)                                    
//BP13F595 DD DSN=&&F595TOTL,DISP=(OLD,PASS)                                    
//BP13OUTA DD DSN=BP13.F595.CY05A,DISP=OLD                                      
//BP13OUTB DD DSN=BP13.F595.CY05B,DISP=OLD                                      
//BP13OUTC DD DSN=BP13.F595.CY05C,DISP=OLD                                      
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* APPLICATION PROFILE SUMMART REPORT BY ALLOCATION SCHEME/PPS/MGPS            
//*-----------------------------------------------------------------            
//STEP60   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F55A DD DSN=BP13.F55A.APPLN,DISP=SHR                                      
//P13L733A DD DSN=BP13.L733A.BP13S733,DISP=OLD                                  
//P13L733B DD DSN=BP13.L733B.BP13S733,DISP=OLD                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S733),DISP=SHR                             
//*-----------------------------------------------------------------            
//* PRINT APPLICATION DETAIL SHOW ALLOCATION SCHEME/PPS/MGPS                    
//*-----------------------------------------------------------------            
//STEP61   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F55A DD DSN=BP13.F55A.APPLN,DISP=SHR                                      
//BP13L734 DD DSN=BP13.L734.BP13S734,DISP=OLD                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S734),DISP=SHR                             
//*---------------------------------------------------------------------        
//* SORT IN BP13K515 KEY ORDER                                                  
//*---------------------------------------------------------------------        
//STEP61   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.BE01.F515.MHAMTH,DISP=SHR                               
//         DD  DSN=BP13.BE01.F515.MHAMTH.BACKUP(0),DISP=SHR                     
//SORTOUT  DD  DSN=&&BP13F515,DISP=(,PASS),                                     
//             UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                             
//             DCB=(RECFM=FB,LRECL=580)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(11,9,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* DEFINE DATA RETURN FROM MHA/CDB                                             
//*-----------------------------------------------------------------            
//STEP62 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT    DD  DSN=&&BP13F515,DISP=(OLD,PASS)                                   
//SYSIN    DD  *                                                                
  DEL 'BP13.K515.MHADATA' CL PURGE                                              
  DEF CLUSTER                                          -                        
        (NAME(BP13.K515.MHADATA)                       -                        
        SHR(2,3)                                       -                        
        KEYS(9 10)                                     -                        
        CYL(30 10)                                    -                         
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        SPEED                                          -                        
        RECSZ(580 580)                                 -                        
        FREESPACE(10 10)                               -                        
        CISZ(4096)                                     -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K515.MHADATA.DATA))                 -                        
      INDEX                                            -                        
        (NAME(BP13.K515.MHADATA.INDEX))                                         
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K515.MHADATA)                                            
//*---------------------------------------------------------------------        
//* INCLUDE PPS=Y/P/E                                                           
//*---------------------------------------------------------------------        
//STEP63   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.AY0D,DISP=SHR                              
//SORTOUT  DD DSN=&&F730PPS,DISP=(,PASS),                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(30,20),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(469,1,CH,EQ,C'Y',OR,                                           
                 469,1,CH,EQ,C'P',OR,                                           
                 469,1,CH,EQ,C'E')                                              
//*------------------------------------------------------------------           
//* COMPUTE YEAR-OBTAIN CTIZEN AND YOUNGEST-CHILD AGE                           
//*------------------------------------------------------------------           
//STEP64   EXEC PGM=BP13CZ26,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730PPS,DISP=(OLD,PASS)                                     
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K515 DD DSN=BP13.K515.MHADATA,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13F595 DD DSN=&&F595CZ26,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(30,10),RLSE)                                          
//BP13LZ26 DD DSN=BP13.LZ26.BP13CZ26,DISP=OLD                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT BTO/SBF PPS APPLICATION AGE/YEAR-OBTAIN CITIZENSHIP                   
//*-----------------------------------------------------------------            
//STEP65   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F730 DD DSN=&&F595CZ26,DISP=(OLD,PASS)                                    
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13L055 DD DSN=BP13.L055.BP13S055,DISP=OLD                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S055),DISP=SHR                             
