//BP13A611 JOB (BP13P),'BP13A611',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* JOB NEED TO CLOSE K800 AND K648                                             
//*=================================================================            
//*---------------------------------------------------------------*             
//*     TO UPDATE PREMIUM CODE TAG FOR 3R AND WIA, WIB, WIC       *             
//*---------------------------------------------------------------*             
//* CHGE REQ  DATE        BY   DESCRIPTION                        *             
//* --------  ----        ---  -----------                        *             
//* BP133253  30/01/2008  IL5  NEW                                *             
//* BP135171  10/02/2014  RJE1 TO CATER FOR DB2 UPGRADE                         
//*---------------------------------------------------------------*             
//*  SEND DJDE AHEAD OF THE PRINT DATASET                                       
//*  PRT01                                                                      
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F740,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT    COND=(226,3,CH,EQ,C'   ')                                            
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13C577,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY NRIC SEQUENCE                                                       
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&P13F558B,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27600,LRECL=600,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST, SOC-OCCUPIER FILE                             
//* MATCH NRIC IN SMS FILE, IF MATCH UPDATE AS UPGRADER                         
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13U706,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&P13F558B,DISP=(OLD,PASS)                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=&&P13F558C,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//BP13F559 DD DUMMY                                                             
//BP13L706 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* MATCH NRIC WITH TRANSFER HISTORY ONLY FOR TRF-APPLN-DTE  AFTER              
//* '19970901' OR FOR DIVORCE CASES TRF-APPLN-DATE > 19970709                   
//* AND TRF-SCH-ACC IS NOT THE SAME AS SMS-SCH-ACC                              
//* AS ONE NRIC TRANSFER, ALL FOUR LESSEE WILL BE FOUND IN TRANSFER             
//* BP13.F558.UPGOCCP CONTAINS TRANSFER HISTORY DATA                            
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=BP13C619,COND=(0,NE)                                        
//BB13K510 DD DSN=BB13.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB13K500 DD DSN=BB13.K500.HISTORY,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F558 DD DSN=&&P13F558C,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT IN SCH-ACC-NI ORDER FOR RETRIEVING FLAT TYPE FROM PBF                  
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(101,11,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* FLAT TYPE  IS NOT AVAILABLE IN SMS                                          
//* BASED ON THE SCHEME ACCOUNT FR SMS EXTRACT FLAT TYPE FROM PBF               
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F558 DD DSN=&&F558SORT,DISP=(OLD,PASS)                                    
//BP13OUT  DD DSN=&&F558PBF,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C742) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT BP13F558 IN NRIC ORDER, IF ONE NRIC WITH MULTIPLE SMS REC          
//* PROGRAM WILL SELECT THE BIGGER FLAT TYPE                                    
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558PBF,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F558SMSF,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SELECT THE LEAST PRIORITY IF FOUND TO HAVE MULTIPLE SMS RECORDS             
//* SELECT BIGGER FLAT TYPE, DIRENT PURCHASE OVER OPEN MARKET                   
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13C734,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558SMSF,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558FLAT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT BY NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558FLAT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558RESL,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                            
//* MATCH NRIC IN RESALE FILE, IF MATCH UPDATE AS UPGRADER                      
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13U702,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&F558RESL,DISP=(OLD,PASS)                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//BP13L702 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REQUEST OCCUPIER BY NRIC                                               
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558NRIC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(9,9,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* SORT DEBARMENT FILE BY PRIMARY KEY                                          
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&BP04K010,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(1000,150),RLSE),                       
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,44,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//* MATCH SOC OCCUPIER REC WITH DEBARMENT REC FD IN                             
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=BP13C690,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558NRIC,DISP=(OLD,PASS)                                    
//P04K010  DD DSN=&&BP04K010,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//P13F558B DD DUMMY                                                             
//P13F558C DD DUMMY                                                             
//P13F558D DD DUMMY                                                             
//P13F558E DD DUMMY                                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY REGN NO                                                             
//*-----------------------------------------------------------------            
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558RDB,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
//*=====================================================================        
//* RDB INFO                                                                    
//*=====================================================================        
//*---------------------------------------------------------------------        
//* SPLIT F558 FILE FROM THE OUTPUT OF DETERMINE THE HOUSEHOLD TYPE             
//* IF - HHTYPE='G' OR '3' OR                                                   
//*      (HHTYPE='H' AND FILE-STATUS-SMS OR FILE-STATUS-RSL = 'OM')             
//*          OUTPUT TO BP13F716                                                 
//* ELSE                                                                        
//*      OUTPUT TO BP13F716 TO CHECK RDB                                        
//*---------------------------------------------------------------------        
//* 1)  P13F716A - TO FURTHER CHECK WITH RDB                                    
//* 2)  BP13F716 - INFO ALREADY FOUND IN SMS & RESALE                           
//*---------------------------------------------------------------------        
//STEP16A  EXEC PGM=BP13C788,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558RDB,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=&&P13F716A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT IN NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP16B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F716A,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP16C  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                                   
//P13F716A DD DSN=&&F716Q748,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                                    
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                        
//*---------------------------------------------------------------------        
//STEP16D  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716Q748,DISP=(OLD,PASS)                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=&&F716C754,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT IN REGN NO SEQUENCE                                                
//*---------------------------------------------------------------------        
//STEP16E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//         DD DSN=&&F716C754,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//*  TO DETERMINE SMS FT/STATUS, RSL FT/STATUS, RDB FT/STATUS                   
//*---------------------------------------------------------------------        
//STEP16F   EXEC PGM=BP13C519,COND=(0,NE)                                       
//BP13F716  DD DSN=&&F716REGN,DISP=(OLD,PASS)                                   
//BP13F520  DD DSN=&&BP13F740,DISP=(OLD,PASS)                                   
//P13F520A  DD DSN=&&F520C519,DISP=(NEW,PASS),                                  
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP16G  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520C519,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//*  TO DETERMINE LOAN TAG & PREMIUM CODE                                       
//*---------------------------------------------------------------------        
//STEP17    EXEC PGM=BP13C520,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520SORT,DISP=(OLD,PASS)                                   
//BP13F558  DD DSN=&&F558RDB,DISP=(OLD,PASS)                                    
//BR10K010  DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13F520A  DD DSN=&&BP13F520,DISP=(NEW,PASS),                                  
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//             UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                              
//BP13L520  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT F520 IN REGN NO ORDER                                                  
//*-----------------------------------------------------------------            
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520A,DISP=(,PASS),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* TO EXTRACT THE SUCCESSFUL BALLOTED APPLICANT'S & OCCUPIER INFOR             
//* TO UPDATE THE SOC MASTER AND SOC OCCUPIER FILE                              
//* TO PASS RECORDS TO CFS FOR PRE-ELIGIBILITY CHECK                            
//*---------------------------------------------------------------------        
//STEP19    EXEC PGM=BP13C71M,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520A,DISP=(SHR,DELETE)                                    
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//*    SORT OUT REC WITH FROM BP13K740 (REQUEST STATUS 'S' OR 'R')              
//*--------------------------------------------------------------------         
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13K740,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,DCB=(LRECL=500,RECFM=FB),                                  
//        SPACE=(CYL,(500,250),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(260,1,CH,EQ,C'S',OR,                                           
                 260,1,CH,EQ,C'R')                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//*    SORT OUT REC WITH PREM-CODE = 'SN' FROM BP13K800                         
//*-------------------------------------------------------------------*         
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13K800,DISP=(NEW,PASS),                                   
//         LRECL=50,RECFM=FB,DSORG=PS,DATACLAS=MULTIVOL,                        
//         SPACE=(5,(2,2),RLSE),AVGREC=M,BLKSIZE=0                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,CH,A)                                                       
   OUTREC FIELDS=(4,8,30,1,51,3,81,1,88,9,97,9,525,1,                           
                  526,5,785,6,924,3,963,1,49,2)                                 
   INCLUDE COND=(964,2,CH,EQ,C'SN')                                             
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO GENERATE REPORT ON APPLICATIONS WITH RESALE STATUS = 'SN'                
//*--------------------------------------------------------------------*        
//STEP22     EXEC SAS,OPTIONS='MACRO',COND=(0,NE)                               
//WORK       DD UNIT=SYSDA,SPACE=(CYL,(200,100),,,ROUND)                        
//BP13K740   DD DSN=&&BP13K740,DISP=(SHR,DELETE)                                
//BP13K800   DD DSN=&&BP13K800,DISP=(SHR,DELETE)                                
//BP13L534   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                
//SYSIN      DD DSN=BP13.BATCH.SRC(BP13S534),DISP=SHR                           
/*                                                                              
//*---------------------------------------------------------------------        
