//BP13D22G JOB (BP13P),'BP13D22G',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB01423
//         NOTIFY=CSD0071                                                       
/*JOBPARM SYSAFF=MVS2                                                           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-------------------------------------------------------------------*         
//* HARDLUCK FT2T                                                               
//* CHECK RDB FOR PARENT/CHILD RELATIONSHIP                                     
//*=================================================================            
//*-CHG-NO   BY   ON    DESCRIPTION                                             
//*------------------------------------                                         
//*-BP134205 LSB 110555 ADD BP13K813 FOR BP13CB91                               
//*-BP134247 LSB 110610 ADD PPOS/EC CHECK,CY82 CHK MATURE-TAG                   
//*-BP134255 LSB 110615 CHG BP13CY64 TO BP13CY82 BYPASS MATURE EST              
//*-BP134255 LSB 110711 CHG BP13CB71, DELETE CB90, ICNLUDE REQUEST-S            
//*                     IN BP13CB91, ADD FN/NE/HARDLUCK COUNT                   
//*                     BP13CY89,BYAPSS STATUS=S, BTO COUNT>00                  
//*-BP134598 LSB 250712 CHG COL 470 COL 467 ON UNSUCC COUNT                     
//*-BP134598 LSB 310712 IMPLT CY74 UPDATE HHTY=H FOR PARENT CHILD               
//*-BP134598 LSB 010812 TAKE OUT SY02F001                                       
//*-BP137734 LSB 080419 BTO-CNT >= 01, READ RDB                                 
//*-BP137734 LSB 160419 NO NEED TO COMPUTE PARENT-CHILD, DEL JCL STEPS          
//*-                    DEFINE BP13Q750 BASED ON BP13F749 RECORD                
//*-BP137958 KV6 310719 DELETE INLCUDE COND (COL 487) IN STEP01                 
//*-------------------------------------------------------------------*         
//*=================================================================            
//* READ RDB TO DETERMINE RPARENT/CHILD                                         
//*=================================================================            
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0J,DISP=SHR                         
//SORTOUT  DD DSN=&&F500BLAN,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                                
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(467,2,CH,GE,C'01')                                             
   OUTREC FIELDS=(1,67,C'000',71,104,C' ',176,41,C'000',220,281)                
//*-------------------------------------------------------------------*         
//* SORT BP13K828 OCCUP RECORD                                        *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F825LESS,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(131,1,CH,EQ,C'Y')                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K828 OCCUP RECORD                                        *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F825LESS,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(131,1,CH,EQ,C'Y')                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K828 OCCUP RECORD                                        *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F825LESS,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F825NEW,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(131,1,CH,EQ,C'Y')                                             
//*-------------------------------------------------------------------*         
//* OUTREC BP13F558 FROM BP13K825 REQUEST OCCUPIER FILE               *         
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE               *         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"       *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC  PGM=BP13C059,COND=(0,NE)                                       
//BP13F500 DD  DSN=&&F500BLAN,DISP=(OLD,PASS)                                   
//BP13F825 DD  DSN=&&F825NEW,DISP=(OLD,DELETE)                                  
//BP13F558 DD  DSN=BP13.F558.UPGOCCP.FT2T.AY0J,DISP=OLD                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* OUTREC SOC OCCUPIER TO BP13F716 FORMAT FOR MATCHING RDB BY HDBREF           
//* OUTPUT FOUDN WITH DP FLAT FOUND IN SMS                                      
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.FT2T.AY0J,DISP=SHR                          
//SORTOUT  DD DSN=&&F716OCC,DISP=(NEW,PASS),                                    
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   OUTREC FIELDS=(1,8,9,9,33X,101,11,45X,53,8,236X)                             
//*---------------------------------------------------------------------        
//* EXTRACT OCCUPIER RECORDS FROM RDB DATABASE BASED ON NRIC                    
//* ONE NRIC MAY HAVE A FEW RECORDS WITH DIFF SHC-ACC-NO IN RDB                 
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716OCC,DISP=(OLD,PASS)                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=&&F716Q749,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//BP13L749 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q749) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* DROP DUPLICATE RECORDS                                              05140004
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716Q749,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716UQ49,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,350,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* SORT BY REGN/NRIC                                                   05140004
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716UQ49,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F716.AY0JQ750,DISP=OLD                                   
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//*--------------------------------------------------------------------         
//*  DELETE/DEFINE BP13K716                                                     
//*--------------------------------------------------------------------         
//STEP10    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=BP13.F716.AY0JQ750,DISP=SHR                                   
//SYSIN     DD  *                                                               
          DEL (BP13.K716.BP13AY0J) CL PURGE                                     
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K716.BP13AY0J)              -                  00810000
              CYL(12 8)                           -                     00830000
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K716.BP13AY0J.DATA)         -                  00870000
              KEYS(17 0)                             -                  00880000
              RECSZ(350 350)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K716.BP13AY0J.INDEX)        -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K716.BP13AY0J)                                   00720000
