//BP13D412  JOB (BP13P),'BP13D412',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*********************************************************************         
//* CHG-NO   BY   ON      - DESCRIPTION                                         
//*------------------------------------                                         
//* BP132292 SK   20040204 - NEW JCL                                            
//* BP135293 ESA1 20150121 - TO UPDATE BP13.F936.DEBARLOG.ACCUM                 
//*                        - TO CLEAR BP13.K936.DEBARLOG                        
//* BP135165 ESA1 20150410 - TO REPRO BP13K996 TO BP13F996ACCUM                 
//*                        - TO CLEAR BP13.K996.BE01C830.LOG                    
//* BP135165 ESA1 20150414 - TO REPRO BP13K998 TO BP13F998 ACCUM                
//*                        - TO CLEAR BP13.K998.BE01B837.LOG                    
//* BP13XXXX EL27 20160225 - OLD BP13F996 INSTEAD OF MOD                        
//* BP137196 LSB1 20170511 - REMOVE JOB BP13K936 TO BP13D400                    
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY                                                              
//*-----------------------------------------------------------------            
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAAMB1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAAMB1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*****************************************************************             
//* SORT BY SCH-ACC-NUMBER & TRANS TYPE                                         
//* SORTOUT ONLY 'AB' & 'AP' CASES ONLY                                         
//*****************************************************************             
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BR05.BP13.F150.SLSSOC,DISP=SHR                                
//SORTOUT  DD DSN=&&BR05F150,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(10,20),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(3,11,A,1,2,D),FORMAT=CH                                          
  INCLUDE COND=(1,2,CH,EQ,C'AP',OR,1,2,CH,EQ,C'AB')                             
/*                                                                              
//*****************************************************************             
//* NUM-TRANS = 'AP'                                                            
//* UPDATE SURRENDER DATE, ABORTIVE DATE & SURRENDER BALANCE FROM SLS           
//* NUM-TRANS = 'AB' - UPDATE ABORTIVE DATE                                     
//*****************************************************************             
//STEP02   EXEC PGM=BP13C365,COND=(0,NE)                                        
//BR05F150 DD DSN=&&BR05F150,DISP=(OLD,PASS)                                    
//BP13K690 DD DSN=BP13.K690.AMORTISE,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F690 DD DSN=BP13.F690.AMORTISE.ABORT,DISP=MOD                             
//P13F690A DD DSN=BP13.F690.AMORTISE.REQUEST,DISP=MOD                           
//P13F690B DD DSN=BP13.F690.AMORTISE.REMARK,DISP=MOD                            
//BP13L365 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*****************************************************************             
//* SORT BY SCH-ACC-NUMBER & TRANS TYPE FOR CM TRANS-TYPE                       
//* CM - SURRENDER COMPLETED                                                    
//*****************************************************************             
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F630.SOC,DISP=SHR                                        
//SORTOUT  DD DSN=&&AG07F630,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=130),                              
//            SPACE=(CYL,(10,20),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
  INCLUDE COND=(20,4,CH,EQ,C'SAPS')                                             
/*                                                                              
//*****************************************************************             
//* UPDATE COMPENSATION AMT/DATE-PAID FROM PAYMENT                              
//* NUM-TRANS-ID = 'SAPS' CASES                                                 
//*****************************************************************             
//STEP04   EXEC PGM=BP13C377,COND=(0,NE)                                        
//AG07F630 DD DSN=&&AG07F630,DISP=(OLD,PASS)                                    
//BP13K690 DD DSN=BP13.K690.AMORTISE,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F690 DD DSN=BP13.F690.AMORTISE.VOUCHER,DISP=MOD                           
//P13F690A DD DSN=BP13.F690.AMORTISE.REMARK,DISP=MOD                            
//BP13L377 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*****************************************************************             
//* SORT BY SCH-ACC-NUMBER & TRANS TYPE FOR CM TRANS-TYPE                       
//* CM - SURRENDER COMPLETED                                                    
//*****************************************************************             
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BR05.BP13.F150.SLSSOC,DISP=SHR                                
//SORTOUT  DD DSN=&&F150A,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(10,20),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(3,11,A,1,2,D),FORMAT=CH                                          
  INCLUDE COND=(1,2,CH,EQ,C'CM')                                                
/*                                                                              
//*****************************************************************             
//* TO DELETE COMPLETED CASE, OUTPUT FILE FOR GL INTERFACE                      
//* CDE-TRANS-TYPE = '35' - SA1 (CDE-TYP-ACTUSE = 01)                           
//* CDE-TRANS-TYPE = '36' - SA2 (CDE-TYP-ACTUSE = 02)                           
//*****************************************************************             
//STEP06   EXEC PGM=BP13C368,COND=(0,NE)                                        
//BR05F150 DD DSN=&&F150A,DISP=(OLD,PASS)                                       
//BP13K690 DD DSN=BP13.K690.AMORTISE,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F690 DD DSN=BP13.F690.AMORTISE.COMPLETE,DISP=MOD                          
//BP13F120 DD DSN=BP13.F120.SATRAN.SURR,DISP=MOD                                
//BP13L368 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------         
//* BACKUP SLSSOC FILE                                                          
//*--------------------------------------------------------------------         
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BR05.BP13.F150.SLSSOC,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.BR05.F150.SLSSOC,DISP=MOD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*--------------------------------------------------------------------         
//* EMPTY SLSSOC FILE                                                           
//*--------------------------------------------------------------------         
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BR05.BP13.F150.SLSSOC,DISP=OLD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-----------------------------------------------------------------            
//*  ACCUMULATE DOCUMENT REQUEST IN BP13F996 FILE                               
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K996.BE01C830.LOG,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F996.BE01C830.LOG,DISP=OLD                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  OMIT COND=(1,8,CH,EQ,C'        ')                                             
//*-------------------------------------------------------------------*         
//* TO DEL/DEFINE  SOC DEBAR LOG FILE(BP13.K996.BE01C830.LOG)         *         
//*-------------------------------------------------------------------*         
//STEP12    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=27500,                                            
//             BLKSIZE=0                                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL (BP13.K996.BE01C830.LOG) CL PURGE                                 
          DEF CLUSTER                                -                          
              (NAME(BP13.K996.BE01C830.LOG)           -                         
              CYL(50 10)                            -                           
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K996.BE01C830.LOG.DATA)      -                         
              KEYS(53 0)                             -                          
              RECSZ(27500 27500)                     -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K996.BE01C830.LOG.INDEX)     -                         
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K996.BE01C830.LOG)                                       
//*                                                                             
//*-----------------------------------------------------------------            
//*  ACCUMULATE DOCUMENT REQUEST IN BP13F998 FILE                               
//*-----------------------------------------------------------------            
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K998.BE01B837.LOG,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F998.BE01B837.LOG,DISP=MOD                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  OMIT COND=(1,8,CH,EQ,C'        ')                                             
//*-------------------------------------------------------------------*         
//* TO DEL/DEFINE  SOC DEBAR LOG FILE(BP13.K998.BE01B837.LOG)         *         
//*-------------------------------------------------------------------*         
//STEP14    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=1900,                                             
//             BLKSIZE=0                                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL (BP13.K998.BE01B837.LOG) CL PURGE                                 
          DEF CLUSTER                                -                          
              (NAME(BP13.K998.BE01B837.LOG)           -                         
              CYL(10 10)                            -                           
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K998.BE01B837.LOG.DATA)      -                         
              KEYS(53 0)                             -                          
              RECSZ(1900 1900)                     -                            
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K998.BE01B837.LOG.INDEX)     -                         
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K998.BE01B837.LOG)                                       
//*--------------------------------------------------------------------*        
//*  TO CREATE BACK UP FILES                                                    
//*--------------------------------------------------------------------*        
//STEP15 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F996.BE01C830.LOG,                                      
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F996.LOG.BACKUP(+1),DISP=(NEW,CATLG),                   
//             UNIT=CART,LABEL=(1,SL),                                          
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=27500,RECFM=FB)                    
//INPUT2   DD  DSN=BP13.F998.BE01B837.LOG,                                      
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.F998.LOG.BACKUP(+1),DISP=(NEW,CATLG),                   
//             UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=1900,RECFM=FB)                     
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO CLEAR BP13.F996.BE01C830.LOG                                            
//*--------------------------------------------------------------------*        
//STEP16  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=27500,                                            
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F996.BE01C830.LOG,                                      
//             DISP=SHR,                                                        
//             SPACE=(CYL,(100,20)),                                            
//             RECFM=FB,LRECL=27500,                                            
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//*  TO CLEAR BP13.F998.BE01B837.LOG                                            
//*--------------------------------------------------------------------*        
//STEP17  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=1900,                                             
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F998.BE01B837.LOG,                                      
//             DISP=SHR,                                                        
//             SPACE=(CYL,(100,20)),                                            
//             RECFM=FB,LRECL=1900,                                             
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*                          END OF JOB                               *         
//*--------------------------------------------------------------------         
