//BP13AELD JOB (BP13P),'BP13AELD',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* CHG REF   BY    DATE      DESCRIPTION                                       
//* --------  ----  --------  -----------------------------------------         
//* BP136055  SMR2  08122015  SHORTLIST APPLNS ELIGIBLE FOR ELDERLY             
//* BP136107  SMR2  17022016  ACCEPT PARAMETER FROM JCL IN BP13C525             
//* BP136360  SMR2  07102016  SPLIT SIMULATION (BP13AELS) AND ACTUAL            
//*                           (BP13AELD) ELDERLY SHORTLISTING                   
//* BP138301  AM25  14052020  HARDCOPY REPORTS CONVERSION                       
//* BP139411  AM25  07122022  ADD SYSIN FOR BP13CF7F                            
//**********************************************************************        
//* VERIFY FILES BEFORE JOB RUN                                                 
//**********************************************************************        
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG/FTS BEFORE SHORTLISTING            
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=BP13C558,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13L558 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLING FOR ELDERLY SCHEME                             
//* REMAINING ETHNIC AND HH QUOTAS WILL BE USED FOR PUBLIC APPLICANTS           
//*---------------------------------------------------------------------        
//STEP23   EXEC PGM=BP13U546,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13F740 DD DSN=BP13.F740.MATUREBA.PAELD,DISP=SHR                             
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L546 DD SYSOUT=8,DEST=IOM8                                                
//P13L546A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY REGN                                                                
//* INCLUDE ONLY APPLICATIONS UNDER ELDERLY SCHEME                              
//*---------------------------------------------------------------------        
//STEP24A EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F520REGN,DISP=(NEW,PASS),                                    
//           UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                          
//           DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                             
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,211,2,CH,EQ,C'2F',AND,                 
                 (210,1,CH,EQ,C'F',OR,210,1,CH,EQ,C'S'))                        
//*---------------------------------------------------------------------        
//* SORT BY REGN ON BALLOT FILE TO GET RESULT                                   
//*---------------------------------------------------------------------        
//STEP24B EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                   
//           AMP=('BUFND=23')                                                   
//SORTOUT DD DSN=&&F520BALT,DISP=(NEW,PASS),                                    
//           UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                          
//           DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                             
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OMIT COND=(245,1,CH,EQ,C'P',OR,245,1,CH,EQ,C'C')                            
//*---------------------------------------------------------------------        
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------------        
//STEP24C  EXEC PGM=BP13C817,COND=(0,NE)                                        
//BP13F510 DD DSN=&&F520REGN,DISP=(OLD,DELETE)                                  
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,DELETE)                                  
//P13UNSUC DD DUMMY                                                             
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT SUCC CASES BY NEW TOWN, FLAT TYPE, REGNO                           
//*---------------------------------------------------------------------        
//STEP24D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13SUCC,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*---------------------------------------------------------------------        
//* PRINT REPORT ON SUCC FOR THIS ROUND BY ALLOC-SCHEME                         
//*---------------------------------------------------------------------        
//STEP24E  EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
ER1                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS UNDER ELDERLY SCHEME                                   
//*---------------------------------------------------------------------        
//STEP25  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=BP13.F740.MATUREBA.PAELD.SUCC,DISP=MOD                         
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* PRINT REPORT ON SUCC ELDERLY APPLICANTS                                     
//*---------------------------------------------------------------------        
//STEP26   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,DELETE)                                  
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*---------------------------------------------------------------------        
//* SORT OUT 2F FLATS TO PRINT FLAT SUPPLY AFTER SHORTLISTING                   
//*---------------------------------------------------------------------        
//STEP27A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010RM2F,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'2F')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER SHORTLISTING                      
//*---------------------------------------------------------------------        
//STEP27B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010RM2F,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG/FTS AFTER SHORTLISTING             
//*---------------------------------------------------------------------        
//STEP28   EXEC PGM=BP13C558,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13L558 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY NEW TOWN, FLAT TYPE                                                 
//*---------------------------------------------------------------------        
//STEP29A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F010,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,5,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* TRANSFER ELDERLY SHORTLISTED COUNT TO PA (COHORT = 'PA')                    
//* ADD REG-ELDER1/2/3 TO REG-PA1/2/3                                           
//*---------------------------------------------------------------------        
//STEP29B  EXEC PGM=BP13CF7E,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13F010 DD DSN=&&BP13F010,DISP=(OLD,DELETE)                                  
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 2F FLATS TO PRINT FLAT SUPPLY AFTER SHORTLISTING                   
//*---------------------------------------------------------------------        
//STEP30A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010RM2F,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'2F')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER SHORTLISTING                      
//*---------------------------------------------------------------------        
//STEP30B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010RM2F,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* COMPUTE NO OF UNITS SET ASIDE FOR NHH/UPG/FTS FOR PRIORITY SCHEME           
//* COMPUTE FOR PA SCHEME                                                       
//*---------------------------------------------------------------------        
//STEP31   EXEC PGM=BP13CF7F,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG/FTS AFTER SHORTLISTING             
//*---------------------------------------------------------------------        
//STEP32   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13L552 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* FOR MATURE NT                                                               
//* SORT UNSUCC PRIORITY, SAS AND PUBLIC CASES FOR PA PIGEONHOLING              
//*---------------------------------------------------------------------        
//STEP33   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.PA,DISP=OLD                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,213,3,CH,NE,C'GRO',AND,                 
                 245,1,CH,EQ,C' ')                                              
//*---------------------------------------------------------------------        
//*                      END BP13AELD                                           
//*---------------------------------------------------------------------        
