//BP13AJBB JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*  PIGEONHOLING OF PARTIAL SUCCESSFUL JB-LINKS TO GET JB                      
//*  FLAT QUOTA                                                                 
//* ----------------------------------------------------------                  
//* CHG-NO   BY   ON     DESCRIPTION                                            
//* ----------------------------------------------------------                  
//*BP130642 LSB 990525 - SORT IN REGN-NO BF BP13C817                            
//*BP130721 LSB 990812 - STEO LREC=300                                          
//*BP130652 SRA 991012 - EXPAND F500,F510,F520,K520 RECL FROM                   
//*                      300 TO 500                                             
//*BP130871 SSS 000608 - LISTING TO EAALSS                                      
//*BP132317 ROM 030315 - CHANGE BP13U719 TO BP13U732                            
//*BP132412 CKK 031006 - READ JB CASES FROM K520 DIRECTLY                       
//*BP132596 PGS 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E             
//*BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                                
//*============================================================*                
//* STEP 00 - 01 = LASER PRINTER JCL                           *                
//* STEP 02 - 03 = BACKUP TENDER AND BALLOT FILE               *                
//* STEP 05 - 08 = PRINT FLAT SUPPLY REPORT BF PIGEONHOLING    *                
//* STEP 09 - 10 = PROCESS PIGEONHOLING(BP13U732 PUBLIC ONLY)  *                
//* STEP 11 - 14 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING    *                
//* STEP 15 - 16 = PRINT SUMMARY RESULT OF REQUEST BP13L522    *                
//* STEP 17      = ACCUM BP13F525                              *                
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN                                            
//******************************************************************            
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K520.BALLOT,DISP=OLD                                     
//INPUT3   DD DSN=BP13.K710.SUPPLY,DISP=OLD                                     
//INPUT4   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT02 : COPIES = 2                                                         
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.JB,DISP=OLD                                  
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.JB,DISP=OLD                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F520.BALLOT.JB,DISP=OLD                                  
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP04   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT  DD  DSN=&&P13K010N,DISP=(,PASS),                                     
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP05   EXEC  PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//BP13F010 DD  DSN=&&P13K010N,DISP=(OLD,PASS)                                   
//BP13F713 DD  DSN=BP13.F713.PIGEON.PA,DISP=SHR                                 
//BP13L524 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BY SEQ-NO/JB-PARENT-REGN/NUM-REGN ORDER                                
//*-----------------------------------------------------------------            
//STEP06   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K520.BALLOT,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD  DSN=&&BP13F520,DISP=(NEW,PASS),                                  
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(50,20),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,28,A,123,8,A),FORMAT=CH                                      
    INCLUDE COND=(213,2,CH,EQ,C'JB')                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* TO PROCESS THE PIGEON-HOLDING FOR JB CASES, THE PROGRAM WILL                
//* ONLY ALLOCATE JB QUOTA TO JB PREVIOUSLY UNSUCC IN PA PIGEONHOLING           
//*-----------------------------------------------------------------            
//STEP07   EXEC  PGM=BP13U732,COND=(0,NE)                                       
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                  
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13F520 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L732 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L732A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L732B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*-----------------------------------------------------------------            
//STEP08   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT  DD  DSN=&&K010AFN,DISP=(,PASS),                                      
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
        4,2,CH,EQ,C'4 ',OR,                                                     
        4,2,CH,EQ,C'5 ')                                                        
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP09   EXEC  PGM=BP13C524,COND=(0,NE)                                       
//BP13F010 DD  DSN=&&K010AFN,DISP=(OLD,PASS)                                    
//BP13F713 DD  DSN=BP13.F713.PIGEON.PA,DISP=SHR                                 
//BP13L524 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES FOR MATCHING BP13C817                  
//*-----------------------------------------------------------------            
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT5  DD DSN=&&F520BALT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(130,20),RLSE),                                        
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
//*-----------------------------------------------------------------            
//* SORT BY REGN-NO ORDER                                                       
//*-----------------------------------------------------------------            
//STEP10A  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K520.BALLOT,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD  DSN=&&F520AJBB,DISP=(,PASS),                                     
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(8,3),RLSE),                                          
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(213,2,CH,EQ,C'JB')                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*-----------------------------------------------------------------            
//STEP11   EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD  DSN=&&F520AJBB,DISP=(OLD,PASS)                                   
//BP13F520 DD  DSN=&&F520BALT,DISP=(OLD,PASS)                                   
//P13UNSUC DD  DSN=&&P13UNSUC,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(50,10),RLSE),                                        
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//P13SUCC  DD  DSN=&&P13SUCC,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(50,10),RLSE),                                        
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//SYSOUT   DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSDBOUT DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT SUMMARY BALLOT RESULT BY ZONE/FT/CAT                                  
//*-----------------------------------------------------------------            
//STEP12   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                  
//P13FSUCC DD  DSN=&&P13SUCC,DISP=(OLD,PASS)                                    
//P13FUNSC DD  DSN=&&P13UNSUC,DISP=(OLD,PASS)                                   
//PRIOFMT  DD  DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT42F001 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                            
//*                                                                             
//*-----------------------------------------------------------------            
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*-----------------------------------------------------------------            
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//OUTPUT1  DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT LAST SUCC REGN-NO IN NT/FT ORDER                                       
//*-----------------------------------------------------------------            
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F525,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=20000)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,4,2,A,53,3,A,11,1,A),FORMAT=CH                            
//*-----------------------------------------------------------------            
//* PRINT REPORT TO SHOW THE LAST SUCC REGN-NO HIT MAX ZONE/ALLOC/CAT           
//*-----------------------------------------------------------------            
//STEP15    EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                 
//BP13K525  DD  DSN=&&BP13F525,DISP=(OLD,PASS)                                  
//FT18F001  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S502),DISP=SHR                            
//******************************************************************            
//* SORT BY REGN FOR SUCCESSFUL JB CASES                                        
//******************************************************************            
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520JB,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(LRECL=500,RECFM=FB),DSORG=PS,                     
//            SPACE=(CYL,(130,20),RLSE)                                         
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,NE,C'   ',AND,                                        
                 213,2,CH,EQ,C'JB')                                             
//******************************************************************            
//* SORT BY REGN FOR JB SUCCESSFUL CASES USING PA QUOTA                         
//******************************************************************            
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F500PA,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,DCB=(LRECL=500,RECFM=FB),DSORG=PS,                     
//            SPACE=(CYL,(130,20),RLSE)                                         
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,NE,C'   ',AND,                                        
                 213,2,CH,EQ,C'JB')                                             
//*---------------------------------------------------------------------        
//* TO CREATE THE TEMP BALLOT FILE FOR SUCC JB BASED ON REGN NO                 
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.BLANK.CHAR500,DISP=SHR                                   
//         DD DSN=&&F500PA,DISP=(OLD,PASS)                                      
//SYSIN    DD *                                                                 
         DEF CL (NAME(BP13.K520.BALLOT.BJB)      -                              
                 CYL(25 5)                       -                              
                 UNIQUE                          -                              
                 SPEED                           -                              
                 IMBED                           -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K520.BALLOT.BJB.DATA) -                             
                 KEYS(8 122)                     -                              
                 RECSZ(500 500)                  -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K520.BALLOT.BJB)                                      
//*---------------------------------------------------------------------        
//* OUTPUT THE BKNG REC FOR COMPUTING ALLOCN SUMMARY RESULT                     
//*---------------------------------------------------------------------        
//STEP19    EXEC PGM=BP13C885,COND=(0,NE)                                       
//BP13F500  DD DSN=&&F520JB,DISP=(OLD,PASS)                                     
//BP13K520  DD DSN=BP13.K520.BALLOT.BJB,DISP=SHR                                
//P13F500O  DD DSN=&&BP13FJB,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,DCB=(LRECL=500,RECFM=FB),DSORG=PS,                    
//             SPACE=(CYL,(130,20),RLSE)                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* PRINT SUCC CASES FOR PURE JB CASES ONLY.                                    
//*--------------------------------------------------------------------         
//STEP20   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                  
//BP13F520 DD  DSN=&&BP13FJB,DISP=(OLD,PASS)                                    
//PRIOFMT  DD  DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT18F001 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S739),DISP=SHR                            
//*---------------------------------------------------------------------        
//* TO DELETE THE TEMP BALLOT FILE FOR SUCC JB BASED ON REGN NO                 
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K520.BALLOT.BJB) CL PURGE                                    
//*-----------------------------------------------------------------            
//* END BP13AJBB                                                                
//*-----------------------------------------------------------------            
