//BP13W460  JOB (BP13P),'BP13W460',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*                                                                             
//*===================================================================*         
//*  FREQUENCY  : WEEKLY SATURDAY                                     *         
//*  DEPENDENCY : RUN AFTER BP04D02                                   *         
//*-------------------------------------------------------------------*         
//*  CHGE REQ  BY    DATE     REMARKS                                 *         
//*  -------- ----   ------   -----------------------------------     *         
//*  BP130998  CLT   190501   NEW JOB                                 *         
//*  BP132486  MTD   270204   ADD PGM BP13C389                        *         
//*  BP132486  MTD   120304   CHANGE BP13K437 TO BP13K431             *         
//*  BP133522  PCL3  040509   ADD PGM BP13CD24, BP13CD25 & BP13CD26   *         
//*  BP133522  CT2   120609   ADD PGM BP13CD29                        *         
//*  BP133522  CT2   230609   READ P04K010 FOR DEBAR CDE FOR BP13CD26*          
//*  BP134250  LJL   060611   TO REMOVE THE PRINTING OF BP13L602      *         
//*  BP13XXXX  ZDD1  160113   TO ADD BP13CF60                         *         
//*===================================================================*         
//*                                                                             
//*-------------------------------------------------------------------*         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                  *         
//*  PRT01 : COPIES = 1 ** (SALES - AGM TEAM)                         *         
//*-------------------------------------------------------------------*         
//*                                                                             
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                  *         
//*  PRT02 : COPIES = 1 ** (SALES - EC TEAM)                          *         
//*-------------------------------------------------------------------*         
//*                                                                             
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALEC1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALEC1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//*  PRINT DEBARMENT EXCEPTION REPORT - REMOVE PRINTING OF BP13L602  *          
//*-------------------------------------------------------------------*         
//*--------------------------------------------------------------------         
//* EMPTY ACCUMULATED SO TRANS FILE                                             
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT8   DD DUMMY                                                             
//OUTPUT8  DD DSN=BP13.F410.ACCUMSO,DISP=OLD                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT8)  OUTFILE(OUTPUT8)                                     
//*                                                                             
//*--------------------------------------------------------------------         
//* SORT BP13K435 BY KEY LOCATION                                               
//*--------------------------------------------------------------------         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K435.KEY.BORROW,DISP=SHR                                 
//SORTOUT  DD DSN=&&BP13F435,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(RECFM=FB,LRECL=250)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(32,4,A),FORMAT=CH                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* BP13C389 - PRINT WEEKLY REPORT ON KEYS BORROWED                             
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=BP13C389,COND=(0,NE)                                        
//BP13F435 DD DSN=&&BP13F435,DISP=(OLD,DELETE)                                  
//BP13K431 DD DSN=BP13.K431.BORROWER.CODE,DISP=SHR,                             
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13L389 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------*        
//* SORT BP13FD00 BY PROJECT, HSGNT-ELIG & REGN NO                     *        
//*--------------------------------------------------------------------*        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FD00,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1600),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(22,3,A,81,1,A,1,8,A),FORMAT=CH                                   
  OMIT COND=(22,3,CH,EQ,C'D01')                                                 
//*--------------------------------------------------------------------*        
//* SORT BP13F800 BY REGN FOR ALL DBSS CANCELED CASES                  *        
//*--------------------------------------------------------------------*        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,EQ,C'C',AND,4,1,CH,EQ,C'5')                              
//*--------------------------------------------------------------------*        
//* PRINT DBSS CASES WITH GRANT APPROVAL DATE (BP13CD25)               *        
//*--------------------------------------------------------------------*        
//STEP08   EXEC PGM=BP13CD25,COND=(0,NE)                                        
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                                   
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K425 DD DSN=BP13.K425.CTRLCNT,DISP=SHR                                    
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR                                      
//BP13LD25 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------*        
//*  PRINT REPORT FOR DBSS HOUSING GRANT CANCELLED CASES (BP13CD26)    *        
//*--------------------------------------------------------------------*        
//STEP09   EXEC PGM=BP13CD26,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                                   
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR                                    
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR                                      
//BP13LD26 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT BP13KD00 FOR APPROVED GRANT CASES WITH EFF TRANSFER DATE               
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SORTOUT  DD DSN=&&P13FD00,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1600),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=((1485,8,CH,NE,C'        '),AND,                                 
               (98,8,CH,NE,C'        '),AND,                                    
               (20,1,CH,EQ,C'1'))                                               
//*---------------------------------------------------------------------        
//* SORT BP13KD03 FOR APPROVED GRANT CASES WITH EFF TRANSFER DATE               
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD03.DBSHIST,DISP=SHR                                    
//SORTOUT  DD DSN=&&P13FD03,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1600),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=((1485,8,CH,NE,C'        '),AND,                                 
               (98,8,CH,NE,C'        '),AND,                                    
               (20,1,CH,EQ,C'1'))                                               
//*---------------------------------------------------------------------        
//* MERGE BP13FD00 AND BP13FD03 SORTED BY REGN NO                               
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13FD00,DISP=(OLD,PASS)                                     
//         DD DSN=&&P13FD03,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&P13FD00A,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1600),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*--------------------------------------------------------------------*        
//* PRINT EC CASES WITH GRANT APPROVAL DATE (BP13CF60)                *         
//*--------------------------------------------------------------------*        
//STEP14   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K425 DD DSN=BP13.K425.CTRLCNT,DISP=SHR                                    
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR                                      
//P13LF60A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13LF60B DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CF60) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
