//BP13D235 JOB (BP13P),'BP13D235',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* THIS WILL GENERATE HLE REPORT AND SEND EMAIL TO CRM                         
//*                                                                             
//* SEND SALES CASES TO HDB FLAT PORTAL FOR WATCHLIST NOTIFICATION              
//* 29 DEC 2023 - MOVE FTP TO BP28 INTO BP13D236                                
//* 02 FEB 2024 - MRR5 - OMIT HFE CASES                                         
//*=================================================================            
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD  DSN=&&BP13F80A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(800,800),RLSE),                                      
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,CH,A)                                                       
   INCLUDE COND=(1,1,CH,NE,C'C',AND,                                            
                88,9,CH,NE,C'         ',AND,                                    
                1258,9,CH,EQ,C'         ',AND,                                  
                155,11,CH,NE,C'           ')                                    
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F80A,DISP=(OLD,DELETE)                                  
//SORTOUT  DD  DSN=&&BP13F80B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(800,800),RLSE),                                      
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,CH,A)                                                       
   OMIT COND=(30,2,CH,EQ,C'2F',AND,                                             
              1573,2,CH,LT,C'99',AND,                                           
              57,3,CH,NE,C'FSH')                                                
//*---------------------------------------------------------------------        
//* OMIT HFE CASES (DTE BALLOT >= 202305 AND NOT SER)                           
//*---------------------------------------------------------------------        
//STEP02B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F80B,DISP=(OLD,DELETE)                                  
//SORTOUT  DD  DSN=&&BP13F80C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(800,800),RLSE),                                      
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,CH,A)                                                       
   OMIT COND=(785,6,CH,GE,C'202305',AND,                                        
              924,2,CH,NE,C'SER',AND,                                           
              1148,1,CH,NE,C'P',AND,                                            
              1148,1,CH,NE,C'Y')                                                
//*---------------------------------------------------------------------        
//* MERGE BP13F800 AND BP27K800 TO CREATE INPUT FOR HLE RPT PROGRAM             
//*---------------------------------------------------------------------        
//STEP03A EXEC SORT,COND=(0,NE)                                                 
//SORTJNF1 DD DSN=&&BP13F80C,DISP=(SHR,PASS)                                    
//SORTJNF2 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//SORTOUT  DD  DSN=&&BP27F80C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(800,800),RLSE),                                      
//             DCB=(RECFM=FB,LRECL=1200,BLKSIZE=0)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   JOINKEYS FILES=F1,FIELDS=(88,9,A)                                            
   JOINKEYS FILES=F2,FIELDS=(20,9,A)                                            
   REFORMAT FIELDS=(F2:1,1200)                                                  
//*---------------------------------------------------------------------        
//STEP03B EXEC SORT,COND=(0,NE)                                                 
//SORTJNF1 DD DSN=&&BP13F80C,DISP=(SHR,PASS)                                    
//SORTJNF2 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP27F80C,DISP=(MOD,PASS)                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   JOINKEYS FILES=F1,FIELDS=(88,9,A)                                            
   JOINKEYS FILES=F2,FIELDS=(29,9,A)                                            
   REFORMAT FIELDS=(F2:1,1200)                                                  
//*---------------------------------------------------------------------        
//STEP03C EXEC SORT,COND=(0,NE)                                                 
//SORTJNF1 DD DSN=&&BP13F80C,DISP=(SHR,PASS)                                    
//SORTJNF2 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP27F80C,DISP=(MOD,PASS)                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   JOINKEYS FILES=F1,FIELDS=(88,9,A)                                            
   JOINKEYS FILES=F2,FIELDS=(38,9,A)                                            
   REFORMAT FIELDS=(F2:1,1200)                                                  
//*---------------------------------------------------------------------        
//STEP03D EXEC SORT,COND=(0,NE)                                                 
//SORTJNF1 DD DSN=&&BP13F80C,DISP=(SHR,PASS)                                    
//SORTJNF2 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP27F80C,DISP=(MOD,PASS)                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   JOINKEYS FILES=F1,FIELDS=(88,9,A)                                            
   JOINKEYS FILES=F2,FIELDS=(47,9,A)                                            
   REFORMAT FIELDS=(F2:1,1200)                                                  
//*---------------------------------------------------------------------        
//STEP3E   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP27F80C,DISP=(SHR,PASS)                                    
//SORTOUT  DD  DSN=&&BP27F80D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(800,800),RLSE),                                      
//             DCB=(RECFM=FB,LRECL=1200,BLKSIZE=0)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,CH,A)                                                       
   OMIT COND=(11,3,CH,EQ,C'PRJ',OR,11,3,CH,EQ,C'REJ',OR,                        
              11,3,CH,EQ,C'PCN',OR,11,3,CH,EQ,C'CAN')                           
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C27K,COND=(0,NE)                                        
//BP27F800 DD DSN=&&BP27F80D,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//            AMP=('BUFND=23')                                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13F00A DD  DSN=&&BP13F00A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(400,400),RLSE),                                      
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//BP13F00B DD  DSN=&&BP13F00B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(400,400),RLSE),                                      
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//BP13F00C DD  DSN=&&BP13F00C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(400,400),RLSE),                                      
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//BP13F00D DD  DSN=&&BP13F00D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(400,400),RLSE),                                      
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO CRM                                                
//*-----------------------------------------------------------------            
//STEP5A   EXEC SENDMAIL                                                        
//INPUT    DD DSN=&&BP13F00A,DISP=(SHR,PASS)                                    
//*                                                                             
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO CRM                                                
//*-----------------------------------------------------------------            
//STEP5B   EXEC SENDMAIL                                                        
//INPUT    DD DSN=&&BP13F00B,DISP=(SHR,PASS)                                    
//*                                                                             
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO CRM                                                
//*-----------------------------------------------------------------            
//STEP5C   EXEC SENDMAIL                                                        
//INPUT    DD DSN=&&BP13F00C,DISP=(SHR,PASS)                                    
//*                                                                             
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO CRM                                                
//*-----------------------------------------------------------------            
//STEP5D   EXEC SENDMAIL                                                        
//INPUT    DD DSN=&&BP13F00D,DISP=(SHR,PASS)                                    
//*                                                                             
//*---------------------------------------------------------------------        
//* BACKUP ALL GENERATED REPORTS TO BP13.HLE.F00E.RPT                           
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT01  DD DSN=&&BP13F00A,DISP=(SHR,PASS)                                    
//         DD DSN=&&BP13F00B,DISP=(SHR,PASS)                                    
//         DD DSN=&&BP13F00C,DISP=(SHR,PASS)                                    
//         DD DSN=&&BP13F00D,DISP=(SHR,PASS)                                    
//OUTPUT01 DD DSN=BP13.HLE.F00E.RPT,DISP=SHR                                    
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT01)  OUTFILE(OUTPUT01)                                     
//******************************************************************            
//*=================================================================            
//* END JOB BP13D235                                                            
//*=================================================================            
