//BP13ACKC JOB (BP13P),'BP13ACKC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*                                                                             
//PROCACKC PROC  RND=00                                                         
//**********************************************************************        
//**********************************************************************        
//* 1) SHORTLISTING FOR SALE OF BALANCE FLATS APPLICATIONS                      
//* 2) ROUNDS (10 - 15)                                                         
//*    - 1ST ROUND                                                              
//*      IMPOSE RATIO 90:10 / NOT SUBJECT TO ETHNIC QUOTA                       
//**********************************************************************        
//* CHG-NO   BY  ON        DESCRIPTION                                          
//*---------------------------------------------------------------------        
//* BP133364 IL5 17072008  ROUNDS 01-05 OF BALLOTING                            
//* BP133504 IL5 21012009  REPLACE BP13U532 WITH BP13U540                       
//* BP133561 IL5 28042009  TO SORT DATA SETS BY REGN BEFORE RUNNING             
//*                        SAS PROGRAM BP13C817                                 
//* BP134861 EAA1 130422- EXPAND BP13K010 TO 600                                
//* BP135458 SMR2 04082014 EXPAND BP13K712 TO 350                               
//*---------------------------------------------------------------------        
//*********************************************************************         
//*    TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                
//*    DATASET, SINGLE COPY                                                     
//*--------------------------------------------------------------------         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD  DSN=BP13.BATCH.PARM(BP13SY09),DISP=SHR                           
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*---------------------------------------------------------------------        
//* EXTRACT CASES WHICH HAVE NOT BEEN SHORTLISTED                               
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.ARE2.R&RND,DISP=OLD,                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=29000),                           
//            SPACE=(CYL,(10,5))                                                
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY26),DISP=SHR                            
//*                                                                             
//*--------------------------------------------------------------------------   
//* SORT                                                                -----   
//*--------------------------------------------------------------------------   
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F010.TENDER.ARE2,DISP=SHR                                
//SORTOUT  DD DSN=&&TEMP1,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(TRK,(10,5),RLSE)                                           
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY30),DISP=SHR                            
//*                                                                             
//*---------------------------------------------------------------------        
//* TO DELETE & REDEFINE BP13K010                                       00020004
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                  00030000
//SYSPRINT DD SYSOUT=*                                                  00040000
//INPUT    DD DSN=&&TEMP1,DISP=(OLD,DELETE)                                     
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY31),DISP=SHR                    00050000
//*                                                                             
//*-------------------------------------------------------------------*         
//* SET CAT1, CAT2, CAT3 QUOTA FOR PA TO NO OF FLATS AVAILABLE                  
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13C71P,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//* CREATE/DEFINE BP13K712 FLAT NHH/UPG FILE                                    
//*--------------------------------------------------------------------         
//STEP06    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR350,DISP=SHR                                  
//SYSIN     DD DSN=BP13.BATCH.PARM(BP13SY28),DISP=SHR                           
//*                                                                             
//*---------------------------------------------------------------------        
//* EXTRACT CASES WHICH HAVE NOT BEEN SHORTLISTED                               
//* (SORT BY NT, FLAT TYPE, ALLOC SCH)                                          
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F740,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=29000),                           
//            SPACE=(CYL,(10,5))                                                
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY36),DISP=SHR                            
//*                                                                             
//*---------------------------------------------------------------------        
//* COMPUTE NO OF TOTAL REQUESTS FOR NHH/UPG FOR PA ONLY                        
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13C54A,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13F520 DD DSN=&&BP13F740,DISP=(OLD,DELETE)                                  
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* COMPUTE NO OF UNITS SET ASIDE FOR NHH/UPG FOR PRIORITY SCHEME               
//* COMPUTE FOR PA SCHEME                                                       
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C545,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F740.MATUREBA.ARE2.R&RND,DISP=SHR                        
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY29),DISP=SHR                            
//*                                                                     -----   
//*=====================================================================        
//*  END OF BP13AREX JOB STEPS -- START OF  BP13APP1                            
//*=====================================================================        
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.PA&RND,DISP=OLD                              
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.PA&RND,DISP=OLD                            
//INPUT3   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F740.MATUREBA.PA&RND,DISP=OLD                            
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY10),DISP=SHR                            
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE ALL UNSUCCESSFUL APPLICATIONS                                       
//*-----------------------------------------------------------------            
//STEP13  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F520PUB,DISP=(,PASS),                                        
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD DSN=BP13.BATCH.PARM(BP13SY34),DISP=SHR                             
//*                                                                             
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR PUBLIC   CASES, THE PROGRAM WILL          
//* ONLY ALLOCATE THE PUBLIC QUOTA AND PRIORITY QUOTA ON CCC, SFF, MTF          
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13U538,COND=(0,NE)                                        
//STEPLIB   DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                           
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13K010  DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//BP13F740  DD DSN=&&F520PUB,DISP=(OLD,DELETE)                                  
//BP13K740  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K712  DD DSN=BP13.K712.FLATNHUG,DISP=SHR,                                 
//             AMP=('BUFND=23')                                                 
//BP13F525  DD DSN=BP13.F525.APPL,DISP=OLD                                      
//BP13L538  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//P13L538A  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG AFTER PIGEONHOLING                 
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13L552 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//*  SORT VSAM FILE TO SEQUENTIAL FILES FOR MATCHING BP13C817                   
//*--------------------------------------------------------------------         
//STEP13A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520BALT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(130,20),RLSE),                             
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY37),DISP=SHR                            
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE ALL UNSUCCESSFUL APPLICATIONS                                       
//*-----------------------------------------------------------------            
//STEP13B EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F520PUB,DISP=(,PASS),                                        
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD DSN=BP13.BATCH.PARM(BP13SY37),DISP=SHR                             
//*                                                                             
//*---------------------------------------------------------------------        
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------------        
//STEP14   EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520PUB,DISP=(OLD,DELETE)                                   
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,DELETE)                                  
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*=====================================================================        
//*  END OF BP13APP1 JOB STEPS --                                               
//*=====================================================================        
//*=====================================================================        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY35),DISP=SHR                            
//*                                                                             
//*------------------------------------------------------------------           
//* PRINTS SUMMARY LIST OF THE MATURERQ FILE OF ELIGIBLE                        
//* APPLICATIONS (BEFORE COMMENCEMENT OF SHORTLISTING)                          
//*------------------------------------------------------------------           
//STEP17   EXEC PGM=BP13C525,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L525C DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=====================================================================        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP16A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13SUCC,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY35),DISP=SHR                            
//*                                                                             
//*------------------------------------------------------------------           
//* PRINTS SUMMARY LIST OF THE MATURERQ FILE OF ELIGIBLE                        
//* APPLICATIONS (BEFORE COMMENCEMENT OF SHORTLISTING)                          
//*------------------------------------------------------------------           
//STEP17A  EXEC PGM=BP13C525,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//BP13F730 DD DSN=&&F740SUCC,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE ADJUST PA FLAT             
//*-----------------------------------------------------------------            
//STEP18A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K0104RMB,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY32),DISP=SHR                            
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE ADJUST PA FLAT SUPPLY            
//*-----------------------------------------------------------------            
//STEP18B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K0104RMB,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT OUT 1,2 FLATS TO PRINT FLAT SUPPLY BEFORE ADJUST PA FLAT               
//*-----------------------------------------------------------------            
//STEP18C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K0104RM2,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD DSN=BP13.BATCH.PARM(BP13SY33),DISP=SHR                            
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE ADJUST PA FLAT SUPPLY            
//*-----------------------------------------------------------------            
//STEP18D   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K0104RM2,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------00000030
//* UPDATE CDE-COHORT FOR EACH CORRESPONDING ROUND                      00000030
//*---------------------------------------------------------------------00000030
//STEP19   EXEC  PGM=BP13C71H,COND=(0,NE)                               00002680
//BP13F713 DD DSN=BP13.F713.PIGEON.COHORT&RND,DISP=SHR                          
//BP13F740 DD DSN=BP13.F740.MATUREBA.ARE2.R&RND,DISP=SHR                        
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//*=====================================================================        
//*  END OF ONE ROUND                                                           
//*=====================================================================        
//         PEND                                                                 
//*                                                                             
//RND01    EXEC  PROCACKC,COND=(0,NE),                                          
//             RND='34'                                                         
//RND02    EXEC  PROCACKC,COND=(0,NE),                                          
//             RND='35'                                                         
//RND03    EXEC  PROCACKC,COND=(0,NE),                                          
//             RND='36'                                                         
//RND04    EXEC  PROCACKC,COND=(0,NE),                                          
//             RND='37'                                                         
//RND05    EXEC  PROCACKC,COND=(0,NE),                                          
//             RND='38'                                                         
//RND06    EXEC  PROCACKC,COND=(0,NE),                                          
//             RND='39'                                                         
