//BP13RP03 JOB (BP13P),'BP13DPRE',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB01423
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*===================================================================*         
//* JOB TO KEEP PRE-E INFOR DATA : SMS, RSL, TRF, SLS, MAMS                     
//* FILE : BP13K558                                                             
//* JOB TO KEEP PRE-E INFOR DATA : RDB, PIDB                                    
//* FILE : BP13K716                                                             
//*===================================================================*         
//*-------------------------------------------------------------                
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP137208 YCH2 20180212   TO INCLUDE PLAN BP13PCC                            
//*                                                                             
//*---------------------------------------------------------------------        
//* OUTREC SOC OCCUPIER TO BP13F716 FORMAT FOR MATCHING RDB BY HDBREF           
//* OUTPUT FOUDN WITH DP FLAT FOUND IN SMS                                      
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.SERS,DISP=SHR                               
//SORTOUT  DD DSN=&&F716OCC,DISP=(NEW,PASS),                                    
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   OUTREC FIELDS=(1,8,9,9,33X,101,11,45X,53,8,236X)                             
//*---------------------------------------------------------------------        
//* EXTRACT OCCUPIER RECORDS FROM RDB DATABASE BASED ON NRIC                    
//* ONE NRIC MAY HAVE A FEW RECORDS WITH DIFF SHC-ACC-NO IN RDB                 
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716OCC,DISP=(OLD,PASS)                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=&&F716Q749,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//BP13L749 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q749) PLAN(BP13PCC)  -                                        
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* DROP DUPLICATE RECORDS                                              05140004
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716Q749,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716UQ49,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,350,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* SORT BY SCH-ACC-NO                                                  05140004
//*---------------------------------------------------------------------        
//STEP3A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716UQ49,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716ST49,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSIN   DD *                                                                  
   SORT FIELDS=(51,11,A),FORMAT=CH                                              
//*-------------------------------------------------------------------*         
//* USE SCH-ACC-NO TO GET ESTATE AND FLAT TYPE FROM PBF FILE AND      *         
//*     USE ESTATE TO GET FROM BM06K510 ON NEW TOWN RESIDE            *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716ST49,DISP=(OLD,PASS)                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=&&F716PT49,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY REGN/NRIC                                                   05140004
//*---------------------------------------------------------------------        
//STEP4A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716PT49,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F716.DPREQ749.SERS,DISP=OLD                              
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* EXTRACT MOBILITY RECORDS TO DETERMINE MOVE IN DATE                          
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716OCC,DISP=(OLD,PASS)                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=&&F716Q747,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q747) PLAN(BP13PCC)  -                                        
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* DROP DUPLICATE RECORDS                                              05140004
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716Q747,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716UQ47,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,350,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* SORT BY SCH-ACC-NO                                                  05140004
//*---------------------------------------------------------------------        
//STEP6A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716UQ47,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716ST47,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSIN   DD *                                                                  
   SORT FIELDS=(51,11,A),FORMAT=CH                                              
//*-------------------------------------------------------------------*         
//* USE SCH-ACC-NO TO GET ESTATE AND FLAT TYPE FROM PBF FILE AND      *         
//*     USE ESTATE TO GET FROM BM06K510 ON NEW TOWN RESIDE            *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716ST47,DISP=(OLD,PASS)                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=&&F716PT47,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC)  -                                        
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY REGN/NRIC                                                   05140004
//*---------------------------------------------------------------------        
//STEP7A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716PT47,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F716.DPREQ747.SERS,DISP=OLD                              
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SORTOUT IN REGNO/NRIC SEQUENCE BP13F558                                     
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.SERS,DISP=SHR                               
//SORTOUT  DD DSN=&&F558SORT,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=600,RECFM=FB),                               
//            SPACE=(CYL,(150,30),RLSE)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
     SUM FIELDS=NONE                                                    05860004
//*---------------------------------------------------------------------        
//* OUTPUT BP13F716 IS SCH-ACC-NO = SMS-SCH-ACC-NO                              
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13C767,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558SORT,DISP=(OLD,PASS)                                    
//BP13F716 DD DSN=BP13.F716.DPREQ749.SERS,DISP=SHR                              
//P13F716A DD DSN=BP13.F716.DPREQ750.SERS,DISP=OLD                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------05130004
//* DROP DUPLICATE RECORDS                                              05140004
//*---------------------------------------------------------------------05150004
//STEP11  EXEC SORT,COND=(0,NE)                                         05160004
//SORTIN   DD DSN=BP13.BLANK.CHAR350,DISP=SHR                           05170004
//         DD DSN=BP13.F716.DPREQ750.SERS,DISP=SHR                      05180004
//SORTOUT  DD DSN=&&F716ST80,DISP=(,PASS),                              05190004
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=350),                          05200004
//        SPACE=(CYL,(10,12),RLSE)                                      05210004
//SYSIN   DD *                                                          05220004
     SORT FIELDS=(1,17,A),FORMAT=CH                                     05230004
     SUM FIELDS=NONE                                                    05240004
//*-------------------------------------------------------------------- 05250004
//*  DELETE/DEFINE BP13K716                                             05260004
//*-------------------------------------------------------------------- 05270004
//STEP12    EXEC PGM=IDCAMS,COND=(0,NE)                                 05280004
//SYSPRINT  DD SYSOUT=*                                                 05290004
//INPUT1   DD DSN=&&F716ST80,DISP=(OLD,PASS)                            05300004
//SYSIN     DD  *                                                       05310004
          DEL (BP13.K716.DPREQ750.SERS) CL PURGE                        05330004
          DEF CLUSTER                                -                  05330004
              (NAME(BP13.K716.DPREQ750.SERS)               -            05340004
              CYL(20 10)                           -                    05350004
              DATACLAS(MULTIVOL)                     -                  05360004
              STORCLAS(PRODRLS)                      -                  05370004
              LOG(NONE)                              -                  05380004
              SPEED                                  -                  05390004
              UNIQUE                                 -                  05400004
              SHR(2 3))                              -                  05410004
              DATA                                   -                  05420004
              (NAME(BP13.K716.DPREQ750.SERS.DATA)          -            05430004
              KEYS(17 0)                             -                  05440004
              RECSZ(350 350)                         -                  05450004
              CISZ(4096)                             -                  05460004
              FSPC(10 10))                           -                  05470004
              INDEX                                  -                  05480004
              (NAME(BP13.K716.DPREQ750.SERS.INDEX)         -            05490004
              CISZ(4096))                                               05500004
      IF MAXCC = 0  THEN                             -                  05510004
         REPRO IFILE(INPUT1)                         -                  05520004
              ODS(BP13.K716.DPREQ750.SERS)                              05530004
//*---------------------------------------------------------------------05870004
//* DEFINE BP13K558                                                     05880004
//*---------------------------------------------------------------------05890004
//STEP13    EXEC PGM=IDCAMS,COND=(0,NE)                                 05900004
//SYSPRINT  DD SYSOUT=*                                                 05910004
//INPUT     DD DSN=&&F558SORT,DISP=(OLD,PASS)                           05920004
//SYSIN    DD *                                                         05930004
  DEL (BP13.K558.BP13DPRE.SERS) CLUSTER PURGE                           05940004
  DEF CLUSTER                                          -                05950004
        (NAME(BP13.K558.BP13DPRE.SERS)                       -          05960004
        SHR(2,3)                                       -                05970004
        KEYS(17 0)                                     -                05980004
        CYL(50 40)                                     -                05990004
        RECSZ(600 600)                                 -                06000004
        FREESPACE(10 10)                               -                06010004
        CISZ(4096)                                     -                06020004
        STORCLAS(PRODRLS)                              -                06030004
        LOG(NONE)                                      -                06040004
        IXD                                            -                06050004
        UNQ)                                           -                06060004
      DATA                                             -                06070004
        (NAME(BP13.K558.BP13DPRE.SERS.DATA))                 -          06080004
      INDEX                                            -                06090004
        (NAME(BP13.K558.BP13DPRE.SERS.INDEX))                           06100004
      IF LASTCC = 0 THEN                               -                06110004
        REPRO IFILE(INPUT)                             -                06120004
              ODS(BP13.K558.BP13DPRE.SERS)                              06130004
