//BP13M150  JOB (BP13P),'BP13M150',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* SOC MONTHLY JOB                                                             
//*=================================================================            
//* CHG REF  BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130487 SSS 980507 - CHG UNIT=3480 TO UNIT=CARTANCE DEPT                   
//* BP130421 SSS 980611 - MICROFICHE CONVERSION                                 
//* BP130418 CLT 980826 - Y2K IMPLEMENTATION                                    
//* BP130612 LSB 981221 - ADD VFT FILE IN STEPA                                 
//* BP130447 LSB 990116 - CHG C329, S313-S319, C142, DEL C413                   
//* BP130565 CLT 990301 - ADD STEP91/92 FOR STAMPING REPORT                     
//* BP130447 LSB 990831 - GET ADDRESS C329, CHG C330                            
//* BP130447 LSB 990902 - ADD S316 - S321 REPORTS                               
//* BP130738 LSB 991102 - CHG REGN-DEPOSIT REPORT TO FIN DEPRT                  
//* BP130777 CLT 001005 - REMOVE UPDATING STEPS                                 
//* BP130871 SSS 000609 - REMOVE LISTING FOR EAALSS                             
//* BP130883 CLT 241000 - REMOVE BP13C904 AND CALL BP13C913                     
//* BP131016 LSB 160501 - ADD JOB FOR STUDIO APARTMENT                          
//* BP132197 SSS 200303 - AMEND GROUPID                                         
//* BP132341 MCC 240503 - EXCL BANK LOAN CASES IN STEP1                         
//* BP132441 CLT 281103 - EXCL BANK LOAN FOR BP13L307/L408                      
//* BP132481 MJ16170204 - INCL FILE BP13K022 IN BP13C136                        
//* BP132504 JF4 260304 - ADD STEP74A, STEP74B (FOR BANK CASES)                 
//*                       INCL FILE K022, K021 IN C307 AND C408                 
//* BP132548 YCH 150604 - ADD K022 AND ALTERNATE KEY IN BP13C120                
//* BP132561 CLT 010904 - ADD BP13C315 TO MONITOR SUB-TRSF STAMPING             
//* BP132702 CLT 110805 - CHG PRT03 TO PRT01 FOR SUB-TRSF REPORTS               
//* BP132768 CKK 111105 - OUTPUT P13L120A TO A SEQ FILE                         
//* BP132801 LSB 130306 - OMIT TRANS-TY=60 CPF GRANT                            
//* BP132846 SSS 010606 - CHG DD NAME FOR BP13C120                              
//* BP133194 SSS 101107 - 1 COPY BP13L120 TO EAPD                               
//* BP133566 ESA1040609 - ADD BP13K893 & BP13K895 TO BP13C110                   
//*                     - ADD BP13K893 TO BP13C126                              
//* BP134216 LJL 181011 - TO GENERATE 3 SEPARATE REPORTS FOR BP13L408           
//* BP134529 LJL 170413 - TO CONVERT HARDCOPY PRINT TO SEQUENTIAL FILE          
//*                     - FOR BP13L330A, BP13L330B,BP13L142,BP13L319            
//* BP134779 PCL 290513 - TO UPDATE INTO EMAIL/FILE REPORT FORMAT FOR           
//*                       BP13L307, BP13L315, & BP13L408                        
//* BP135006 220813 LSB  REMOVE PARAMETERS FOR MICROFICHE OUTPUT                
//* BP135171 110214 RJE1 TO CATER FOR DB2 UPGRADE                               
//* BP134740 200514 ESD1 TO CATER DUPLICATE DEBARMENT REPORT.                   
//* BP135490 120215 RJB1 ADDED PGM BP13C32D                                     
//* BP135901 270815 KSJ3 ADDED PARMS TO BP13C408                                
//* BP136098 020316 KSJ3 ADDED STEP2C, STEP6 FOR S11A, STEP12 FOR S11C          
//* BP136176 050516 KSJ3 ADDED 1 MORE BP13C126 RUN SOLELY FOR 2F CASES          
//* BP136224 030616 KSJ3 INCL LBS CASES (F136-CDE-VALID=L) IN SA                
//*                      INCL LEASE TENURE IN 2F SORT CONDITION                 
//* BP135548 091116 RJB1 CATER FOR NEW COLUMNS FOR SOC REPORT DATASETS          
//* BP136642 060217 SMR2 CATER FOR SYSOUT=8,DEST=IOM8                           
//* BP136869 050717 LSB1 TEMP LOAN REMARK IN COL 144 FOR C126 REPORT            
//*                      LEASE PERIOD UP TO 65 YR FOR FSH                       
//* BP137181 020718 LSB1 MFL LOAN FOR FSH IN COL 144 FOR C126 REPORT            
//* BP138565 010221 LSB1 ADD FT=1F                                              
//* BP138663 220921 LSB1 SORTING BEFORE C126                                    
//*=================================================================            
//* SORT TO INCLUDE NON TYPE 24 TRANS                                           
//*-----------------------------------------------------------------            
//STEP1    EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F136,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD   *                                                               
     SORT FIELDS=(5,8,A),FORMAT=CH                                              
     OMIT COND=(1,2,CH,EQ,C'24',OR,                                             
                1,2,CH,EQ,C'34',OR,                                             
                1,2,CH,EQ,C'40',OR,                                             
                1,2,CH,EQ,C'60',OR,                                             
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'LSE'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'CON'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'CST'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'LRF'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'SRV'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'SST'),OR,                    
              (99,3,CH,EQ,C'SOL'))                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* COLLATE AND EDIT MTHLY SOC TRANS FOR PRINTING PROGRAM                       
//*-----------------------------------------------------------------            
//STEP2    EXEC PGM=BP13C110,COND=(0,NE)                                        
//BP13F136 DD DSN=&&BP13F136,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F127 DD DSN=BP13.F127.EDITSOC,DISP=OLD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* SORT BP13F127                                                               
//*-----------------------------------------------------------------            
//STEP2A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F127.EDITSOC,DISP=SHR                                    
//SORTOUT  DD DSN=&&SAF127,DISP=(,PASS,DELETE),                                 
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
     INCLUDE COND=(118,2,CH,EQ,C'1A',OR,                                        
                   118,2,CH,EQ,C'2A',OR,                                        
                   114,1,CH,EQ,C'L')                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13F127                                                               
//*-----------------------------------------------------------------            
//STEP2B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F127.EDITSOC,DISP=SHR                                    
//SORTOUT  DD DSN=&&OTHF127,DISP=(,PASS,DELETE),                                
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
     OMIT COND=(118,2,CH,EQ,C'1A',OR,                                           
                118,2,CH,EQ,C'2A',OR,                                           
                118,2,CH,EQ,C'1F',OR,                                           
               (118,2,CH,EQ,C'2F',AND,                                          
                130,2,CH,GT,C'00',AND,                                          
                130,2,CH,LE,C'65'),OR,                                          
                114,1,CH,EQ,C'L')                                               
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13F127 FOR 2 ROOM FLEXI                                              
//*-----------------------------------------------------------------            
//STEP2C   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F127.EDITSOC,DISP=SHR                                    
//SORTOUT  DD DSN=&&F1272F,DISP=(,PASS,DELETE),                                 
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(5,8,A),FORMAT=CH                                                
     INCLUDE COND=(118,2,CH,EQ,C'1F',OR,                                        
                  (118,2,CH,EQ,C'2F',AND,                                       
                   130,2,CH,GT,C'00',AND,                                       
                   130,2,CH,LE,C'65'))                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT REPORT ON CASH RECEIPT FOR THE MONTH ON TEMPORARY FILE                
//*-----------------------------------------------------------------            
//STEP4    EXEC  SAS,COND=(0,NE)                                                
//BP13F127 DD DSN=&&SAF127,DISP=(OLD,PASS)                                      
//BP13L111 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S111),DISP=SHR                             
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT REPORT ON CASH RECEIPT FOR THE MONTH ON TEMPORARY FILE                
//*-----------------------------------------------------------------            
//STEP5    EXEC  SAS,COND=(0,NE)                                                
//BP13F127 DD DSN=&&OTHF127,DISP=(OLD,PASS)                                     
//BP13L111 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S111),DISP=SHR                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT REPORT ON 2 ROOM FLEXI CASH RECEIPT FOR THE MONTH                     
//*-----------------------------------------------------------------            
//STEP6    EXEC  SAS,COND=(0,NE)                                                
//BP13F127 DD DSN=&&F1272F,DISP=(OLD,PASS)                                      
//BP13L11A DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S11A),DISP=SHR                             
/*                                                                              
//*=================================================================            
//* PRINT CPF POSTED FOR THE MONTH                                              
//*-----------------------------------------------------------------            
//STEP7    EXEC  SAS,COND=(0,NE)                                                
//BP13F127 DD DSN=BP13.F127.EDITSOC,DISP=SHR                                    
//BP13L114 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S114),DISP=SHR                             
//*                                                                             
//*=================================================================            
//*  REPORT ON ADJUSTMENT/REFUND/TRANSFER FOR THE MONTH ON                      
//*  TEMPORARY FILE -SA CASES                                                   
//*-----------------------------------------------------------------            
//STEP10   EXEC  SAS,COND=(0,NE)                                                
//BP13F127 DD DSN=&&SAF127,DISP=(OLD,PASS)                                      
//BP13L113 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S113),DISP=SHR                             
/*                                                                              
//*-----------------------------------------------------------------            
//* REPORT ON ADJUSTMENT/REFUND/TRANSFER FOR THE MONTH ON                       
//* TEMPORARY FILE-OTHER CASES                                                  
//*-----------------------------------------------------------------            
//STEP11   EXEC  SAS,COND=(0,NE)                                                
//BP13F127 DD DSN=&&OTHF127,DISP=(OLD,PASS)                                     
//BP13L113 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S113),DISP=SHR                             
/*                                                                              
//*-----------------------------------------------------------------            
//* REPORT ON ADJUSTMENT/REFUND/TRANSFER FOR THE MONTH ON                       
//* TEMPORARY FILE - 2 ROOM FLEXI CASES                                         
//*-----------------------------------------------------------------            
//STEP12   EXEC  SAS,COND=(0,NE)                                                
//BP13F127 DD DSN=&&F1272F,DISP=(OLD,PASS)                                      
//BP13L11C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S11C),DISP=SHR                             
/*                                                                              
//*=================================================================            
//* REPORT ON ADJUSTMENT/REFUND/TRANSFER FOR THE MONTH                          
//*-----------------------------------------------------------------            
//STEP13   EXEC  SAS,COND=(0,NE)                                                
//BP13F127 DD DSN=BP13.F127.EDITSOC,DISP=SHR                                    
//BP13L116 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S116),DISP=SHR                             
/*                                                                              
//*=================================================================            
//* MONTHLY STATEMENT REPORT ON TEMPORARY FILE                                  
//*-----------------------------------------------------------------            
//STEP15   EXEC  SAS,COND=(0,NE)                                                
//BP13F127 DD DSN=BP13.F127.EDITSOC,DISP=SHR                                    
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//BP13L112 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S112),DISP=SHR                             
/*                                                                              
//*=================================================================            
//* PRINT RECONCILIATION SUMMARY FOR THE MONTH                                  
//*-----------------------------------------------------------------            
//STEP18   EXEC  SAS,COND=(0,NE)                                                
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//BP13L115 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S115),DISP=SHR                             
//*                                                                             
//*=================================================================            
//* SORT OUT CD TRANSFER TO MORT LOAN RECS                                      
//*-----------------------------------------------------------------            
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F127.EDITSOC,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F120,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(13,8,A),FORMAT=CH                                             
     INCLUDE COND=(1,2,CH,EQ,C'17')                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT CD TRANSFER TO MORT LOAN AUDIT TRIAL REPORT                           
//*-----------------------------------------------------------------            
//STEP22   EXEC PGM=BP13C127,COND=(0,NE)                                        
//BP13F120 DD DSN=&&BP13F120,DISP=(OLD,PASS)                                    
//BP13L127 DD SYSOUT=8,DEST=IOM8                                                
//BP13L27A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=================================================================            
//* SORT OUT TRANS TYPE '25' CASES                                              
//*-----------------------------------------------------------------            
//STEP24A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F132,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD   *                                                               
    SORT FIELDS=(5,19,A),FORMAT=CH                                              
    INCLUDE COND=(1,2,CH,EQ,C'25')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT CD TRANSFER TO SUSPENSE AUDIT TRIAL REPORT                            
//*-----------------------------------------------------------------            
//STEP24B  EXEC PGM=BP13C132,COND=(0,NE)                                        
//BP13F120 DD DSN=&&BP13F132,DISP=(OLD,PASS)                                    
//BP13L132 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*=================================================================            
//* MTHLY EXCEPTIONAL REPORT ON FEES                                            
//*-----------------------------------------------------------------            
//STEP25   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13L120A DD SYSOUT=8,DEST=IOM8                                                
//P13L120B DD SYSOUT=8,DEST=IOM8                                                
//P13L120C DD DSN=BP13.L120.OUTPUT,DISP=OLD                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C120) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* REPORT FOR ACTIVITY BY ACCOUNTING ON TEMPORARY FILE                         
//*-----------------------------------------------------------------            
//STEP28   EXEC PGM=BP13C117,COND=(0,NE)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8')                                                   
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=8')                                                   
//BP13L117 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=================================================================            
//* SORT SA TRANS BY PAYMENT TYPE, DATETING ON HARDCOPY                         
//* INCL TRANS-CODE= 29,PAYMENT-TY = CD (CD TRF TO DEFER-INCOME)                
//*-----------------------------------------------------------------            
//STEP31A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&F137SA,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(99,3,A,91,8,A),FORMAT=CH                                      
     INCLUDE COND=(1,2,CH,EQ,C'29',AND,99,2,CH,EQ,C'CD')                        
     OUTREC FIELDS=(1,98,C'CD*',102,49)                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT SA TRANS BY PAYMENT TYPE,                                              
//* INCLUDE OTHERS TRANS-CODE                                                   
//*-----------------------------------------------------------------            
//STEP31B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&F137OTH,DISP=(,PASS,DELETE),                                
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(99,3,A,91,8,A),FORMAT=CH                                      
     OMIT COND=(1,2,CH,EQ,C'34',OR,                                             
                1,2,CH,EQ,C'40',OR,                                             
                1,2,CH,EQ,C'60',OR,                                             
               (1,2,CH,EQ,C'29',AND,99,2,CH,EQ,C'CD'),OR,                       
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'LSE'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'CON'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'CST'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'LRF'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'SRV'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'SST'),OR,                    
              (99,3,CH,EQ,C'SOL'))                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT SA TRANS BY PAYMENT TYPE, DATE                                         
//*-----------------------------------------------------------------            
//STEP31C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F137SA,DISP=(OLD,PASS)                                      
//         DD DSN=&&F137OTH,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&BP13F137,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(99,3,A,91,8,A),FORMAT=CH                                      
     INCLUDE COND=(1,2,CH,EQ,C'19',OR,1,2,CH,EQ,C'21',OR,                       
                   1,2,CH,EQ,C'22',OR,1,2,CH,EQ,C'23',OR,                       
                   1,2,CH,EQ,C'29',OR,1,2,CH,EQ,C'30',OR,                       
                   1,2,CH,EQ,C'31',OR,1,2,CH,EQ,C'32')                          
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE TEMP FILE FOR REPORT PRINTING                                        
//*-----------------------------------------------------------------            
//STEP31D  EXEC PGM=BP13C110,COND=(0,NE)                                        
//BP13F136 DD DSN=&&BP13F137,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F127 DD DSN=&&F127EDIT,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT SA TRANSACTIONS                                                        
//*-----------------------------------------------------------------            
//STEP31E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F127EDIT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F136SA,DISP=(,PASS,DELETE),                                 
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD  *                                                                
     SORT FIELDS=(99,3,A,91,8,A),FORMAT=CH                                      
     INCLUDE COND=(118,2,CH,EQ,C'1A',OR,                                        
                   118,2,CH,EQ,C'2A',OR,                                        
                   114,1,CH,EQ,C'L')                                            
//*-----------------------------------------------------------------            
//* SORT OTHER TRANSACTIONS                                                     
//*-----------------------------------------------------------------            
//STEP31F  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F127EDIT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F136OTH,DISP=(,PASS,DELETE),                                
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD  *                                                                
     SORT FIELDS=(99,3,A,91,8,A),FORMAT=CH                                      
       OMIT COND=(118,2,CH,EQ,C'1A',OR,                                         
                  118,2,CH,EQ,C'2A',OR,                                         
                  118,2,CH,EQ,C'1F',OR,                                         
                 (118,2,CH,EQ,C'2F',AND,                                        
                  130,2,CH,GT,C'00',AND,                                        
                  130,2,CH,LE,C'65'),OR,                                        
                  114,1,CH,EQ,C'L')                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT 2F TRANSACTIONS (NO LOAN)                                              
//*-----------------------------------------------------------------            
//STEP31G  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F127EDIT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F1362F,DISP=(,PASS,DELETE),                                 
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD  *                                                                
     SORT FIELDS=(99,3,A,91,8,A,118,2,A),FORMAT=CH                              
     INCLUDE COND=((118,2,CH,EQ,C'1F',OR,                                       
                   118,2,CH,EQ,C'2F'),AND,                                      
                  (130,2,CH,GT,C'00',AND,                                       
                   130,2,CH,LE,C'65',AND,                                       
                   144,6,CH,EQ,C'      '))                                      
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT 2F TRANSACTIONS (WITH TEMP LOAN)                                       
//*-----------------------------------------------------------------            
//STEP31H  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F127EDIT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F1362TMP,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD  *                                                                
     SORT FIELDS=(99,3,A,91,8,A,118,2,A),FORMAT=CH                              
     INCLUDE COND=((118,2,CH,EQ,C'1F',OR,                                       
                   118,2,CH,EQ,C'2F'),AND,                                      
                  (130,2,CH,GT,C'00',AND,                                       
                   130,2,CH,LE,C'65',AND,                                       
                   144,6,CH,NE,C'      '))                                      
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT SA AUDIT TRIAL                                                        
//*-----------------------------------------------------------------            
//STEP32A  EXEC PGM=BP13C126,COND=(0,NE)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F120 DD DSN=&&F136SA,DISP=(OLD,PASS)                                      
//BP13L126 DD SYSOUT=8,DEST=IOM8                                                
//BP13L26A DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT SA AUDIT TRIAL                                                        
//*-----------------------------------------------------------------            
//STEP33   EXEC PGM=BP13C126,COND=(0,NE)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F120 DD DSN=&&F136OTH,DISP=(OLD,PASS)                                     
//BP13L126 DD SYSOUT=8,DEST=IOM8                                                
//BP13L26A DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT 2F AUDIT TRIAL                                                        
//*-----------------------------------------------------------------            
//STEP34A  EXEC PGM=BP13C126,COND=(0,NE)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F120 DD DSN=&&F1362F,DISP=(OLD,PASS)                                      
//BP13L126 DD SYSOUT=8,DEST=IOM8                                                
//BP13L26A DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT 2F AUDIT TRIAL                                                        
//*-----------------------------------------------------------------            
//STEP34F  EXEC PGM=BP13C126,COND=(0,NE)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F120 DD DSN=&&F1362TMP,DISP=(OLD,PASS)                                    
//BP13L126 DD SYSOUT=8,DEST=IOM8                                                
//BP13L26A DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* STAMP FEE TRANS FOR STAMP FEE SYS, INCLUDE LEASE REGN-FEE FOR SA            
//*-----------------------------------------------------------------            
//STEP38   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F136.STPFEE,DISP=OLD                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(102,11,A),FORMAT=CH                                           
     INCLUDE COND=((1,2,CH,EQ,C'23',AND,99,3,CH,EQ,C'LSE'),OR,                  
                   (1,2,CH,EQ,C'31',AND,99,3,CH,EQ,C'LRF'))                     
//*                                                                             
//*-----------------------------------------------------------------            
//* BACKUP BALANCE FILE AFTER BLANCE BROUGHT FORWARD DONE - 12 GDG              
//*-----------------------------------------------------------------            
//STEP40  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//OUTPUT3  DD DSN=BP13.F160.BACKUP(+1),DISP=(NEW,CATLG,DELETE),                 
//            SPACE=(TRK,(5,2)),                                                
//            DCB=(BP13.GDG,RECFM=FB,LRECL=100,BLKSIZE=23400)                   
//*                                                                             
      REPRO INFILE(INPUT3)   OUTFILE(OUTPUT3)                                   
//*                                                                             
//*-----------------------------------------------------------------            
//* PREPARE BALANCE FILE FOR NEXT MONTH                                         
//*-----------------------------------------------------------------            
//STEP41   EXEC PGM=BP13C121,COND=(0,NE)                                        
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* SORT RESETTLEMENT FILE IN REGN NO AND ALLOC STATUS SEQ                      
//*-----------------------------------------------------------------            
//STEP45   EXEC SORT,CYL=2,COND=(0,NE)                                          
//SORTIN   DD DSN=BP13.F220.RESETTLE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F220,DISP=(NEW,PASS),UNIT=SYSDA,                        
//            SPACE=(TRK,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=23450)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A,321,3,A),FORMAT=CH                                       
//*                                                                             
//*-----------------------------------------------------------------            
//* REPORTS FOR RESETTLEMENT DEPARTMENT  -- ACCEPTED/REJECTED                   
//*                                         AND KEY ISSUE                       
//*-----------------------------------------------------------------            
//STEP46   EXEC PGM=BP13C480,COND=(0,NE)                                        
//BP13F220 DD DSN=&&BP13F220,DISP=(OLD,PASS)                                    
//BP13L480 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* CLEAR UP FILE FOR START OF NEXT MONTH                                       
//*-----------------------------------------------------------------            
//STEP47    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//INPUT4   DD DUMMY                                                             
//OUTPUT4  DD DSN=BP13.F220.RESETTLE,DISP=OLD                                   
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT4) OUTFILE(OUTPUT4)                                     
//*                                                                             
//*=================================================================            
//* REPORT ON CASES WHERE BLOCK WITH OCS DATE IS DUE WITHIN 5 DAYS              
//*-----------------------------------------------------------------            
//STEP48   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                             
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L323 DD SYSOUT=8,DEST=IOM8                                                
//P13L323A DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C323) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* UNRESOLVED KIV CASES                                                        
//*-----------------------------------------------------------------            
//STEP49   EXEC SAS,COND=(0,NE)                                                 
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//BP13L118 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S118),DISP=SHR                             
/*                                                                              
//*=================================================================            
//* UNRESOLVED KIV CASES                                                        
//*-----------------------------------------------------------------            
//STEP52  EXEC  SAS,COND=(0,NE)                                                 
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//BP13L120 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S120),DISP=SHR                             
//*                                                                             
//*=================================================================            
//* EXTRACT REPORT FILE FOR PRINTING SUB-TRANFER AGEING REPORT                  
//*-----------------------------------------------------------------            
//STEP53   EXEC PGM=BP13C133,COND=(0,NE)                                        
//BP13K882 DD DSN=BP13.K882.ACCUMSTF,DISP=SHR                                   
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//BP13FOUT DD DSN=&&PRTFILE,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(2,2),RLSE),                                
//            DCB=(RECFM=FB,LRECL=420,BLKSIZE=0)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SUMMARY AGEING REPORT FOR SUB-TRANSFER                                      
//*-----------------------------------------------------------------            
//STEP54   EXEC PGM=BP13C134,COND=(0,NE)                                        
//PRTFILE  DD DSN=&&PRTFILE,DISP=(OLD,PASS)                                     
//BP13L134 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* LISTING OF SUB-TRANSFER CASES > 2 MONTHS OLD                                
//*-----------------------------------------------------------------            
//STEP55   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//PRTFILE  DD DSN=&&PRTFILE,DISP=(OLD,PASS)                                     
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L136 DD SYSOUT=8,DEST=IOM8                                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C136) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* BACKUP BP13.F125.REG - 36 GDG                                               
//*-----------------------------------------------------------------            
//STEP56   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT70  DD DSN=BP13.F125.REG,DISP=SHR                                        
//OUTPUT70 DD DSN=BP13.F125.REG.MONTH.BACKUP(+1),                               
//            DISP=(,PASS),UNIT=CART,LABEL=(,SL),                               
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=150,RECFM=FB)                   
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT70) OUTFILE(OUTPUT70)                                    
//*                                                                             
//*-----------------------------------------------------------------            
//* CATALOG GDG                                                                 
//*-----------------------------------------------------------------            
//STEP57    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT4    DD DSN=BP13.F125.REG.MONTH.BACKUP(+1),                              
//             DISP=(OLD,CATLG),UNIT=(,,DEFER)                                  
//*                                                                             
//*-----------------------------------------------------------------            
//* EMPTY MTHLY REG  FILE                                                       
//*-----------------------------------------------------------------            
//STEP58   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.EMPTY.CHAR150,DISP=OLD                                   
//OUTPUT2  DD DSN=BP13.F125.REG,DISP=OLD                                        
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*=================================================================            
//* REPORT ON MARTGAGE LOAN TO FINANCE DEPARTMENT (T/P)                         
//*-----------------------------------------------------------------            
//STEP59   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                    
//BP13F410 DD DSN=BP13.F410.MTHSO,DISP=SHR                                      
//FT12F001 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S458),DISP=SHR                             
//*                                                                             
//*=================================================================            
//* REPORT ON CASES WHERE BLOCK WITH OCS DATE IS DUE WITHIN 5 DAYS              
//*-----------------------------------------------------------------            
//STEP60   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                             
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L197 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C197) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* SORT OUT WITH DATE OF AGREEMENT ORDER                                       
//*-----------------------------------------------------------------            
//STEP62   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=13')                                                  
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(600,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(12,8,A,4,8,A),FORMAT=CH,FILSZ=E5000                              
//*                                                                             
//*-----------------------------------------------------------------            
//* REPORT ON BK FEE NOT REFUND FOR MORE THAN 2 MTHS                            
//*-----------------------------------------------------------------            
//STEP63   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F142A DD DSN=BP13.F142.BOOK,DISP=OLD                                       
//P13F142B DD DSN=BP13.F142.DEBT,DISP=OLD                                       
//P13F142C DD DSN=BP13.F142.CDMT,DISP=OLD                                       
//BP13F142 DD DSN=BP13.F142.RDEP,DISP=OLD                                       
//BP13L329 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C329) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* SORT OUT STUDIO APARTMENT CASES                                             
//*-----------------------------------------------------------------            
//STEP65A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=13')                                                  
//SORTOUT  DD DSN=&&P13F800A,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(600,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(04,8,A),FORMAT=CH,FILSZ=E5000                                    
  INCLUDE COND=(30,2,CH,EQ,C'1A',OR,                                            
                30,2,CH,EQ,C'2A',OR,                                            
                54,2,CH,EQ,C'SA')                                               
//*                                                                             
//*-----------------------------------------------------------------            
//* REPORT ON BK FEE NOT REFUND FOR MORE THAN 1 MTH (SA CASES)                  
//*-----------------------------------------------------------------            
//STEP65B  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F800 DD DSN=&&P13F800A,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L32D DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C32D) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* AGEING REPORT FOR BOOKIN FEE PAID OUTSTANDING                               
//*-----------------------------------------------------------------            
//STEP66   EXEC  SAS,COND=(0,NE)                                                
//BP13F142 DD DSN=BP13.F142.BOOK,DISP=SHR                                       
//BP13L313 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S313),DISP=SHR                             
/*                                                                              
//*-----------------------------------------------------------------            
//* AGEING REPORT FOR SOC DEBTOR OUTSTANDING                                    
//*-----------------------------------------------------------------            
//STEP67   EXEC  SAS,COND=(0,NE)                                                
//BP13F142 DD DSN=BP13.F142.DEBT,DISP=SHR                                       
//BP13L314 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S314),DISP=SHR                             
/*                                                                              
//*-----------------------------------------------------------------            
//* AGEING REPORT FOR COMMITMENT DEPOSIT OUTSTANDING                            
//*-----------------------------------------------------------------            
//STEP68   EXEC  SAS,COND=(0,NE)                                                
//BP13F142 DD DSN=BP13.F142.CDMT,DISP=SHR                                       
//BP13L315 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S315),DISP=SHR                             
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT IN BOOKING FILE MTH ORDER                                              
//*-----------------------------------------------------------------            
//STEP69   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F142.BOOK,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13BOOK,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=300),                                         
//            SPACE=(CYL,(50,8),RLSE)                                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(249,3,A,1,8,A),FORMAT=CH                                        
   INCLUDE COND=(249,3,CH,GT,C'007')                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* LISTING ON BOOKING PAID MORE THAN 8 MTH CASES                               
//*-----------------------------------------------------------------            
//STEP70   EXEC PGM=BP13C330,COND=(0,NE)                                        
//BP13F142 DD DSN=&&BP13BOOK,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//            AMP=('BUFND=23')                                                  
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13L30A DD DSN=BP13.REPORT.BP13L30A,DISP=SHR                                 
//BP13L30B DD DSN=BP13.REPORT.BP13L30B,DISP=SHR                                 
//BP13L30C DD DSN=BP13.REPORT.BP13L30C,DISP=SHR                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY F142-NUM-MONTHNG PAID                                               
//* INCLUDE WITH KEY-AVAILABLE DATE CASES                                       
//*-----------------------------------------------------------------            
//STEP71    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.F142.CDMT,DISP=SHR                                      
//SORTOUT   DD DSN=&&BP13FOCD,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(50,8),RLSE),                              
//             DCB=(BLKSIZE=0,LRECL=300,RECFM=FB)                               
//SYSIN     DD *                                                                
   SORT FIELDS=(249,3,A),FORMAT=CH                                              
   INCLUDE COND=(252,1,CH,EQ,C'Y')                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* LISTING OF SA CASES > 24 MTHS  AND KEY IS AVAILABLE                         
//*-----------------------------------------------------------------            
//STEP72   EXEC PGM=BP13C142,COND=(0,NE)                                        
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13F142 DD DSN=&&BP13FOCD,DISP=(OLD,PASS)                                    
//BP13L142 DD DSN=BP13.REPORT.BP13L142,DISP=SHR                                 
//P13L142A DD DSN=BP13.REPORT.P13L142A,DISP=SHR                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRIN  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13K800 CASES WHERE K800-DTE-STAMP-AGMT = SPACES &                    
//* K800-DTE-SALE-AGMT NOT = SPACES (NON-BANK CASES)                            
//*-----------------------------------------------------------------            
//STEP73  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K800.APPLN,DISP=SHR                                       
//SORTOUT DD DSN=&&BP13F801,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                               
//           DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                
//SYSIN   DD  *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(459,8,CH,NE,C'        ',AND,595,8,CH,EQ,C'        ',            
                AND,963,1,CH,NE,C'B')                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* LIST OF OUTSTANDING STAMPING (SA) > 2 MTHS (NON-BANK CASES)                 
//*-----------------------------------------------------------------            
//STEP74   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&BP13F801,DISP=(SHR,DELETE)                                  
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//*BP13L307 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//BP13L307 DD DSN=BP13.L307.BP13C307,DISP=SHR                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C307) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13K800 CASES WHERE K800-DTE-STAMP-AGMT = SPACES &                    
//* K800-DTE-SALE-AGMT NOT = SPACES (BANK CASES - EXCLUDE 'ES' CASES)           
//*-----------------------------------------------------------------            
//STEP74A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F802,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(459,8,CH,NE,C'        ',AND,595,8,CH,EQ,C'        ',            
                AND,963,1,CH,EQ,C'B',AND,967,2,CH,NE,C'ES')                     
/*                                                                              
//*-----------------------------------------------------------------            
//* LIST OF OUTSTANDING STAMPING (SA) > 2 MTHS (BANK CASES)                     
//*-----------------------------------------------------------------            
//STEP74B  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&BP13F802,DISP=(SHR,DELETE)                                  
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//*BP13L307 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//BP13L307 DD DSN=BP13.L307.BP13C307.BANK,DISP=SHR                              
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C307) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')  -                                              
      PARM('B')                                                                 
  END                                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13K410 CASES WHERE K410-DTE-STAMP-DOA = SPACES                       
//* & KEY ISSUED GE '19951101' (NON-BANK CASES) FOR TP CASES                    
//*-----------------------------------------------------------------            
//STEP75   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F410,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(855,8,A),FORMAT=CH                                               
  INCLUDE COND=(863,8,CH,EQ,C'        ',&,1,1,CH,NE,C'5',&,                     
                855,8,CH,GE,C'19951101',&,68,1,CH,NE,C'B',&,                    
                1135,1,CH,NE,C'Y')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BP13K410 CASES WHERE K410-DTE-STAMP-DOA = SPACES                       
//* & KEY ISSUED GE '19951101' (NON-BANK CASES) (SERS ONLY AND SA-TP)           
//*-----------------------------------------------------------------            
//STEP75A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F411,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(855,8,A),FORMAT=CH                                               
  INCLUDE COND=(863,8,CH,EQ,C'        ',&,1,1,CH,NE,C'5',&,                     
                855,8,CH,GE,C'19951101',&,68,1,CH,NE,C'B',&,                    
                1135,1,CH,EQ,C'Y')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BP13K410 CASES WHERE K410-DTE-STAMP-DOA = SPACES                       
//* & KEY ISSUED GE '19951101' (NON-BANK CASES) (DBSS ONLY)                     
//*-----------------------------------------------------------------            
//STEP75B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F412,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(855,8,A),FORMAT=CH                                               
  INCLUDE COND=(863,8,CH,EQ,C'        ',&,1,1,CH,EQ,C'5',&,                     
                855,8,CH,GE,C'19951101',&,68,1,CH,NE,C'B',&,                    
                43,3,CH,NE,C'SER')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* LIST OF OUTSTANDING STAMPING (TP) > 2 MTHS (NON-BANK CASES)                 
//*-----------------------------------------------------------------            
//STEP76   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F410 DD DSN=&&BP13F410,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//*BP13L408 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//BP13L408 DD DSN=BP13.L408.BP13C408,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
    DSN SYSTEM(DSN)                                                             
    RUN PROGRAM(BP13C408) PLAN(BP13PCC) -                                       
    LIB('BP13.BATCH.LOADCOB') -                                                 
    PARM('TP   ')                                                               
//*                                                                             
//*-----------------------------------------------------------------            
//* LIST OF OUTSTANDING STAMPING (TP) > 2 MTHS (NON-BANK CASES)                 
//* (SERS ONLY).                                                                
//*-----------------------------------------------------------------            
//STEP76A  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F410 DD DSN=&&BP13F411,DISP=(OLD,PASS)                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//*BP13L408 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//BP13L408 DD DSN=BP13.L408.BP13C408.TP,DISP=SHR                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
    DSN SYSTEM(DSN)                                                             
    RUN PROGRAM(BP13C408) PLAN(BP13PCC) -                                       
    LIB('BP13.BATCH.LOADCOB') -                                                 
    PARM('SA-TP')                                                               
//*                                                                             
//*-----------------------------------------------------------------            
//* LIST OF OUTSTANDING STAMPING (TP) > 2 MTHS (NON-BANK CASES)                 
//* (DBSS ONLY).                                                                
//*-----------------------------------------------------------------            
//STEP76B  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F410 DD DSN=&&BP13F412,DISP=(OLD,PASS)                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//*BP13L408 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//BP13L408 DD DSN=BP13.L408.BP13C408.TP2,DISP=SHR                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
    DSN SYSTEM(DSN)                                                             
    RUN PROGRAM(BP13C408) PLAN(BP13PCC) -                                       
    LIB('BP13.BATCH.LOADCOB') -                                                 
    PARM('DBSS ')                                                               
//*                                                                             
//*-----------------------------------------------------------------            
//* AGEING REPORT ON REGISTRATION DEPOSIT WITH RECEIPT INFORMATION              
//*-----------------------------------------------------------------            
//STEP77   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                   
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F142 DD DSN=BP13.F142.RDEP,DISP=SHR                                       
//BP13L316 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S316),DISP=SHR                             
//*                                                                             
//*-----------------------------------------------------------------            
//* REPORT ON APPLICATION CANCELLED BUT REGISTRATION                            
//* DEPOSIT NOT ACTED ON YET                                                    
//*-----------------------------------------------------------------            
//STEP78   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                   
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F142 DD DSN=BP13.F142.RDEP,DISP=SHR                                       
//BP13L317 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S317),DISP=SHR                             
//*                                                                             
//*-----------------------------------------------------------------            
//* REPORT ON APPLICATION CANCELLED BUT BOOKING FEE                             
//* NOT ACTED ON YET                                                            
//*-----------------------------------------------------------------            
//STEP79   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                   
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F142 DD DSN=BP13.F142.BOOK,DISP=SHR                                       
//BP13L318 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S318),DISP=SHR                             
//*                                                                             
//*-----------------------------------------------------------------            
//* REPORT ON SOC DEBTORS >=1 FROM SALES-ARGMT-DATE                             
//*-----------------------------------------------------------------            
//STEP80   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                   
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F142 DD DSN=BP13.F142.DEBT,DISP=SHR                                       
//BP13L319 DD DSN=BP13.REPORT.BP13L319,DISP=SHR                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S319),DISP=SHR                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BY F142-NUM-MONTHNG PAID                                               
//*-----------------------------------------------------------------            
//STEP80A   EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.F142.DEBT,DISP=SHR                                      
//SORTOUT   DD DSN=&&BP13F142,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(50,8),RLSE),                              
//             DCB=(BLKSIZE=0,LRECL=300,RECFM=FB)                               
//SYSIN     DD *                                                                
   SORT FIELDS=(249,3,A),FORMAT=CH                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* BP135548 - TO INCLUDE NEW COLUMNS FOR MONITORING NO. OF MONTHS              
//*            OUTSTANDING AND OIC OF THE CASES                                 
//* REPORT ON SOC DEBTORS >=1 FROM SALES-ARGMT-DATE                             
//*-----------------------------------------------------------------            
//STEP80B  EXEC PGM=BP13C31Z,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13F142 DD DSN=&&BP13F142,DISP=(OLD,PASS)                                    
//BP13L31Z DD DSN=BP13.REPORT.BP13L31Z,DISP=SHR                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRIN  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* LISTING OF SOC DEBTORS WITH NO SALES-AGREEMENT-DATE                         
//*-----------------------------------------------------------------            
//STEP81   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                   
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F142 DD DSN=BP13.F142.DEBT,DISP=SHR                                       
//BP13L320 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S320),DISP=SHR                             
//*                                                                             
//*-----------------------------------------------------------------            
//* LISTING OF REGN-DEPOSIT WITH MORE THAN 2 YEARS FROM                         
//* RECIEPT DATE                                                                
//*-----------------------------------------------------------------            
//STEP82   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                   
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F142 DD DSN=BP13.F142.RDEP,DISP=SHR                                       
//BP13L321 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S321),DISP=SHR                             
//*                                                                             
//*-----------------------------------------------------------------            
//* BACKUP STUDIO APARTMENT TRANSACTION                                         
//*-----------------------------------------------------------------            
//STEP83   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F120.SATRAN.SA.MTH,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.F120.SATRAN.SA.MTHBKUP,DISP=OLD                          
      REPRO INFILE(INPUT1)   OUTFILE(OUTPUT1)                                   
//*                                                                             
//*-----------------------------------------------------------------            
//* EMPTY STUDIO APARTMENT TRANSACTION FILE                                     
//*-----------------------------------------------------------------            
//STEP84   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR150,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F120.SATRAN.SA.MTH,DISP=OLD                              
      REPRO INFILE(INPUT1)   OUTFILE(OUTPUT1)                                   
//*                                                                             
//*-----------------------------------------------------------------            
//* BACKUP K885 FILE TO GDG FILE                                                
//*-----------------------------------------------------------------            
//STEP85   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F885.EXAPPLT.MONTH(+1),DISP=(NEW,CATLG),                 
//            SPACE=(CYL,(5,5),RLSE),                                           
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)                   
      REPRO INFILE(INPUT1)   OUTFILE(OUTPUT1)                                   
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13K800 CASES WHERE K800-NUM-SUB-TRANSFER NOT = ' '                   
//* & K800-DTE-STAMP-SUBTRF = SPACES                                            
//*-----------------------------------------------------------------            
//STEP86   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F803,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(600,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(738,1,CH,NE,C' ',&,1154,8,CH,EQ,C'        ')                    
/*                                                                              
//*-----------------------------------------------------------------            
//* EXCLUDE CASES WHERE K800-NUM-SUB-TRANSFER = 'N'                             
//* AS NO STAMPING IS REQUIRED                                                  
//*-----------------------------------------------------------------            
//STEP87   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F803,DISP=(SHR,DELETE)                                  
//SORTOUT  DD DSN=&&BP13F804,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(600,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(738,1,CH,NE,C'N')                                               
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT LIST OF OUTSTANDING STAMPING > 2 MTHS                                 
//* (FOR CONCESSIONARY AND BANK LOAN SUB-TRANSFER CASES)                        
//*-----------------------------------------------------------------            
//STEP88   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&BP13F804,DISP=(OLD,PASS)                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//*BP13L315 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//BP13L315 DD DSN=BP13.L315.BP13C315,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
    DSN SYSTEM(DSN)                                                             
    RUN PROGRAM(BP13C315) PLAN(BP13PCC) -                                       
    LIB('BP13.BATCH.LOADCOB')                                                   
//*-----------------------------------------------------------------            
//* SPOOL REPORT PRINTED FROM BP13D100 TO OUTPUT TO CD                          
//*-----------------------------------------------------------------            
//STEP90   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.L100.BP13D100,DISP=SHR                                   
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BP13.F450.MTLPRT IN BO, CURRENT REGN NUMBERS SEQUENCE        *         
//*-------------------------------------------------------------------*         
//STEP91   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F450.MTLPRT,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13F450,DISP=(NEW,PASS),                                    
//            SPACE=(TRK,(10,5),RLSE),UNIT=SYSDA,                               
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=23400)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(4,2,A,60,9,A,10,8,A),FORMAT=CH                               
//*-------------------------------------------------------------------*         
//* FINANCIAL TRANSACTION ON COMMITMENT DEPOSIT TRANSFER TO SMS                 
//*-------------------------------------------------------------------*         
//STEP92   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F450 DD DSN=&&P13F450,DISP=(OLD,PASS)                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR                                    
//BP13L428 DD SYSOUT=8,DEST=IOM8                                                
//BP13P428 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C428) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* BACKUP THE PRINTING FILE                                                    
//*-----------------------------------------------------------------            
//STEP95   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.L100.BP13D100,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.L100.BP13D100.PREVMTH,DISP=OLD                           
//INPUT2   DD DSN=BP13.F450.MTLPRT,DISP=SHR                                     
//OUTPUT2  DD DSN=BP13.F450.MTLPRT.PREVMTH,DISP=OLD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*-----------------------------------------------------------------            
//* EMPTY THE PRINTING FILE                                                     
//*-----------------------------------------------------------------            
//STEP96   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.L100.BP13D100,DISP=OLD                                   
//INPUT2   DD DSN=BP13.EMPTY.CHAR200,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F450.MTLPRT,DISP=OLD                                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT DEBARMENT FILE                                                         
//*-----------------------------------------------------------------            
//STEP97   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP04.K010.DEBAR,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP97,DISP=(NEW,PASS),                                     
//         SPACE=(TRK,(10,20),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                   
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,9,A,34,2,A),FORMAT=CH                                      
    INCLUDE COND=(21,2,CH,EQ,C'CO')                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE EMAIL REPORT OF DUPLICATE DEBARMENT                                  
//*-----------------------------------------------------------------            
//STEP98   EXEC PGM=BP13C10E,COND=(0,NE)                                        
//P04K010  DD DSN=&&STEP97,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K891 DD DSN=BP13.K895.OCCUP.HISTORY.PATH1,DISP=SHR,                       
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP27K025 DD DSN=BP27.K025.CAOIC,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP27K021 DD DSN=BP27.K025.CAOIC.PATH1,DISP=SHR,                               
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FOUT DD DSN=&&DUPRPT,DISP=(,PASS,DELETE),                                 
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=132,RECFM=FB)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L307)                                            
//*-----------------------------------------------------------------            
//STEP120  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L307.BP13C307,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L307)                                            
//*-----------------------------------------------------------------            
//STEP121  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L307.BP13C307.BANK,DISP=SHR                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L315)                                            
//*-----------------------------------------------------------------            
//STEP122  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L315.BP13C315,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L408)                                            
//*-----------------------------------------------------------------            
//STEP123  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L408.BP13C408,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L408)                                            
//*-----------------------------------------------------------------            
//STEP124  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L408.BP13C408.TP,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L408)                                            
//*-----------------------------------------------------------------            
//STEP125  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L408.BP13C408.TP2,DISP=SHR                               
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L408)                                            
//*-----------------------------------------------------------------            
//STEP126  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&DUPRPT,DISP=(OLD,PASS)                                      
//*-------------------------------------------------------------------*         
//*                                                                             
//*=================================================================            
//*                       END   OF   JOB                                        
//*=================================================================            
