//BP13A50G JOB (BP13P),'BP13A50G',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//        NOTIFY=CSD0071                                                        
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : TO GENERATE DATA SET THAT CONSIST OF                  *         
//*             SALES MODE / BALLOT DATE / NT / FT /                  *         
//*             FIRST-TIMER COUNT / FIRST-TIMER PERCENTAGE            *         
//* THIS JOB IS SCHDULED TO RUN DURING  LAUNCHING PERIOD              *         
//* BP13A50D - EXTRACT CASES FOR HOUSEHOLD CHECK                      *         
//* BP13A501 - SMS, RSL, DEBARMENT CHECK                              *         
//* BP13A50G - UPDATE BP13K730 SBF FILE                               *         
//*                                                                   *         
//*===================================================================*         
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP136852 SMR2 20170718 CATER FOR SALES-MODE = 'ROF'                         
//*-------------------------------------------------------------------          
//*-------------------------------------------------------------------*         
//* STEP0  :  TO DELETE SEQ. DATASET                                            
//*-------------------------------------------------------------------*         
//STEP00   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FF01.SALES.DEMAND')                                             
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*------------------------------------------------------------------           
//* SORT CASES ACCORDING TO SALES MODE / BALLOT DATE / NT / FT                  
//*------------------------------------------------------------------           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13F730,DISP=(NEW,PASS),                                   
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                                 
//          SPACE=(CYL,(50,15),RLSE)                                            
//SYSIN    DD  *                                                                
       SORT FIELDS=(376,3,A,334,6,A,187,3,A,211,2,A),FORMAT=CH                  
       INCLUDE COND=(376,3,CH,EQ,C'BTO',OR,376,3,CH,EQ,C'SBF',OR,               
                     376,3,CH,EQ,C'ROF')                                        
//*------------------------------------------------------------------           
//*------------------------------------------------------------------           
//* TO GENERATE RECORD PER SALES MODE / BALLOT DATE / NT / FT                   
//* WITH THE TOTAL NUMBER OF FIRST TIMER AND ITS PERCENTAGE                     
//*------------------------------------------------------------------           
//STEP02   EXEC PGM=BP13CF44,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,DELETE)                                  
//BP13FF01 DD DSN=BP13.FF01.SALES.DEMAND,DISP=(NEW,CATLG),                      
//          DCB=(BLKSIZE=0,LRECL=50,RECFM=FB),                                  
//          SPACE=(CYL,(1,5),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
