//BP13A533  JOB (BP13P),'BP13A533',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-----------------------------------------------------------------            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- --------------------                                           
//* BP130435 LSB 980225   REN CASES BYPASS TENANT PRIORITY SCHEME,STEP2A        
//* BP130418 LSB 980626   AC17 Y2000 CHANGES                                    
//* BP130630 YCH 990706   CHGE TO READ RDBII AND F715 TO F716                   
//* BP130652     990826   EXPAND F500,K500 RECL 300 TO 500                      
//* BP130788 LSB 000215   REPRO AC17 FILE IN BV1P3D050 RUN AT 5PM               
//*                       THIS JOB USING BP13.AC71.RENTAL FILE,                 
//*                       DELETE DEPENDENCY WITH AC17 FILE                      
//* BP130857 SSS 000626   ADD GROUPID                                           
//* BP132412 LSB 031003   HOUSEHOLD=T, DO NOT CHK 5 YR                          
//* BP132421 MJB 151003   ADD RENTAL SCH-ACCT, ALLOC-SCH & FLAT TYPE            
//*                       INTO F716 & OMIT ALLOC-SCH = 'THS', 'INC',            
//*                       'USW' & 'DHS'                                         
//* BP132421 LSB 221103   INCLUDE ONLY TENANT ROLE = 003                        
//* BP135171 RJE 100214   TO CATER FOR DB2 UPGRADE                              
//* BP137048 SMR 071117   TO STOP PRINTING OF HARDCOPY REPORTS                  
//*-----------------------------------------------------------------            
//* TENANT  PRIORITY  SCHEME  FOR NHH - 4-ROOM FLATS                            
//*-----------------------------------------------------------------            
//* STEP 01    - OUTREC NRIC1 - NRIC4 FOR NHH/4RM FROM REQUEST FILE             
//* STEP 03-04 - OUTREC NRIC FROM CIS RENTAL MASTER                             
//* STEP 05    - MATCH NRIC IN REUQEST WITH CIS NRIC (BP13C792)                 
//* STEP 09    - BACKUP BP13.F500.SEQUENCE TO BP13.F500.TENANT                  
//* STEP 10-11 - BACKUP WEIGHTAGE FILE, UPDATE RESIDENT SCHEME TO               
//*              BP13.F500.SEQUENCE                                             
//* STEP 12    - PRINT REPORT ON RESIDENT SCHEME                                
//*-----------------------------------------------------------------            
//*  TENANT PRIORITY SCHEME                                                     
//* - SORT OUT ONLY NEW HOUSEHOLD CASES APPLIED FOR 3 & 4 RM FLATS              
//* - AND ONLY FOR NT-WITH-LAND, APPLICANTS ONLY                                
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(160,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH,FILSZ=E50000                                 
   INCLUDE COND=(116,1,CH,EQ,C'H',AND,                                          
                (211,1,CH,EQ,C'3',OR,211,1,CH,EQ,C'4'))                         
//*-----------------------------------------------------------------            
//* OUTPUT BP13F716 FROM BP13F500 FILE FOR NRIC 1 - 4 HA ONLY                   
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C805,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(60,15),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REQUEST RECORDS IN NRIC ORDER                                          
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(60,15),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* OUTREC NRIC1 FROM RENTAL SYSTEM FILE                                        
//* INCLUDE PROPERTY-CODE = ZEROS, RENTAL FLATS                                 
//* OMIT NRIC = BLANK                                                           
//* OMIT CDE-TENLIVE NOT = 'L'                                                  
//* OMIT MODE ALLOCATION = 'THS' OR 'INC' OR 'USW'                              
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* TO EXTRACT RENTAL SCHEME ACCOUNT & ALLOCATION SCHEME                        
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                                   
//P13F716A DD DSN=&&F716Q748,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                                    
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                        
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716Q748,DISP=(OLD,PASS)                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=BP13.F716.CISTENC,DISP=OLD                                    
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//*  SORT REQUEST FILE IN REF-NO ORDER                                          
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&F500SEQ,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSIN     DD  *                                                               
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     SUM FIELDS=NONE                                                            
//*--------------------------------------------------------------------         
//*  DELETE AND DEFINE BP13K500 - TEMPRES FILE                                  
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&F500SEQ,DISP=(OLD,PASS)                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K500.TEMPRES) CLUSTER PURGE                                  
         DEF CL (NAME(BP13.K500.TEMPRES) -                                      
                 CYL(60 20)                -                                    
                 UNIQUE                   -                                     
                 SPEED                   -                                      
                 IMBED                   -                                      
                 SHR(2 3))                -                                     
                 DATA                     -                                     
                 (NAME(BP13.K500.TEMPRES.DATA) -                                
                 KEYS(8 122)               -                                    
                 RECSZ(500 500)           -                                     
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN               -                                     
           REPRO IFILE(INPUT)             -                                     
                 ODS(BP13.K500.TEMPRES)                                         
//*---------------------------------------------------------------------        
//*  SORT TENANT FILE IN REF-NO ORDER INCLUDE ROLE = 003 TENANT                 
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.CISTENC,DISP=SHR                                    
//SORTOUT  DD DSN=&&F716ROLE,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(90,30),RLSE),                          
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN     DD  *                                                               
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
     INCLUDE COND=(75,3,CH,EQ,C'003',AND,51,4,CH,LT,C'7000')                    
//*---------------------------------------------------------------------        
//*  SORT TENANT  FILE IN REF-NO ORDER                                          
//*---------------------------------------------------------------------        
//STEP8A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716ROLE,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716TAG,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),SPACE=(CYL,(90,30),RLSE),                          
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN     DD  *                                                               
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
     OMIT COND=(150,3,CH,EQ,C'THS',OR,150,3,CH,EQ,C'INC',OR,                    
                150,3,CH,EQ,C'USW',OR,150,3,CH,EQ,C'DHS')                       
//*---------------------------------------------------------------------        
//*  SORT TENANT  FILE IN REF-NO ORDER                                          
//*---------------------------------------------------------------------        
//STEP8A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F558,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN     DD  *                                                               
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
//*--------------------------------------------------------------------         
//* UPDATE NEW HOUSEHOLD TYPE FROM NHH TO NHT                                   
//*--------------------------------------------------------------------         
//STEP09   EXEC PGM=BP13U760,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&BP13F558,DISP=(OLD,PASS)                                    
//BP13F716 DD DSN=&&F716TAG,DISP=(OLD,PASS)                                     
//BP13K500 DD DSN=BP13.K500.TEMPRES,DISP=OLD,                                   
//            AMP=('BUFND=23')                                                  
//P13F558A DD DSN=BP13.F558.UPGOCCP,DISP=OLD                                    
//BP13L760 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*  BACKUP BP13.F500.SEQUENCE TO BP13.F500.TENANT                              
//*--------------------------------------------------------------------         
//STEP10 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                  
//OUTPUT1   DD DSN=BP13.F500.TENANT,DISP=OLD                                    
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*  REPRO FROM VSAM TO SEQUENTIAL FILES                                        
//*  BP13.F500.SEQUENCE - WITH WEIGHTAGE SCHEME + RESIDENT SCHEME INFO          
//*--------------------------------------------------------------------         
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.K500.TEMPRES,DISP=OLD,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*---------------------------------------------------------------------        
//* PRINT REPORT ON NRIC DETERMINE AS TENANT PRIORITY SCHEME                    
//*---------------------------------------------------------------------        
//STEP12    EXEC  SAS,COND=(0,NE)                                               
//BP13F716  DD DSN=&&F716TAG,DISP=(OLD,PASS)                                    
//BP13L742  DD SYSOUT=*                                                         
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S742),DISP=SHR                            
