//BP13D011 JOB (BP13P),'BP13D011',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*=================================================================            
//* NOTE : DO NOT CHANGE STEP NUMBER                                            
//*-----------------------------------------------------------------            
//* SEND EMAIL ON KEYS TO BE RETURNED                                           
//*=================================================================            
//* CHG REF  BY   ON        DESCRIPTION                                         
//* -------- ---  --------  -----------                                         
//* BP132638 SSS  20050117  NEW JOB                                             
//*=================================================================            
//* BACKUP F120.KEYLOCN                                                         
//*-----------------------------------------------------------------            
//STEP01   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BM06.F120.KEYLOCN,DISP=SHR                                    
//OUTPUT1  DD DSN=BM06.F120.KEYLOCN.BKUP,DISP=OLD                               
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
//*-----------------------------------------------------------------            
//* SORT BM06F120 IN BO-CODE SCH-ACC-NO SEQUENCE                                
//*-----------------------------------------------------------------            
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BM06.F120.KEYLOCN,DISP=SHR                                    
//SORTOUT  DD DSN=&&M06F120K,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(25,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=700,BLKSIZE=27300)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(509,2,A,1,11,A),FORMAT=CH                                      
/*                                                                              
//*-----------------------------------------------------------------            
//* SEND EMAIL ON KEYS TO BE RETURNED                                           
//*-----------------------------------------------------------------            
//STEP03   EXEC  PGM=BP13C22K,COND=(0,NE)                                       
//BM06F120 DD DSN=&&M06F120K,DISP=(SHR,PASS)                                    
//BP13K435 DD DSN=BP13.K435.KEY.BORROW,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13MAIL DD DSN=BP13.MAILOUT.C22K,DISP=OLD                                    
//M06F120A DD DSN=BM06.F120.KEYLOCN,DISP=OLD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO BO ON KEYS TO BE RETURNED                          
//*-----------------------------------------------------------------            
//STEP04   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.C22K,DISP=SHR                                    
/*                                                                              
//*=================================================================            
//* END JOB BP13D205                                                            
//*=================================================================            
