//BP13A402 JOB (BP13P),'BP13A402',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-----------------------------------------------------------------            
//* CHG-NO   BY   ON      DESCRIPTION                                           
//* ------------- -------------------                                           
//* BP136438 RJB1 151216  NEW REPORT ON PENDING KEYS                            
//* BP136525 RJB1 221216  TO CATER FOR NEW COLUMNS IN THE REPORT                
//*                       ADDED COND IN STEP01 AND ADDED KB05 IN STEP02         
//* BP136665 RJB1 080317  TO CATER FOR SENDMAIL                                 
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.KC40.PENDKEY,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13FC40,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(10,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=100)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(57,03,CH,NE,C'REJ',AND,                                         
                57,03,CH,NE,C'KI ')                                             
//*-------------------------------------------------------------------*         
//*                                                                   * 11      
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13FC40 DD DSN=&&BP13FC40,DISP=(OLD,PASS,DELETE)                             
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13KB05 DD DSN=BP13.KB05.JOURNAL,DISP=SHR                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR                                   
//BP13LKA1 DD DSN=BP13.LKA1.REPORT,DISP=SHR                                     
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CKA1) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*****************************************************************             
//*         AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*****************************************************************             
//STEP03   EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD DSN=&&P13MHDG,DISP=(NEW,PASS),                                    
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=550,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*                                                                             
//*---------------------------------------------------------------------        
//STEP04   EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                 
//SYSOUT   DD SYSOUT=*                                                          
//MAILNAME DD DSN=&&MAILNAME,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                        00080000
//            DCB=(RECFM=VB,LRECL=550)                                  00090001
//MAILRCPT DD DSN=&&MAILRCPT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                        00080000
//            DCB=(RECFM=VB,LRECL=550)                                  00090001
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
    FILE MAILNAME;                                                              
    PUT @01 '           FILENAME="BP13LKA1.TXT"';                               
    PUT @01 ' ';                                                                
  RUN;                                                                          
//         DD DSN=BP13.MAIL.BP13CKA1,DISP=SHR                                   
//         DD *                                                                 
    PUT @01 'SUBJECT : DETAILS OF CASES WHERE THE KEYS ARE AVAILABLE/NOT AVAILA'
        @67 'BLE';                                                              
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=*.STEP03.SMTPHDR,DISP=(OLD,DELETE)                            
//         DD DSN=&&MAILRCPT,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&MAILNAME,DISP=(OLD,DELETE)                                  
//         DD *                                                                 
//         DD DSN=BP13.LKA1.REPORT,DISP=SHR                                     
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILRPT.BP13CKA1,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//STEP06   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13CKA1,DISP=SHR                                
//*                                                                             
