//BP13D224 JOB (BP13P),'BP13D224',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
/*JOBPARM SYSAFF=MVS2                                                           
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* INPUT FILE = BP13.F595.SOCNOTFD.AFQUE.AY0H                                  
//* REPORT FOR BP13AY0H(FT)                                                     
//* BP13L828 = BP13.L828.BP13S828.AFQUE.AY0H                                    
//* P13L828A = BP13.L828.DETAIL.AY0H                                            
//* BP13LB83 = BP13.LB83.BP13CB83.AFQUE.AY0H                                    
//*=================================================================            
//* CHG-NO   BY    ON   - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP135237 LSB 280214 - CHG K595.BALLOT.LOG TO K595.BP13D220                  
//* BP136160 SMR 110316 - OUTREC HOUSEHOLD, BALLOT-HH & FT2T TO BP13F007        
//* BP137734 LSB 050419 - INCLUDE SMS-FD IN BP13F008 REPORT, DEL CB83           
//* BP137958 KV6 050819 - DELETE INLCUDE COND (COL 487)IN STEP01/03/05          
//*=================================================================            
//*- REPORT FOR FT (BP13AY0H)                                                   
//*------------------------------------------------------------------           
//* BYPASS REQUEST-STATUS=S (COL 487)                                           
//*------------------------------------------------------------------           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0H,DISP=SHR                         
//SORTOUT DD DSN=&&F730AFQ,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),                                             
//        SPACE=(CYL,(180,30),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(467,2,A,123,8,A),FORMAT=CH                                      
   INCLUDE COND=(467,2,CH,GE,C'01')                                             
//*---------------------------------------------------------------------        
//* PRINT DETAIL REPORT ON NOT BOOK AFTER CHECK REQUEST-STATUS                  
//*---------------------------------------------------------------------        
//STEP02   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                    
//WORK     DD UNIT=(SYSDA,20),SPACE=(CYL,(60,20))                               
//BP13F740 DD DSN=&&F730AFQ,DISP=(OLD,PASS)                                     
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K023 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13L828 DD DSN=BP13.L828.BP13S828.AFQUE.AY0H,DISP=SHR                        
//P13L828A DD DSN=BP13.L828.DETAIL.AY0H,DISP=OLD                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S828),DISP=SHR                             
//*------------------------------------------------------------------           
//* SORT BY BK CNT/BK TAG/BE CNT/BTO CNT                                        
//* INCLUDE BK_TAG = 'N'                                                        
//* BYPASS REQUEST-STATUS=S (COL 487)                                           
//*------------------------------------------------------------------           
//* DO NOT PRINT THIS REPORT                                                    
//*------------------------------------------------------------------           
//*STEP03   EXEC SORT,COND=(0,NE)                                               
//*SORTIN  DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0H,DISP=SHR                        
//*SORTOUT DD DSN=&&CB83AFQ,DISP=(,PASS),                                       
//*        UNIT=SYSDA,                                                          
//*        DCB=(RECFM=FB,LRECL=500),                                            
//*        SPACE=(CYL,(50,30),RLSE)                                             
//*SYSIN   DD  *                                                                
//*   SORT FIELDS=(467,2,A,469,1,A,467,2,A),FORMAT=CH                           
//*   INCLUDE COND=(469,1,CH,EQ,C'N')                                           
//*---------------------------------------------------------------------        
//* DETAIL FOR BOOKED AND NOT BOOKED BTO/BE REQUEST (GLOBAL FIGURE)             
//* TAKE OUT THIS STEP FROM 06/04/2019                                          
//*---------------------------------------------------------------------        
//*STEP04   EXEC PGM=BP13CB83,COND=(0,NE)                                       
//*BP13F595 DD DSN=&&CB83AFQ,DISP=(OLD,PASS)                                    
//*BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K500 DD DSN=BP13.K500.BP13AY0H,DISP=SHR,                                 
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K501 DD DSN=BP13.K500.BP13AY0H.PATH1,DISP=SHR,                           
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K595 DD DSN=BP13.K595.BP13D220,DISP=SHR,                                 
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K591 DD DSN=BP13.K595.BP13D220.PATH1,DISP=SHR,                           
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K592 DD DSN=BP13.K595.BP13D220.PATH2,DISP=SHR,                           
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K593 DD DSN=BP13.K595.BP13D220.PATH3,DISP=SHR,                           
//*        AMP=('BUFND=4','BUFNI=8')                                            
//*BP13K594 DD DSN=BP13.K595.BP13D220.PATH4,DISP=SHR,                           
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                 
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13LB83 DD DSN=BP13.LB83.BP13CB83.AFQUE.AY0H,DISP=OLD                       
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT HIGH ATTEMPT CASE                                                  
//* COL 487 - BYPASS REQUEST-STATUS=S, ADD SMS-FD                               
//*------------------------------------------------------------------           
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0H,DISP=SHR                         
//SORTOUT DD DSN=&&BP13F007,DISP=(,PASS),                                       
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=200),                                             
//        SPACE=(CYL,(80,12),RLSE)                                              
//SYSIN   DD  *                                                                 
   SORT FIELDS=(470,2,A,123,8,A),FORMAT=CH                                      
   INCLUDE COND=(467,2,CH,GE,C'01')                                             
  OUTREC FIELDS=(41,9,123,8,82,9,376,3,187,3,211,2,213,3,3X,334,6,              
                225,1,116,1,461,1,475,1,397,1,149X)                             
//*-----------------------------------------------------------------    00170000
//* PRINT PROFILE                                                       00180000
//*-----------------------------------------------------------------    00210000
//STEP06   EXEC  PGM=BP13CY90,COND=(0,NE)                               01360018
//BP13F007 DD  DSN=&&BP13F007,DISP=(OLD,PASS)                           00230001
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00240000
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                          00250000
//             AMP=('BUFND=4','BUFNI=8')                                00260000
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                            00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K585 DD  DSN=BP13.K585.HARDLUCK,DISP=SHR,                         00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K828 DD  DSN=BP13.K828.HISTOCCP,DISP=SHR,                         00330002
//             AMP=('BUFND=4','BUFNI=8')                                00340000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00350002
//             AMP=('BUFND=4','BUFNI=8')                                00360002
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                    00350002
//             AMP=('BUFND=4','BUFNI=8')                                00360002
//BP13K593 DD  DSN=BP13.K593.UNSUCCNT,DISP=SHR,                         00370008
//             AMP=('BUFND=4','BUFNI=8')                                00380006
//BP13K595 DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                               
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K591 DD  DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                         
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13F008 DD  DSN=BP13.F008.AY0H.OUTPUT,DISP=OLD                       00450005
//SUMMARY   DD SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                 01620002
//SYSOUT   DD  SYSOUT=*                                                 01630002
