//BP13A221 JOB (BP13P),'USER:BP13',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//**********************************************************************        
//* IMPORTANT NOTE :                                                            
//* STEP00          - TO VERIFY THAT FILES ARE CLOSED.                          
//* STEP01 - STEP02 - TO DELETE BP13K230 AND BP13K240 RECORDS.                  
//* STEP03          - TO BACKUP CONTROL RECORDS.                                
//**********************************************************************        
//* ====================================================================        
//* CHG-NO   BY    ON        DESCRIPTION                                        
//* ======== === ==========  ===========                                        
//* BP130956 AKT 23-11-2000  CHGE BP13F230 LRECL TO 250                         
//* BP131017 LMS 25-05-2001  TO REMOVE UPDATE TO K222,K230,K240.                
//* BP132278 JF4 28-03-2003  CHGE BP13F230/F240 LRECL TO 450.                   
//* BP133610 ESA129-05-2009  TO REPLACE BP13K767 WITH BP13K816                  
//* BP135281 ESA130-05-2014  TO REPLACE BP13K816 WITH BP13K813                  
//* ====================================================================        
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 6 IN BP13B289 - DELETE INTV FLATLIST                    
//*--------------------------------------------------------------------         
//STEP00   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.INDELREC,DISP=OLD                                   
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'DL')                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F230.BP13A221                                        
//*--------------------------------------------------------------------         
//STEP1   EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F230.BP13A221,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F230.BP13A221                                        
//*--------------------------------------------------------------------         
//STEP2   EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F240.BP13A221,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* DELETE THE INTV FILE                                                        
//*---------------------------------------------------------------------        
//STEP3  EXEC    PGM=BP13C234,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.INDELREC,                                          
//             DISP=SHR                                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13F230 DD  DSN=BP13.F230.BP13A221,                                          
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13F240 DD  DSN=BP13.F240.BP13A221,                                          
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*     ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                         
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.INDELREC,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A221                                                                
//*---------------------------------------------------------------------        
