//BP13M900 JOB (BP13P),'BP13M900',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*=================================================================            
//*-----------------------------------------------------------------            
//* CHG-NO   BY    ON    -                                                      
//*-----------------------                                                      
//* BP137196 LSB1 110518 - BACKUP BP13L26C                                      
//* BP138273 LSB1 220420 - DELETE C933, C934                                    
//*=================================================================            
//*-------------------------------------------------------------------*         
//* REPRO ACCUMULATED TRANS TO MONTHLY BACKUP                         *         
//*-------------------------------------------------------------------*         
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.F010.DEBAR.SOC.ACCUM,                                   
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F010.DEBAR.SOC.MONTH(+1),                               
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(BP13.GDG,RECFM=FB,LRECL=300,BLKSIZE=27900)                  
//*                                                                             
//INPUT2   DD  DSN=BP13.L26C.DEBAR.ACCUM,                                       
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.L26C.DEBAR.MONTH(+1),                                   
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(BP13.GDG,RECFM=FB,LRECL=200,BLKSIZE=27800)                  
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  REPRO INFILE(INPUT1) OFILE(OUTPUT1)                                           
  REPRO INFILE(INPUT2) OFILE(OUTPUT2)                                           
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY ACCUMULATED TRANSACTION FILE                                *         
//*-------------------------------------------------------------------*         
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DUMMY                                                            
//OUTPUT1  DD  DSN=BP13.F010.DEBAR.SOC.ACCUM,                                   
//             DISP=OLD                                                         
//OUTPUT2  DD  DSN=BP13.L26C.DEBAR.ACCUM,                                       
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  REPRO INFILE(INPUT1) OFILE(OUTPUT1)                                           
  REPRO INFILE(INPUT1) OFILE(OUTPUT2)                                           
//*                                                                             
//*-------------------------------------------------------------------*         
//*  END OF JOB                                                                 
//*-------------------------------------------------------------------*         
