//BP13A537 JOB (BP13P),'BP13A537',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* EXTRACT WAITING LIST APLLN FOR PIGEONHOLING                                 
//* NOTE: THIS JCL WAS CHANGED TO FOLLOW BP13A500 FORMAT                        
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP130030 LSB 951006 - OMIT 3 ROOM APPLICATION IN STEP02                     
//* BP130062 LSB 951207 - OMIT EXEC-COND-TAG = 'C'                              
//* BP130061 SSS 951213 - REMOVE P13F800O IN BP13C575                           
//*                       REMOVE BP13C843                                       
//* BP130145 LSB 960711 - BYPASS SERS FOR BALLOTING                             
//* BP130341 LSB 970709 - BP13C853, READ BP13K060 FOR ZONE CODE                 
//* BP130323 LSB 970806 - DO NOT OMIT 10-YR=NO IN STEP01                        
//* BP130377 LSB 970915 - DO NOT OMIT EC-TAG = 'C' FOR 10-YR CHECK              
//* BP130418 CLT 980922 - Y2K COMPLIANCE CHANGES - BP13K800/BP13K820            
//* BP130652     990825 - EXPAND F500,F510,F520,K520 RECL 300 TO 500            
//* BP130857 SSS 000626 - ADD GROUPID                                           
//* BP132293 SK  030210 - READ BP13K703 FOR BP13C705                            
//* BP132317 ROM 030306 - TO CHANGE THE WHOLE JCL INTO BP13A500 FORMAT          
//* BP133150 ROM 030306 - TO UPDATE SORT 'NT' AND REMOVE BP13C705               
//* BP133239 IL5 170108 - TO UPDATE SORT 'NT' AND INCLUDE BP13C705              
//* BP133256 IL5 050208 - TO REMOVE HARDCODING OF NT IN STEP01                  
//* BP133362 IL5 230608 - TO HARDCODE BALLOT DATE FOR MAY BTO                   
//* BP133419 IL5 190808 - TO HARDCODE BALLOT DATE FOR JUN BTO                   
//* BP133432 MSD 170908 - EXTRACT MATURE REQUEST TAGGED FOR BALLOTING           
//* BP133511 IL5 300109 - REMOVE REPORT BP13L527                                
//* BP133511 IL5 300109 - REMOVE REPORT BP13L527                                
//* BP133604 IL5 080509 - INCLUDE NEW PROGRAM BP13C54D                          
//* BP135748 IL5 210515 - CHANGE PROGRAM BP13C577 TO BP13C059                   
//* BP137102 AM2 191218 - SORT OUT NUM-OPTION S6 FOR BP13C54D                   
//* BP137670 AM2 210219 - ADD STEPS TO TERMINATE JOB FOR OUTSTNDNG REGN         
//**************************************************************                
//*-------------------------------------------------------------------*         
//* STEP0  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//STEP0    EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.F500.NT.EXCP')                                                  
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT NUM-OPTION 'S6'                                                    
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K205,DISP=(NEW,PASS),                                    
//            SPACE=(TRK,(1,1),RLSE),UNIT=SYSDA,                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'S6')                                               
//*-----------------------------------------------------------------            
//* EXTRACT APPLICATIONS FOR BALLOTING BASED ON BP13K205                        
//*------------------------------------------------------------------           
//STEP02   EXEC PGM=BP13C54D,COND=(0,NE)                                        
//BP13F205 DD DSN=&&P13K205,DISP=(OLD,DELETE)                                   
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                                 
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F500 DD DSN=BP13.F500.NT,DISP=OLD                                         
//BP13L54D DD SYSOUT=*                                                          
//BP13L54E DD SYSOUT=*                                                          
//BP13L54F DD SYSOUT=*                                                          
//BP13L54G DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  IDENTIFY REG NO WITH FIELDS EQUAL BLANK                                    
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=BP13.F500.NT.EXCP,DISP=(NEW,CATLG),                           
//            SPACE=(CYL,(80,10),RLSE),DATACLAS=MULTIVOL,                       
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=((116,1,CH,EQ,C' ',OR,187,3,CH,EQ,C'   ',OR,                     
                211,2,CH,EQ,C'  ',OR,213,3,CH,EQ,C'   ',OR,                     
                225,1,CH,EQ,C' '),AND,260,1,CH,EQ,C' ')                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  CHECK OUTSTANDING REG NO                                                   
//*  RC0 - FILE NOT EMPTY, TERMINATE JOB                                        
//*  RC4 - FILE EMPTY, CONTINUE PROCESSING                                      
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.F500.NT.EXCP,DISP=SHR                                    
//SYSIN    DD *                                                                 
        PRINT INFILE(INPUT) COUNT(1)                                            
        IF LASTCC EQ 0 THEN SET MAXCC=4                                         
        IF LASTCC EQ 4 THEN SET MAXCC=0                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  REPRO MATURE REQUEST                                                       
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C059,COND=(0,NE)                                        
//BP13F500 DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//BP13F825 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=BP13.F558.UPGOCCP,DISP=OLD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* END BP13A537                                                                
//*---------------------------------------------------------------------        
