//BP13ADB3  JOB (BP13P),'BP13ADB3',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//**************************************************************                
//* RUN THIS JCL AFTER BP13D400 !!                                              
//**************************************************************                
//* CHG-NO   BY   DATE      - DESCRIPTION                                       
//*----------------------------------                                           
//* BP132113 LSB 07/03/2002 - NEW JCL                                           
//* BP132080 ANC 27/06/2002 - CHANGE SORT FIELD IN STEP04 TO                    
//*                           CATER FOR P04K010 NEW FILE LAYOUT                 
//* BP132290 CKK 13/03/2003 - CHANGE GROUPID                                    
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-------------------------------------------------------------                
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* REBUILD VSAM FILE BP13.K010.DEBAR                                 *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.BLANK.CHAR300,DISP=OLD                                   
//SYSIN    DD  *                                                                
          DEL (BP13.K010.DEBAR) CL PURGE                                        
          DEF CLUSTER                                -                          
              (NAME(BP13.K010.DEBAR)                -                           
              CYL(50 10)                             -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
            DATA                                     -                          
              (NAME(BP13.K010.DEBAR.DATA)           -                           
              KEYS(44 0)                             -                          
              RECSZ(300 300)                         -                          
              CISZ(8192)                             -                          
              FSPC(10 10))                           -                          
            INDEX                                    -                          
              (NAME(BP13.K010.DEBAR.INDEX)           -                          
              CISZ(8192))                                                       
      IF MAXCC = 0 THEN                              -                          
         REPRO IFILE(INPUT1)                         -                          
               ODS(BP13.K010.DEBAR)                                             
//*---------------------------------------------------------------------        
//* INCLUDE MCPS CASES. ALL MCPS CASES THAT'S SUCC.                             
//*---------------------------------------------------------------------        
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F740,DISP=(NEW,PASS),                                  
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(25,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,28,A),FORMAT=CH                                                
  INCLUDE COND=(226,3,CH,NE,C'   ',AND,                                         
                253,1,CH,NE,C' ')                                               
//*---------------------------------------------------------------------        
//* CREATE DEBARMENT RECORD                                                     
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13C002,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13K853 DD DSN=BP13.K853.MCPS,DISP=SHR                                       
//BP13K665 DD DSN=BP13.K665.DEBARREF.SOC,DISP=SHR                               
//BP04K010 DD DSN=BP13.K010.DEBAR,DISP=SHR                                      
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//BP13L002 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* SORT K010 TO F010 FOR DEBARMENT SYSTEM                            *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.DEBAR,DISP=SHR                                      
//SORTOUT  DD DSN=BP13.F010.DEBAR.SOC,DISP=MOD                                  
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,44,A),FORMAT=CH                                              
//*                                                                             
