//BP13D22B JOB (BP13P),'BP13D22B',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* COMPUTE FT HARDLUCK COUNT BP13CY92                                          
//*=================================================================            
//* CHG-NO   BY    ON   - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP134879 LSB 160410 - SPLIT JOB FROM BP13D220                               
//* BP135237 LSB 290314 - REFER TO BP13.K595.BP13D220 INSTEAD BALLOT.LOG        
//*                       RENAME THIS JOB FROM BP13D22H TO BP13D221             
//* BP135635 LSB 190115 - CATER FOR FTS                                         
//* BP136740 LSB 110817 - CATER FOR STS                                         
//* BP137734 LSB 060419 - TAKE OUT CY46 JOB, NO DATA OUTPUT FROM CY46           
//* BP138080 SMP 061119 - INCLUDE BP13K813 IN BP13CB70 TO CATER FOR             
//*                       'HL' BOOK STATUS                                      
//* BP139512 LSB 010323 - AD DATACLAS=MULTIVOL                                  
//*=================================================================            
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y1                                  
//*-----------------------------------------------------------------            
//STEP0A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K20H.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YH')                                               
//*-----------------------------------------------------------------            
//*------------------------------------------------------------------           
//* SORT BY REGN-NO                                                             
//*------------------------------------------------------------------           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.K500.BP13AY0H,DISP=SHR                                    
//SORTOUT DD DSN=&&F595CB80,DISP=(,PASS),                                       
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*------------------------------------------------------------------           
//* COMMENT OUT FIRST - FOR FUTURE USE (PA RECORDS)                             
//*------------------------------------------------------------------           
//*STEP01A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN  DD DSN=BP13.F595.CB8A.AY0H.PA,DISP=SHR                               
//*        DD DSN=BP13.F595.CB8A.AY0H.PAHA1,DISP=SHR                            
//*        DD DSN=&&F595CB80,DISP=(OLD,PASS)                                    
//*SORTOUT DD DSN=&&CB70PA,DISP=(,PASS),                                        
//*        UNIT=(SYSDA,3),                                                      
//*        DCB=(RECFM=FB,LRECL=500),                                            
//*        SPACE=(CYL,(250,50),RLSE)                                            
//*SYSIN   DD  *                                                                
//*SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*INCLUDE COND=(213,3,CH,NE,C'FTS')                                            
//*---------------------------------------------------------------------        
//* MATCH BP13K800 WITH REQUEST FILE TO TAG BOOK, GET BOOK-STATUS               
//* F800-NUM-ALLOC-TAG ID KEEP IN F595-TME-SYSTEM(COL 493)                      
//* NOTE : BOOK STATUS = 'HL' IS DETERMINED INSIDE BP13CB70                     
//*        MUST BE NME BTO, BLANK BOOK STATUS, REQ-STAT = W/R/P/K ONLY          
//*------------------------------------------------------------------           
//STEP02   EXEC PGM=BP13CB70,COND=(0,NE)                                        
//BP13F800 DD DSN=BP13.F800.BP13D220,DISP=SHR                           00120000
//BP13F595 DD DSN=&&F595CB80,DISP=(OLD,PASS)                            00120000
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F595A DD DSN=BP13.F595.CB70.AY0H,DISP=OLD,                         00120000
//            UNIT=(SYSDA,3),                                                   
//            SPACE=(CYL,(250,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),DATACLAS=MULTIVOL              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT NRIC1                                                              
//*------------------------------------------------------------------           
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.CB70.AY0H,DISP=SHR                           00120000
//SORTOUT DD DSN=&&F595SBF,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*------------------------------------------------------------------           
//* CHECK NRIC1/NRIC2/NRIC3/NRIC4 TO READ BP13K595                              
//* IF FOUND SUCC UNDER SBF/BE, DROP THE RECORD                                 
//* CHG REFER TO BP13.K595.BP13D220 INSTEAD OF BP13.K595.BALLOT.LOG             
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13CB93,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595SBF,DISP=(OLD,PASS)                                     
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13K595 DD DSN=BP13.K595.BP13D220,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K591 DD DSN=BP13.K595.BP13D220.PATH1,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K592 DD DSN=BP13.K595.BP13D220.PATH2,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K593 DD DSN=BP13.K595.BP13D220.PATH3,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K594 DD DSN=BP13.K595.BP13D220.PATH4,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=BP13.F595.CB93.AY0H,DISP=OLD                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* INCLUDE AFTER CUTOFF-DATE CASES                                             
//*------------------------------------------------------------------           
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.CB93.AY0H,DISP=SHR                                   
//SORTOUT DD DSN=&&P13CB93A,DISP=(,PASS),                                       
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A,261,8,A),FORMAT=CH                                       
   INCLUDE COND=(464,1,CH,EQ,C'A')                                              
//*------------------------------------------------------------------           
//* SORT BY NRIC1, DTE-QTR, DTE-REQUEST                                         
//* ONLY TAKE IN 469 = N CASES TO CHECK SBF/BE WITH BOOK-STATUS                 
//*------------------------------------------------------------------           
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.CB70.AY0H,DISP=SHR                                   
//SORTOUT DD DSN=&&F595CB71,DISP=(,PASS),                                       
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                               
//*-------------------------------------------------------------------*         
//*IF FOUND AFTER CUTOFF DATE, DELETE ALL RECORD WITH SAME NRIC                 
//*-------------------------------------------------------------------*         
//STEP07   EXEC PGM=BP13CY45,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595CB71,DISP=(OLD,PASS)                                    
//BP13F740 DD DSN=&&P13CB93A,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=BP13.F595.AY0H.CY45AF,DISP=OLD                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT BEFORE CUTOFF DATE CASES                                           
//*------------------------------------------------------------------           
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.CB93.AY0H,DISP=SHR                                   
//SORTOUT DD DSN=&&P13CB93B,DISP=(,PASS),                                       
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A,261,8,A),FORMAT=CH                                       
   INCLUDE COND=(464,1,CH,EQ,C'B')                                              
//*------------------------------------------------------------------           
//* SORT NY NRIC, DTE-QTE, DTE-REQUEST                                          
//*------------------------------------------------------------------           
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.AY0H.CY45AF,DISP=SHR                                 
//SORTOUT DD DSN=&&F595CY45,DISP=(,PASS),                                       
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                               
//*-------------------------------------------------------------------*         
//* IF FOUND CASES BEFORE CUTOFF DATE, DELETE ALL PREV RECORD                   
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=BP13CY45,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595CY45,DISP=(OLD,PASS)                                    
//BP13F740 DD DSN=&&P13CB93B,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=BP13.F595.AY0H.CY45BF,DISP=OLD                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT SBF/BE CASES                                                       
//* 06/05/2019 - TAKE OUT THIS STEP                                             
//*------------------------------------------------------------------           
//*STEP11   EXEC SORT,COND=(0,NE)                                               
//*SORTIN  DD DSN=BP13.F595.BP13D220,DISP=SHR                                   
//*SORTOUT DD DSN=&&F740SBFC,DISP=(,PASS),                                      
//*        UNIT=(SYSDA,3),                                                      
//*       DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//*       SPACE=(CYL,(250,50),RLSE)                                             
//*SYSIN   DD  *                                                                
//*   SORT FIELDS=(41,9,A,334,6,D,261,8,D),FORMAT=CH                            
//*   INCLUDE COND=(1,1,CH,NE,C' ',AND,                                         
//*              376,3,CH,EQ,C'SBF')                                            
//*------------------------------------------------------------------           
//*STEP12   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F595.AY0H.CY45BF,DISP=SHR                               
//*SORTOUT DD DSN=&&F595CUTA,DISP=(,PASS),                                      
//*        UNIT=(SYSDA,3),                                                      
//*        DCB=(RECFM=FB,LRECL=500),                                            
//*        SPACE=(CYL,(250,50),RLSE)                                            
//*SYSIN   DD  *                                                                
//*   SORT FIELDS=(41,9,A,334,6,D,261,8,D),FORMAT=CH                            
//*-------------------------------------------------------------------*         
//*STEP13   EXEC PGM=BP13CY46,COND=(0,NE)                                       
//*BP13F595 DD DSN=&&F595CUTA,DISP=(OLD,PASS)                                   
//*BP13F740 DD DSN=&&F740SBFC,DISP=(OLD,PASS)                                   
//*P13F595A DD DSN=BP13.F595.AY0H.CY46,DISP=OLD                                 
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSTSPRT DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.AY0H.CY45BF,DISP=SHR                                 
//SORTOUT DD DSN=BP13.F595.AY0H.CY46,DISP=OLD                                   
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A,334,6,D,261,8,D),FORMAT=CH                               
//*------------------------------------------------------------------           
//* SORT BY DTE-BALLOT, DTE-REQUEST                                             
//* BYPASS 1A FLAT                                                              
//*------------------------------------------------------------------           
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.AY0H.CY46,DISP=SHR                                   
//SORTOUT DD DSN=&&F595PA,DISP=(,PASS),                                         
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                               
   OMIT COND=(211,2,CH,EQ,C'1A',OR,                                             
              211,2,CH,EQ,C'SP',OR,                                             
              213,3,CH,EQ,C'FTS',OR,                                            
              213,3,CH,EQ,C'STS',OR,                                            
              248,3,CH,EQ,C'SSC',OR,                                            
              248,3,CH,EQ,C'JSS',OR,                                            
              248,3,CH,EQ,C'NCS',OR,                                            
              248,3,CH,EQ,C'SSE',OR,                                            
              248,3,CH,EQ,C'JSE',OR,                                            
              248,3,CH,EQ,C'NSE')                                               
//*-------------------------------------------------------------------*         
//*- PROCESS FT-FT(NON-FTS)                                                     
//*-------------------------------------------------------------------*         
//* COUNT NO OF ATTEMPT, COMPUTE BOOK/NOT-BOOK                                  
//* SYSTEM TO STOP COUNTING ONCE FOUND BOOK/INVITED(FN)                         
//* 467- BTO COUNT                                                              
//* 485- FN COUNT                                                               
//* 487- REQUEST-STATUS = S                                                     
//* 490- AFTER QUEUE, BTO COUNT                                                 
//* 492- BUY-STATUS                                                             
//* 493- ALLOC-TAG                                                              
//* 495- NE COUNT                                                               
//* 497- BK COUNT                                                               
//* 499- HARDLUCK COUNT                                                         
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=BP13CY92,COND=(0,NE)                                        
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13F595 DD DSN=&&F595PA,DISP=(OLD,PASS)                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=BP13.F595.AY0H.CB71,DISP=OLD                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*==================================================================           
//* PROCESS FTS                                                                 
//*==================================================================           
//* SORT BY REGN-NO                                                             
//*------------------------------------------------------------------           
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.K500.BP13AY0H.FTS,DISP=SHR                                
//SORTOUT DD DSN=&&BP13CB70,DISP=(,PASS),                                       
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*------------------------------------------------------------------           
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.CB8A.AY0H.FTS,DISP=SHR                               
//        DD DSN=BP13.F595.CB8A.AY0H.FTSHA1,DISP=SHR                            
//        DD DSN=&&BP13CB70,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=&&CB70FTS,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),DATACLAS=MULTIVOL,                                     
//        DCB=(RECFM=FB,LRECL=500),                                             
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(213,3,CH,EQ,C'FTS',OR,                                          
                213,3,CH,EQ,C'STS',OR,                                          
                248,3,CH,EQ,C'SSC',OR,                                          
                248,3,CH,EQ,C'JSS',OR,                                          
                248,3,CH,EQ,C'NCS',OR,                                          
                248,3,CH,EQ,C'SSE',OR,                                          
                248,3,CH,EQ,C'JSE',OR,                                          
                248,3,CH,EQ,C'NSE')                                             
//*---------------------------------------------------------------------        
//* MATCH BP13K800 WITH REQUEST FILE TO TAG BOOK, GET BOOK-STATUS               
//* F800-NUM-ALLOC-TAG ID KEEP IN F595-TME-SYSTEM(COL 493)                      
//* NOTE : BOOK STATUS = 'HL' IS DETERMINED INSIDE BP13CB70                     
//*        MUST BE NME BTO, BLANK BOOK STATUS, REQ-STAT = W/R/P/K ONLY          
//*------------------------------------------------------------------           
//STEP18   EXEC PGM=BP13CB70,COND=(0,NE)                                        
//BP13F800 DD DSN=BP13.F800.BP13D220,DISP=SHR                           00120000
//BP13F595 DD DSN=&&CB70FTS,DISP=(OLD,PASS)                             00120000
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F595A DD DSN=BP13.F595.CB70.AY0H.FTS,DISP=OLD                      00120000
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* INCLUDE FTS CASES                                                           
//*------------------------------------------------------------------           
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.CB70.AY0H.FTS,DISP=SHR                               
//SORTOUT DD DSN=&&F595FTS,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                               
   OMIT COND=(211,2,CH,EQ,C'1A',OR,                                             
              211,2,CH,EQ,C'SP')                                                
//*-------------------------------------------------------------------*         
//* COUNT NO OF ATTEMPT, COMPUTE BOOK/NOT-BOOK                                  
//* SYSTEM TO STOP COUNTING ONCE FOUND BOOK/INVITED(FN)                         
//* 467- BTO COUNT                                                              
//* 485- FN COUNT                                                               
//* 487- REQUEST-STATUS = S                                                     
//* 490- AFTER QUEUE, BTO COUNT                                                 
//* 492- BUY-STATUS                                                             
//* 493- ALLOC-TAG                                                              
//* 495- NE COUNT                                                               
//* 497- BK COUNT                                                               
//* 499- HARDLUCK COUNT                                                         
//*-------------------------------------------------------------------*         
//STEP20   EXEC PGM=BP13CY92,COND=(0,NE)                                        
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13F595 DD DSN=&&F595FTS,DISP=(OLD,PASS)                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=BP13.F595.AY0H.CB71.FTS,DISP=OLD                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
