//BP13M407 JOB (BP13P),'BP13M407',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010002
//         NOTIFY=CSD0071                                               00020002
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030002
//*-----------------------------------------------------------------    12800002
//* FILE TO IRAS ON TP OF NEW FLATS FOR THE MONTH                       12810002
//*-----------------------------------------------------------------    12820002
//STEP01   EXEC SORT,COND=(0,NE)                                        12830002
//SORTIN   DD DSN=BP13.F430.SOC.MBKUP(0),DISP=SHR                       12840002
//SORTOUT  DD DSN=&&BP13F430,DISP=(NEW,PASS),                           12850002
//            DCB=(RECFM=FB,LRECL=1000,BLKSIZE=27000),                  12860002
//            SPACE=(CYL,(10,5),RLSE)                                   12870002
//SYSIN    DD *                                                         12880002
    SORT FIELDS=(1,11,A),FORMAT=CH                                      12890002
//*-------------------------------------------------------------------- 12920002
//* CREATE FILE FOR IRAS                                                12930002
//*-------------------------------------------------------------------- 12940002
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       12950002
//BP13F430 DD DSN=&&BP13F430,DISP=(OLD,PASS)                            12960002
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                           12980002
//            AMP=('BUFNI=8','BUFND=4')                                 12990002
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                              13000002
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                           13010002
//            AMP=('BUFNI=8','BUFND=4')                                 13020002
//BP13F40A DD DSN=BP13.F40A.SALE,DISP=OLD,                              13030002
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   12860002
//            SPACE=(CYL,(5,5),RLSE)                                    12870002
//SYSOUT   DD SYSOUT=*                                                  13040002
//SYSTSPRT DD SYSOUT=*                                                  13050002
//SYSPRINT DD SYSOUT=*                                                  13060002
//SYSDBG   DD SYSOUT=*                                                  13070002
//SYSDBOUT DD SYSOUT=*                                                  13080002
//SYSTSIN  DD *                                                         13090002
    DSN SYSTEM(DSN)                                                     13100002
    RUN PROGRAM(BP13C40A) PLAN(BP13PCC) -                               13110002
        LIB('BP13.BATCH.LOADCOB')                                       13120002
/*                                                                      13130002
//*---------------------------------------------------------------------        
//* BACKUP FILES TO GDG                                                         
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F40A.SALE,DISP=SHR                                      
//OUTPUT1  DD  DSN=BP13.F40A.SALE.MBKUP(+1),                                    
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(5,5),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                  
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
