//BP13M719  JOB (BP13P),'BP13M719',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* RUN ON 28TH OF THE MONTH FOR MA&B TO VERIFY INTEREST REBATE                 
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - MA&B UNIT                    
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* DEFINE NEW DATASETS FOR BP13KD* SERIES                                      
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.KD00.TEMP)                  -                  00810000
              CYL(4 5)                              -                   00830000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.KD00.TEMP.DATA)             -                  00870000
              KEYS(8 0)                              -                  00880000
              RECSZ(1600 1600)                       -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.KD00.TEMP.INDEX) -                             00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.KD00.TEMP)                                       00720000
//*-----------------------------------------------------------------            
//* DEFINE BP13.KD38.A070125 FILE                                               
//*-----------------------------------------------------------------            
//STEP02    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.KD38.PPTRANS,DISP=SHR                                   
//SYSIN     DD  *                                                               
            DEF CLUSTER (NAME(BP13.KD38.TEMP)         -                 00800000
                CYL(3 2)                              -                 00830000
                UNIQUE                                -                 00840000
                STORCLAS(PRODRLS)                     -                         
                LOG(NONE)                             -                         
                SHR(2 3))                             -                 00850000
              DATA                                    -                 00860000
                (NAME(BP13.KD38.TEMP.DATA)            -                 00870000
                 KEYS(13 0)                           -                 00880000
                 RECSZ(400 400)                       -                 00890000
                 CISZ(4096)                           -                 00900000
                 FSPC(10 10))                         -                 00910000
              INDEX                                   -                 00920000
                (NAME(BP13.KD38.TEMP.INDEX)           -                 00930000
                 CISZ(4096))                                            00940000
            IF MAXCC = 0  THEN                        -                 00950000
               REPRO IFILE(INPUT1)                    -                 00960000
               ODS(BP13.KD38.TEMP)                                      00720000
//*-----------------------------------------------------------------            
//* SORT IN REGN-NO ORDER                                                       
//*-----------------------------------------------------------------            
//STEP03   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.KD30.PPDUEDTE,                                           
//            DISP=SHR                                                          
//SORTOUT  DD DSN=&&FD30SORT,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,05),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//*  CREATE INTEREST REBATE FOR MORTGAGE LOAN.                                  
//*  FOR PP=01, DUE-DATE = 200702                                               
//*-----------------------------------------------------------------            
//STEP04   EXEC  PGM=BP13CC49,COND=(0,NE)                                       
//BP13FD30 DD DSN=&&FD30SORT,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD00 DD DSN=BP13.KD00.TEMP,DISP=SHR                                       
//BP13KD38 DD DSN=BP13.KD38.TEMP,DISP=SHR                                       
//BP13F125 DD DSN=&&BP13F125,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(5,3),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//BP13LC49 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*  SORT BY KEY = SCHEME ACCOUT                                                
//*-----------------------------------------------------------------            
//STEP05   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.KD30.PPDUEDTE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13FD30,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,05),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(19,11,A),FORMAT=CH                                              
   OMIT COND=(19,11,CH,EQ,C'           ')                                       
//*-----------------------------------------------------------------            
//* OUTPUT CASES THAT DUE IN PREVIOUS MONTH, AND PAID IN THIS MONTH             
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=BP13CC67,COND=(0,NE)                                        
//BP13FD30 DD DSN=&&BP13FD30,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//P13FD30A DD DSN=&&FD30INTD,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                              
//            SPACE=(CYL,(1,3),RLSE)                                            
//BP13LC67 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* BP13FD69 IS OUTPUT FROM BP13M713, COMPUTE INTEREST FOR THE MONTH            
//* SORT BY KEY = SCHEME ACCOUT                                                 
//*-----------------------------------------------------------------            
//STEP07   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.FD69.INTEREST,DISP=SHR                                   
//SORTOUT  DD DSN=&&FD69SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,05),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=120,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
   OMIT COND=(1,11,CH,EQ,C'           ')                                        
//*-----------------------------------------------------------------            
//* CREATE INTEREST REBATE FOR MORTGAGE LOAN - EXISTING LOAN                    
//*-----------------------------------------------------------------            
//STEP08   EXEC  PGM=BP13CC68,COND=(0,NE)                                       
//BP13FD30 DD DSN=&&FD30INTD,DISP=(OLD,PASS)                                    
//BP13FD69 DD DSN=&&FD69SORT,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD00 DD DSN=BP13.KD00.TEMP,DISP=SHR                                       
//BP13F125 DD DSN=&&F125MTH,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(5,3),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//BP13LC68 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*  DELETE TEMP VSAM DATASETS                                                  
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DEL   ('BP13.KD00.TEMP') CL PURGE                                           
    DEL   ('BP13.KD38.TEMP') CL PURGE                                           
