//BP13D50K JOB (BP13P),'BP13D50K',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*====================================================================         
//*                                                                             
//*  TO GENERATE REPORT BP13S16B AND FTP TO SERVER                              
//*                                                                             
//*====================================================================         
//* CHG REF  BY   DDMMCCYY DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP139682 AM25 11082023 NEW JOB STREAM                                       
//*          AM25 26022024 REVERT CHANGES ON BP13C021                           
//*====================================================================         
//*--------------------------------------------------------------------         
//* DELETE SEQUENTIAL FILE                                                      
//*--------------------------------------------------------------------         
//STEP000  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL (BP13.CLOUD.BP13D50K.L16B)                                             
     DEL (BP13.FTP.BP13D50K)                                                    
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*--------------------------------------------------------------------         
//*  SORT AND MERGE BTO/SBF FILES                                               
//*--------------------------------------------------------------------         
//STEP010  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT.BTO,DISP=SHR                           
//         DD DSN=BP13.F730.DAILY.REPORT.BE,DISP=SHR                            
//SORTOUT  DD DSN=&&F730L16B,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(50,50),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*--------------------------------------------------------------------         
//*  GENERATE MERGED EXCEPTION REPORT                                           
//*--------------------------------------------------------------------         
//STEP020  EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(50,50))                                    
//BP13F730 DD DSN=&&F730L16B,DISP=(OLD,DELETE)                                  
//BP13L16B DD DSN=BP13.CLOUD.BP13D50K.L16B,DISP=(NEW,CATLG),                    
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(50,50),RLSE),DATACLAS=MULTIVOL                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S16B),DISP=SHR                             
//*--------------------------------------------------------------------         
//*  GENERATE FILE TRANSFER STATEMENTS                                          
//*--------------------------------------------------------------------         
//STEP030  EXEC PGM=EZACFSM1,COND=(0,NE)                                        
//SYSOUT   DD DSN=BP13.FTP.BP13D50K,DISP=(NEW,CATLG),                           
//            DCB=(BLKSIZE=0,LRECL=80,RECFM=FB),                                
//            SPACE=(CYL,(1,1),RLSE)                                            
//SYSIN    DD *                                                                 
CD /PROD/APPN/DATA/ISGCLOUD/BP13/FROM-HDB/APPL-STG                              
ASCII                                                                           
PUT 'BP13.CLOUD.BP13D50K.L16B' BP13L16_&LYR4&LMON&LDAY..txt                     
PUT 'BP13.CLOUD.BP13DFT2.LB35A' BP13LB35_&LYR4&LMON&LDAY..txt                   
PUT 'BP13.CLOUD.BP13D501.L506G' BP13L506_&LYR4&LMON&LDAY..txt                   
QUIT                                                                            
//*--------------------------------------------------------------------         
//*  STEP TO FTP INTO IDEAL SERVER                                              
//*--------------------------------------------------------------------         
//STEP040  EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.FTP.BP13D50K,DISP=SHR                                    
