//BP13AY0C JOB (BP13P),'BP13AY0C',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* CHG-NO   BY    ON     - DESCRIPTION                                         
//*-------------------------------------------                                  
//* BP134504 LSB 06062010 - CATER FOR SBF                                       
//* BP134931 LSB 31052013 - CATER FOR SBF                                       
//* BP134931 IMC 17072013 - ADD NEW BP13F730 OUTPUT FOR BP13CB95                
//* BP135089 IMC 01102013 - ADD NEW BP13L55B OUTPUT FOR BP13CY67                
//* BP135251 LSB 12052014 - CHG BP13K816 TO BP13K813, CHG CY67 TO CY5D          
//* BP135338 LSB 19062014 - ADD BP13F55Y, F55Z                                  
//* BP136888 LSB 10072017 - ADD ROF                                             
//* BP137358 FNP 30052018 - EXPAND BP13F55A FROM 800 TO 1200                    
//* BP138080 SMP 06112019 - INCLUDE BP13K813 IN BP13CB70 TO CATER FOR           
//*                         'HL' BOOK STATUS                                    
//* BP137872 KR13 15112019 - CHANGE CY67 TO CY5D                                
//* BP138417 KR13 30112020 - F55A SCH-ACC COL 610                               
//* BP139220 KR13 07062022 - F55A SCH-ACC COL 194                               
//*=================================================================            
//* REPORT ON BTO APPLICATION (REPEAT/INVITED)                                  
//*=================================================================            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y1                                  
//*-----------------------------------------------------------------            
//STEP0A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YC')                                               
//*---------------------------------------------------------------------        
//* INCLUDE BOOKED CASES FROM MASTER BP13K800                                   
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F800,DISP=(,PASS),                                     
//             UNIT=(SYSDA,3),SPACE=(CYL,(350,50),RLSE),                        
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(785,6,CH,GE,C'200805',AND,                                      
               (924,3,CH,EQ,C'BTO',OR,924,3,CH,EQ,C'SBF',OR,                    
                924,3,CH,EQ,C'ROF'))                                            
//*---------------------------------------------------------------------        
//* INCLUDE BOOKED CASES FROM HISTORY BP13K893                                  
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F800,DISP=(MOD,PASS),                                  
//             UNIT=(SYSDA,3),SPACE=(CYL,(350,50),RLSE),                        
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(785,6,CH,GE,C'200805',AND,                                      
               (924,3,CH,EQ,C'BTO',OR,924,3,CH,EQ,C'SBF',OR,                    
                924,3,CH,EQ,C'ROF'))                                            
  OUTREC FIELDS=(1,2000)                                                        
//*-----------------------------------------------------------------            
//* MATCH F205 TO GET QTR AS REQUESTED IN SOCY                                  
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13CY63,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F800A DD DSN=&&F800QTR,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,3),SPACE=(CYL,(250,30),RLSE),                         
//            DCB=(LRECL=2000,RECFM=FB)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT BY BALLOT CASES ON BTO QTR                                             
//* ONLY INCLUDE FIRST TIMER                                                    
//*---------------------------------------------------------------------        
//* INCLUDE BALLOT-QTR GT 2007, BTO                                             
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F595,DISP=(,PASS),                                     
//             UNIT=SYSDA,SPACE=(CYL,(220,30),RLSE),                            
//             DCB=(RECFM=FB,LRECL=500)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  OMIT COND=(1,1,CH,EQ,C' ',OR,                                                 
           334,6,CH,LT,C'200805',OR,                                            
          (376,3,CH,NE,C'BTO',AND,376,3,CH,NE,C'SBF',OR,                        
           376,3,CH,NE,C'ROF'))                                                 
//*---------------------------------------------------------------------        
//* CHG ON 04/08/2011 - ALLOW HHTY=G, GRO CASES, CANCELL AFTER BALLOTING        
//*---------------------------------------------------------------------        
//**       260,1,CH,EQ,C'C',OR,                                                 
//*****    116,1,CH,EQ,C'G',OR,                                                 
//*---------------------------------------------------------------------        
//*-----------------------------------------------------------------            
//* MATCH F205 TO GET QTR AS REQUESTED IN SOCY                                  
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13CY64,COND=(0,NE)                                        
//BP13F595 DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=&&F595NT,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(150,30),RLSE),                             
//            DCB=(LRECL=500,RECFM=FB)                                          
//P13F595B DD DSN=&&F595BALT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,30),RLSE),                             
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT BY REGN-NO                                                             
//*------------------------------------------------------------------           
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=&&F800QTR,DISP=(OLD,PASS)                              00120000
//SORTOUT DD DSN=&&F800NT,DISP=(,PASS),                                         
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(350,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* MATCH BP13K800 WITH REQUEST FILE TO TAG BOOK, GET BOOK-STATUS               
//* F800-NUM-ALLOC-TAG ID KEEP IN F595-TME-SYSTEM(COL 493)                      
//* NOTE : BOOK STATUS = 'HL' IS DETERMINED INSIDE BP13CB70                     
//*        MUST BE NME BTO, BLANK BOOK STATUS, REQ-STAT = W/R/P/K ONLY          
//*------------------------------------------------------------------           
//STEP07   EXEC PGM=BP13CB70,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800NT,DISP=(OLD,PASS)                              00120000
//BP13F595 DD DSN=&&F595NT,DISP=(OLD,PASS)                              00120000
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                            00120000
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F595A DD DSN=&&F595CB70,DISP=(NEW,PASS),                           00120000
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(250,30),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BP13K595 BY NRIC/DATE-BALLOT                                           
//* GRO WITH DUPLICATE NRIC                                                     
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595CB70,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F595.AY0C.BALCNT,DISP=SHR                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A,334,6,A,187,3,A),FORMAT=CH                                
  INCLUDE COND=(334,6,CH,GE,C'200805',AND,                                      
                2,1,CH,NE,C' ')                                                 
//*-------------------------------------------------------------------*         
//*  COUNT NO OF DATE-BALLOT BY NRIC                                  *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=BP13CB85,COND=(0,NE)                                        
//BP13F595 DD DSN=BP13.F595.AY0C.BALCNT,DISP=SHR                                
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K825 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=BP13.F595.AY0C,DISP=OLD                                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*-----------------------------------------------------------------            
//* SORT BP13F595 BY NT/FT/BAL-CNT                                              
//*-----------------------------------------------------------------            
//STEP10  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.F595.AY0C,DISP=SHR                                       
//SORTOUT  DD DSN=&&F595QTR,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(250,30),RLSE)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,474,1,A),FORMAT=CH                               
//*INCLUDE COND=(461,1,CH,NE,C'G')                                              
//*-----------------------------------------------------------------            
//* MATCH F205 TO GET QTR AS REQUESTED IN SOCY                                  
//*---------------------------------------------------------------------        
//STEP10A  EXEC PGM=BP13CY64,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595QTR,DISP=(OLD,PASS)                                     
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=&&F595Y64A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,30),RLSE),                             
//            DCB=(LRECL=500,RECFM=FB)                                          
//P13F595B DD DSN=&&F595Y64B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(150,30),RLSE),                             
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT BOOKING PROFILE, TAKE-UP RATE NON-SELN                                
//*-----------------------------------------------------------------            
//STEP11   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F595 DD DSN=&&F595Y64B,DISP=(OLD,PASS)                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13L078A DD DSN=BP13.L078.P13L078A,DISP=SHR                                   
//P13L078B DD DSN=BP13.L078.P13L078B,DISP=SHR                                   
//P13F078A DD DSN=BP13.L078.P13F078A,DISP=SHR                                   
//P13F078B DD DSN=BP13.L078.P13F078B,DISP=SHR                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S078),DISP=SHR                             
//*-----------------------------------------------------------------            
//* SORT BP13F595 BY NRIC/DTE-BAL/NT/FT/BAL-CNT                                 
//*-----------------------------------------------------------------            
//STEP12  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.F595.AY0C,DISP=SHR                                       
//SORTOUT  DD DSN=&&F595S080,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(250,100),RLSE)                                        
//SYSIN    DD *                                                                 
  SORT FIELDS=(41,9,A,334,6,A,187,3,A,211,2,A,474,1,A),FORMAT=CH                
  INCLUDE COND=((474,1,CH,EQ,C'Y',OR,467,1,CH,EQ,C'Y'),AND,                     
                 211,1,CH,EQ,C'4',AND,                                          
                 461,1,CH,NE,C'G')                                              
//*-----------------------------------------------------------------            
//* PRINT UNSUCC COUNT WITH INCOME PROFILE                                      
//*-----------------------------------------------------------------            
//STEP13   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F595 DD DSN=&&F595S080,DISP=(OLD,PASS)                                    
//BP13L080 DD DSN=BP13.L080.BP13S080,DISP=OLD                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S080),DISP=SHR                             
//*===================================================================*         
//* REPORT FOR PMU                                                      00170000
//*-----------------------------------------------------------------            
//* EXTRACT BP13F595 BASED ON END-QTR-DATE                                      
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13CY64,COND=(0,NE)                                        
//BP13F595 DD  DSN=BP13.F595.AY0C,DISP=SHR                              00230000
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=&&F595SP05,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//P13F595B DD DSN=&&F595CB95,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------    00170000
//* GET APPLICATION DETAIL DATA                                         00180000
//*-----------------------------------------------------------------    00210000
//STEP14   EXEC  PGM=BP13CB95,COND=(0,NE)                               00220000
//BP13F730 DD  DSN=&&F595CB95,DISP=(OLD,PASS)                           00230000
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00240000
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                          00250000
//             AMP=('BUFND=4','BUFNI=8')                                00260000
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                            00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00290000
//             AMP=('BUFND=4','BUFNI=8')                                00300000
//BP13K825 DD  DSN=BP13.K828.HISTOCCP,DISP=SHR,                         00310000
//             AMP=('BUFND=4','BUFNI=8')                                00320000
//BP13K828 DD  DSN=BP13.K590.CANOCCP,DISP=SHR,                          00330001
//             AMP=('BUFND=4','BUFNI=8')                                00340000
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                          00350001
//             AMP=('BUFND=4','BUFNI=8')                                00360000
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR,                    00370001
//             AMP=('BUFND=4','BUFNI=8')                                00380000
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR,                    00390001
//             AMP=('BUFND=4','BUFNI=8')                                00400000
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                        00401001
//             AMP=('BUFND=4','BUFNI=8')                                00402001
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                  00403001
//             AMP=('BUFND=4','BUFNI=8')                                00404001
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR,                  00405001
//             AMP=('BUFND=4','BUFNI=8')                                00406001
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR,                  00410000
//             AMP=('BUFND=4','BUFNI=8')                                00420000
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR,                  00430000
//             AMP=('BUFND=4','BUFNI=8')                                00440000
//BP13K585 DD DSN=BP13.K585.HARDLUCK,DISP=SHR,                          00430000
//             AMP=('BUFND=4','BUFNI=8')                                00440000
//BP13K587 DD DSN=BP13.K587.HARDLUCK.HIST,DISP=SHR,                     00430000
//             AMP=('BUFND=4','BUFNI=8')                                00440000
//BP13F55A DD  DSN=BP13.F55A.AY0C,DISP=OLD                              00450000
//BP13F55Y DD  DUMMY                                                    00450000
//BP13F55Z DD  DUMMY                                                    00450000
//P13F730A DD  DUMMY                                                    00460000
//SYSPRINT DD  SYSOUT=*                                                 00460000
//SYSOUT   DD  SYSOUT=*                                                 00470000
//*-----------------------------------------------------------------            
//* SORT BY SCH-ACC-NO                                                          
//*-----------------------------------------------------------------            
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F55A.AY0C,DISP=SHR                                       
//SORTOUT  DD DSN=&&F55ASCH,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=1200,BLKSIZE=00)                              
//SYSIN    DD  *                                                                
    SORT FIELDS=(194,9,A),FORMAT=CH                                             
//*-----------------------------------------------------------------            
//* SORT BY SCH-ACC-NO                                                          
//*-----------------------------------------------------------------            
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F120,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(280,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=700,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,9,A),FORMAT=CH                                               
    SUM FIELDS=NONE                                                             
//*-----------------------------------------------------------------            
//*  GET FLAT TYPE/SELLING PRICE/UNIT-NO FROM FIS                               
//*-----------------------------------------------------------------            
//STEP18   EXEC  PGM=BP13CY85,COND=(0,NE)                                       
//BM06F120 DD  DSN=&&BM06F120,DISP=(OLD,PASS)                                   
//BP13F55A DD  DSN=&&F55ASCH,DISP=(OLD,PASS)                                    
//P13F55AA DD  DSN=&&F55AFIS,DISP=(,PASS),                                      
//            SPACE=(CYL,(80,30),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=1200,BLKSIZE=0)                               
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT REGN-NO                                                                
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F55AFIS,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F55AREGN,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1200),                                 
//        SPACE=(CYL,(80,25),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* FORMAT AND ADD IN HEADER FOR MPU                                            
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=BP13CY5D,COND=(0,NE)                                        
//BP13F55A DD DSN=&&F55AREGN,DISP=(OLD,PASS)                                    
//BP13L55A DD DSN=BP13.L55A.AY0C,DISP=OLD                                       
//BP13L55B DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
