//BP13AMP2 JOB (BP13P),'BP13AMP2',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*    PIGEONHOLING OF MATUTE NEW TOWN -  UNSUCC MTF/SFF/REN/RH*                
//*                                       AND PUBLIC SCHEME    *                
//*                                                            *                
//*    NOT THE DIFFERENCE                                      *                
//*    - TENDER PROGRAM ONLY HAVE NEW + BALANCE FLATS          *                
//*    - RE-DEFINE TENDER PROGRAM ONLY FOR MATURE NT, DELETE   *                
//*      NT WITH-LAND REC                                      *                
//*    - INCLUDE  ONLY MATURE NT CASES                         *                
//*    - INCLUDE  REN CASES WHICH ARE UNSUCC IN PRIO PIGEONHOLE*                
//*    - AFTER PIGEONHOLING OF PRIORITY, UNSUCC PRIORITY CASE  *                
//*      JOIN PUBLIC SCHEME IN THIS PIGEONHOLING, INCLUDE REN  *                
//*    - CHECK FOR BOTH HHTY AND RESIDENT SCHEME               *                
//**************************************************************                
//* CHG REF  BY  ON      DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP131064 CKK 011222  NEW JCL. 1ST ROUND PA PIGEONHOLING                     
//* BP132596 PGS 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E            
//* BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                               
//*                                                                             
//**************************************************************                
//* STEP 00 - 01 = LASER PRINTER JCL                           *                
//* STEP 02 - 03 = BACKUP TENDER AND BALLOT FILE               *                
//* STEP 04 - 05 = PRINT FLAT SYPPLY REPORT BF PIGEONHOLING    *                
//* STEP 06 - 07 = PROCESS PIGEONHOLING(BP13U536 )             *                
//* STEP 08 - 09 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING    *                
//* STEP 10      = MATCH RELEVANT REQUEST TO GET SUCC & UNSUCC *                
//*                BALLOT RESULT FOR PRINT REPORT              *                
//* STEP 11      = PRINT SUCC/UNSUCC REQUEST REPOR BP13L522    *                
//* STEP 12      = BACKUP TENDER FILE                          *                
//* STEP 13      = PRINT RESIDENT/NON-RES REPORT BP13L752      *                
//* STEP 14      = ACCUM APPL FILE                             *                
//*                                                            *                
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K012.MCPSUNIT,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT02 : COPIES = 2                                                         
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F010.TENDER.PA1,DISP=OLD                                 
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.PA1,DISP=OLD                               
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13K012A,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=23200)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=BP13C502,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F012 DD DSN=&&P13K012A,DISP=(OLD,DELETE)                                  
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13L502 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING             
//*-----------------------------------------------------------------            
//STEP5A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13K012B,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=23200)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP5B   EXEC PGM=BP13C502,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F012 DD DSN=&&P13K012B,DISP=(OLD,DELETE)                                  
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13L502 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT THE MATURE PA REQUEST BY RANDOM NO                                 
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                
//SORTOUT  DD DSN=&&F520PA,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* TO PROCESS THE PIGEON-HOLDING FOR MATURE PA CASES, THE PROGRAM WI           
//* ONLY ALLOCATE THE PRIORITY SUPPLY QUOTA                                     
//* PRIO REQUEST INCLUDE MTF/SFF/RH/REN                                         
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=BP13U536,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K012 DD DSN=BP13.K012.MCPSUNIT,DISP=OLD                                   
//BP13F740 DD DSN=&&F520PA,DISP=(OLD,PASS)                                      
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L536 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L536A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*-----------------------------------------------------------------            
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//SORTOUT  DD DSN=&&K012C,DISP=(,PASS),                                         
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=23200)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER PIGEON-HOLING                     
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=BP13C502,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F012 DD DSN=&&K012C,DISP=(OLD,DELETE)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13L502 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING              
//*-----------------------------------------------------------------            
//STEP9A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//SORTOUT  DD DSN=&&K012D,DISP=(,PASS),                                         
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=23200)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER PIGEON-HOLING                     
//*-----------------------------------------------------------------            
//STEP9B   EXEC PGM=BP13C502,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F012 DD DSN=&&K012D,DISP=(OLD,DELETE)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13L502 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*-----------------------------------------------------------------            
//STEP10   EXEC PGM=BP13C713,COND=(0,NE)                                        
//BP13F510 DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                
//BP13K520 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT SUMMARY BALLOT RESULT FOR JS SCHEME                                   
//*-----------------------------------------------------------------            
//STEP11   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//P13FSUCC DD DSN=&&P13SUCC,DISP=(OLD,PASS)                                     
//P13FUNSC DD DSN=&&P13UNSUC,DISP=(OLD,PASS)                                    
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//FT42F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER(+1),DISP=(NEW,CATLG),                        
//            SPACE=(TRK,(5,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                       
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* PRINT REPORTS ON RESIDENT/NON-RESIDENT REGISTERED COUNT                     
//*-----------------------------------------------------------------            
//STEP13   EXEC PGM=BP13C733,COND=(0,NE)                                        
//BP13K012 DD DSN=BP13.K012.MCPSUNIT,DISP=SHR                                   
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13L733 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=N                                                          
//*-----------------------------------------------------------------            
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*-----------------------------------------------------------------            
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//OUTPUT1  DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                 
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT LAST SUCC REGN-NO IN NT/FT ORDER                                       
//*-----------------------------------------------------------------            
//STEP15    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F525,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=20000)                               
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,3,A,4,2,A,53,3,A,11,1,A),FORMAT=CH                            
//*-----------------------------------------------------------------            
//* PRINT REPORT TO SHOW LAST SUCC REGN-NO HIT MAX ZONE/ALLOC/CAT               
//*-----------------------------------------------------------------            
//STEP16    EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                 
//BP13K525  DD  DSN=&&BP13F525,DISP=(OLD,PASS)                                  
//FT18F001  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S502),DISP=SHR                            
//*-----------------------------------------------------------------            
//* END BP13AMP2                                                                
//*-----------------------------------------------------------------            
