//BP13A23A JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),         00000010
//             NOTIFY=CSD0071                                           00000020
//*-------------------------------------------------------------------          
//STEP01  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F5A,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP02  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F5B,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP03  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F6A,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP04  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F6B,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP05  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F7A,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP06  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F7B,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP07  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F8A,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP08  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F8B,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP09  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F8C,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP10  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F8D,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP11  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F8E,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------*         
//* DESCRIPTION :  RUN MQ TRIGGER PROGRAM                             *         
//*-------------------------------------------------------------------          
//STEP12  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F6C,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP13  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F6D,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP14  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F6E,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP15  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F5C,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP16  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F6F,                                         
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP17  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F900,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP18  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F800,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP19  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F700,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP20  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F600,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP21  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F500,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP22  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F400,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP23  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F300,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP24  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F200,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP25  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F100,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP26  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F450,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP27  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F850,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP27  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F950,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP28  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F855,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP29  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F960,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP30  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F190,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP31  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.F145,                                        
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP32  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F100.F01,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP33  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F100.F02,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP34  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F100.F03,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP35  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F200.F01,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP36  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F200.F02,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP37  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F200.F03,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP38  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F200.F04,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP39  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F200.F05,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP40  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F200.F06,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP41  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F300.F01,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP42  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F300.F02,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP43  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F400.F01,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP44  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F400.F02,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP45  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F400.F03,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP46  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F400.F04,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
//STEP47  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=200,                                              
//             BLKSIZE=27000                                                    
//SYSUT2   DD  DSN=BP13.F23A.EMAIL.PA.F400.F05,                                 
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------          
