//BP13A22C JOB (BP13P),'BP13A22C',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*-----------------------------------------------------------------            
//* CHG-NO   BY   ON      DESCRIPTION                                           
//* ------------- -------------------                                           
//* BP137125 ESA1 081113  NEW REPORT ON OCST COST                               
//* BP135171 RJE1 100214  TO CATER FOR DB2 UPGRADE                              
//* BP135404 EL27 20140711 CHANGE PRINTER FROM L03Z TO X6AI                     
//* BP135404 NST1 20140719 CHANGE PRINTER FROM X6AI TO X6AU(LANDSCAPE)          
//* BP135561 ESA1 20150115 OUTPUT TO DATASET BEFORE SENDING TO PRINTER          
//* BP135695 ESA1 20150408 ADD BP13C25S FOR PRINTING OF POF2 AMT                
//* BP135952 ESA1 20151008 TO REPLACE BM06F190 TO BP13F205 IN BP13C24Q          
//* BP136721 KAM4 20170412 TO REPLACE DEST=XDA2 BY DEST= X6AM                   
//* BP136697 KG12 20170421 TO REPLACE DEST=X6AM BY DEST= X8AI                   
//* BP139089 EL27 20220310 TO REPLACE DEST=X8AI BY DEST= XDA2                   
//*-------------------------------------------------------------------          
//*--------------------------------------------------------------------         
//*    SORT OUT RECORDS UPDATED THROUGH M19A PANEL                              
//*--------------------------------------------------------------------         
//STEP01   EXEC  SORT                                                           
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'OC')                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* BP13C24Q - PRINT REPORT ON UPDATED POD/POF DATES                            
//*--------------------------------------------------------------------         
//STEP02 EXEC    PGM=BP13C24Q,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&BP13F205,DISP=(SHR,PASS)                                   
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR                                     
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR                                    
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,DISP=SHR                                  
//BP13K277 DD  DSN=BP13.K277.OCSCOST,DISP=SHR                                   
//BP13L24Q DD DSN=&&BP13L24Q,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FBA,LRECL=133)                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP02 IN X8AI PRINTER                               
//*--------------------------------------------------------------------         
//STEP2A EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L24Q,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=XDA2                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*----------------------------------------------------------------             
//*   CREATE SOFTCOPY REPORT FOR ALL REPORTS PRINTED                            
//*----------------------------------------------------------------             
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13L24Q,DISP=(SHR,PASS)                                   
//OUTPUT1  DD  DSN=BP13.L22C.RPT,                                               
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-----------------------------------------------------------------            
//* END OF BP13A22C                                                             
//*-----------------------------------------------------------------            
