//BP13A711 JOB (BP13P),'BP13A711',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//       NOTIFY=CSD0071                                                 00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//*=================================================================    00040000
//*    THIS JCL IS TO UPLOAD THE SUCCESSFUL CASES SHORTLISTED IN   *    00050000
//*    THE RESERVE LIST TO SOC MASTER                              *    00060000
//*                                                                *    00070000
//******************************************************************    00080000
//* CHG REF  DATE     BY   DESCRIPTION                                  00090000
//* -------- -------- ---  -----------                                  00100000
//* BP132293 20030211 CKK  NEW RESERVE LIST JCL                         00110000
//* BP132352 20030625 SK   ADD BP13C145,BP13C144                        00120000
//* BP132384 20030731 ANC1 ADD STEPS TO CAPTURE EXISTING/EX-DP FLATS    00130000
//* BP132417 20031031 CKK7 REPLACE BP13K825 WITH BP13K823               00140000
//* BP132451 20031202 SK   ADD BP13L520 FOR BP13C520                    00150000
//* BP132627 20041130 SSS2 DELETE F542 / K542 DATASETS                  00160000
//* BP132618 20050104 ROM1 READ BP04.K010 INSTEAD OF BP04.F010          00170000
//* BP132862 20060615 CKK7 INCLUDE BP13K648 IN BP13C528                 00180000
//* BP133056 20070727 IL5  OUTPUT 'Z' FOR RESERVE LIST                  00190000
//* BP133244 20080128 LSB  ADD VERIFY FILE STEPP                        00200000
//* BP133639 20090708 ZDD1 INCLUDE BP13K595 ON BP13C145                 00210000
//*                        INCLUDE OTHER ALTERNATE FILES OF BP13K595    00220000
//*          20090908 ZDD1 INCLUDE BP13K730 ON BP13C145                 00221000
//* BP134024 20100930 ZDD1 INCLUDE BP13K813 ON BP13C528                 00222000
//* BP135171 20140210 RJE1 TO CATER FOR DB2 UPGRADE                     00226000
//*=================================================================    00230000
//*- TO LOAD BALLOTED RECORD TO SOC MASTER / SOC OCCUP FILE             00240000
//*-------------------------------------------------------------------- 00250000
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                       00260000
//*-------------------------------------------------------------------- 00270000
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                   00280000
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=OLD                            00290000
//INPUT2   DD DSN=BP13.K823.RSVOCCP,DISP=OLD                            00300000
//INPUT3   DD DSN=BP13.K800.APPLN,DISP=OLD                              00310000
//INPUT4   DD DSN=BP13.K820.OCCUP,DISP=OLD                              00320000
//INPUT5   DD DSN=BP13.K840.APPLHIST,DISP=OLD                           00330000
//INPUT6   DD DSN=BP13.K648.BANKLOAN,DISP=OLD                           00340000
//INPUT7   DD DSN=BP13.K022.WISOIC,DISP=OLD                             00350000
//INPUT8   DD DSN=BP13.K024.WISLAST,DISP=OLD                            00360000
//INPUT9   DD DSN=BP13.K595.BALLOT.LOG,DISP=OLD                         00370000
//INPUT10  DD DSN=BP13.K705.SOCLIST,DISP=OLD                            00380000
//SYSPRINT DD SYSOUT=*                                                  00390000
//SYSIN   DD *                                                          00400000
          VFY FILE(INPUT1)                                              00410000
          VFY FILE(INPUT2)                                              00420000
          VFY FILE(INPUT3)                                              00430000
          VFY FILE(INPUT4)                                              00440000
          VFY FILE(INPUT5)                                              00450000
          VFY FILE(INPUT6)                                              00460000
          VFY FILE(INPUT7)                                              00470000
          VFY FILE(INPUT8)                                              00480000
          VFY FILE(INPUT9)                                              00490000
          VFY FILE(INPUT10)                                             00500000
//*-----------------------------------------------------------------    00510000
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                            00520000
//*  PRT01                                                              00530000
//*-----------------------------------------------------------------    00540000
//PRT01    EXEC PGM=IEBGENER                                            00550000
//SYSUT1   DD *                                                         00560000
$DJDE$ JDE=BP13D,JDL=BP13,END;                                          00570000
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                           00580000
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00590000
//SYSPRINT DD SYSOUT=*                                                  00600000
//SYSIN    DD DUMMY                                                     00610000
//*-----------------------------------------------------------------    00620000
//*- BACKUP SOC MASTER                                                  00630000
//*-----------------------------------------------------------------    00640000
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                  00650000
//SYSPRINT DD SYSOUT=*                                                  00660000
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=SHR,                             00670000
//            AMP=('BUFND=13')                                          00680000
//OUTPUT1  DD DSN=BP13.F800.APPLN,DISP=OLD                              00690000
//SYSIN    DD  *                                                        00700000
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                               00710000
//*-----------------------------------------------------------------    00720000
//* SORT THE REGN NO ORDER                                              00730000
//*-----------------------------------------------------------------    00740000
//STEP02   EXEC SORT,COND=(0,NE)                                        00750000
//SORTIN   DD DSN=BP13.K700.RESERVE,DISP=SHR,                           00760000
//            AMP=('BUFND=22')                                          00770000
//SORTOUT  DD DSN=&&BP13F740,DISP=(NEW,PASS),                           00780000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   00790000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       00800000
//SYSIN DD *                                                            00810000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      00820000
   OMIT    COND=(226,3,CH,EQ,C'   ')                                    00830000
//*---------------------------------------------------------------------00840000
//* OUTPUT LESSEE-CHECK = 'Y'                                           00850000
//*---------------------------------------------------------------------00860000
//STEP03   EXEC SORT,COND=(0,NE)                                        00870000
//SORTIN   DD DSN=BP13.K823.RSVOCCP,DISP=SHR,                           00880000
//            AMP=('BUFND=23')                                          00890000
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                           00900000
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                       00910000
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                        00920000
//SYSIN    DD *                                                         00930000
  SORT FIELDS=(1,8,A),FORMAT=CH                                         00940000
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                       00950000
  OUTREC FIELDS=(1,200,200X)                                            00960000
/*                                                                      00970000
//*---------------------------------------------------------------------00980000
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY   00990000
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                 01000000
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"         01010000
//*---------------------------------------------------------------------01020000
//STEP04   EXEC PGM=BP13C577,COND=(0,NE)                                01030000
//BP13F500 DD DSN=&&BP13F740,DISP=(OLD,PASS)                            01040000
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,PASS)                            01050000
//BP13F558 DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   01060000
//SYSDBG   DD SYSOUT=*                                                  01070000
//SYSDBOUT DD SYSOUT=*                                                  01080000
//SYSOUT   DD SYSOUT=*                                                  01090000
//*                                                                     01100000
//*---------------------------------------------------------------------01110000
//* SORT BY NRIC SEQUENCE                                               01120000
//*---------------------------------------------------------------------01130000
//STEP05   EXEC SORT,COND=(0,NE)                                        01140000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   01150000
//SORTOUT  DD DSN=&&P13F558B,DISP=(NEW,PASS),                           01160000
//            DCB=(BLKSIZE=27600,LRECL=600,RECFM=FB),                   01170000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01180000
//SYSIN    DD *                                                         01190000
   SORT FIELDS=(9,9,A),FORMAT=CH                                        01200000
//*---------------------------------------------------------------------01210000
//* BASED ON THE NRIC IN REQUEST, SOC-OCCUPIER FILE                     01220000
//* MATCH NRIC IN SMS FILE, IF MATCH UPDATE AS UPGRADER                 01230000
//*---------------------------------------------------------------------01240000
//STEP06   EXEC PGM=BP13U706,COND=(0,NE)                                01250000
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                    01260000
//BP13F558 DD DSN=&&P13F558B,DISP=(OLD,DELETE)                          01270000
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                          01280000
//            AMP=('BUFND=8','BUFNI=4')                                 01290000
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                            01300000
//            AMP=('BUFND=8','BUFNI=4')                                 01310000
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                             01320000
//            AMP=('BUFND=8','BUFNI=4')                                 01330000
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                          01340000
//            AMP=('BUFND=8','BUFNI=4')                                 01350000
//P13F558O DD DSN=&&P13F558C,DISP=(NEW,PASS),                           01360000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01370000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01380000
//BP13F559 DD DUMMY                                                     01390000
//BP13L706 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          01400000
//SYSPRINT DD SYSOUT=*                                                  01410000
//SYSDBG   DD SYSOUT=*                                                  01420000
//SYSDBOUT DD SYSOUT=*                                                  01430000
//SYSOUT   DD SYSOUT=*                                                  01440000
//*-----------------------------------------------------------------    01450000
//* MATCH NRIC WITH TRANSFER HISTORY ONLY FOR TRF-APPLN-DTE  AFTER      01460000
//* '19970901' OR FOR DIVORCE CASES TRF-APPLN-DATE > 19970709           01470000
//* AND TRF-SCH-ACC IS NOT THE SAME AS SMS-SCH-ACC                      01480000
//* AS ONE NRIC TRANSFER, ALL FOUR LESSEE WILL BE FOUND IN TRANSFER     01490000
//* BP13.F558.UPGOCCP CONTAINS TRANSFER HISTORY DATA                    01500000
//*-----------------------------------------------------------------    01510000
//STEP07   EXEC PGM=BP13C619,COND=(0,NE)                                01520000
//BB13K510 DD DSN=BB13.K510.UINHIST,DISP=SHR,                           01530000
//            AMP=('BUFND=4','BUFNI=8')                                 01540000
//BB13K500 DD DSN=BB13.K500.HISTORY,DISP=SHR,                           01550000
//            AMP=('BUFND=4','BUFNI=8')                                 01560000
//BP13F558 DD DSN=&&P13F558C,DISP=(OLD,PASS)                            01570000
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   01580000
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          01590000
//SYSPRINT DD SYSOUT=*                                                  01600000
//SYSDBG   DD SYSOUT=*                                                  01610000
//SYSDBOUT DD SYSOUT=*                                                  01620000
//SYSABOUT DD SYSOUT=*                                                  01630000
//SYSIN    DD *                                                         01640000
/*                                                                      01650000
//*---------------------------------------------------------------------01660000
//* SORT IN SCH-ACC-NI ORDER FOR RETRIEVING FLAT TYPE FROM PBF          01670000
//*---------------------------------------------------------------------01680000
//STEP08   EXEC SORT,COND=(0,NE)                                        01690000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   01700000
//SORTOUT  DD DSN=&&F558SORT,DISP=(NEW,PASS),                           01710000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01720000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01730000
//SYSIN     DD  *                                                       01740000
   SORT FIELDS=(101,11,A),FORMAT=CH                                     01750000
//*---------------------------------------------------------------------01760000
//* FLAT TYPE  IS NOT AVAILABLE IN SMS                                  01770000
//* BASED ON THE SCHEME ACCOUNT FR SMS EXTRACT FLAT TYPE FROM PBF       01780000
//*---------------------------------------------------------------------01790000
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       01800000
//BP13F558 DD DSN=&&F558SORT,DISP=(OLD,PASS)                            01810000
//BP13OUT  DD DSN=&&F558PBF,DISP=(NEW,PASS),                            01820000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   01830000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      01840000
//SYSTSPRT DD SYSOUT=*                                                  01850000
//SYSPRINT DD SYSOUT=*                                                  01860000
//SYSUDUMP DD SYSOUT=*                                                  01870000
//SYSOUT   DD SYSOUT=*                                                  01880000
//SYSDBOUT DD SYSOUT=*                                                  01890000
//SYSTSIN  DD *                                                         01900000
  DSN SYSTEM(DSN)                                                       01910000
  RUN PROGRAM(BP13C742) PLAN(BP13PCC) -                                 01920000
      LIB('BP13.BATCH.LOADCOB')                                         01930000
  END                                                                   01940000
/*                                                                      01950000
//*---------------------------------------------------------------------01960000
//* SORT OUT BP13F558 IN NRIC ORDER, IF ONE NRIC WITH MULTIPLE SMS REC  01970000
//* PROGRAM WILL SELECT THE BIGGER FLAT TYPE                            01980000
//*---------------------------------------------------------------------01990000
//STEP10   EXEC SORT,COND=(0,NE)                                        02000000
//SORTIN   DD DSN=&&F558PBF,DISP=(OLD,PASS)                             02010000
//SORTOUT  DD DSN=&&F558SMSF,DISP=(NEW,PASS),                           02020000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   02030000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      02040000
//SYSIN    DD  *                                                        02050000
   SORT FIELDS=(1,17,A),FORMAT=CH                                       02060000
//*---------------------------------------------------------------------02070000
//* SELECT THE LEAST PRIORITY IF FOUND TO HAVE MULTIPLE SMS RECORDS     02080000
//* SELECT BIGGER FLAT TYPE, DIRENT PURCHASE OVER OPEN MARKET           02090000
//*---------------------------------------------------------------------02100000
//STEP11   EXEC PGM=BP13C734,COND=(0,NE)                                02110000
//BP13F558 DD DSN=&&F558SMSF,DISP=(OLD,PASS)                            02120000
//P13F558A DD DSN=&&F558FLAT,DISP=(NEW,PASS),                           02130000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   02140000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      02150000
//SYSPRINT DD SYSOUT=*                                                  02160000
//SYSDBG   DD SYSOUT=*                                                  02170000
//SYSDBOUT DD SYSOUT=*                                                  02180000
//SYSOUT   DD SYSOUT=*                                                  02190000
//*---------------------------------------------------------------------02200000
//* SORT OUT BY NRIC SEQUENCE                                           02210000
//*---------------------------------------------------------------------02220000
//STEP12   EXEC SORT,COND=(0,NE)                                        02230000
//SORTIN   DD DSN=&&F558FLAT,DISP=(OLD,PASS)                            02240000
//SORTOUT  DD DSN=&&F558RESL,DISP=(NEW,PASS),                           02250000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                   02260000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                      02270000
//SYSIN    DD  *                                                        02280000
   SORT FIELDS=(9,9,A),FORMAT=CH                                        02290000
//*---------------------------------------------------------------------02300000
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                    02310000
//* MATCH NRIC IN RESALE FILE, IF MATCH UPDATE AS UPGRADER              02320000
//*---------------------------------------------------------------------02330000
//STEP13   EXEC PGM=BP13U702,COND=(0,NE)                                02340000
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                    02350000
//BP13F558 DD DSN=&&F558RESL,DISP=(OLD,PASS)                            02360000
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                          02370000
//            AMP=('BUFND=8','BUFNI=4')                                 02380000
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                           02390000
//            AMP=('BUFND=8','BUFNI=4')                                 02400000
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   02410000
//BP13L702 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          02420000
//SYSPRINT DD SYSOUT=*                                                  02430000
//SYSDBG   DD SYSOUT=*                                                  02440000
//SYSDBOUT DD SYSOUT=*                                                  02450000
//SYSOUT   DD SYSOUT=*                                                  02460000
//*---------------------------------------------------------------------02470000
//* SORT REQUEST OCCUPIER BY NRIC                                       02480000
//*---------------------------------------------------------------------02490000
//STEP14A  EXEC SORT,COND=(0,NE)                                        02500000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   02510000
//SORTOUT  DD DSN=&&F558NRIC,DISP=(NEW,PASS),                           02520000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                     02530000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                    02540000
//SYSIN    DD  *                                                        02550000
      SORT FIELDS=(9,9,A),FORMAT=CH                                     02560000
//*---------------------------------------------------------------------02570000
//* SORT DEBARMENT FILE BY PRIMARY KEY                                  02580000
//*---------------------------------------------------------------------02590000
//STEP14B  EXEC SORT,COND=(0,NE)                                        02600000
//SORTIN   DD DSN=BP04.K010.DEBAR,DISP=SHR,                             02610000
//            AMP=('BUFND=8','BUFNI=4')                                 02620000
//SORTOUT  DD DSN=&&BP04K010,DISP=(NEW,PASS),                           02630000
//            UNIT=(SYSDA,2),SPACE=(CYL,(1000,150),RLSE),               02640000
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                    02650000
//SYSIN    DD  *                                                        02660000
      SORT FIELDS=(1,44,A),FORMAT=CH                                    02670000
//*---------------------------------------------------------------------02680000
//* MATCH SOC OCCUPIER REC WITH DEBARMENT REC FD IN                     02690000
//*---------------------------------------------------------------------02700000
//STEP15   EXEC PGM=BP13C690,COND=(0,NE)                                02710000
//BP13F558 DD DSN=&&F558NRIC,DISP=(OLD,PASS)                            02720000
//P04K010  DD DSN=&&BP04K010,DISP=(OLD,PASS)                            02730000
//P13F558A DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                   02740000
//P13F558B DD DUMMY                                                     02750000
//P13F558C DD DUMMY                                                     02760000
//P13F558D DD DUMMY                                                     02770000
//P13F558E DD DUMMY                                                     02780000
//SYSPRINT DD SYSOUT=*                                                  02790000
//SYSDBG   DD SYSOUT=*                                                  02800000
//SYSDBOUT DD SYSOUT=*                                                  02810000
//SYSOUT   DD SYSOUT=*                                                  02820000
/*                                                                      02830000
//*-----------------------------------------------------------------    02840000
//* SORT BY REGN NO                                                     02850000
//*-----------------------------------------------------------------    02860000
//STEP16   EXEC SORT,COND=(0,NE)                                        02870000
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                   02880000
//SORTOUT  DD DSN=&&BP13F558,DISP=(NEW,PASS),                           02890000
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                     02900000
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                    02910000
//SYSIN    DD  *                                                        02920000
    SORT FIELDS=(1,17,A),FORMAT=CH                                      02930000
//*=====================================================================02940000
//* RDB INFO                                                            02950000
//*=====================================================================02960000
//*---------------------------------------------------------------------02970000
//* SPLIT F558 FILE FROM THE OUTPUT OF DETERMINE THE HOUSEHOLD TYPE     02980000
//* IF - HHTYPE='G' OR '3' OR                                           02990000
//*      (HHTYPE='H' AND FILE-STATUS-SMS OR FILE-STATUS-RSL = 'OM')     03000000
//*          OUTPUT TO BP13F716                                         03010000
//* ELSE                                                                03020000
//*      OUTPUT TO BP13F716 TO CHECK RDB                                03030000
//*---------------------------------------------------------------------03040000
//* 1)  P13F716A - TO FURTHER CHECK WITH RDB                            03050000
//* 2)  BP13F716 - INFO ALREADY FOUND IN SMS & RESALE                   03060000
//*---------------------------------------------------------------------03070000
//STEP16A  EXEC PGM=BP13C788,COND=(0,NE)                                03080000
//BP13F558 DD DSN=&&BP13F558,DISP=(OLD,PASS)                            03090000
//P13F716A DD DSN=&&P13F716A,DISP=(NEW,PASS),                           03100000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                   03110000
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                       03120000
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                           03130000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                   03140000
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                       03150000
//SYSPRINT DD SYSOUT=*                                                  03160000
//SYSDBG   DD SYSOUT=*                                                  03170000
//SYSDBOUT DD SYSOUT=*                                                  03180000
//SYSOUT   DD SYSOUT=*                                                  03190000
//*---------------------------------------------------------------------03200000
//* SORT OUT IN NRIC SEQUENCE                                           03210000
//*---------------------------------------------------------------------03220000
//STEP16B  EXEC SORT,COND=(0,NE)                                        03230000
//SORTIN   DD DSN=&&P13F716A,DISP=(OLD,PASS)                            03240000
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                           03250000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03260000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03270000
//SYSIN    DD *                                                         03280000
   SORT FIELDS=(9,9,A),FORMAT=CH                                        03290000
//*---------------------------------------------------------------------03300000
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                     03310000
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED       03320000
//*---------------------------------------------------------------------03330000
//STEP16C  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                    03340000
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                            03350000
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                            03360000
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                           03370000
//P13F716A DD DSN=&&F716Q748,DISP=(NEW,PASS),                           03380000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03390000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03400000
//SYSPRINT DD SYSOUT=*                                                  03410000
//SYSTSPRT DD SYSOUT=*                                                  03420000
//SYSOUT   DD SYSOUT=*                                                  03430000
//SYSDBOUT DD SYSOUT=*                                                  03440000
//SYSABOUT DD SYSOUT=*                                                  03450000
//SYSTSIN DD *                                                          03460000
 DSN SYSTEM(DSN)                                                        03470000
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                 03480000
      LIB('BP13.BATCH.LOADCOB')                                         03490000
 END                                                                    03500000
/*                                                                      03510000
//*---------------------------------------------------------------------03520000
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                            03530000
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                03540000
//*---------------------------------------------------------------------03550000
//STEP16D  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       03560000
//BP13F716 DD DSN=&&F716Q748,DISP=(OLD,PASS)                            03570000
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                             03580000
//BP13OUT  DD DSN=&&F716C754,DISP=(NEW,PASS),                           03590000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03600000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03610000
//SYSTSPRT DD SYSOUT=*                                                  03620000
//SYSPRINT DD SYSOUT=*                                                  03630000
//SYSUDUMP DD SYSOUT=*                                                  03640000
//SYSOUT   DD SYSOUT=2                                                  03650000
//SYSDBOUT DD SYSOUT=*                                                  03660000
//SYSTSIN  DD *                                                         03670000
  DSN SYSTEM(DSN)                                                       03680000
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                 03690000
      LIB('BP13.BATCH.LOADCOB')                                         03700000
  END                                                                   03710000
/*                                                                      03720000
//*---------------------------------------------------------------------03730000
//* SORT OUT IN REGN NO SEQUENCE                                        03740000
//*---------------------------------------------------------------------03750000
//STEP16E  EXEC SORT,COND=(0,NE)                                        03760000
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                            03770000
//         DD DSN=&&F716C754,DISP=(OLD,PASS)                            03780000
//SORTOUT  DD DSN=&&F716REGN,DISP=(NEW,PASS),                           03790000
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                       03800000
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                    03810000
//SYSIN    DD *                                                         03820000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        03830000
//*---------------------------------------------------------------------03840000
//*  TO DETERMINE SMS FT/STATUS, RSL FT/STATUS, RDB FT/STATUS           03850000
//*---------------------------------------------------------------------03860000
//STEP16F   EXEC PGM=BP13C519,COND=(0,NE)                               03870000
//BP13F716  DD DSN=&&F716REGN,DISP=(OLD,PASS)                           03880000
//BP13F520  DD DSN=&&BP13F740,DISP=(OLD,PASS)                           03890000
//P13F520A  DD DSN=&&F520C519,DISP=(NEW,PASS),                          03900000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   03910000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       03920000
//SYSPRINT  DD SYSOUT=*                                                 03930000
//SYSDBG    DD SYSOUT=*                                                 03940000
//SYSDBOUT  DD SYSOUT=*                                                 03950000
//SYSOUT    DD SYSOUT=*                                                 03960000
//*                                                                     03970000
//*-----------------------------------------------------------------    03980000
//* SORT THE REGN NO ORDER                                              03990000
//*-----------------------------------------------------------------    04000000
//STEP16G  EXEC SORT,COND=(0,NE)                                        04010000
//SORTIN   DD DSN=&&F520C519,DISP=(OLD,PASS)                            04020000
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                           04030000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   04040000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       04050000
//SYSIN DD *                                                            04060000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      04070000
//*---------------------------------------------------------------------04080000
//*  TO DETERMINE LOAN TAG & PREMIUM CODE                               04090000
//*---------------------------------------------------------------------04100000
//STEP17    EXEC PGM=BP13C520,COND=(0,NE)                               04110000
//BP13F520  DD DSN=&&F520SORT,DISP=(OLD,PASS)                           04120000
//BP13F558  DD DSN=&&BP13F558,DISP=(OLD,PASS)                           04130000
//BR10K010  DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                          04140000
//             AMP=('BUFNI=8','BUFND=4')                                04150000
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                         04160000
//             AMP=('BUFNI=8','BUFND=4')                                04170000
//P13F520A  DD DSN=&&BP13F520,DISP=(NEW,PASS),                          04180000
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                  04190000
//             UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                      04200000
//BP13L520  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                         04210000
//SYSPRINT  DD SYSOUT=*                                                 04220000
//SYSDBG    DD SYSOUT=*                                                 04230000
//SYSDBOUT  DD SYSOUT=*                                                 04240000
//SYSOUT    DD SYSOUT=*                                                 04250000
//*-----------------------------------------------------------------    04260000
//* SORT F520 IN REGN NO ORDER                                          04270000
//*-----------------------------------------------------------------    04280000
//STEP18   EXEC SORT,COND=(0,NE)                                        04290000
//SORTIN   DD DSN=&&BP13F520,DISP=(OLD,PASS)                            04300000
//SORTOUT  DD DSN=&&P13F520A,DISP=(NEW,PASS),                           04310000
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   04320000
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       04330000
//SYSIN DD *                                                            04340000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      04350000
//*---------------------------------------------------------------------04360000
//* TO EXTRACT THE SUCCESSFUL BALLOTED APPLICANT'S & OCCUPIER INFOR     04370000
//* TO UPDATE THE SOC MASTER AND SOC OCCUPIER FILE                      04380000
//* TO PASS RECORDS TO CFS FOR PRE-ELIGIBILITY CHECK                    04390000
//*---------------------------------------------------------------------04400000
//STEP19    EXEC PGM=BP13C528,COND=(0,NE)                               04410000
//BP13F520  DD DSN=&&P13F520A,DISP=(OLD,PASS)                           04420000
//BP13K530  DD DSN=BP13.K530.ISSUENO,DISP=SHR                           04430000
//BP13K825  DD DSN=BP13.K823.RSVOCCP,DISP=SHR                           04440000
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                            04450000
//             AMP=('BUFNI=8','BUFND=4')                                04460000
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                            04470000
//             AMP=('BUFNI=8','BUFND=4')                                04480000
//BP13K840  DD DSN=BP13.K840.APPLHIST,DISP=SHR,                         04490000
//             AMP=('BUFNI=8','BUFND=4')                                04500000
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                         04510000
//             AMP=('BUFNI=8','BUFND=4')                                04520000
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR,                            04521000
//             AMP=('BUFNI=8','BUFND=4')                                04522000
//BP13F310  DD DSN=BP13.F310.APPOINT,DISP=MOD                           04530000
//BP13F800  DD DSN=&&BP13F800,DISP=(NEW,PASS),                          04540000
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                     04550000
//             UNIT=SYSDA,SPACE=(CYL,(40,20),RLSE)                      04560000
//SYSPRINT  DD SYSOUT=*                                                 04570000
//SYSDBG    DD SYSOUT=*                                                 04580000
//SYSDBOUT  DD SYSOUT=*                                                 04590000
//SYSOUT    DD SYSOUT=*                                                 04600000
//*-----------------------------------------------------------------    04610000
//* ASSIGNING RESISTRATION NUMBER TO OIC                                04620000
//*-----------------------------------------------------------------    04630000
//STEP19A  EXEC PGM=BP13C144,COND=(0,NE)                                04640000
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                            04650000
//BP13F520 DD DSN=&&P13F520A,DISP=(OLD,PASS)                            04660000
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                           04670000
//         AMP=('BUFNI=8','BUFND=4')                                    04680000
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                            04690000
//         AMP=('BUFNI=8','BUFND=4')                                    04700000
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                      04710000
//         AMP=('BUFND=8','BUFNI=4')                                    04720000
//BP13L144 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          04730000
//SYSOUT   DD SYSOUT=*                                                  04740000
//SYSUDUMP DD SYSOUT=*                                                  04750000
//SYSABEND DD SYSOUT=*                                                  04760000
//SYSDBUG  DD SYSOUT=*                                                  04770000
//SYSABOUT DD SYSOUT=*                                                  04780000
//SYSDBOUT DD SYSOUT=*                                                  04790000
//*-----------------------------------------------------------------    04800000
//* SKIP F800 CASES WHERE DTE-REGN IS NOT = F001-CURR-DTE               04810000
//*-----------------------------------------------------------------    04820000
//STEP19B  EXEC PGM=BP13C145,COND=(0,NE)                                04830000
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                            04840000
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                            04850000
//         AMP=('BUFNI=8','BUFND=4')                                    04860000
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                      04870000
//         AMP=('BUFND=8','BUFNI=4')                                    04880000
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                            04890000
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                         04900000
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR                   04910000
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR                   04920000
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR                   04930000
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR                   04940000
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                           04941000
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                     04942000
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                     04943000
//P13L145A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          04950000
//SYSOUT   DD SYSOUT=*                                                  04960000
//SYSUDUMP DD SYSOUT=*                                                  04970000
//SYSABEND DD SYSOUT=*                                                  04980000
//SYSDBUG  DD SYSOUT=*                                                  04990000
//SYSABOUT DD SYSOUT=*                                                  05000000
//SYSDBOUT DD SYSOUT=*                                                  05010000
//*----------------------------------------------------------------*    05020000
//* TO EXTRACT SUCCESSFUL APPLICANTS FROM REQUEST FILE             *    05030000
//*----------------------------------------------------------------*    05040000
//STEP20   EXEC PGM=BP13C579,COND=(0,NE)                                05050000
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                          05060000
//BP13F520 DD DSN=&&BP13F740,DISP=(SHR,PASS)                            05070000
//BP13F200 DD DSN=&&P13F200A,DISP=(NEW,PASS),                           05080000
//            DCB=(RECFM=FB,LRECL=300),                                 05090000
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE)                         05100000
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          05110000
//SYSPRINT DD SYSOUT=*                                                  05120000
//SYSABOUT DD SYSOUT=*                                                  05130000
//SYSDBOUT DD SYSOUT=*                                                  05140000
/*                                                                      05150000
//*----------------------------------------------------------------*    05160000
//* TO SET NUM-RESERVE = 'Y' (TO DENOTE CASES FROM RESERVE LIST)   *    05170000
//*----------------------------------------------------------------*    05180000
//STEP21   EXEC SORT,COND=(0,NE)                                        05190000
//SORTIN   DD DSN=&&P13F200A,DISP=(SHR,PASS)                            05200000
//SORTOUT  DD DSN=&&P13F200B,DISP=(NEW,PASS),                           05210000
//            UNIT=SYSDA,                                               05220000
//            DCB=(RECFM=FB,LRECL=300),                                 05230000
//            SPACE=(CYL,(2,1),RLSE)                                    05240000
//SYSOUT   DD SYSOUT=*                                                  05250000
//SYSIN    DD *                                                         05260000
   SORT FIELDS=(14,8,A),FORMAT=CH                                       05270000
   OUTREC FIELDS=(1,175,C'Y',177,124)                                   05280000
//*-------------------------------------------------------------------- 05290000
//* TO APPEND BP13F200 RECORDS TO BOOKING APPOINTMENT FILE              05300000
//*---------------------------------------------------------------------05310000
//STEP22    EXEC PGM=IDCAMS,COND=(0,NE)                                 05320000
//SYSPRINT  DD SYSOUT=*                                                 05330000
//INPUT1    DD DSN=&&P13F200B,DISP=(SHR,PASS)                           05340000
//OUTPUT1   DD DSN=BP13.F200.BKAPPMT,DISP=MOD                           05350000
//SYSIN     DD  *                                                       05360000
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                05370000
/*                                                                      05380000
//*---------------------------------------------------------------------05390000
//* SORT OUT ALL CASES FOR WRITING BACK TO BP13K705                     05400000
//*---------------------------------------------------------------------05410000
//STEP23   EXEC SORT,COND=(0,NE)                                        05420000
//SORTIN   DD DSN=BP13.K700.RESERVE,DISP=SHR,                           05430000
//            AMP=('BUFND=23')                                          05440000
//SORTOUT  DD DSN=&&F700A,DISP=(NEW,PASS),                              05450000
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                   05460000
//            UNIT=SYSDA,SPACE=(CYL,(16,3),RLSE)                        05470000
//SYSIN    DD *                                                         05480000
     SORT FIELDS=(1,49,A),FORMAT=CH                                     05490000
//*-------------------------------------------------------------------- 05500000
//* REWRITE THE RESULT OF THE RESERVE LIST BALLOTING BACK TO RESERVE    05510000
//* LIST MASTER FILE, BP13K705                                          05520000
//*-------------------------------------------------------------------- 05530000
//STEP24   EXEC PGM=IDCAMS,COND=(0,NE)                                  05540000
//SYSPRINT DD SYSOUT=*                                                  05550000
//INPUT1   DD DSN=&&F700A,DISP=(OLD,PASS)                               05560000
//OUTPUT1  DD DSN=BP13.K705.SOCLIST,DISP=SHR                            05570000
//SYSIN    DD *                                                         05580000
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                     05590000
//*------------------------------------------------------------------   05600000
//* SORT OUT ALL CASES EXTRACTED FROM RESERVE LIST                      05610000
//*------------------------------------------------------------------   05620000
//STEP25   EXEC SORT,COND=(0,NE)                                        05630000
//SORTIN  DD DSN=BP13.K700.RESERVE,DISP=SHR                             05640000
//SORTOUT DD DSN=&&F740SUCC,DISP=(,PASS),                               05650000
//        UNIT=SYSDA,                                                   05660000
//        DCB=(RECFM=FB,LRECL=500),                                     05670000
//        SPACE=(CYL,(20,10),RLSE)                                      05680000
//SYSIN   DD  *                                                         05690000
   SORT FIELDS=(123,8,A),FORMAT=CH                                      05700000
   OMIT COND=(226,3,CH,EQ,C'   ')                                       05710000
//*---------------------------------------------------------------------05720000
//* UPDATE CDE-REQUEST-STATUS = Z INTO K595 (SUCC UNDER RESERVE LIST)   05730000
//*---------------------------------------------------------------------05740000
//STEP26   EXEC  PGM=BP13C71B,COND=(0,NE)                               05750000
//BP13F700 DD  DSN=&&F740SUCC,DISP=(OLD,PASS)                           05760000
//BP13K595 DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                       05770000
//         AMP=('BUFND=4','BUFNI=8')                                    05780000
//SYSOUT   DD  SYSOUT=*                                                 05790000
//SYSPRINT DD  SYSOUT=*                                                 05800000
//SYSDBG   DD  SYSOUT=*                                                 05810000
//SYSDBOUT DD  SYSOUT=*                                                 05820000
//*---------------------------------------------------------------------05830000
//*   CLEAR BP13.F700.RESERVE SO AS TO PREPARE FOR NEXT RESERVE LIST    05840000
//*   SHORTLISTING                                                      05850000
//*---------------------------------------------------------------------05860000
//STEP27   EXEC PGM=IDCAMS,COND=(0,NE)                                  05870000
//SYSPRINT DD SYSOUT=*                                                  05880000
//INPUT1   DD DUMMY                                                     05890000
//OUTPUT1  DD DSN=BP13.F700.RESERVE,DISP=OLD                            05900000
//SYSIN    DD *                                                         05910000
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                            05920000
//*---------------------------------------------------------------------05930000
//* END BP13A711                                                        05940000
//*---------------------------------------------------------------------05950000
