//BP13D010 JOB (BP13P),'BP13D010',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//      NOTIFY=CSD0071                                                  00020000
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030000
//*-----------------------------------------------------------------    00040000
//* CHG REF  BY  ON       DESCRIPTION                                   00050000
//* -------- --- -------- -----------                                   00060000
//* BP132196 SSS 20020815 NEW JOB                                       00070000
//* BP132220 ED  20020930 OMIT WIS AT JW SITE OFFICE                    00080000
//* BP132266 CKK 20030117 INCLUDE JW BACK                               00090000
//* BP132202 CKK 20030512 DON'T CHECK SYSTEM DATE                       00100000
//* BP132352 CKK 20030612 NEW K022 AND K024 LAYOUT                      00110000
//* BP132638 SSS 20050118 RENAMED FROM BP13D309                         00120000
//* BP133639 ZDD 20090708 INCLUDE BP13K595 ON BP13C145                  00130000
//*                       INCLUDE OTHER ALTERNATE FILES OF BP13K595     00140000
//*          ZDD 20090908 INCLUDE BP13K730 ON BP13C145                  00141000
//*=================================================================    00150000
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS  (DUPLEX)           00160000
//* PRT01 : COPIES = 1                                                  00170000
//*-----------------------------------------------------------------    00180000
//PRT01    EXEC PGM=IEBGENER                                            00190000
//SYSUT1   DD *                                                         00200000
$DJDE$ JDE=BP13D,JDL=BP13,END;                                          00210000
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                           00220000
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00230000
//SYSPRINT DD SYSOUT=*                                                  00240000
//SYSIN    DD DUMMY                                                     00250000
//*-------------------------------------------------------------------- 00260000
//* VERIFY FILES                                                        00270000
//*-------------------------------------------------------------------- 00280000
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                  00290000
//INPUT1   DD DSN=BP13.K022.WISOIC,DISP=OLD                             00300000
//INPUT2   DD DSN=BP13.K024.WISLAST,DISP=OLD                            00310000
//SYSPRINT DD SYSOUT=*                                                  00320000
//SYSIN   DD *                                                          00330000
          VFY FILE(INPUT1)                                              00340000
          VFY FILE(INPUT2)                                              00350000
//*-----------------------------------------------------------------    00360000
//* SORT OUT WIS CASES                                                  00370000
//* INCLUDE (NUM-ALLOC-CAT = 'WIS' AND DTE-REGN > '20020930' AND        00380000
//*          NUM-APPLN-TYPE NOT = 'S')  OR NUM-ZONE = 3R                00390000
//*-----------------------------------------------------------------    00400000
//STEP02   EXEC SORT,COND=(0,NE)                                        00410000
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                             00420000
//            AMP=('BUFNI=8','BUFND=4')                                 00430000
//SORTOUT  DD DSN=&&F800OIC,DISP=(NEW,PASS),                            00440000
//            UNIT=SYSDA,SPACE=(CYL,(150,100),RLSE),                    00450000
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                   00460000
//SYSIN    DD  *                                                        00470000
   SORT FIELDS=(22,8,A,4,8,A),FORMAT=CH                                 00480000
   INCLUDE COND=((22,8,CH,GE,C'20030517'),AND,                          00490000
                 (924,3,CH,EQ,C'WIS',OR,49,2,CH,EQ,C'3R'))              00500000
/*                                                                      00510000
//*-----------------------------------------------------------------    00520000
//* ASSIGN OIC FOR WIS AND 3R APPLICATION                               00530000
//*-----------------------------------------------------------------    00540000
//STEP04   EXEC PGM=BP13C145,COND=(0,NE)                                00550000
//BP13F800 DD DSN=&&F800OIC,DISP=(OLD,DELETE)                           00560000
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                            00570000
//            AMP=('BUFNI=8','BUFND=4')                                 00580000
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                      00590000
//            AMP=('BUFND=8','BUFNI=4')                                 00600000
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                            00610000
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                         00620000
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR                   00630000
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR                   00640000
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR                   00650000
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR                   00660000
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                           00661000
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                     00662000
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                     00663000
//P13L145A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          00670000
//P13L145B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          00680000
//SYSOUT   DD SYSOUT=*                                                  00690000
//SYSUDUMP DD SYSOUT=*                                                  00700000
//SYSABEND DD SYSOUT=*                                                  00710000
//SYSDBUG  DD SYSOUT=*                                                  00720000
//SYSABOUT DD SYSOUT=*                                                  00730000
//SYSDBOUT DD SYSOUT=*                                                  00740000
