//BP13M124 JOB (BP13P),'BP13M124',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//         NOTIFY=CSD0071                                               00020000
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030000
//*=================================================================    00040000
//* To get data till previous month from grant assmnt person table      00050000
//*=================================================================    00060000
//* BP138252 PP11 11052020 - NEW JOB                                    00070000
//*=================================================================    00080000
//* TO CREATE A INTERFACE FILE                                          00090000
//*-----------------------------------------------------------------    00100000
//*                                                                     00110000
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                    00120000
//BP13GRNT DD  DSN=BP13.GRANT.DTLS,DISP=OLD                             00130000
//BP13GRNR DD  DSN=BP13.GRANT.DTLS.REPORT,DISP=OLD                      00140000
//BP13GERR DD  DSN=BP13.GRANT.ERR.DTLS,DISP=OLD                         00150000
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                             00160000
//BP13K893 DD  DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                     00170000
//SYSOUT   DD SYSOUT=*                                                  00180000
//SYSTSPRT DD SYSOUT=*                                                  00190000
//SYSPRINT DD SYSOUT=*                                                  00200000
//SYSDBG   DD SYSOUT=*                                                  00210000
//SYSDBOUT DD SYSOUT=*                                                  00220000
//SYSTSIN  DD *                                                         00230000
    DSN SYSTEM(DSN)                                                     00240000
    RUN PROGRAM(BP13CB3J) PLAN(BP13PCC) -                               00250000
        LIB('BP13.BATCH.LOADCOB')                                       00260000
    END                                                                 00270000
/*                                                                      00280000
//*--------------------------------------------------------------------*00290000
