//BP13D402  JOB (BP13P),'BP13D402',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
/*JOBPARM LINECT=0                                                              
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*================================================================*            
//*                                                                *            
//*              P R I N T   W O R K S H E E T                     *            
//*                                                                *            
//*================================================================*            
//*                                                                *            
//* THIS JOB IS FOR PRINTING OF WORKSHEETS AND REPORTS             *            
//* DO NOT INCLUDE UPDATING STEPS IN THIS JCL !!!                  *            
//*                                                                *            
//*================================================================*            
//* CHG REF  BY   DATE    DESCRIPTION                                           
//* -------- --- -------- ----------------------------------------              
//* BP130415 LLW 19980105 ADD COPIES=3 TO PRT04 TO CATER FOR THREE              
//*                       COPIES OF APPT LTR.                                   
//*                       ADD PRT10 FOR PRINTING OF HOUSEHOLD                   
//*                       INCOME LETTER.                                        
//* BP130302 LLW 19980206 PRINT IN-PRINCIPLE LTR FOR CA=Y CASES                 
//* BP130302 LLW 19980225 BP13C641 - INCLUDED P13L641B                          
//* BP130302 LLW 19980307 INCLUDED STEP FOR PRINTING OF APPT LTR &              
//*                       SUCH FOR SA/TP CA=E/Y PREMIUM CASES ONLY              
//* BP130302 LLW 19980316 CATER FOR SERS & STD CA=E/Y NORMAL &                  
//*                       AND PREMIUM CASES                                     
//* BP130454 LLW 19980316 PRINT ADDITIONAL APPT LTR FOR SERS ONLY               
//* BP130469 LLW 19980413 PRINT FINAL REMINDER FOR FS CASES                     
//* BP130302 LLW 19980718 CATER FOR TP                                          
//* BP130302 LLW 19980814 MOVE STEPS 25, 25A & 25B TO LAST STEP                 
//* BP130520 LLW 19980921 STEP31 & 31A - PRINT REPORT FOR PRE-E CHK             
//* BP130418 CLT 19980923 Y2K COMPLIANCE CHANGES                                
//* BP130539 LLW 19981119 IDP-SCH='REN'.                                        
//* BP130520 LLW 19981123 CATER FOR PRINT OF CONTROL LISTING FOR                
//*                       EN-BLOC (PACD DATE)-STEP32 & 32A.                     
//* BP130539 LLW 19981223 CATER FOR 'NRT', 'REN' & FLT <=90SM.                  
//* BP130582 LLW 19981228 PRINT DAILY REPORT FOR GIRO PAYMENT FOR               
//*                       MONTHLY SUBS INSTALMENT.                              
//* BP130539 LLW 19990113 IMPLEMENT BP13C650 & BP13C651.                        
//* BP130636 LLW 19990331 INCLUDE PLAN(BP13C904) FOR BP13C641                   
//* BP130454 LLW 19990421 CHANGE EAALAG3C TO EAALAG2E FOR PRT04.                
//* BP130685 CLT 19990707 UPDATE BP13C642 TO READ SY08K010.                     
//* BP130666 LLW 19990806 TO PRINT CASES THAT HAVE USED CPF TO PAY              
//*                       LEASE FEE OR CONVEYANCE FEE WITHOUT USING             
//*                       A MINIMUM AMOUNT TOWARDS ICP (STEP34).                
//* BP130778 AKT 19991215 REMOVE BP13C904 FROM STEP25A,STEP25B AND              
//*                       STEP26A.                                              
//* BP130757 SSS 20000126 CATER FOR 40TH ANNIVERSARY LOGO PRINTING              
//* BP130799 CLT 01032000 NEW LOAN APPLICATION FORM IN BP13C642                 
//* BP130799 CLT 11032000 ADD JOBPARM STATEMENT FOR PRINTING                    
//* BP130845 CLT 27062000 REMOVE RUNNING OF BP13C642 AS PRINTING OF             
//*                       MLA IS DONE ONLINE VIA LASER PRINNTING.               
//* BP130895 JMS 20062000 USE TEMP DATASET IN PRGM BP13C439                     
//* BP130883 CLT 27102000 REMOVE CALLING OF BP13C904.                           
//* BP130944 CLT 21112000 PRINT ACK RECEIPT FOR MORTGAGE LOAN RETURNS           
//* BP130944 CLT 06122000 ADD FORM NAME IN DJDE STATEMENT                       
//* BP130998 CLT 20042001 ADD PRINTING FOR STUDIO APARTMENT                     
//* BP130998 CLT 02052001 REMOVE BP13C903 FROM RUN STATEMENT                    
//* BP130998 CKK 28052001 ADD PRINTING FOR SA FLAT                              
//* BP130998 CKK 15062001 COPIES=2 FOR BP1348 FORM                              
//* BP130998 CKK 04072001 ADD PRINTING FOR SA/TP FOR STUDIO APARTMENT           
//* BP132064 CLT 27122001 TC CUTOVER                                            
//* BP132125 CLT 15042002 REMOVE RUNNING OF BP13C037/BP13C641                   
//* BP132095 CKK 04052002 ADD PRINTING OF QMS BARCODE FOR ALL LETTERS           
//* BP132127 CKK 17052002 ADD PRT20 FOR PRINTING 1 COPY FOR SERS                
//* BP132160 CKK 30072002 REMOVE BP13C664 AND BP13C667                          
//*                       SHIFT ALL DJDE TO JCL FROM PROGRAM                    
//* BP132160 MALC07082002 ADD PRT33 TO PRINT BP134N WORKSHEET FORM              
//*                       CALL BY BP13C661                                      
//* BP132232 MALC21102002 TO CATER FOR CSM INFO. FOR BP13C665 AND               
//*                       BP13C635 USE BP1327 FORM INSTEAD OF BP1325            
//* BP132237 MALC21411002 FOR BP13C426 REMOVE READING OF BM06K100               
//* BP132352 CKK712062003 READ BP13K024 FOR C635, C665 AND C650                 
//* BP132352 CKK722062003 READ BP13K024 FOR ALL PRINTING PRGM                   
//* BP132371 SSS 10072003 PRINT 2 COPIES FOR L400B                              
//* BP132405 SSS 03092003 CHG CLASS V TO 2 FOR NON-COLOR FORM                   
//* BP132449 MTD 04022004 ADD BP13C453 AND BP13C454                             
//* BP132525 CLT 11052004 REMOVE BP13C689                                       
//* BP132566 CLT 19072004 ADD P13L400F TO BP13C400                              
//* BP132546 YCH 11062004 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//* BP132711 CLT 17062005 DELETE BP13C439/C442                                  
//* BP132702 CLT 11082005 DELETE BP13C427 AND PRINTING OF INCOME FORM           
//* BP132980 CLT 20122006 REMOVE PRINTING BY BP13C611, TRAN 'C4'                
//* BP133084 RB12 12062007 ADD BP27K800 TO STEP 32                              
//* BP133    SSS  19102007 REMOVE FORM BP1305                                   
//* BP133781 ESD1 14092010 ADDED STEP TO RUN BP13B664.                          
//* BP134317 CCC5 15022012 INCLUDED AC20K720 FOR BP13C903                       
//* BP135131 ESD1 05122013 ADDED NEW STEPS FOR CREATION OF SOCA                 
//*                        SUMMARY COUNT FILES.                                 
//* BP135171 RJE1 11022014 TO CATER FOR DB2 UPGRADE                             
//* BP136657 PCL4 03032017 TO REMOVE TL APPT TYPE                               
//* BP136799 KVL1 22052017 TO CHANGE SORT COND STEP33 TO NOT ELIMINATE          
//*                        VACANT FLATS (W/O REGN) IN THE SORT OUT              
//* BP136980 ZDD1 20102017 REMOVED PRINTING OF BP13L11A                         
//* BP136963 LSB1 20180510 INTERFACE FILE TO CAR PARK SO-APPMT                  
//* BP136733 DN8  20190423 TO INCLUDE NEW PROGRAM BP13C11H                      
//* BP137819 LSB1 20190521 INCLUDE TP CASE TO CAR PARK                          
//* BP139118 KAC1 20230623 CATER FOR INSTAL-GIRO = E (EGIRO)                    
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                                
//* PRT01 : CLASS = 2, COPIES = 3 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG3A CP-3',END;                                    
1$DJDE$ JDE=13C400,COPIES=3,FORMS=BLANKF,COLLATE=YES,JDL=BP13,END;              
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG3A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                                
//* PRT02 : CLASS = 2, COPIES = 1 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                                
//* PRT04 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2A CP-2',END;                                    
1$DJDE$ JDE=BP13D,COPIES=2,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT06 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT06    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2C CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP1313,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2C                         
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS  - TENANCY RPT                 
//* PRT07 : CLASS = 2, COPIES = 3 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT07    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG3B CP-1',END;                                    
1$DJDE$ JDE=13C311,COLLATE=YES,JDL=BP13,END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG3B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT09 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT09    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2D CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP1304,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2D                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT11 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT11    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2F CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP134A,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2F                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT12 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT12    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2G CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP134B,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2G                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT13 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT13    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2H CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP134E,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2H                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT14 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT14    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2I CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP134F,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2I                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT15 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT15    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2J CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP134C,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2J                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT16 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT16    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2K CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP134D,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2K                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT17 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT17    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2L CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP1322,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2L                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT18 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT18    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2M CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP134P,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2M                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT19 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT19    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2N CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP134L,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2N                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT20 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT20    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2O CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP134M,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2O                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT21 : CLASS = 2, COPIES = 2 **                                            
//*         WITH BARCODE FOR QMS AND BARCODE FOR POSTAL                         
//*----------------------------------------------------------------             
//PRT21    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2P CP-1',END;                                    
1$DJDE$ JDE=13POTN,JDL=BP13,FORM=BP1312,END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2P                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT22 : CLASS = W, COPIES = 2 **                                            
//*         WITH BARCODE FOR QMS AND BARCODE FOR POSTAL                         
//*----------------------------------------------------------------             
//PRT22    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2Q CP-1',END;                                    
1$DJDE$ JDE=13POTN,JDL=BP13,FORM=BP1326,END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2Q                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT23 : CLASS = V, COPIES = 2 **                                            
//*         WITH BARCODE FOR QMS AND BARCODE FOR POSTAL                         
//*----------------------------------------------------------------             
//PRT23    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2R CP-1',END;                                    
1$DJDE$ JDE=13POTN,JDL=BP13,FORM=BP1325,END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2R                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT24 : CLASS = V, COPIES = 2 **                                            
//*         WITH BARCODE FOR QMS AND BARCODE FOR POSTAL                         
//*----------------------------------------------------------------             
//PRT24    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2S CP-1',END;                                    
1$DJDE$ JDE=13POTN,JDL=BP13,FORM=BP1323,END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2S                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT25 : CLASS = 2, COPIES = 2 **                                            
//*         WITH BARCODE FOR QMS AND BARCODE FOR POSTAL                         
//*----------------------------------------------------------------             
//PRT25    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2T CP-1',END;                                    
1$DJDE$ JDE=13POTN,JDL=BP13,FORM=BP1306,END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2T                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT26 : CLASS = V, COPIES = 2 **                                            
//*         WITH BARCODE FOR QMS AND BARCODE FOR POSTAL                         
//*----------------------------------------------------------------             
//PRT26    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2U CP-1',END;                                    
1$DJDE$ JDE=13POTN,JDL=BP13,FORM=BP1336,END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2U                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT27 : CLASS = V, COPIES = 1 **                                            
//*         WITH BARCODE FOR QMS AND BARCODE FOR POSTAL                         
//*----------------------------------------------------------------             
//PRT27    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1C CP-1',END;                                    
1$DJDE$ JDE=13POTN,JDL=BP13,COPIES=1,FORM=BP1336,END;                           
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1C                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT33 : CLASS = 2, COPIES = 2 ** (SALES - AGM TEAM)                         
//*----------------------------------------------------------------             
//PRT33    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2Z CP-1',END;                                    
1$DJDE$ JDE=13C400,COLLATE=YES,JDL=BP13,FORMS=BP134N,END;                       
//FORMID   OUTPUT FORMS=1WS1,LINECT=66,GROUPID=EAALAG2Z                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS (LETTER)                       
//* PRT34 : CLASS = V, COPIES = 2 **                                            
//*         WITH BARCODE FOR QMS AND BARCODE FOR POSTAL                         
//*----------------------------------------------------------------             
//PRT34    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2 CP-1',END;                                     
1$DJDE$ JDE=13POTN,JDL=BP13,FORM=BP1327,END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2                                    
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* SORT SOC TRANS FILE FOR TRANS-TY = 'TB' & SALES TYPE 10                     
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=OLD                                      
//SORTOUT  DD DSN=&&S01F310,DISP=(NEW,PASS),                            00040010
//            UNIT=3380,SPACE=(TRK,(15,20),RLSE),                       00050006
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                    00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=((40,2,CH,EQ,C'10'),AND,                                       
      (9,2,CH,EQ,C'TB'))                                                        
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTERS AND GIRO FORMS FOR TYPE 10 LOOSE CASE   *         
//* FOR CA=N CASES (- BP13B435   'TB' - BP13B438)                *              
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&S01F310,DISP=(OLD,PASS)                                     
//BP13K880 DD DSN=BP13.K880.SUBTRF.SUCC,DISP=SHR,                               
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//AB20K050 DD DSN=AB20.K050.PREMIUM,DISP=SHR                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//P13L400A DD SYSOUT=W,OUTPUT=(*.PRT06.FORMID),DEST=IOMW                        
//FORMID   OUTPUT FORMS=1WD1                                                    
//BP13L400 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L400B DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//P13L400C DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L400D DD SYSOUT=2,OUTPUT=(*.PRT21.FORMID),DEST=IOM2                        
//P13L400F DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//AC20K700 DD DSN=AC20.K700.REBATE,DISP=SHR                                     
//AC20K710 DD DSN=AC20.K710.CUTOVER,DISP=SHR                                    
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//CP27K090 DD DSN=CP27.K090.HOLIDAY,DISP=SHR                                    
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C400) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB') -                                               
      PARM('  ')                                                                
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTER & WORKSHEET                              *         
//* FOR SA-TP ¦ CA=N ¦ SALES-TYPE=10 ¦ NON-SERS                       *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&S01F310,DISP=(OLD,PASS)                                     
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//P13L651A DD SYSOUT=W,OUTPUT=(*.PRT23.FORMID),DEST=IOMW                        
//P13L651B DD SYSOUT=2,OUTPUT=(*.PRT17.FORMID),DEST=IOM2                        
//AB20K050 DD DSN=AB20.K050.PREMIUM,DISP=SHR                                    
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//AC20K700 DD DSN=AC20.K700.REBATE,DISP=SHR                                     
//AC20K710 DD DSN=AC20.K710.CUTOVER,DISP=SHR                                    
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C651) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTER & WORKSHEET                              *         
//* FOR SA-TP ¦ CA=N ¦ SALES-TYPE=10 ¦ SERS                           *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&S01F310,DISP=(OLD,DELETE)                                   
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//P13L657B DD SYSOUT=2,OUTPUT=(*.PRT18.FORMID),DEST=IOM2                        
//P13L657C DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L657D DD SYSOUT=W,OUTPUT=(*.PRT26.FORMID),DEST=IOMW                        
//AB20K050 DD DSN=AB20.K050.PREMIUM,DISP=SHR                                    
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//AC20K700 DD DSN=AC20.K700.REBATE,DISP=SHR                                     
//AC20K710 DD DSN=AC20.K710.CUTOVER,DISP=SHR                                    
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C657) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* SORT SOC TRANS FILE FOR TRANS-TY = 'TB' & SALES TYPE 2B                     
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=OLD                                      
//SORTOUT  DD DSN=&&S03F310,DISP=(NEW,PASS),                            00040010
//            UNIT=3380,SPACE=(TRK,(10,20),RLSE),                       00050006
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                    00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=((40,2,CH,EQ,C'2B'),AND,                                       
                  (9,2,CH,EQ,C'TB'))                                            
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTERS FOR SITTING TENANT CASE                 *         
//* SALE TYPE 2B                                                      *         
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&S03F310,DISP=(OLD,PASS)                                     
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//AB20K050 DD DSN=AB20.K050.PREMIUM,DISP=SHR                                    
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR                                   
//AC20K700 DD DSN=AC20.K700.REBATE,DISP=SHR                                     
//AC20K710 DD DSN=AC20.K710.CUTOVER,DISP=SHR                                    
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//P13L426C DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L426D DD SYSOUT=2,OUTPUT=(*.PRT09.FORMID),DEST=IOM2                        
//P13L426E DD SYSOUT=W,OUTPUT=(*.PRT22.FORMID),DEST=IOMW                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C426) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* SORT SOC TRANS FILE FOR TRANS-TY = 'C3'                                     
//* FOR SERS, STD, RP, RED CASES                                                
//* SATP CA=E/Y                                                                 
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=OLD                                      
//SORTOUT  DD DSN=&&S71F310,DISP=(NEW,PASS),                            00040010
//            UNIT=3380,SPACE=(TRK,(10,20),RLSE),                       00050006
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                    00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(9,2,CH,EQ,C'C3')                                              
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTERS, UPDATE HH INCOME & WORKSHEET           *         
//* FOR SA-TP CA=E/Y (SERS, STD, RP, RED CASES)                       *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&S71F310,DISP=(OLD,PASS)                             00040010
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR,                                 
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//AB20K050 DD DSN=AB20.K050.PREMIUM,DISP=SHR                                    
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR                                   
//AC20K700 DD DSN=AC20.K700.REBATE,DISP=SHR                                     
//AC20K710 DD DSN=AC20.K710.CUTOVER,DISP=SHR                                    
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//P13L661A DD SYSOUT=W,OUTPUT=(*.PRT27.FORMID),DEST=IOMW                        
//P13L661B DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L661C DD SYSOUT=W,OUTPUT=(*.PRT23.FORMID),DEST=IOMW                        
//P13L661D DD SYSOUT=W,OUTPUT=(*.PRT26.FORMID),DEST=IOMW                        
//P13L661E DD SYSOUT=W,OUTPUT=(*.PRT22.FORMID),DEST=IOMW                        
//P13L661G DD SYSOUT=2,OUTPUT=(*.PRT19.FORMID),DEST=IOM2                        
//P13L661H DD SYSOUT=2,OUTPUT=(*.PRT33.FORMID),DEST=IOM2                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C661) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT SOC TRANS FILE FOR TRANS-TY = 'TB' &                *                  
//*      SALES TYPE 01, 02, 03 AND 3A                                 *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=OLD                                      
//SORTOUT  DD DSN=&&S04F310,DISP=(NEW,PASS),                            00040010
//            UNIT=3380,SPACE=(TRK,(10,20),RLSE),                       00050006
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                    00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=((40,2,CH,EQ,C'01',OR,                                         
                   40,2,CH,EQ,C'02',OR,                                         
                   40,2,CH,EQ,C'03',OR,                                         
                   40,2,CH,EQ,C'3A'),AND,                                       
                  (9,2,CH,EQ,C'TB'))                                            
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTER & WORKSHEET                              *         
//* FOR SA-TP ¦ CA=N ¦ SALES-TYPE=01/02/03/3A ¦ NON-SERS              *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&S04F310,DISP=(OLD,PASS)                                     
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//P13L652A DD SYSOUT=W,OUTPUT=(*.PRT24.FORMID),DEST=IOMW                        
//P13L652B DD SYSOUT=2,OUTPUT=(*.PRT17.FORMID),DEST=IOM2                        
//AB20K050 DD DSN=AB20.K050.PREMIUM,DISP=SHR                                    
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//AC20K700 DD DSN=AC20.K700.REBATE,DISP=SHR                                     
//AC20K710 DD DSN=AC20.K710.CUTOVER,DISP=SHR                                    
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C652) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTER & WORKSHEET                              *         
//* FOR SA-TP ¦ CA=N ¦ SALES-TYPE=01/02/03/3A ¦ SERS                  *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&S04F310,DISP=(OLD,PASS)                                     
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//P13L657B DD SYSOUT=2,OUTPUT=(*.PRT18.FORMID),DEST=IOM2                        
//P13L657C DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L657D DD SYSOUT=W,OUTPUT=(*.PRT26.FORMID),DEST=IOMW                        
//AB20K050 DD DSN=AB20.K050.PREMIUM,DISP=SHR                                    
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//AC20K700 DD DSN=AC20.K700.REBATE,DISP=SHR                                     
//AC20K710 DD DSN=AC20.K710.CUTOVER,DISP=SHR                                    
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C657) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT SOC TRANS FILE FOR TRANS-TY = 'C3'  & SALES TYPE 10          *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=OLD                                      
//SORTOUT  DD DSN=&&STEP6A,DISP=(NEW,PASS),                             00040010
//            UNIT=3380,SPACE=(TRK,(10,20),RLSE),                       00050006
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                    00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=((40,2,CH,EQ,C'10'),AND,                                       
                  (9,2,CH,EQ,C'C3'))                                            
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTER & WORKSHEET                              *         
//* FOR SA-TP ¦ CA=E/Y ¦ SALES-TYPE=10 ¦ NON-SERS ¦ NON-PREMIUM       *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC  PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F310 DD  DSN=&&STEP6A,                                                    
//             DISP=(OLD,PASS)                                                  
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K640 DD  DSN=BP13.K640.CA.ACTION,                                         
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K022 DD  DSN=BP13.K022.WISOIC,                                            
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,                                      
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//P13L635A DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//P13L635B DD  SYSOUT=W,OUTPUT=(*.PRT34.FORMID),DEST=IOMW                       
//P13L635D DD  SYSOUT=2,OUTPUT=(*.PRT11.FORMID),DEST=IOM2                       
//P13L635E DD  SYSOUT=2,OUTPUT=(*.PRT12.FORMID),DEST=IOM2                       
//AB20K050 DD  DSN=AB20.K050.PREMIUM,                                           
//             DISP=SHR                                                         
//AB03K050 DD  DSN=AB03.K050.INTTABLE,                                          
//             DISP=SHR                                                         
//AC20K700 DD  DSN=AC20.K700.REBATE,DISP=SHR                                    
//AC20K710 DD  DSN=AC20.K710.CUTOVER,DISP=SHR                                   
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C635) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTER  FOR SA-TP FOR CA=E/Y                    *         
//* FOR SA-TP ¦ CA=E/Y ¦ SALES-TYPE=10 ¦ NON-SERS ¦ PREMIUM           *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC  PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F310 DD  DSN=&&STEP6A,                                                    
//             DISP=(OLD,PASS)                                                  
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K640 DD  DSN=BP13.K640.CA.ACTION,                                         
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                             
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K024 DD  DSN=BP13.K024.WISLAST,DISP=SHR                                   
//P13L635A DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//P13L635B DD  SYSOUT=W,OUTPUT=(*.PRT34.FORMID),DEST=IOMW                       
//P13L635D DD  SYSOUT=2,OUTPUT=(*.PRT19.FORMID),DEST=IOM2                       
//P13L635E DD  SYSOUT=2,OUTPUT=(*.PRT20.FORMID),DEST=IOM2                       
//AB20K050 DD  DSN=AB20.K050.PREMIUM,DISP=SHR                                   
//AB03K050 DD  DSN=AB03.K050.INTTABLE,DISP=SHR                                  
//AC20K700 DD  DSN=AC20.K700.REBATE,DISP=SHR                                    
//AC20K710 DD  DSN=AC20.K710.CUTOVER,DISP=SHR                                   
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C665) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTER & WORKSHEET                              *         
//* FOR TP ¦ CA=E/Y ¦ SALES-TYPE=10 ¦ NON-SERS ¦ PREMIUM & NON-PREMIUM*         
//*-------------------------------------------------------------------*         
//STEP15   EXEC  PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F310 DD  DSN=&&STEP6A,DISP=(OLD,PASS)                                     
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K640 DD  DSN=BP13.K640.CA.ACTION,DISP=SHR,                                
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                             
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//P13L650A DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//P13L650B DD  SYSOUT=2,OUTPUT=(*.PRT25.FORMID),DEST=IOM2                       
//P13L650D DD  SYSOUT=2,OUTPUT=(*.PRT15.FORMID),DEST=IOM2                       
//P13L650E DD  SYSOUT=2,OUTPUT=(*.PRT16.FORMID),DEST=IOM2                       
//AB20K050 DD  DSN=AB20.K050.PREMIUM,DISP=SHR                                   
//AB03K050 DD  DSN=AB03.K050.INTTABLE,DISP=SHR                                  
//AC20K700 DD  DSN=AC20.K700.REBATE,DISP=SHR                                    
//AC20K710 DD  DSN=AC20.K710.CUTOVER,DISP=SHR                                   
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//CP27K090 DD  DSN=CP27.K090.HOLIDAY,DISP=SHR                                   
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C650) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT SOC TRANS FILE FOR TRANS-TY = 'C3'  & SALES TYPE 03          *         
//* FOR RP FLAT WHICH SOCA THEN TP                                    *         
//*-------------------------------------------------------------------*         
//STEP15A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=OLD                                      
//SORTOUT  DD DSN=&&STEP6B,DISP=(NEW,PASS),                             00040010
//            UNIT=3380,SPACE=(TRK,(10,20),RLSE),                       00050006
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                    00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=((40,2,CH,EQ,C'01',OR,                                         
                   40,2,CH,EQ,C'02',OR,                                         
                   40,2,CH,EQ,C'03',OR,                                         
                   40,2,CH,EQ,C'3A'),AND,                                       
                  (9,2,CH,EQ,C'C3'))                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT APPOINTMENT LETTER & WORKSHEET                              *         
//* FOR TP ¦ CA=E/Y ¦ SALES-TYPE=10 ¦ NON-SERS ¦ PREMIUM & NON-PREMIUM*         
//*-------------------------------------------------------------------*         
//STEP15B  EXEC  PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F310 DD  DSN=&&STEP6B,DISP=(OLD,PASS)                                     
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K640 DD  DSN=BP13.K640.CA.ACTION,DISP=SHR,                                
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                             
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//P13L650A DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//P13L650B DD  SYSOUT=2,OUTPUT=(*.PRT25.FORMID),DEST=IOM2                       
//P13L650D DD  SYSOUT=2,OUTPUT=(*.PRT15.FORMID),DEST=IOM2                       
//P13L650E DD  SYSOUT=2,OUTPUT=(*.PRT16.FORMID),DEST=IOM2                       
//AB20K050 DD  DSN=AB20.K050.PREMIUM,DISP=SHR                                   
//AB03K050 DD  DSN=AB03.K050.INTTABLE,DISP=SHR                                  
//AC20K700 DD  DSN=AC20.K700.REBATE,DISP=SHR                                    
//AC20K710 DD  DSN=AC20.K710.CUTOVER,DISP=SHR                                   
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//CP27K090 DD  DSN=CP27.K090.HOLIDAY,DISP=SHR                                   
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C650) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//*  SORT SOC TRANS FILE FOR TRANS-TY = 'C3' &                                  
//*       SALES TYPE 01, 02, 03, 3A                                             
//*-----------------------------------------------------------------            
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=OLD                                      
//SORTOUT  DD DSN=&&S04F311,DISP=(NEW,PASS),                            00040010
//           UNIT=3380,SPACE=(TRK,(15,20),RLSE),                        00050006
//           DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                     00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=((40,2,CH,EQ,C'01',OR,                                         
                   40,2,CH,EQ,C'02',OR,                                         
                   40,2,CH,EQ,C'03',OR,                                         
                   40,2,CH,EQ,C'3A'),AND,                                       
                  (9,2,CH,EQ,C'C3'))                                            
//*-----------------------------------------------------------------            
//* PRINT APPOINTMENT LETTER                                                    
//* FOR SA-TP ¦ CA=E/Y ¦ SALES-TYPE=01/02/03/3A ¦ NON-SERS                      
//*-----------------------------------------------------------------            
//STEP17   EXEC  PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F310 DD  DSN=&&S04F311,                                                   
//             DISP=(OLD,DELETE)                                                
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K640 DD  DSN=BP13.K640.CA.ACTION,                                         
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//P13L636A DD  SYSOUT=W,OUTPUT=(*.PRT24.FORMID),DEST=IOMW                       
//P13L636B DD  SYSOUT=2,OUTPUT=(*.PRT13.FORMID),DEST=IOM2                       
//P13L636C DD  SYSOUT=2,OUTPUT=(*.PRT14.FORMID),DEST=IOM2                       
//AB20K050 DD  DSN=AB20.K050.PREMIUM,                                           
//             DISP=SHR                                                         
//AB03K050 DD  DSN=AB03.K050.INTTABLE,                                          
//             DISP=SHR                                                         
//AC20K700 DD  DSN=AC20.K700.REBATE,DISP=SHR                                    
//AC20K710 DD  DSN=AC20.K710.CUTOVER,DISP=SHR                                   
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C636) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* SORT SOC TRANS FILE FOR TRANS-TY = 'TB','C3','SA'                           
//*-----------------------------------------------------------------            
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//         DD DSN=BP13.F310.APPOINT,DISP=SHR                                    
//SORTOUT  DD DSN=&&S05F310,DISP=(NEW,PASS),                            00040010
//           UNIT=3380,SPACE=(TRK,(15,20),RLSE),                        00050006
//           DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                     00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(9,2,CH,EQ,C'TB',OR,                                           
                  9,2,CH,EQ,C'C3',OR,9,2,CH,EQ,C'SA')                           
//*-------------------------------------------------------------------*         
//* ACCUMULATE TO DAILY APPOINT FILE FOR CLEAR FILE CHECK             *         
//*-------------------------------------------------------------------*         
//STEP20   EXEC SORT,COND=(0,NE)                                        00029010
//SORTIN   DD DSN=&&S05F310,DISP=(OLD,DELETE)                           00030014
//SORTOUT  DD DSN=BP13.F310.APPOINT,DISP=MOD                            00040010
//SYSIN    DD *                                                         00053006
    SORT FIELDS=(9,2,A,1,8,A),FORMAT=CH,FILSZ=E20000                    00054006
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT SOC TRANS FILE FOR TRANS-TY =  'KA'                          *         
//*-------------------------------------------------------------------*         
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP23,DISP=(NEW,PASS),                             00040010
//            UNIT=3380,SPACE=(TRK,(10,20),RLSE),                       00050006
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                    00051006
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(9,2,CH,EQ,C'KA')                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT LIST OF KEY AVAIL CASES FOR SALES TO SCHEDULE APPT.         *         
//*-------------------------------------------------------------------*         
//STEP22   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&STEP23,DISP=(OLD,PASS)                                      
//BP13K880 DD DSN=BP13.K880.SUBTRF.SUCC,DISP=SHR,                               
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//AB20K050 DD DSN=AB20.K050.PREMIUM,DISP=SHR                                    
//P13L400A DD SYSOUT=W,OUTPUT=(*.PRT06.FORMID),DEST=IOMW                        
//FORMID   OUTPUT FORMS=1WD1                                                    
//BP13L400 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L400B DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//P13L400C DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L400D DD SYSOUT=2,OUTPUT=(*.PRT21.FORMID),DEST=IOM2                        
//P13L400F DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//AC20K700 DD DSN=AC20.K700.REBATE,DISP=SHR                                     
//AC20K710 DD DSN=AC20.K710.CUTOVER,DISP=SHR                                    
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//CP27K090 DD DSN=CP27.K090.HOLIDAY,DISP=SHR                                    
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C400) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB') -                                               
      PARM('KA')                                                                
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* ACCUMULATE TO DAILY APPOINT FILE FOR CLEAR FILE CHECK                       
//*-----------------------------------------------------------------            
//STEP23   EXEC SORT,COND=(0,NE)                                        00029010
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                              00030014
//SORTOUT  DD DSN=BP13.F310.APPOINT,DISP=MOD                            00040010
//SYSIN    DD *                                                         00053006
    SORT FIELDS=(9,2,A,1,8,A),FORMAT=CH,FILSZ=E20000                    00054006
    INCLUDE COND=(9,2,CH,EQ,C'C0')                                              
//*                                                                             
//*=================================================================            
//* SORT CASES: PRINT REPORT ON PRE-ELIGIBILITY EN-BLOC LISTING                 
//* FOR TP & SA/TP CASES INDIVIDUALLY                                           
//*-----------------------------------------------------------------            
//STEP24   EXEC SORT,COND=(0,NE)                                        00029010
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                              00030014
//SORTOUT  DD DSN=&&S31F310,DISP=(NEW,PASS),                                    
//            UNIT=3380,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                         00053006
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00054006
   INCLUDE COND=(09,2,CH,EQ,C'C0',AND,                                          
                 11,1,CH,EQ,C'Y',AND,                                           
                 66,5,CH,GT,C'     ')                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//*  TO PRINT REPORT ON PRE-ELIGIBILITY EN-BLOC LISTING               *         
//*  FOR  TP & SA/TP  CASES INDIVIDUALLY                              *         
//*-------------------------------------------------------------------*         
//STEP25   EXEC PGM=BP13C648                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//BP13F310 DD  DSN=&&S31F310,DISP=(OLD,PASS)                                    
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR                                    
//BP13L648 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//P13L648A DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO SORT CASES: PRINT REPORT ON PRE-ELIGIBILITY EN-BLOC LISTING    *         
//* FOR  TP & SA/TP  CASES EN-BLOC                                    *         
//*-------------------------------------------------------------------*         
//STEP26   EXEC SORT,COND=(0,NE)                                        00029010
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                              00030014
//SORTOUT  DD DSN=&&S32F310,DISP=(NEW,PASS),                                    
//            UNIT=3380,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                         00053006
   SORT FIELDS=(66,5,A,1,8,A),FORMAT=CH                                 00054006
   INCLUDE COND=(09,2,CH,EQ,C'C0',AND,                                          
                 11,1,CH,NE,C'Y',AND,                                           
                 66,5,CH,GT,C'     ')                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* TO PRINT REPORT ON PRE-ELIGIBILITY EN-BLOC LISTING                *         
//* FOR  TP & SA/TP  CASES EN-BLOC                                    *         
//*-------------------------------------------------------------------*         
//STEP27   EXEC PGM=BP13C648                                                    
//SYSOUT   DD  SYSOUT=*                                                         
//BP13F310 DD  DSN=&&S32F310,DISP=(OLD,PASS)                                    
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR                                    
//BP13L648 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//P13L648A DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//*                                                                             
//*=================================================================            
//* SORT K400 FOR K400-CDE-SUBS-INSTAL-GIRO = 'Y'                               
//*-----------------------------------------------------------------            
//STEP28   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.F410.DAILYSO,DISP=SHR                                    
//SORTOUT  DD DSN=&&STEP33,DISP=(NEW,PASS),                                     
//            SPACE=(CYL,(3,2),RLSE),                                           
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=20000,LRECL=2000,RECFM=FB)                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1465,1,CH,EQ,C'Y',OR,                                           
                1465,1,CH,EQ,C'E')                                              
//*                                                                             
//*-----------------------------------------------------------------            
//*  LIST OF CASES OPTED TO USE GIRO FOR SUBSEQUENT HOUSING                     
//*  INSTALMENT                                                                 
//*-----------------------------------------------------------------            
//STEP29   EXEC PGM=BP13C662,COND=(0,NE)                                        
//BP13F410 DD DSN=&&STEP33,DISP=(OLD,DELETE)                                    
//BP13L662 DD SYSOUT=8,DEST=IOM8                                                
//P13L662A DD SYSOUT=2,OUTPUT=(*.PRT07.FORMID),DEST=IOM2                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------*        
//* SORT ALL 'DG' TRANSACTION CODE                                     *        
//*--------------------------------------------------------------------*        
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K315.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F315N,DISP=(NEW,PASS),                                   
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                               
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN    DD *                                                                 
   SORT FIELDS=(190,3,A,40,2,A,115,1,A,1,8,A),FORMAT=CH                         
   INCLUDE COND=(9,2,CH,EQ,C'DG')                                               
/*                                                                              
//*--------------------------------------------------------------------*        
//*  LIST OF CASES OPTED TO USE GIRO FOR SUBSEQUENT HOUSING INSTALMENT          
//*--------------------------------------------------------------------*        
//STEP31   EXEC PGM=BP13C664,COND=(0,NE)                                        
//BP13F315 DD DSN=&&P13F315N,DISP=(OLD,DELETE)                                  
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                                   
//           AMP=('BUFND=4','BUFNI=8')                                          
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//           AMP=('BUFND=4','BUFNI=8')                                          
//BP13L664 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//P13L664A DD SYSOUT=2,OUTPUT=(*.PRT07.FORMID),DEST=IOM2                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* EXTRACT BP13K432 RECORDS WITH KEYS RETURN DATE = SYSTEM DATE                
//*-----------------------------------------------------------------            
//STEP32 EXEC    PGM=IKJEFT01,COND=(0,NE),                              00000260
//             REGION=4096K,                                            00000270
//             DYNAMNBR=20                                              00000280
//BP13K432 DD  DSN=BP13.K432.KEY.LOG,DISP=SHR,                          00001900
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K435 DD  DSN=BP13.K435.KEY.BORROW,DISP=SHR,                       00001900
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                            00001900
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00001900
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP27K800 DD  DSN=BP27.K800.HLAPPLN,DISP=SHR,                          00001900
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                          00001900
//             AMP=('BUFND=4','BUFNI=8')                                        
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00001900
//BP13F432 DD  DSN=BP13.F432.BP13C453,DISP=SHR                          00001900
//SYSOUT   DD  SYSOUT=*                                                 00001940
//SYSTSPRT DD  SYSOUT=*                                                 00000450
 /SYSPRINT DD  SYSOUT=*                                                 00001940
//SYSDBOUT DD  SYSOUT=*                                                 00001950
//SYSTSIN  DD  *                                                        00000490
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C453) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                      00000500
//*=================================================================            
//* SORT BP13F432 BY REGN NUMBER                                                
//*-----------------------------------------------------------------            
//STEP33   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.F432.BP13C453,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F432,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,500,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT DAILY REPORT ON KEYS RETURNED TO SOU                                  
//*-----------------------------------------------------------------            
//STEP34 EXEC    PGM=BP13C454,COND=(0,NE)                               00001890
//BP13F432 DD  DSN=&&BP13F432,DISP=(OLD,DELETE)                         00001900
//BP13L454 DD  SYSOUT=8,DEST=IOM8                                               
//SYSOUT   DD  SYSOUT=*                                                 00001940
//SYSPRINT DD  SYSOUT=*                                                 00001940
//SYSDBOUT DD  SYSOUT=*                                                 00001950
//*                                                                             
//*=================================================================            
//* BACKUP FILE                                                                 
//*-----------------------------------------------------------------            
//STEP35   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K432.KEY.LOG,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F432.KEY.LOG.ACCUM,                                      
//            DISP=MOD                                                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                      00001960
//*=================================================================            
//* DELETE-DEFINE VSAM FILE (BP13.K432.KEY.LOG)                                 
//*-----------------------------------------------------------------            
//STEP36   EXEC  PGM=IDCAMS                                             00003360
//INPUT1   DD  DSN=BP13.BLANK.CHAR200,DISP=SHR                          00003370
//SYSPRINT DD  SYSOUT=*                                                 00003390
//SYSIN    DD  *                                                        00003400
          DEL 'BP13.K432.KEY.LOG' CLUSTER PURGE                                 
          DEF CLUSTER                                -                          
              (NAME(BP13.K432.KEY.LOG)          -                               
              TRK(20 10)                             -                          
              UNIQUE                                 -                          
              STORCLAS(PRODRLS)               -                                 
              LOG(NONE)                       -                                 
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K432.KEY.LOG.DATA) -                                   
              KEYS(16 0)                             -                          
              RECSZ(200 200)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K432.KEY.LOG.INDEX) -                                  
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K432.KEY.LOG)              -                               
            REUSE                                                               
      IF MAXCC = 0 THEN                              -                          
         DEF AIX (NAME(BP13.K432.KEY.LOG.ALTX1) -                               
              REL(BP13.K432.KEY.LOG)            -                               
              TRK(5 3)                               -                          
              SHR(2 3)                               -                          
              UNIQUE                                 -                          
              KEYS(11 16)                            -                          
              CISZ(4096)                             -                          
              RECSZ(6000 6000)                       -                          
              NUNQK)                                                            
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.K432.KEY.LOG.PATH1) -                               
             PENT(BP13.K432.KEY.LOG.ALTX1))                                     
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.K432.KEY.LOG)             -                               
             ODS(BP13.K432.KEY.LOG.ALTX1)                                       
/*                                                                      00003410
//*---------------------------------------------------------------------        
//* INCLUDE WITH DTE-SO-APPMT CASE                                              
//*-----------------------------------------------------------------            
//STEP37   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F800C42E,DISP=(,PASS),                                      
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000),                              
//        SPACE=(CYL,(100,10),RLSE)                                             
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C'C',AND,                                            
               155,4,CH,NE,C'    ',AND,                                         
               475,8,CH,GE,C'20190701')                                         
   INREC OVERLAY=(1985:C'        ')                                             
//*---------------------------------------------------------------------        
//* INCLUDE DAILY KEY-ISSUED CASE                                               
//*-----------------------------------------------------------------            
//STEP37A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F410.DAILYSO,DISP=SHR                                    
//SORTOUT  DD DSN=&&F800C42E,DISP=(MOD,PASS),                                   
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000),                              
//        SPACE=(CYL,(100,10),RLSE)                                             
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   OUTREC BUILD=(001:C'K',                                                      
                 004:1,8,                                                       
                 088:138,9,                                                     
                 097:233,9,                                                     
                 106:328,9,                                                     
                 115:423,9,                                                     
                 155:10,11,                                                     
                1985:855,8,                                                     
                1993:8X)                                                        
/*                                                                      00009902
//*-----------------------------------------------------------------            
//* OUTPUT BP13F448 TO CAR PARK SYSTEM, WITH APPOMT OR TP CASES                 
//*-----------------------------------------------------------------            
//STEP38  EXEC PGM=BP13C42E,COND=(0,NE)                                         
//BP13F800 DD DSN=&&F800C42E,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F448 DD DSN=BP13.F448.SOAPPT.CARPARK,DISP=OLD                             
//P13F448A DD DSN=BP13.F448.TP.CARPARK,DISP=OLD                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*===================================================================*         
//* BP135131 - ADDED NEW STEPS FOR CREATION OF SOCA SUMMARY COUNT FILES         
//*===================================================================*         
//*-------------------------------------------------------------------*         
//* SORTOUT ALL OUTSTANDING SA CASES                                            
//*--------------------------------------------------------------------         
//STEP39   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&F80A,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=COPY                                                             
   INCLUDE COND=((365,8,CH,EQ,C'        ',OR,                                   
                  365,8,CH,EQ,C'00000000',OR,                                   
                  365,8,BI,EQ,X'00'),AND,                                       
                 (155,11,CH,GT,C'00000000000'),AND,                             
                 (1,1,CH,NE,C'C'),AND,                                          
                 (4,1,CH,EQ,C'1',OR,                                            
                  4,1,CH,EQ,C'2',OR,                                            
                  4,1,CH,EQ,C'3',OR,                                            
                  4,1,CH,EQ,C'4'))                                              
//*-------------------------------------------------------------------*         
//* CREATE FB40 AND FB45 FOR OUTSTANDING CASES                                  
//*--------------------------------------------------------------------         
//STEP40   EXEC PGM=BP13C11A,COND=(0,NE)                                        
//BP13F80A DD DSN=&&F80A,DISP=(OLD,PASS)                                00400005
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FB40 DD DSN=BP13.FB40.SUMCNT,DISP=SHR                                     
//BP13FB45 DD DSN=BP13.FB45.SUMREGN,DISP=SHR                                    
//BP13L11A DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORTOUT ALL KPI CASES                                                       
//*--------------------------------------------------------------------         
//STEP41   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&F80B,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=COPY                                                             
   OMIT COND=(953,8,CH,EQ,C'        ',OR,                                       
              953,8,CH,EQ,C'00000000',OR,                                       
              953,8,BI,EQ,X'00',OR,                                             
              155,11,CH,EQ,C'        ',OR,                                      
              155,11,BI,EQ,X'00',OR,                                            
              1,1,CH,EQ,C'C',OR,                                                
              4,1,CH,EQ,C'5',OR,                                                
              4,1,CH,EQ,C'6')                                                   
//*-------------------------------------------------------------------*         
//* CREATE FB40 AND FB45 FOR KPI CASES                                          
//*--------------------------------------------------------------------         
//STEP42   EXEC PGM=BP13C11B,COND=(0,NE)                                        
//BP13F80A DD DSN=&&F80B,DISP=(OLD,PASS)                                00400005
//BP13F300 DD DSN=BP13.F300.SUCCESS,DISP=SHR                            00400005
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FB40 DD DSN=BP13.FB40.SUMCNT,DISP=MOD                                     
//BP13L11B DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* CREATE FB40 AND FB45 FOR TP SIGNED CASES                                    
//*--------------------------------------------------------------------         
//STEP43   EXEC PGM=BP13C11H,COND=(0,NE)                                        
//BP13F410 DD DSN=BP13.F410.DAILYSO,DISP=SHR                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FB40 DD DSN=BP13.FB40.SUMCNT,DISP=MOD                                     
//BP13L11B DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORTOUT BP13.FB45.SUMMREGN                                                  
//*--------------------------------------------------------------------         
//STEP44   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB45.SUMREGN,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB45.SUMREGN,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,1,CH,A,2,1,CH,A,3,2,CH,A,5,2,CH,A,7,3,CH,A,                   
                10,6,CH,A,16,8,CH,A)                                            
//*-------------------------------------------------------------------*         
//* SORTOUT BP13.FB45.SUMMREGN                                                  
//*--------------------------------------------------------------------         
//STEP45   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB40.SUMCNT,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.FB40.SUMCNT,DISP=SHR                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,1,CH,A,2,1,CH,A,3,8,CH,A)                                     
//*-------------------------------------------------------------------*         
//* REPRO FB40 TO KB40                                                          
//*--------------------------------------------------------------------         
//STEP46      EXEC PGM=IDCAMS                                                   
//INPFL   DD DSN=BP13.FB40.SUMCNT,DISP=SHR                                      
//OUTFL   DD DSN=BP13.KB40.SUMCNT,DISP=SHR                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPFL) OUTFILE(OUTFL) REPLACE                                    
//*-------------------------------------------------------------------*         
//* REPRO FB45 TO KB45                                                          
//*--------------------------------------------------------------------         
//STEP47   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.FB45.SUMREGN,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
         DEL 'BP13.KB45.SUMREGN' CL PURGE                                       
         DEF CL (NAME(BP13.KB45.SUMREGN)              -                         
                 CYL(200 100)                          -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.KB45.SUMREGN.DATA)         -                        
                 KEYS(23 0)                            -                        
                 RECSZ(400 400)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.KB45.SUMREGN)                                         
//*-------------------------------------------------------------------*         
//*                       END OF BP13D402                             *         
//*-------------------------------------------------------------------*         
