//BP13A548 JOB (BP13P),'BP13A548',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* EXTRACT WAITING LIST APLLN FOR PIGEONHOLING                                 
//* NOTE: THIS JCL WAS CHANGED FOR EC ONLY                                      
//*                                                                             
//* THIS IS THE 1ST JCL FOR EC SHORTLISTING. TO RUN BEFORE ASSIGNING            
//* OF RANDOM NO. ASSIGN RANDOM NO IS BP13AA05.                                 
//******************************************************************            
//* CR  REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP134270 IL5 060711 - NEW.  MODIFIED FROM BP13A546                          
//*                       FT IS HARDCODED AS 5 FOR BALLOT                       
//* BP134524 IL5 170512 - UPDATED HARDCODED NT                                  
//* BP134674 IL5 250912 - UPDATED HARDCODED NT                                  
//* BP134886 IL5 160412 - UPDATED HARDCODED NT                                  
//* BP134886 IL5 160412 - UPDATED HARDCODED NT                                  
//* BP134982 IL5 110712 - UPDATED HARDCODED NT                                  
//* BP135016 IL5 250713 - UPDATED HARDCODED NT                                  
//* BP135028 IL5 230813 - UPDATED HARDCODED NT                                  
//* BP135057 IL5 041013 - UPDATED HARDCODED NT                                  
//* BP135057 IL5 041013 - UPDATED HARDCODED NT                                  
//* BP135107 IL5 251013 - UPDATED HARDCODED NT                                  
//* BP135505 IL5 141014 - UPDATED HARDCODED NT                                  
//* BP135504 IL5 171014 - UPDATED HARDCODED NT                                  
//* BP135623 IL5 071015 - UPDATED HARDCODED NT                                  
//* BP135872 IL5 270715 - UPDATED HARDCODED NT                                  
//* BP138102 IL5 050320 - UPDATED HARDCODED NT                                  
//* BP138246 IL5 120320 - CHANGE CLASS 2 TO CLASS J AND IOMS                    
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01                    APPLICATION TEAM                                  
//**************************************************************                
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*------------------------------------------------------------------*          
//* STEP 0:-       *   DELETE BACKUP FILES *                                    
//*------------------------------------------------------------------*          
//STEP000  EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD *                                                                 
     DEL (BP13.LF65.REPORT)                                                     
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*--------------------------------------------------------------------         
//* SORT OUT DBSS APPLICATION ONLY                                              
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F500.DBSS,DISP=OLD                                       
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(376,3,CH,EQ,C'EC ',AND,187,3,CH,EQ,C'SK ',AND,               
                   334,6,CH,EQ,C'202002')                                       
     OUTREC FIELDS=(1,210,C'5',212,289)                                         
//*--------------------------------------------------------------------         
//* SORT BTO MATURE REQUESTS TO SEQUENTIAL FILE                                 
//*---------------------------------------------------------------------        
//STEP02A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.DBSS,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(187,3,A,211,2,A,123,8,A),FORMAT=CH                            
//*---------------------------------------------------------------------        
//*  JCL TO RUN PROGRAM BP13LF65                                                
//*---------------------------------------------------------------------        
//STEP02B  EXEC PGM=BP13CF65,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR                                      
//P13F730A DD DSN=BP13.F500.DBSS,DISP=OLD                                       
//BP13LF65 DD DSN=BP13.LF65.REPORT,DISP=(NEW,CATLG),                            
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(5,5),RLSE),AVGREC=M,DSORG=PS                             
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//*  SORT OUT ALL THE CANCELLED DBSS CASES FROM BALLOT LOG FILE                 
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F595,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(160,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      INCLUDE COND=(260,1,CH,EQ,C'C',AND,                                       
                    123,1,CH,EQ,C'6',AND,                                       
                    187,3,CH,EQ,C'SK ',AND,                                     
                    334,6,CH,EQ,C'202002')                                      
//*---------------------------------------------------------------------        
//* PRINT REPORT SHOWING CANCELLED EC APPLICATIONS                              
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C527,COND=(0,NE)                                        
//BP13F595 DD DSN=&&P13F595,DISP=(OLD,PASS)                                     
//BP13K500 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K501 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                             
//BP13K502 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                             
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR                                   
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13L527 DD SYSOUT=J,OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//*                      END OF JOB                                             
//*------------------------------------------------------------------           
