//BP13DM26 JOB (BP13P),'BP13DM26',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             COND=(0,NE),NOTIFY=CSD0071                                       
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//**********************************************************************        
//*TO DETERMINE APPLICATION CORE NUCLEUS PERSON PAST 5 YEARS CHANCE             
//*TO BOOK A FLAT ELIGIBIITY FOR FTPMC                                          
//**********************************************************************        
//*STEP01: SET RECORD TYPE 0 FOR HEADER, 1 TO APPLICATION RECORD DETAIL         
//*AND 9 TO CONTROL RECORD                                                      
//**********************************************************************        
//STEP01  EXEC PGM=SORT                                                         
//SORTIN   DD DISP=SHR,DSN=BP13.FDM24003.ACCEPTED.SD(0)                         
//SORTOUT  DD DSN=&&STEP01,DISP=(NEW,PASS,DELETE),UNIT=CART,                    
//            DCB=(LRECL=101,RECFM=FB,BLKSIZE=0)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  OPTION DYNALLOC=(SYSDA,50)                                                    
  SORT FIELDS=(7,8,CH,A)                                                        
  INREC IFTHEN=(WHEN=(7,8,CH,EQ,X'0000000000000000'),                           
        BUILD=(1:C'0',2:1,100)),                                                
        IFTHEN=(WHEN=(7,8,CH,EQ,X'FFFFFFFFFFFFFFFF'),                           
        BUILD=(1:C'9',2:1,100)),                                                
        IFTHEN=(WHEN=NONE,                                                      
        BUILD=(1:C'1',2:1,100))                                                 
/*                                                                              
//**********************************************************************        
//*STEP02: CORE NUCLEUS PERSON BY ASCENDING NRIC AND SET RECORD                 
//*TYPE 2 TO CORE NUCLEUS PERSON DETAILS                                        
//**********************************************************************        
//STEP02  EXEC PGM=SORT                                                         
//SORTIN   DD DISP=SHR,DSN=BP13.K825.REQOCCP,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&STEP02,DISP=(NEW,PASS,DELETE),UNIT=CART,                    
//            DCB=(LRECL=101,RECFM=FB,BLKSIZE=0)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  OPTION DYNALLOC=(SYSDA,50)                                                    
  SORT FIELDS=(1,8,CH,A,9,9,CH,A)                                               
  INCLUDE COND=(1,1,CH,EQ,C'8',AND,131,1,CH,EQ,C'Y')                            
  OUTREC IFTHEN=(WHEN=(1,8,CH,NE,C' '),                                         
        BUILD=(1:C'2',2:C'      ',1,8,9,9,131,1,76:X))                          
/*                                                                              
//**********************************************************************        
//*STEP03: TO MERGE HEADER, APPLICATION DETAIL, CONTROL RECORD WITH             
//*PERSON RECORD AND SORT BY ASCENDING REGN NO, RECORD TYPE AND NRIC            
//**********************************************************************        
//STEP03   EXEC SORT                                                            
//SORTIN   DD DSN=&&STEP01,DISP=(OLD,DELETE,DELETE),UNIT=CART                   
//         DD DSN=&&STEP02,DISP=(OLD,DELETE,DELETE),UNIT=CART                   
//SORTOUT  DD DSN=&&STEP03,DISP=(NEW,PASS,DELETE),UNIT=CART,                    
//            DCB=(LRECL=101,RECFM=FB,BLKSIZE=0)                                
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(8,8,CH,A,1,1,CH,A,16,9,CH,A)                                     
//***************************************************************               
//*STEP04: DETERMINE CORE NUCLEUS PERSON PAST 5 YEAR CHANCE ELIGIBILITY         
//***************************************************************               
//STEP04   EXEC PGM=BP13CM26                                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSDUMP  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//BP13FIN1 DD DSN=&&STEP03,DISP=(OLD,DELETE,DELETE),UNIT=CART                   
//BP13K591 DD DISP=SHR,DSN=BP13.K595.BALLOT.LOG.PATH1,                          
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K592 DD DISP=SHR,DSN=BP13.K595.BALLOT.LOG.PATH2,                          
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K593 DD DISP=SHR,DSN=BP13.K595.BALLOT.LOG.PATH3,                          
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K594 DD DISP=SHR,DSN=BP13.K595.BALLOT.LOG.PATH4,                          
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K595 DD DISP=SHR,DSN=BP13.K595.BALLOT.LOG,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DISP=SHR,DSN=BP13.K800.APPLN,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K893 DD DISP=SHR,DSN=BP13.K893.APPLN.HISTORY,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FIN2 DD *                                                                 
NCNSNENFLSWAWBWFWGWHWIWJWKWL                                                    
//BP13FOT1 DD DSN=BP13.FDM26001.ACCEPTED.SD(+1),                                
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(10,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                            
//BP13FOT2 DD DSN=BP13.FDM26002.REJECTED.SD(+1),                                
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(10,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                            
/*                                                                              
