//BP13A200 JOB (BP13P),'BP13A200',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*-----------------------------------------------------------------            
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP13A215 LSB 961126 - NEW REPORT ON AVG SELL-PRICE FOR 3RM/4A FLAT          
//* BP13A418 LSB 981015 - Y2K CHANGES                                           
//* BP130883 CLT 271000 - REMOVE CALLING OF BP13C904                            
//* BP130970 MBS 010808 - CHG BP13C228 ADD ONE OUTPUT FILE                      
//* BP132278 JF4 030328 - CHG CALLING PGMS BP13C260 AND BP13C226                
//* BP132432 MTD 031021 - ADD PGM BP13C266                                      
//* BP132432 MTD 031114 - REMOVE PGM BP13C266 AND RETAIN BP13C224               
//* BP132452 MJ16031229 - REMOVE FILES BP13K580 AND B14K580O FROM PGM           
//*                       BP13C224 AND INCLUDED THE UPDATION OF DPD &           
//*                       LCD TO BM06F800,REMOVE INCLUDE COND FROM              
//*                       STEP16.                                               
//* BP132582 SSD 041004 - ADD PRT07 AND PGM BP13C26E                            
//* BP132785 LMS 071205 - TO CATER FOR COMBINE SA FLATLIST                      
//* BP132878 GAN 080606 - TO CATER FOR NEW BREAK (MODL-DESG) IN L26A            
//* BP133026 RB12 260307 - CATER FOR NEW BREAK (RM TYPE)                        
//* BP133056 RB12 070507 - ADD PRT08 AND REPORT BP13L26G                        
//* BP133071 RB12 010607 - TO CATER FOR CHANGE IN SORTING OF F999               
//* BP133056 RB12 140607 - CATER FOR DIFF SORTING CRITERIA FOR L26G             
//* BP133610 ESA1 010609 - REPLACE BP13K767 WITH BP13K816                       
//* BP133724 DW5  251109 - TO ADD BM06K100 TO PROGRAM BP13C226                  
//* BP133772 ESA1 080110 - TO CATER FOR FORM A,C & D ONLY IN BP13C260           
//* BP133851 ESA1 120310 - TO ADD BP13KQ30 IN BP13C226                          
//*                      - TO ADD BP13C26J IN BP13C260                          
//* BP133859 ESA1 010610 - TO ADD BP13K816 IN BP13C224                          
//* BP134044 ESA1 060111 - TO ADD BP13KQ50 & BP13K110 IN BP13C224               
//* BP134309 DW5  020811 - TO ADD UPDATE TO BM06K810                            
//* BP134513 ESA1 160412 - TO ADD BP13K11A IN BP13C224                          
//* BP135487 EL27 190712 - ADD VERIFY BP13.K110.GROUNIT.FLATLIST                
//* BP135004 ESA1 060813 - TO ADD BP13C26K IN BP13C260                          
//* BP135171 RJE1 100214 - TO CATER FOR DB2 UPGRADE                             
//* BP135008 EL27 131014 - FIX STEP4B SB37 ABEND                                
//* BP135178 ESA1 111114 - TO ROUTE PRINTING TO CLASS 'J'                       
//* BP135555 KG12 150109 - TO ADD READING OF BM06K110 & BP13K277 IN             
//*                        STEP05                                               
//* BP136066 ESA1 120115 - TO ADD BP13C26L IN BP13C260                          
//* BP136217 ESA1 070416 - TO ADD STEP7A TO CATER FOR CD-ROM COPY               
//* BP13XXXX EL27 100516 - FIX &&F800DEL SB37 ERROR AT SORTING BM06F800         
//* BP136348 ESA1 011117 - TO ADD DJ02KL5A & DJ02KL50 IN BP13C250               
//* BP136642 SMR2 060217 - CATER FOR SYSOUT=8,DEST=IOM8                         
//* BP136671 ESA1 230317 - TO ADD BP13C26M IN BP13C260                          
//* BP136835 ESA1 220617 - TO ADD BB14K990 IN BP13C224                          
//*================================================================== *         
//*-------------------------------------------------------------------*         
//* VERIFY FILES BEFORE RUNNING                                       *         
//*-------------------------------------------------------------------*         
//STEPAA  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K110.GROUNIT.FLATLIST,DISP=OLD                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY (FOR BP13C257)                                        
//*-----------------------------------------------------------------            
//PRT02  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1B CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1B                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* PRINTING OF SELLING PRICE FOR BP13C260                                      
//* COPIES=3, DUPLEX                                                            
//*-----------------------------------------------------------------            
//PRT03  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3H CP-3',END;                                      
1$DJDE$ JDE=13C26E,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3H                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* PRINTING OF SELLING PRICE FOR BP13C260                                      
//* COPIES=3, DUPLEX                                                            
//*-----------------------------------------------------------------            
//PRT04  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3I CP-3',END;                                      
1$DJDE$ JDE=13C26E,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3I                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* PRINTING OF SELLING PRICE FOR BP13C260                                      
//* COPIES=3, DUPLEX                                                            
//*-----------------------------------------------------------------            
//PRT05  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3G CP-3',END;                                      
1$DJDE$ JDE=13C26D,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3G                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* PRINTING OF SELLING PRICE FOR BP13C260                                      
//* COPIES=3, DUPLEX                                                            
//*-----------------------------------------------------------------            
//PRT06  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3J CP-3',END;                                      
1$DJDE$ JDE=13C26D,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3J                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//PRT07  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3K CP-3',END;                                      
1$DJDE$ JDE=13C26D,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3K                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//PRT08  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3L CP-3',END;                                      
1$DJDE$ JDE=13C26D,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3L                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//PRT09  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL3M CP-3',END;                                      
1$DJDE$ JDE=13C26D,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL3M                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*-----------------------------------------------------------------            
//STEP00 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'FT')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* TO SORT RECORDS IN ZONE/NT/FLAT-TYPE/ALLOC-DATE SEQUENCE                    
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&F800DEL,                                                   
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(50,25),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(559,2,A,546,3,A,544,2,A,291,8,A),FORMAT=CH                      
/*                                                                              
//*-----------------------------------------------------------------            
//* DELETE THE ACCUMULATED FLAT LIST FILE                                       
//*-----------------------------------------------------------------            
//STEP02 EXEC    PGM=BP13C228,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BM06F800 DD  DSN=&&F800DEL,                                                   
//             DISP=(SHR,DELETE)                                                
//BM6F800  DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=OLD                                                         
//BM6F800D DD  DUMMY                                                            
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//*   PROGRAM TO OUTPUT FILE FOR PRINTING APPENDIX B                            
//*   PROGRAM BP13C226 TO REPLACE BM06300A                                      
//*-----------------------------------------------------------------            
//STEP03 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06F110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13KQ30 DD  DSN=BP13.KQ30.PAIR,                                              
//             DISP=SHR                                                         
//BP13KQ31 DD  DSN=BP13.KQ30.PAIR.PATH1,                                        
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13F270 DD  DSN=BP13.F270.BP13A200,                                          
//             DISP=MOD                                                         
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C226) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* TO SORT RECORDS IN ZONE/NT/FLAT-TYPE/ALLOC-DATE SEQUENCE                    
//*-----------------------------------------------------------------            
//STEP04 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&BM6F800A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(559,2,A,546,3,A,544,2,A,540,2,A,15,4,A,                         
                 19,4,A,23,5,A,503,5,A,501,2,A),FORMAT=CH                       
//*-------------------------------------------------------------------          
//* TO DEFINE BP13K110                                                  00020004
//*-------------------------------------------------------------------          
//STEP4A   EXEC PGM=IDCAMS,COND=(0,NE)                                  00030000
//SYSPRINT DD SYSOUT=*                                                  00040000
//INPUT    DD DSN=BP13.BLANK.CHAR80,DISP=SHR                                    
//SYSIN    DD *                                                         00050000
  DEL 'BP13.K110.GROUNIT.FLATLIST' CLUSTER PURGE                                
  DEF CLUSTER                                 -                                 
      (NAME(BP13.K110.GROUNIT.FLATLIST)       -                                 
      TRK(10 5)                               -                                 
      STORCLAS(PRODRLS)                       -                                 
      LOG(NONE)                               -                                 
      UNIQUE                                  -                                 
      SHR(2 3))                               -                                 
      DATA                                    -                                 
      (NAME(BP13.K110.GROUNIT.FLATLIST.DATA)  -                                 
      KEYS(21 0)                              -                                 
      RECSZ(80 80)                            -                                 
      CISZ(4096)                              -                                 
      FSPC(10 10))                            -                                 
      INDEX                                   -                                 
      (NAME(BP13.K110.GROUNIT.FLATLIST.INDEX) -                                 
      CISZ(4096))                                                               
           IF LASTCC = 0  THEN                -                         00950000
              REPRO IFILE(INPUT)              -                         00960000
              ODS(BP13.K110.GROUNIT.FLATLIST)                           00720000
//*--------------------------------------------------------------------*00001300
//*  SORT BP13KQ50                                                      00001310
//*--------------------------------------------------------------------*00001320
//STEP4B EXEC    SORT,COND=(0,NE)                                       00001330
//SORTIN   DD  DSN=BP13.KQ50.GROUNIT,                                   00001340
//             DISP=SHR                                                 00001350
//SORTOUT  DD  DSN=&&BP13FQ50,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(TRK,(5,5),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                               
//SYSIN    DD  *                                                        00001410
    SORT FIELDS=(1,16,A,26,2,A),FORMAT=CH                                       
//*----------------------------------------------------------------     00001420
//*   TO CREATE BP13K110 FOR MGPS                                       00001430
//*----------------------------------------------------------------     00001440
//STEP4C EXEC    PGM=BP13C24I,COND=(0,NE)                               00001450
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                  00001460
//             DISP=SHR                                                 00001470
//BP13FQ50 DD  DSN=&&BP13FQ50,                                          00001480
//             DISP=(SHR,DELETE)                                        00001490
//BP13K110 DD  DSN=BP13.K110.GROUNIT.FLATLIST,                          00001500
//             DISP=SHR                                                 00001510
//SYSDBG   DD  SYSOUT=*                                                 00001640
//SYSDBOUT DD  SYSOUT=*                                                 00001650
//SYSOUT   DD  SYSOUT=*                                                 00001660
//*-----------------------------------------------------------------            
//* WRITE LIST OF SELLING PRICE                                                 
//*-----------------------------------------------------------------            
//STEP05 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BM06F800 DD  DSN=&&BM6F800A,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//BP13KQ50 DD  DSN=BP13.KQ50.GROUNIT,                                           
//             DISP=SHR                                                         
//BP13K110 DD  DSN=BP13.K110.GROUNIT.FLATLIST,                                  
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BM06K150 DD  DSN=BM06.K150.FLEXIPR,                                           
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BP13K260 DD  DSN=BP13.K260.BLOCK.DPP,                                         
//             DISP=SHR                                                         
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,                                          
//             DISP=SHR                                                         
//BB14K580 DD  DSN=BB14.K580.UNTLEASE,                                          
//             DISP=SHR                                                         
//BB14K990 DD  DSN=BB14.K990.REGLEASE,                                          
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,                                     
//             DISP=SHR                                                         
//BP13K277 DD  DSN=BP13.K277.OCSCOST,                                           
//             DISP=SHR                                                         
//BP13F999 DD  DSN=BP13.F999.BP13C224,                                          
//             DISP=OLD                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C224) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
// IF (STEP05.RC = 00) THEN                                             00000610
//*-----------------------------------------------------------------            
//* TO SORT RECORDS IN CONTRACTS SEQUENCE                                       
//*-----------------------------------------------------------------            
//STEP6B EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F999.BP13C224,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F999,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,BLKSIZE=0,LRECL=300)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,5,1,A,4,1,A,117,3,A,4,2,A,38,5,A,26,1,A,                  
                        45,5,A,43,2,A),FORMAT=CH                                
/*                                                                              
// ENDIF                                                                00002130
// IF (STEP05.RC = 22) THEN                                             00000610
//*-----------------------------------------------------------------            
//* TO SORT RECORDS IN CONTRACTS SEQUENCE                                       
//*-----------------------------------------------------------------            
//STEP6B EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F999.BP13C224,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F999,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,BLKSIZE=0,LRECL=300)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,117,3,A,38,5,A,26,1,A,                                    
                        45,5,A,43,2,A),FORMAT=CH                                
/*                                                                              
// ENDIF                                                                00002130
// IF (STEP05.RC = 99) THEN                                             00000610
//*-----------------------------------------------------------------            
//* TO SORT RECORDS IN CONTRACTS SEQUENCE                                       
//*-----------------------------------------------------------------            
//STEP6C EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F999.BP13C224,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F999,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,BLKSIZE=0,LRECL=300)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,5,1,A,4,1,A,117,3,A,4,2,A,38,5,A,26,1,A,                  
                        45,5,A,43,2,A),FORMAT=CH                                
/*                                                                              
// ENDIF                                                                00002130
// IF (STEP05.RC = 77) THEN                                             00000610
//*-----------------------------------------------------------------            
//* TO SORT RECORDS IN CONTRACTS SEQUENCE (FOR COMBINE SA)                      
//*-----------------------------------------------------------------            
//STEP6D EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.F999.BP13C224,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F999,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,BLKSIZE=0,LRECL=300)                               
//SYSIN    DD  *                                                                
      SORT FIELDS=(5,1,A,4,1,A,117,3,A,38,5,A,54,20,A,192,4,A,                  
                           45,5,A,43,2,A),FORMAT=CH                             
/*                                                                              
// ENDIF                                                                00002130
// IF (RC = 00 OR RC = 22 OR RC = 77 OR RC = 99) THEN                   00000610
//*-----------------------------------------------------------------            
//* PRINT LIST OF SELLING PRICE                                                 
//*-----------------------------------------------------------------            
//STEP07 EXEC    PGM=IKJEFT01,                                                  
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BP13F999 DD  DSN=&&BP13F999,                                                  
//             DISP=(OLD,PASS)                                                  
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//BM06K150 DD  DSN=BM06.K150.FLEXIPR,                                           
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13L26H DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT03.FORMID),DEST=IOMJ                                
//BP13L26I DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT04.FORMID),DEST=IOMJ                                
//BP13L26G DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT05.FORMID),DEST=IOMJ                                
//BP13L26J DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT06.FORMID),DEST=IOMJ                                
//BP13L26K DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT07.FORMID),DEST=IOMJ                                
//BP13L26L DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT08.FORMID),DEST=IOMJ                                
//BP13L26M DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT09.FORMID),DEST=IOMJ                                
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C260) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* PRINT LIST OF SELLING PRICE                                                 
//*-----------------------------------------------------------------            
//STEP7A EXEC    PGM=IKJEFT01,                                                  
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BP13F999 DD  DSN=&&BP13F999,                                                  
//             DISP=(OLD,DELETE)                                                
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//BM06K150 DD  DSN=BM06.K150.FLEXIPR,                                           
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13L26H DD  SYSOUT=8,DEST=IOM8                                               
//BP13L26I DD  SYSOUT=8,DEST=IOM8                                               
//BP13L26G DD  SYSOUT=8,DEST=IOM8                                               
//BP13L26J DD  SYSOUT=8,DEST=IOM8                                               
//BP13L26K DD  SYSOUT=8,DEST=IOM8                                               
//BP13L26L DD  SYSOUT=8,DEST=IOM8                                               
//BP13L26M DD  SYSOUT=8,DEST=IOM8                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C260) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//*   TO SORT FILE BY NT/FT                                                     
//*-----------------------------------------------------------------            
//STEP08 EXEC    SORT                                                           
//SORTIN   DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&BM06F80A,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(50,25),RLSE),                                        
//             DCB=*.SORTIN                                                     
//SYSIN    DD  *                                                                
      SORT FIELDS=(559,2,A,546,3,A,544,2,A,                                     
                   23,5,A,503,7,A,501,2,A),FORMAT=CH                            
      OMIT COND=(356,2,CH,EQ,C'3R')                                             
//*---------------------------------------------------------------------        
//*   TO PRINT FLATLIST BY NT/FT                                                
//*---------------------------------------------------------------------        
//STEP09 EXEC    PGM=IKJEFT01,                                                  
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BM06F800 DD  DSN=&&BM06F80A,                                                  
//             DISP=(OLD,DELETE)                                                
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//DJ02KL5A DD  DSN=DJ02.KL5A.LRA.BATCH.LOG,                                     
//             DISP=SHR                                                         
//DJ02KL50 DD  DSN=DJ02.KL50.LRA.BATCH.LOG,                                     
//             DISP=SHR                                                         
//P13L250  DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C250) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//*   TO SORT FILE BY NT/FT                                                     
//*-----------------------------------------------------------------            
//STEP14 EXEC    SORT                                                           
//SORTIN   DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&BM06F80B,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(50,25),RLSE),                                        
//             DCB=*.SORTIN                                                     
//SYSIN    DD  *                                                                
      SORT FIELDS=(620,2,A,544,2,A,559,2,A,546,3,A,                             
                   23,5,A,503,7,A,501,2,A),FORMAT=CH                            
      INCLUDE COND=(356,2,CH,EQ,C'3R')                                          
//*---------------------------------------------------------------------        
//*   TO PRINT FLATLIST BY NT/FT                                                
//*---------------------------------------------------------------------        
//STEP15 EXEC    PGM=IKJEFT01,                                                  
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BM06F800 DD  DSN=&&BM06F80B,                                                  
//             DISP=(OLD,DELETE)                                                
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//DJ02KL5A DD  DSN=DJ02.KL5A.LRA.BATCH.LOG,                                     
//             DISP=SHR                                                         
//DJ02KL50 DD  DSN=DJ02.KL50.LRA.BATCH.LOG,                                     
//             DISP=SHR                                                         
//P13L257  DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT02.FORMID),DEST=IOMJ                                
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C257) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* ACCUMULATE THE FLATLIST FILE FOR INTV                                       
//* INCLUDE ONLY INTV TAG = 'Y'                                                 
//*-----------------------------------------------------------------            
//STEP16 EXEC    SORT                                                           
//SORTIN   DD  DSN=&&BM6F800A,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* ACCUM CONTROL REC                                                           
//*-----------------------------------------------------------------            
//STEP17 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT THE CONTROL REC FOR UPDATE OF DPD                                  
//*-----------------------------------------------------------------            
//STEP18 EXEC    SORT                                                           
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F205.DPD,                                               
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'FT',AND,65,1,CH,EQ,C'Y')                          
/*                                                                              
//*-----------------------------------------------------------------            
//* PRT REPORT IN AVERAGE SELLING PRICE FOR 3RM/4A FLAT FOR ZONE=3R             
//*-----------------------------------------------------------------            
//STEP19 EXEC    SAS,                                                           
//             OPTIONS='MACRO'                                                  
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                            
//             DISP=SHR                                                         
//FT12F001 DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S210),                                    
//             DISP=SHR                                                         
/*                                                                              
// ENDIF                                                                        
//*-----------------------------------------------------------------            
//* TO ADD RECORD TO BM06K810 - FLAT OFFER ACCUM FILE                           
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=BP13C10B                                                    
//BM06K810 DD DSN=BM06.K810.UNITOFFR,DISP=SHR                                   
//BM06F800 DD DSN=&&BM6F800A,DISP=(SHR,PASS)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* END OF BP13A200                                                             
//*=================================================================            
