//BP13D301 JOB (BP13P),'BP13D301',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//      NOTIFY=CSD0071                                                  00020000
//*=================================================================*           
//*                                                                 *           
//*                  S O C A       J O B                            *           
//*                  -------------------                            *           
//*                                                                 *           
//*  PURPOSE : BACKUP DAILY AGREEMENT ORDER AND TRANSACTION FILE.   *           
//*                                                                 *           
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP130696  16/08/1999  CLT1 CHANGE BP13C412 DUE TO E-STAMPING    *           
//* BP130778  15/12/1999  LSB1 MOVE BP13C412 TO BP13D200            *           
//* BP132698  18/05/2005  CLT1 VERIFY AG07K962                      *           
//* BP136183  06/06/2016  KSJ3 TO ADD RUN OF BP13C3A5 (STEP01A/B)   *           
//* BP137196  20/04/2018  LSB1 ADD DD RUN OF BP13C3A5 (STEP01A/B)   *           
//* BP138079  19/12/2019  LJL1 TO CATER FOR SERS CONTRA AT SA       *           
//*=================================================================*           
//*-----------------------------------------------------------------            
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*-----------------------------------------------------------------            
//*     VERIFY BEFORE SALES AGREEMENT CASES                                     
//*-----------------------------------------------------------------            
//STEP1A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=AG07.K962.GRPVRNO,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------            
//*   SORT THE DAILY AGREEMENT ORDER FILE TO THE ACCUM AGRORDER FILE            
//*   OMIT DUMMY RECORDS FROM AGREEMENT ORDER FILE                              
//*-----------------------------------------------------------------            
//STEP01 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.K300.AGRORDER,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F300.AGRORDER.ACCUM,DISP=MOD                             
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   OMIT COND=(1,8,CH,EQ,C'        ')                                            
//*-----------------------------------------------------------------            
//* SORT AGREEMENT ORDER FILE TO INCLUDE SERS CASES ONLY  AND SA                
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K300.AGRORDER,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F300,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,SPACE=(TRK,(30,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,CH,A)                                                        
  INCLUDE COND=((28,3,CH,EQ,C'HSP'),AND,                                        
                (679,2,CH,EQ,C'SA'),AND,                                        
                (1474,8,CH,NE,C'        ',AND,                                  
                 1474,8,CH,NE,C'00000000',AND,                                  
                 1474,8,BI,NE,X'00'),AND,                                       
                (1494,8,CH,EQ,C'        ',OR,                                   
                 1494,8,CH,EQ,C'00000000',OR,                                   
                 1494,8,BI,EQ,X'00'))                                           
//*                                                                             
//*-----------------------------------------------------------------            
//* SET SEND DATE TO CURRENT DATE FOR EXTRACTED SERS CASES                      
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13C3A5,COND=(0,NE)                                        
//BP13F300 DD DSN=&&BP13F300,DISP=(OLD,DELETE)                                  
//BP13K300 DD DSN=BP13.K300.AGRORDER,DISP=SHR                                   
//BP13F30A DD DSN=BP13.F300.SUCCESS.SERS,DISP=MOD                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*     INCLUDE BEFORE SALES AGREEMENT CASES                                    
//*-----------------------------------------------------------------            
//STEP04 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD DSN=BP13.K300.AGRORDER,DISP=SHR                                    
//SORTOUT DD DSN=BP13.F300.KIVAGR,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
      SORT FIELDS=(1,8,A),FORMAT=CH,SIZE=E30000                                 
      INCLUDE COND=(679,2,CH,EQ,C'BA')                                          
//*-----------------------------------------------------------------            
//*   SORT THE TRANS FILE TO THE ACCUM TRANS FILE                               
//*-----------------------------------------------------------------            
//STEP05 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=BP13.F310.TRANS.ACCUM,DISP=MOD                                
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*-------------------------------------------------------------------*         
//*  BACKUP FILES BP13K20A                                                      
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K20A.SAPORTAL,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F20A.SAPORTAL.BACKUP(+1),DISP=(NEW,CATLG),               
//            SPACE=(CYL,(180,50)),                                             
//            DCB=(BP13.GDG,BLKSIZE=27800,LRECL=200,RECFM=FB)                   
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* JOB TO CREATE CASES WHICH HAVE ACCEPTED FLATS INTO BP13K20A.                
//* BP13K20A USED BY SOC PORTAL - SOCA MODULE                                   
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F310,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                               
//            SPACE=(CYL,(40,60),RLSE)                                          
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,10,A),FORMAT=CH                                             
     INCLUDE COND=(9,2,CH,EQ,C'AI',OR,                                          
                   9,2,CH,EQ,C'AS')                                             
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=BP13CB11,COND=(0,NE)                                        
//BP13F310 DD DSN=&&BP13F310,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K20A DD DSN=BP13.K20A.SAPORTAL,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*=================================================================            
//* KIV DELETE BP13K20A FOR KYE-ISSED/CANCEL CASES                              
//*-----------------------------------------------------------------            
//* DELETE KEY-ISSUED CASES                                                     
//*-----------------------------------------------------------------            
//*STEP09   EXEC SORT,CYL=30,COND=(0,NE)                                        
//*SORTIN   DD DSN=BP13.K400.SALEORD,DISP=SHR,                                  
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*SORTOUT  DD DSN=&&F310CAN,DISP=(MOD,PASS),                                   
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400),                          
//*            SPACE=(CYL,(40,60),RLSE)                                         
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(1,8,A),FORMAT=CH                                              
//*  OUTREC FIELDS=(1,8,C'DE',140X)                                             
//*-----------------------------------------------------------------            
//* DELETE CANCELLED RECORD FOUND IN BP13K20A                                   
//*-----------------------------------------------------------------            
//*STEP10   EXEC PGM=BP13CB11,COND=(0,NE)                                       
//*BP13F310 DD DSN=&&F310CAN,DISP=(OLD,PASS)                                    
//*BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                            
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K20A DD DSN=BP13.K20A.SAPORTAL,DISP=SHR,                                 
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
