//BP13D22E JOB (BP13P),'BP13D22E',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB01423
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-------------------------------------------------------------------*         
//*- FIRST JOB FT2T                                                             
//*- DETERMINE FT2T HARDLUCK BP13D22E - BP13D22H                                
//*- BP13CY92 - COMPUTE COUNT                                                   
//*-------------------------------------------------------------------*         
//*=================================================================            
//*-CHG-NO   BY   ON    DESCRIPTION                                             
//*------------------------------------                                         
//*-BP134205 LSB 110555 ADD BP13K813 FOR BP13CB91                               
//*-BP134247 LSB 110610 ADD PPOS/EC CHECK,CY82 CHK MATURE-TAG                   
//*-BP134255 LSB 110615 CHG BP13CY64 TO BP13CY82 BYPASS MATURE EST              
//*-BP134255 LSB 110711 CHG BP13CB71, DELETE CB90, ICNLUDE REQUEST-S            
//*                     IN BP13CB91, ADD FN/NE/HARDLUCK COUNT                   
//*                     BP13CY89,BYAPSS STATUS=S, BTO COUNT>00                  
//*-BP135002 LSB 120813 BYPASS FTS SINGLE SCHEME FROM K595                      
//*-BP135237 LSB 290214 STP02 F595.BP13D220 INSTEAD OF K595.BALLOT.LOG          
//*-------------------------------------------------------------------*         
//* 1) DETERMINE APPLICATION WITH COMBINATION OF FIRST TIMER AND                
//* SECOND TIMER, HUSBAND + SPOUSE OR FS CASES                                  
//* 2) >= 6 UNSUCC ATTEMPTS                                                     
//*-------------------------------------------------------------------*         
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y1                                  
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K20H.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YJ')                                               
//*---------------------------------------------------------------------        
//* SORTIN SBF FROM BP13.F595.BP13D220 INSTEAD OF                               
//*                 BP13.K595.BALLOT.LOG                                        
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.BP13D220,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F595,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,3),SPACE=(CYL,(350,100),RLSE),                        
//            DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A,334,6,D,261,8,D),FORMAT=CH                                
  INCLUDE COND=(376,3,CH,EQ,C'SBF')                                             
//*------------------------------------------------------------------           
//* FILE CREATED IN BP13AY0H                                                    
//*------------------------------------------------------------------           
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.AY0H.CY45BF,DISP=SHR                                
//SORTOUT DD DSN=&&F595HH,DISP=(,PASS),                                         
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A,334,6,D,261,8,D),FORMAT=CH                               
//*------------------------------------------------------------------           
//* DROP IF FOUND LAST CASE AS SBF INVITED CASES                                
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13CY46,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595HH,DISP=(OLD,PASS)                                      
//BP13F740 DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=BP13.F595.AY0J.CY46,DISP=OLD                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT BY DTE-BALLOT, DTE-REQUEST                                             
//* BYPASS 1A FLAT                                                              
//*------------------------------------------------------------------           
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.AY0J.CY46,DISP=SHR                                   
//SORTOUT DD DSN=&&F595NRIC,DISP=(,PASS),                                       
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                               
   OMIT COND=(211,2,CH,EQ,C'1A',OR,                                             
              211,2,CH,EQ,C'SP')                                                
//*-------------------------------------------------------------------*         
//* COUNT NO OF ATTEMPT, COMPUTE BOOK/NOT-BOOK                                  
//* SYSTEM TO STOP COUNTING ONCE FOUND BOOK/INVITED(FN)                         
//* 467- BTO COUNT                                                              
//* 485- FN COUNT                                                               
//* 487- REQUEST-STATUS = S                                                     
//* 490- AFTER QUEUE, BTO COUNT                                                 
//* 492- BUY-STATUS                                                             
//* 493- ALLOC-TAG                                                              
//* 495- NE COUNT                                                               
//* 497- BK COUNT                                                               
//* 499- HARDLUCK COUNT                                                         
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=BP13CY92,COND=(0,NE)                                        
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13F595 DD DSN=&&F595NRIC,DISP=(OLD,PASS)                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=BP13.F595.CB71.AY0J,DISP=OLD,                                 
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT NRIC1                                                              
//* ONLY TAKE IN 469 = N CASES TO CHECK SBF/BE WITH BOOK-STATUS                 
//*------------------------------------------------------------------           
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.CB71.AY0J,DISP=SHR                                   
//SORTOUT DD DSN=BP13.F595.AY0J,DISP=OLD                                        
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
   INCLUDE COND=(469,1,CH,EQ,C'N')                                              
