//BP13A21A JOB (BP13P),'BP13A21A',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM      LINECT=0                                                         
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR PRINTING OF APPOINTMENT LETTERS AND APPENDIX C FOR          
//* MATURE NEW TOWNS ONLY (BOOKING EXERCISE ON NEW TOWN BASIS).                 
//*********************************************************************         
//* BP134838 16042013 ESA1 CATER FOR REN INVITATION LETTERS                     
//* BP136275 14072016 ESA1 ADD READING OF BP13K820 IN BP13C230                  
//* BP136642 06022017 SMR2 CATER FOR SYSOUT=8,DEST=IOM8                         
//*=================================================================            
//* SORT THE CONTROL REC FOR THIS OPTION                                        
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'PA',AND,60,3,CH,EQ,C'REN')                        
/*                                                                              
//*-----------------------------------------------------------------            
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//* PRT01 :   2 COPY  DUPLEX                  : ALLOCATION SECTION              
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL2A CP-1',END;                                      
1$DJDE$ JDE=13C24X,COPIES=1,DUPLEX=NO,JDL=BP13,END;                             
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL2A                                     
//SYSUT2   DD  SYSOUT=J,                                                        
//             OUTPUT=(*.FORMID),DEST=IOMJ                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//* PRT02 :   2 COPY  DUPLEX                  : ALLOCATION SECTION              
//*-----------------------------------------------------------------            
//PRT02  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL2B CP-1',END;                                      
1$DJDE$ JDE=13C24X,COPIES=1,DUPLEX=NO,JDL=BP13,END;                             
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL2B                                     
//SYSUT2   DD  SYSOUT=J,                                                        
//             OUTPUT=(*.FORMID),DEST=IOMJ                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//* PRT03 :   1 COPY  SIMPLEX                 : ALLOCATION SECTION              
//*-----------------------------------------------------------------            
//PRT03  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=J,                                                        
//             OUTPUT=(*.FORMID),DEST=IOMJ                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//PRT04  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1B CP-1',END;                                      
1$DJDE$ JDE=13C24S,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1B                                     
//SYSUT2   DD  SYSOUT=J,                                                        
//             OUTPUT=(*.FORMID),DEST=IOMJ                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//* PRT05 :   1 COPY  SIMPLEX                 : ALLOCATION SECTION              
//*-----------------------------------------------------------------            
//PRT05  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1C CP-1',END;                                      
1$DJDE$ JDE=13C230,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL1C                                     
//SYSUT2   DD  SYSOUT=J,                                                        
//             OUTPUT=(*.FORMID),DEST=IOMJ                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT F200 BY ADTE/NT/FT/DTE-APPT/TIME/REGN                                  
//*-----------------------------------------------------------------            
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,5,A,50,6,A,14,8,A),FORMAT=CH                                  
/*                                                                              
//*--------------------------------------------------------------------*00000460
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE      00000470
//* CANCELLATION RECORDS.                                               00000480
//*--------------------------------------------------------------------*00000490
//STEP03 EXEC    PGM=BP13C240,COND=(0,NE)                               00000500
//BP13F200 DD  DSN=&&P13F200A,                                          00000510
//             DISP=(SHR,PASS)                                          00000520
//BP13F205 DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=SHR                                                 00000540
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000550
//             DISP=SHR                                                 00000560
//P13F200O DD  DSN=&&P13F200B,                                          00000570
//             DISP=(NEW,PASS),                                         00000580
//             UNIT=SYSDA,                                              00000590
//             SPACE=(CYL,(10,5),RLSE),                                 00000600
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00000610
//P13F240O DD  SYSOUT=J,                                                00000620
//             OUTPUT=(*.PRT03.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                 00000640
//SYSDBOUT DD  SYSOUT=*                                                 00000650
//SYSOUT   DD  SYSOUT=*                                                 00000660
/*                                                                      00000680
//*--------------------------------------------------------------------*        
//* CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE                 
//* CASES WITH SHORTLIST-QTR NOT THE SAME AS BALLOT-QTR.                        
//*--------------------------------------------------------------------*        
//STEP04 EXEC    PGM=BP13C273,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F205 DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L273 DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT03.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* CHECK SOC MASTER FILE FOR CASES ALREADY ACCEPTED A FLAT.                    
//*--------------------------------------------------------------------*        
//STEP05 EXEC    PGM=BP13C285,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200C,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F205 DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L285 DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT03.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//*   CLEAR BP13.L245A.BP13A212                                                 
//*--------------------------------------------------------------------------   
//STEP5A  EXEC   PGM=IEBGENER,COND=(0,NE)                               00000060
//SYSPRINT DD  SYSOUT=*                                                 00000070
//SYSUT1   DD  DSN=NULLFILE,                                            00000080
//             RECFM=FBA,LRECL=133,                                     00000090
//             BLKSIZE=0                                                00000100
//SYSUT2   DD  DSN=BP13.L245A.BP13A212,                                 00000110
//             DISP=SHR                                                 00000120
//SYSIN    DD  DUMMY                                                    00000170
//*--------------------------------------------------------------------*        
//* CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE                 
//* CASES WITH DIFFERENT ZONE/NT/FT.                                            
//*--------------------------------------------------------------------*        
//STEP06 EXEC    PGM=BP13C27A,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200D,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F205 DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200E,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L27A DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT03.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT F200 BY ADTE/NT/FT/DTE-APPT/TIME/REGN                                  
//*---------------------------------------------------------------------        
//STEP07 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F200E,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F200F,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,13,A,38,12,A,57,5,A),FORMAT=CH                                
/*                                                                              
//*--------------------------------------------------------------------         
//* PRINT INVITATION LETTER FOR SELECTION                                       
//*--------------------------------------------------------------------         
//STEP08 EXEC    PGM=BP13C245,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=SHR                                                         
//BP13F200 DD  DSN=&&P13F200F,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K278 DD  DSN=BP13.K278.OCSBLK,                                            
//             DISP=SHR                                                         
//BP13K555 DD  DSN=BP13.K555.APPLOIC,                                           
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP17K000 DD  DSN=BP17.K000.SCHREF,                                            
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP17K001 DD  DSN=BP17.K000.SCHREF.PATH1,                                      
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP17K580 DD  DSN=BP17.K580.REGAAPRV,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//P13L245A DD  DSN=BP13.L245A.BP13A212,                                         
//             DISP=MOD                                                         
//P13L245B DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT03.FORMID),DEST=IOMJ                                
//P13L245D DD  SYSOUT=8,DEST=IOM8                                               
//BP13L299 DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT04.FORMID),DEST=IOMJ                                
//P13F245A DD  DSN=&&P13F245A,                                          00000570
//             DISP=(NEW,PASS),                                         00000580
//             UNIT=SYSDA,                                              00000590
//             SPACE=(CYL,(10,5),RLSE),                                 00000600
//             DCB=(BLKSIZE=0,LRECL=70,RECFM=FB)                        00000610
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//*   SEND REPORT IN HARCOPY AND CD-ROM                                         
//*--------------------------------------------------------------------         
//STEP8A   EXEC PGM=ICETOOL                                                     
//INPUT1   DD DSN=BP13.L245A.BP13A212,DISP=SHR                                  
//OUTPUT1  DD SYSOUT=J,OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                        
//OUTPUT2  DD SYSOUT=8,DEST=IOM8                                                
//TOOLMSG DD SYSOUT=*                                                           
//DFSMSG  DD SYSOUT=*                                                           
//TOOLIN  DD *                                                                  
  COPY FROM(INPUT1) TO(OUTPUT1)                                                 
  COPY FROM(INPUT1) TO(OUTPUT2)                                                 
//*---------------------------------------------------------------------        
//* PRINT THE APPENDIX B FOR THE SELECTION                                      
//*---------------------------------------------------------------------        
//STEP09 EXEC    PGM=BP13C230,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13F200 DD  DSN=&&P13F200F,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K246 DD  DSN=BP13.K246.SBF.LOOKUP,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13L230 DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT05.FORMID),DEST=IOMJ                                
//BP13L23A DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT05.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//* PRINT ATTENDANCE LIST                                                       
//*--------------------------------------------------------------------         
//STEP10 EXEC    PGM=BP13C231,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=SHR                                                         
//BP13F200 DD  DSN=&&P13F200F,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K76D DD  DSN=BP13.K76D.BALLOT.BLOCKLST,                                   
//             DISP=SHR,                                                00002190
//             AMP=('BUFNI=8','BUFND=4')                                00002200
//BP13K246 DD  DSN=BP13.K246.SBF.LOOKUP,                                        
//             DISP=SHR,                                                00002190
//             AMP=('BUFNI=8','BUFND=4')                                00002200
//BP13L231 DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT05.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*--------------------------------------------------------------------         
//STEP11 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A21A                                                                
//*---------------------------------------------------------------------        
