//BP13AY0A JOB (BP13P),'BP13AY0A',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* FOR FIRST TIMER                                                             
//* REPORT ON HARDLUCK/UNSUCC ATTEMPT COUNT AFTER BOOKING EXERCISE              
//*=================================================================            
//*------------------------------------------------------------------           
//* CHG-NO   BY  ON                                                             
//*-----------------------------                                                
//* BP135920 LSB 14092015 - NEW JCL                                             
//* BP136467 LSB 10022017 - NEW JCL                                             
//* BP138080 SMP 06112019 - INCLUDE BP13K813 IN BP13CB70 TO CATER FOR           
//*                         'HL' BOOK STATUS                                    
//*=================================================================            
//*------------------------------------------------------------------           
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = YL                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&F205LT,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   OUTREC FIELDS=(C'LT',3,78)                                                   
   INCLUDE COND=(14,2,CH,EQ,C'YA')                                              
//*-----------------------------------------------------------------            
//* BYPASS STUDIO APARTMENT (SA), SINGLE SCHEME                                 
//*------------------------------------------------------------------           
//STEP02   EXEC SORT,COND=(0,NE)                                                
//*SORTIN  DD DSN=BP13.F595.AY0H.CY46,DISP=SHR                                  
//SORTIN  DD DSN=BP13.F595.BP13D220,DISP=SHR                                    
//SORTOUT DD DSN=&&F595PA,DISP=(,PASS),                                         
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                               
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                               
   OMIT COND=(211,2,CH,EQ,C'1A',OR,                                             
              211,2,CH,EQ,C'SP',OR,                                             
              213,3,CH,EQ,C'FTS',OR,                                            
              213,3,CH,EQ,C'STS')                                               
//*------------------------------------------------------------------           
//* TO GET ALL CASES THAT ARE < F205-DTE-END                                    
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13CY9H,COND=(0,NE)                                        
//BP13F205 DD DSN=&&F205LT,DISP=(OLD,PASS)                                      
//BP13F595 DD DSN=&&F595PA,DISP=(OLD,PASS)                                      
//P13F595A DD DSN=&&F595EQ,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                               
//        SPACE=(CYL,(250,50),RLSE)                                             
//P13F595B DD DSN=&&F595LT,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                               
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* DEPEND ON THE NEED TO HAVE CUT-OFF-DATE                                     
//*------------------------------------------------------------------           
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=&&F595LT,DISP=(OLD,PASS)                                       
//SORTOUT DD DSN=&&F595PB,DISP=(,PASS),                                         
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                               
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN   DD  *                                                                 
      SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                            
//*------------------------------------------------------------------           
//* COMPUTE HARDLUCK AND COUNT UNUSCC COUNT                                     
//* PROGRAM DIFF FROM BP13CY92 IS DEDUCT MATURE EST/NE COUNT                    
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13CY9F,COND=(0,NE)                                        
//BP13F205 DD DSN=&&F205LT,DISP=(OLD,PASS)                                      
//BP13F595 DD DSN=&&F595PB,DISP=(OLD,PASS)                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=BP13.F595.AY0A.CB71,DISP=OLD,                                 
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(250,50),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = YL                                  
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&F205EQ,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  OUTREC FIELDS=(C'EQ',3,78)                                                    
   INCLUDE COND=(14,2,CH,EQ,C'YA')                                              
//*------------------------------------------------------------------           
//* SORT OUT DTE-BALLOT = 201502                                                
//*------------------------------------------------------------------           
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                 
//        AMP=('BUFND=4','BUFNI=8')                                             
//SORTOUT DD DSN=&&F595CY9H,DISP=(,PASS),                                       
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                               
//        SPACE=(CYL,(250,80),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
   INCLUDE COND=(1,1,CH,NE,C' ',AND,                                            
                 376,3,CH,EQ,C'BTO')                                            
//*------------------------------------------------------------------           
//* TO GET ALL CASES THAT ARE EQUAL TO F205-DTE-END                             
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=BP13CY9H,COND=(0,NE)                                        
//BP13F205 DD DSN=&&F205EQ,DISP=(OLD,PASS)                                      
//BP13F595 DD DSN=&&F595CY9H,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=&&F595EQ2,DISP=(,PASS),                                       
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(250,50),RLSE)                                            
//P13F595B DD DSN=&&F595LT2,DISP=(,PASS),                                       
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(250,50),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* INCLUDE COULD NOT BOOK CASES                                                
//*------------------------------------------------------------------           
//STEP8A   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=&&F595EQ2,DISP=(OLD,PASS)                                      
//SORTOUT DD DSN=&&F595NC,DISP=(,PASS),                                         
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                               
//        SPACE=(CYL,(250,80),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
   INCLUDE COND=(290,2,CH,EQ,C'NC',OR,                                          
                 290,2,CH,EQ,C'NF',OR,                                          
                 290,2,CH,EQ,C'SC',OR,                                          
                 290,2,CH,EQ,C'SF',OR,                                          
                 290,2,CH,EQ,C'NS')                                             
//*------------------------------------------------------------------           
//* OMIT COULD NOT BOOK CASES                                                   
//*------------------------------------------------------------------           
//STEP8B   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=&&F595EQ2,DISP=(OLD,PASS)                                      
//SORTOUT DD DSN=&&F595CB70,DISP=(,PASS),                                       
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                               
//        SPACE=(CYL,(250,80),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
   OMIT COND=(290,2,CH,EQ,C'NC',OR,                                             
              290,2,CH,EQ,C'NF',OR,                                             
              290,2,CH,EQ,C'SC',OR,                                             
              290,2,CH,EQ,C'SF',OR,                                             
              290,2,CH,EQ,C'NS')                                                
//*------------------------------------------------------------------           
//* GET ALLOC-TAG FROM BP13F800                                                 
//* NOTE : BOOK STATUS = 'HL' IS DETERMINED INSIDE BP13CB70                     
//*        MUST BE NME BTO, BLANK BOOK STATUS, REQ-STAT = W/R/P/K ONLY          
//*------------------------------------------------------------------           
//STEP09   EXEC PGM=BP13CB70,COND=(0,NE)                                        
//BP13F800 DD DSN=BP13.F800.BP13D220,DISP=SHR                           00120000
//BP13F595 DD DSN=&&F595CB70,DISP=(OLD,PASS)                            00120000
//BP13F205 DD DSN=&&F205EQ,DISP=(OLD,PASS)                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F595A DD DSN=&&F595TAG,DISP=(,PASS),                               00120000
//         UNIT=(SYSDA,3),                                                      
//         SPACE=(CYL,(250,50),RLSE),                                           
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=&&F595TAG,DISP=(OLD,PASS)                                      
//        DD DSN=&&F595NC,DISP=(OLD,PASS)                                       
//SORTOUT DD DSN=&&F595LOG,DISP=(,PASS),                                        
//           UNIT=(SYSDA,3),                                                    
//           SPACE=(CYL,(250,50),RLSE),                                         
//           DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.AY0A.CB71,DISP=SHR                                   
//SORTOUT DD DSN=&&BP13F730,DISP=(,PASS),                                       
//           UNIT=(SYSDA,3),                                                    
//           SPACE=(CYL,(180,20),RLSE),                                         
//           DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
   INCLUDE COND=(469,1,CH,NE,C'Y',AND,                                          
                 467,2,CH,GE,C'01',AND,                                         
                 487,2,CH,EQ,C'00')                                             
//*---------------------------------------------------------------------        
//* PUT UNSUCC HARDLUCK COUNT IN COL 467                                        
//* PUT BOOK-STATUS TO COL 493                                                  
//* DECODE NT FRO REPORTING BP13L833                                            
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13CY9G,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595LOG,DISP=(OLD,PASS)                             00120000
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                            00120000
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=BP13.F595.AY0A,DISP=OLD,                              00120000
//            UNIT=(SYSDA,3),                                                   
//            SPACE=(CYL,(150,25),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT BY REGN-NO, DTE-BALLOT                                                 
//*------------------------------------------------------------------           
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.AY0A,DISP=SHR                                       
//SORTOUT  DD DSN=BP13.F595.AY0A.NOTBK,DISP=SHR,                                
//         UNIT=SYSDA,                                                          
//         SPACE=(CYL,(100,50),RLSE),                                           
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A,334,6,A),FORMAT=CH                                        
   OMIT COND=((213,3,CH,EQ,C'SAP'),AND,                                         
              (248,3,CH,EQ,C'SSC',OR,                                           
               248,3,CH,EQ,C'JSS',OR,                                           
               248,3,CH,EQ,C'NCS'))                                             
//*------------------------------------------------------------------           
//* BYPASS SECOND TIMER, N-TIMER                                                
//*------------------------------------------------------------------           
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.AY0A.NOTBK,DISP=SHR                                  
//SORTOUT  DD DSN=&&F595ST15,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(150,50),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A,334,6,A),FORMAT=CH                                        
   OMIT COND=(461,1,CH,EQ,C'G',OR,                                              
              209,1,CH,EQ,C'Y')                                                 
//*------------------------------------------------------------------           
//* REPORT ON HARDLUCK                                                          
//*------------------------------------------------------------------           
//STEP16   EXEC  SAS,OPTIONS='MACRO,DQUOTE'                                     
//BP13F595 DD DSN=&&F595ST15,DISP=(OLD,PASS)                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LHLK DD DSN=BP13.L833.FTALL,DISP=OLD                                      
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S833),DISP=SHR                             
