//BP13A230 JOB (BP13P),'USER:BP13',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//******************************************************************            
//* CHG-NO    BY   ON        DESCRIPTION                                        
//* ----------------------------------                                          
//* BP132278  JF4  28/03/03  CHGE BP13F230/F240 LRECL TO 450.                   
//* BP133896  ESA1 07/05/10  TO EXPAND SIZE OF BACK-UP DATA                     
//* BP135171  RJE1 10/02/14  TO CATER FOR DB2 UPGRADE                           
//* BP135281  ESA1 30/05/14  TO REPLACE BP13K816 WITH BP13K813                  
//* BP13XXXX  EL27 03/08/16  FIX BM06F800 TEMP SIZE                             
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//*-----------------------------------------------------------------            
//* STEP00          - TO VERIFY THAT FILES ARE CLOSED.                          
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*-----------------------------------------------------------------            
//STEP00 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=OLD                                                         
//INPUT3   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 17 - SUBMISSION(NO CANCELLATION)                        
//*--------------------------------------------------------------------         
//STEP0A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.INSUREC,DISP=OLD                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'DS')                                              
//*-----------------------------------------------------------------            
//*  TO BACKUP FILES BEFORE UPDATE                                              
//*-----------------------------------------------------------------            
//STEP1A EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F200.BKAPPMT.BACKUP(+1),                                
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=300,RECFM=FB)                  
//INPUT2   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.F210.BKWKPLAN.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                  
//INPUT3   DD  DSN=BM06.L720A1.SUBMISS,                                         
//             DISP=SHR                                                         
//OUTPUT3  DD  DSN=BM06.L720A1.SUBMISS.BACKUP,                                  
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
     REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* STEP01          - TO CHECK THAT EACH NT/ZONE AND FT SUBMITTED IS            
//*                   OVER THE BOOKING PERIOD.                                  
//*---------------------------------------------------------------------        
//* TO CHK THAT EACH ZONE/NT AND FT SUBMITTED IS OVER THE BOOKING PERIOD        
//*---------------------------------------------------------------------        
//STEP01 EXEC    PGM=BP13C254,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.INSUREC,                                           
//             DISP=SHR                                                         
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR                                                         
//P13F205A DD  DSN=&&P13F205A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(LRECL=80,RECFM=FB),                                         
//             DSORG=PS                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* STEP02 - STEP04 - TO PRINT SELECTION/SUBMISSION REPORT FOR                  
//*                   NON-MATURE NEW TOWNS (BOOKING EXERCISE ON ZONE            
//*                   BASIS).                                                   
//* TO SORT OUT F205 RECORDS FOR ZONE                                           
//*---------------------------------------------------------------------        
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F205B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(LRECL=80,RECFM=FB),                                         
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(30,1,CH,EQ,C'Z')                                                
/*                                                                              
//*---------------------------------------------------------------------        
//* TO SORT FILE ACCORDING TO QUEUE POSITION                                    
//*---------------------------------------------------------------------        
//STEP03 EXEC    SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(30,30),RLSE),                                        
//             DCB=(LRECL=300,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,13,A,57,5,A),FORMAT=CH                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*   -- TO PRINT ANNEXURE A                                                    
//*   -- THE SUBMISSION REPORT IS DOWNLOADED TO PC, SO THAT USER                
//*      CAN KEY IN THE REMARKS.                                                
//*---------------------------------------------------------------------        
//STEP04 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=&&P13F205B,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,DELETE)                                                
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH1,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13L232A DD  DSN=BM06.L720A1.SUBMISS,                                         
//             DISP=OLD                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C232) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* STEP05 - STEP07 - TO PRINT SELECTION/SUBMISSION REPORT FOR                  
//*                   MATURE NEW TOWNS (BOOKING EXERCISE ON NEW                 
//*                   TOWN BASIS).                                              
//*---------------------------------------------------------------------        
//* TO SORT OUT F205 RECORDS FOR NEW TOWN                                       
//*---------------------------------------------------------------------        
//STEP05 EXEC    SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F205C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(LRECL=80,RECFM=FB),                                         
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(30,1,CH,EQ,C'T')                                                
/*                                                                              
//*---------------------------------------------------------------------        
//* TO SORT FILE ACCORDING TO REGISTRATION NUMBER                               
//*---------------------------------------------------------------------        
//STEP06 EXEC    SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(30,30),RLSE),                                        
//             DCB=(LRECL=300,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,21,A),FORMAT=CH                                                
/*                                                                              
//*---------------------------------------------------------------------        
//*   -- TO PRINT ANNEXURE A                                                    
//*   -- THE SUBMISSION REPORT IS DOWNLOADED TO PC, SO THAT USER                
//*      CAN KEY IN THE REMARKS.                                                
//*---------------------------------------------------------------------        
//STEP07 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=&&P13F205C,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,DELETE)                                                
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH1,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13L232A DD  DSN=BM06.L720A1.SUBMISS,                                         
//             DISP=MOD                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C232) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F222.BP13A230                                        
//*--------------------------------------------------------------------         
//STEP8A  EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F222.BP13A230,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(1,1)),                                               
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* STEP8           - TO DELETE CORRESPONDING BP13K200, BP13K210 &              
//*                   BP13K222 RECORDS.                                         
//*---------------------------------------------------------------------        
//*   TO DELETE ALLOCATION AT THE TIME OF SUBMISSION                            
//*---------------------------------------------------------------------        
//STEP8  EXEC    PGM=BP13C244,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K200 DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13KP00 DD  DSN=BP13.KP00.DOC,                                               
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13KQ00 DD  DSN=BP13.KQ00.REGN.APPT,                                         
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13F222 DD  DSN=BP13.F222.BP13A230,                                          
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* STEP9 - STEP10 - TO DELETE BM06F800 RECORDS.                                
//*---------------------------------------------------------------------        
//* TO SORT RECORDS IN ZONE/NT/FLAT-TYPE/ALLOC-DATE SEQUENCE                    
//*--------------------------------------------------------------------         
//STEP9  EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F800,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(559,2,A,546,3,A,544,2,A,291,8,A),FORMAT=CH                      
/*                                                                              
//*---------------------------------------------------------------------        
//* DELETE THE ACCUMULATED FLAT LIST FILE                                       
//*---------------------------------------------------------------------        
//STEP10 EXEC    PGM=BP13C228,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//BM6F800  DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=OLD                                                         
//BM6F800D DD  DSN=BM06.F800.ALLOUNIT.SUBMISS,                                  
//             DISP=OLD                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F230.BP13A230                                        
//*--------------------------------------------------------------------         
//STEP11A EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F230.BP13A230,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F240.BP13A230                                        
//*--------------------------------------------------------------------         
//STEP11B EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F240.BP13A230,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* DELETE THE INTV FILE                                                        
//*---------------------------------------------------------------------        
//STEP12 EXEC    PGM=BP13C234,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13F230 DD  DSN=BP13.F230.BP13A230,                                          
//             DISP=SHR                                                         
//BP13F240 DD  DSN=BP13.F240.BP13A230,                                          
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*//*--------------------------------------------------------------------      
//*//* STEP13 - STEP15 - TO DELETE BP13F200 RECORDS.                            
//*//*--------------------------------------------------------------------      
//*//*  SORT F200 BY NT-ZONE, FLAT-TYPE AND DTE-BALLOT                          
//*//*--------------------------------------------------------------------      
//*//STEP13 EXEC    SORT,COND=(0,NE)                                            
//*//SORTIN   DD  DSN=BP13.F200.BKAPPMT,                                        
//*//             DISP=SHR                                                      
//*//SORTOUT  DD  DSN=&&P13F200H,                                               
//*//             DISP=(,PASS),                                                 
//*//             UNIT=(SYSDA,1),                                               
//*//             SPACE=(CYL,(10,5),RLSE),                                      
//*//             DCB=(RECFM=FB,LRECL=300,BLKSIZE=23400)                        
//*//SYSIN    DD  *                                                             
//*   SORT FIELDS=(9,5,A,50,6,A),FORMAT=CH                                      
//*/*                                                                           
//*//*--------------------------------------------------------------------      
//*//*  SORT F205 BY NT-ZONE, FLAT-TYPE AND DTE-BALLOT                          
//*//*--------------------------------------------------------------------      
//*//STEP14 EXEC    SORT,COND=(0,NE)                                            
//*//SORTIN   DD  DSN=&&P13F205A,                                               
//*//             DISP=(SHR,PASS)                                               
//*//SORTOUT  DD  DSN=&&P13F205G,                                               
//*//             DISP=(,PASS),                                                 
//*//             UNIT=(SYSDA,1),                                               
//*//             SPACE=(TRK,(10,5),RLSE),                                      
//*//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=23440)                         
//*//SYSIN    DD  *                                                             
//*   SORT FIELDS=(1,5,A,24,6,A),FORMAT=CH                                      
//*/*                                                                           
//*//*--------------------------------------------------------------------      
//*//*  TO DELETE F200 RECORDS WITH SAME NT/ZONE, FT AND DTE-BALLOT AS          
//*//*     F205 CONTROL RECORD                                                  
//*//*--------------------------------------------------------------------      
//*//STEP15 EXEC    PGM=BP13C236,COND=(0,NE)                                    
//*//BP13F205 DD  DSN=&&P13F205G,                                               
//*//             DISP=(SHR,DELETE)                                             
//*//BP13F200 DD  DSN=&&P13F200H,                                               
//*//             DISP=(SHR,DELETE)                                             
//*//P13F200O DD  DSN=BP13.F200.BKAPPMT,                                        
//*//             DISP=OLD                                                      
//*//SYSDBG   DD  SYSOUT=*                                                      
//*//SYSDBOUT DD  SYSOUT=*                                                      
//*//SYSUDUMP DD  SYSOUT=*                                                      
//*//SYSABEND DD  SYSOUT=*                                                      
//*//SYSOUT   DD  SYSOUT=*                                                      
//*/*                                                                           
//*---------------------------------------------------------------------        
//* STEP16          - TO BACKUP CONTROL RECORDS.                                
//*---------------------------------------------------------------------        
//*     ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE             *           
//*---------------------------------------------------------------------        
//STEP16 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.INSUREC,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A230                                                                
//*---------------------------------------------------------------------        
