//BP13D805 JOB (BP13P),'BP13D805',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00001037
//         NOTIFY=CSD0071                                               00002000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//**************************************************************        00040000
//*             SENDING SMS TO SP, SA AND TP CASES                      00050000
//**************************************************************        00060000
//* CHG REF  BY  ON        DESCRIPTION                                  00070000
//* -------- --- ------    -----------                                  00080000
//* BP132943 CKK 20061201  NEW JCL. FOR SENDING SMS                     00090000
//* BP138198 PP11 20200213  TO INCREASE THE SPILITING BY 33%            00100000
//* BP138926 PP11 20220928  CONVERT AUTOMATED SMS INTO XML FORMAT       00101000
//* BP138926 PP11 20221001  OMITTED PL APPOINTMENT TYPE                 00102036
//*--------------------------------------------------------------------*00110000
//* DELETE THE TEMP DATA SETS                                           00112000
//*-------------------------------------------------------------------* 00113000
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                  00114000
//SYSPRINT DD   SYSOUT=*                                                00115000
//SYSIN    DD   *                                                       00116000
     DEL (BP13.F203.ASMS.SATP.XML01)                                    00116100
     DEL (BP13.F203.ASMS.SATP.XML02)                                    00116200
     DEL (BP13.F203.ASMS.SATP.XML03)                                    00116300
     DEL (BP13.F203.ASMS.SATP.XML04)                                    00116400
     DEL (BP13.F203.ASMS.SATP.XML05)                                    00116500
     DEL (BP13.F203.ASMS.PD.XML01)                                      00116600
     DEL (BP13.F203.ASMS.PD.XML02)                                      00116700
     DEL (BP13.F203.ASMS.PD.XML03)                                      00116800
     DEL (BP13.F203.ASMS.PD.XML04)                                      00116900
     DEL (BP13.F203.ASMS.PD.XML05)                                      00117000
     DEL (BP13.F203.ASMS.PCD.XML01)                                     00117100
     DEL (BP13.F203.ASMS.PCD.XML02)                                     00117200
     DEL (BP13.F203.ASMS.PCD.XML03)                                     00117300
     DEL (BP13.F203.ASMS.PCD.XML04)                                     00117400
     DEL (BP13.F203.ASMS.PCD.XML05)                                     00117500
     DEL (BP13.F203.ASMS.SBK.XML01)                                     00117600
     DEL (BP13.F203.ASMS.SBK.XML02)                                     00117700
     DEL (BP13.F203.ASMS.SBK.XML03)                                     00117800
     DEL (BP13.F203.ASMS.SBK.XML04)                                     00117900
     DEL (BP13.F203.ASMS.SBK.XML05)                                     00118000
     DEL (BP13.F203.ASMS.CPF.SOCA.XML01)                                00118100
     DEL (BP13.F203.ASMS.CPF.SOCA.XML02)                                00118200
     DEL (BP13.F203.ASMS.CPF.SOCA.XML03)                                00118300
     DEL (BP13.F203.ASMS.CPF.SOCA.XML04)                                00118400
     DEL (BP13.F203.ASMS.CPF.SOCA.XML05)                                00118500
     DEL (BP13.BULKSMS.FILEIN.SATP)                                     00118600
     DEL (BP13.BULKSMS.FILEIN.SATP.FTP)                                 00118700
     DEL (BP13.F203.SATP.FTP)                                           00119000
     DEL (BP13.F203.PD.FTP)                                             00120000
     DEL (BP13.F203.PCD.FTP)                                            00121000
     DEL (BP13.F203.SBK.FTP)                                            00121100
     DEL (BP13.F203.CPF.SOCA.FTP)                                       00121200
     IF MAXCC < 12 THEN                                                 00121600
        SET MAXCC = 0                                                   00121700
/*                                                                      00121800
//*                                                                     00121900
//*-------------------------------------------------------------------* 00122000
//* DEFINE TEMP DATA SETS                                               00122100
//*-------------------------------------------------------------------* 00122200
//STEP00A  EXEC PGM=IEFBR14,COND=(0,NE)                                 00122300
//F203001   DD  DSN=BP13.F203.ASMS.SATP.XML01,                          00122400
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00122500
//             SPACE=(CYL,(2,1),RLSE),                                  00122600
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00122700
/*                                                                      00122800
//F203002   DD  DSN=BP13.F203.ASMS.SATP.XML02,                          00122900
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00123000
//             SPACE=(CYL,(2,1),RLSE),                                  00123100
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00123200
/*                                                                      00123300
//F203003   DD  DSN=BP13.F203.ASMS.SATP.XML03,                          00123400
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00123500
//             SPACE=(CYL,(2,1),RLSE),                                  00123600
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00123700
/*                                                                      00123800
//F203004   DD  DSN=BP13.F203.ASMS.SATP.XML04,                          00123900
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00124000
//             SPACE=(CYL,(2,1),RLSE),                                  00124100
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00124200
/*                                                                      00125000
//F203005   DD  DSN=BP13.F203.ASMS.SATP.XML05,                          00126000
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00127000
//             SPACE=(CYL,(2,1),RLSE),                                  00128000
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00129000
/*                                                                      00130000
//F203006   DD  DSN=BP13.F203.ASMS.PD.XML01,                            00131000
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00132000
//             SPACE=(CYL,(2,1),RLSE),                                  00133000
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00134000
/*                                                                      00134100
//F203007   DD  DSN=BP13.F203.ASMS.PD.XML02,                            00134200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00134300
//             SPACE=(CYL,(2,1),RLSE),                                  00134400
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00134500
/*                                                                      00134600
//F203008   DD  DSN=BP13.F203.ASMS.PD.XML03,                            00134700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00134800
//             SPACE=(CYL,(2,1),RLSE),                                  00134900
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00135000
/*                                                                      00135100
//F203009   DD  DSN=BP13.F203.ASMS.PD.XML04,                            00135200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00135300
//             SPACE=(CYL,(2,1),RLSE),                                  00135400
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00135500
/*                                                                      00135600
//F203010   DD  DSN=BP13.F203.ASMS.PD.XML05,                            00135700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00135800
//             SPACE=(CYL,(2,1),RLSE),                                  00135900
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00136000
/*                                                                      00136100
//F203011   DD  DSN=BP13.F203.ASMS.PCD.XML01,                           00136200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00136300
//             SPACE=(CYL,(2,1),RLSE),                                  00136400
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00136500
/*                                                                      00136600
//F203012   DD  DSN=BP13.F203.ASMS.PCD.XML02,                           00136700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00136800
//             SPACE=(CYL,(2,1),RLSE),                                  00136900
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00137000
/*                                                                      00137100
//F203013   DD  DSN=BP13.F203.ASMS.PCD.XML03,                           00137200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00137300
//             SPACE=(CYL,(2,1),RLSE),                                  00137400
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00137500
/*                                                                      00137600
//F203014   DD  DSN=BP13.F203.ASMS.PCD.XML04,                           00137700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00137800
//             SPACE=(CYL,(2,1),RLSE),                                  00137900
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00138000
/*                                                                      00138100
//F203015   DD  DSN=BP13.F203.ASMS.PCD.XML05,                           00138200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00138300
//             SPACE=(CYL,(2,1),RLSE),                                  00138400
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00138500
/*                                                                      00138600
//F203016   DD  DSN=BP13.F203.ASMS.SBK.XML01,                           00138700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00138800
//             SPACE=(CYL,(2,1),RLSE),                                  00138900
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00139000
/*                                                                      00139100
//F203017   DD  DSN=BP13.F203.ASMS.SBK.XML02,                           00139200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00139300
//             SPACE=(CYL,(2,1),RLSE),                                  00139400
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00139500
/*                                                                      00139600
//F203018   DD  DSN=BP13.F203.ASMS.SBK.XML03,                           00139700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00139800
//             SPACE=(CYL,(2,1),RLSE),                                  00139900
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00140000
/*                                                                      00140100
//F203019   DD  DSN=BP13.F203.ASMS.SBK.XML04,                           00140200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00140300
//             SPACE=(CYL,(2,1),RLSE),                                  00140400
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00140500
/*                                                                      00140600
//F203020   DD  DSN=BP13.F203.ASMS.SBK.XML05,                           00140700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00140800
//             SPACE=(CYL,(2,1),RLSE),                                  00140900
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00141000
/*                                                                      00141100
//F203021   DD  DSN=BP13.F203.ASMS.CPF.SOCA.XML01,                      00141200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00141300
//             SPACE=(CYL,(2,1),RLSE),                                  00141400
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00141500
/*                                                                      00141600
//F203022   DD  DSN=BP13.F203.ASMS.CPF.SOCA.XML02,                      00141700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00141800
//             SPACE=(CYL,(2,1),RLSE),                                  00141900
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00142000
/*                                                                      00142100
//F203023   DD  DSN=BP13.F203.ASMS.CPF.SOCA.XML03,                      00142200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00142300
//             SPACE=(CYL,(2,1),RLSE),                                  00142400
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00142500
/*                                                                      00142600
//F203024   DD  DSN=BP13.F203.ASMS.CPF.SOCA.XML04,                      00142700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00142800
//             SPACE=(CYL,(2,1),RLSE),                                  00142900
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00143000
/*                                                                      00143100
//F203025   DD  DSN=BP13.F203.ASMS.CPF.SOCA.XML05,                      00143200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00143300
//             SPACE=(CYL,(2,1),RLSE),                                  00143400
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00143500
/*                                                                      00143600
//F203026   DD  DSN=BP13.BULKSMS.FILEIN.SATP,                           00143700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00143800
//             SPACE=(CYL,(2,1),RLSE),                                  00143900
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00144000
/*                                                                      00144100
//F203027   DD  DSN=BP13.BULKSMS.FILEIN.SATP.FTP,                       00144200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00144300
//             SPACE=(CYL,(2,1),RLSE),                                  00144400
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00144500
/*                                                                      00144600
//F203028   DD  DSN=BP13.F203.SATP.FTP,                                 00144700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00144800
//             SPACE=(CYL,(2,1),RLSE),                                  00144900
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00145000
/*                                                                      00145100
//F203029   DD  DSN=BP13.F203.PD.FTP,                                   00145200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00145300
//             SPACE=(CYL,(2,1),RLSE),                                  00145400
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00145500
/*                                                                      00145600
//F203030   DD  DSN=BP13.F203.PCD.FTP,                                  00145700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00145800
//             SPACE=(CYL,(2,1),RLSE),                                  00145900
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00146000
/*                                                                      00146100
//F203031   DD  DSN=BP13.F203.SBK.FTP,                                  00146200
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00146300
//             SPACE=(CYL,(2,1),RLSE),                                  00146400
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00146500
/*                                                                      00146600
//F203032   DD  DSN=BP13.F203.CPF.SOCA.FTP,                             00146700
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00146800
//             SPACE=(CYL,(2,1),RLSE),                                  00146900
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                        00147000
/*                                                                      00147100
//*--------------------------------------------------------------------*00147200
//*  RETRIEVE APPT FROM BP13K454. REMOVE THOSE CANCELLED OR HAS SIGNED  00147300
//*--------------------------------------------------------------------*00147400
//STEP01   EXEC PGM=BP13CS01,COND=(0,NE)                                00148000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              00150000
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                              00160000
//BP13K454 DD DSN=BP13.K454.APPTABLE,DISP=SHR                           00170000
//BP13K420 DD DSN=BP13.K421.CC.INFO,DISP=SHR                            00180000
//BP13K421 DD DSN=BP13.K421.CC.INFO.PATH1,DISP=SHR                      00190000
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                            00200000
//BP13F203 DD DSN=BP13.F203.SMS.SATP,DISP=SHR                           00210000
//SYSDBG   DD SYSOUT=*                                                  00220000
//SYSDBOUT DD SYSOUT=*                                                  00230000
//SYSOUT   DD SYSOUT=*                                                  00240000
//*--------------------------------------------------------------------*00250000
//*  SORT IN KEY FIELD                                                  00260000
//*--------------------------------------------------------------------*00270000
//STEP02   EXEC SORT,COND=(0,NE)                                        00280000
//SORTIN   DD DSN=BP13.F203.SMS.SATP,DISP=SHR                           00290000
//SORTOUT  DD DSN=&&F203,DISP=(NEW,PASS),                               00300000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         00310000
//         SPACE=(CYL,(8,5),RLSE)                                       00320000
//SYSIN    DD  *                                                        00330000
   SORT FIELDS=(1,19,A),FORMAT=CH                                       00340000
   OMIT COND=(9,2,CH,EQ,C'TL',OR,9,2,CH,EQ,C'TR',OR,9,2,CH,EQ,C'PL')    00350000
/*                                                                      00360000
//*=====================================================================00391000
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                    00392000
//*=====================================================================00393000
//STEP03    EXEC PGM=BP13CFB6,COND=(0,NE)                               00394000
//BP13F203  DD DSN=&&F203,DISP=(SHR,PASS)                               00395000
//BP13K209  DD DSN=BP13.K209.SMS.MSG,DISP=SHR                           00395100
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                              00396000
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                           00397000
//B13F203A  DD DSN=BP13.F203.ASMS.SATP.XML01,DISP=SHR                   00398000
//B13F203B  DD DSN=BP13.F203.ASMS.SATP.XML02,DISP=SHR                   00399000
//B13F203C  DD DSN=BP13.F203.ASMS.SATP.XML03,DISP=SHR                   00399100
//B13F203D  DD DSN=BP13.F203.ASMS.SATP.XML04,DISP=SHR                   00399200
//B13F203E  DD DSN=BP13.F203.ASMS.SATP.XML05,DISP=SHR                   00399300
//SYSPRINT  DD SYSOUT=*                                                 00399400
//SYSOUT    DD SYSOUT=*                                                 00399500
//SYSIN     DD *                                                        00399600
/*                                                                      00399700
//**********************************************************************00399800
//* FTP FILE(S) THAT ARE NOT EMPTY                                      00399900
//**********************************************************************00400000
//STEP04A EXEC PGM=IDCAMS,COND=(0,NE,STEP03)                            00400100
//SYSPRINT DD SYSOUT=*                                                  00400200
//FILE1 DD DSN=BP13.F203.ASMS.SATP.XML01,DISP=SHR                       00400300
//SYSUDUMP DD SYSOUT=*                                                  00400400
//SYSIN DD *                                                            00400500
  PRINT INFILE(FILE1) -                                                 00400600
  DUMP COUNT(1)                                                         00400700
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       00400800
/*                                                                      00400900
//STARTIF IF (STEP04A.RC = 0) THEN                                      00401000
//**********************************************************************00401100
//*          GENERATE THE FILELIST DATASET                              00401200
//**********************************************************************00401300
//STEP04B   EXEC SAS,COND=(0,NE,STEP04A)                                00401400
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00401500
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN.SATP,DISP=SHR                   00401600
//SYSPRINT  DD  SYSOUT=*                                                00401700
//SYSIN     DD  *                                                       00401800
DATA _NULLS_;                                                           00401900
FILE FILELST;                                                           00402000
TDAY=DATE();                                                            00402100
   PUT @001 "BP13A20"                                                   00402200
       @008 TDAY   YYMMDD6.                                             00402300
       @014 '0805000001.xml';                                           00402400
//**********************************************************************00402500
//*          GENERATE THE CURRENT FTP DATE FILE                         00402600
//**********************************************************************00402700
//STEP04C   EXEC SAS,COND=(0,NE,STEP04A)                                00402800
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00402900
//FTPDATE   DD  DSN=BP13.F203.SATP.FTP,DISP=OLD                         00403000
//SYSPRINT  DD  SYSOUT=*                                                00403100
//SYSIN     DD  *                                                       00403200
DATA _NULLS_;                                                           00403300
FILE FTPDATE;                                                           00403400
TDAY=DATE();                                                            00403500
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 00403600
   PUT @001 "put 'BP13.F203.ASMS.SATP.XML01' BP13A20"                   00403700
       @040 TDAY   YYMMDD6.                                             00403800
       @046 '0805000001.xml';                                           00403900
   PUT @001 'quit';                                                     00404000
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           00404100
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          00404200
//INPUT    DD DSN=BP13.F203.SATP.FTP,DISP=OLD                           00404300
/*                                                                      00404400
//STOPIF   ENDIF                                                        00404500
/*                                                                      00404600
//**********************************************************************00404700
//* FTP FILE(S) THAT ARE NOT EMPTY                                      00404800
//**********************************************************************00404900
//STEP05A EXEC PGM=IDCAMS,COND=(0,NE,STEP03)                            00405000
//SYSPRINT DD SYSOUT=*                                                  00406000
//FILE1 DD DSN=BP13.F203.ASMS.SATP.XML02,DISP=SHR                       00407000
//SYSUDUMP DD SYSOUT=*                                                  00408000
//SYSIN DD *                                                            00409000
  PRINT INFILE(FILE1) -                                                 00410000
  DUMP COUNT(1)                                                         00420000
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       00430000
/*                                                                      00440000
//STARTIF IF (STEP05A.RC = 0) THEN                                      00450000
//**********************************************************************00460000
//*          GENERATE THE FILELIST DATASET                              00470000
//**********************************************************************00480000
//STEP05B   EXEC SAS,COND=(0,NE,STEP05A)                                00490000
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00500000
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN.SATP,DISP=MOD                   00510000
//SYSPRINT  DD  SYSOUT=*                                                00520000
//SYSIN     DD  *                                                       00530000
DATA _NULLS_;                                                           00540000
FILE FILELST;                                                           00550000
TDAY=DATE();                                                            00560000
   PUT @001 "BP13A20"                                                   00570000
       @008 TDAY   YYMMDD6.                                             00580000
       @014 '0805000002.xml';                                           00590000
//**********************************************************************00600000
//*          GENERATE THE CURRENT FTP DATE FILE                         00610000
//**********************************************************************00620000
//STEP05C   EXEC SAS,COND=(0,NE,STEP05A)                                00630000
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00640000
//FTPDATE   DD  DSN=BP13.F203.SATP.FTP,DISP=OLD                         00650000
//SYSPRINT  DD  SYSOUT=*                                                00660000
//SYSIN     DD  *                                                       00670000
DATA _NULLS_;                                                           00680000
FILE FTPDATE;                                                           00690000
TDAY=DATE();                                                            00700000
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 00710000
   PUT @001 "put 'BP13.F203.ASMS.SATP.XML02' BP13A20"                   00720000
       @040 TDAY   YYMMDD6.                                             00730000
       @046 '0805000002.xml';                                           00740000
   PUT @001 'quit';                                                     00750000
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           00760000
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          00770000
//INPUT    DD DSN=BP13.F203.SATP.FTP,DISP=OLD                           00780000
/*                                                                      00790000
//STOPIF   ENDIF                                                        00800000
/*                                                                      00810000
//*-------------------------------------------------------------------* 00811000
//*  SORT OUT ALL THE PENDING DOCUMENTS                                 00812000
//*-------------------------------------------------------------------- 00813000
//STEP05D  EXEC SORT,COND=(0,NE,STEP03)                                 00814000
//SORTIN   DD DSN=BP13.K203.SMS,DISP=SHR                                00815000
//SORTOUT  DD DSN=&&F203PD,DISP=(NEW,PASS),                             00816000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         00817000
//         SPACE=(CYL,(8,5),RLSE)                                       00818000
//SYSIN    DD  *                                                        00819000
   SORT FIELDS=(1,19,A),FORMAT=CH                                       00819100
   INCLUDE COND=(9,2,CH,EQ,C'PD')                                       00819200
//*---------------------------------------------------------------------00819300
//*  OUTPUT ONLY DAY AFTER TOMORROW CASES.                              00819400
//*  REMOVE CANCELLED CASES AND NO HANDPHONE CASES                      00819500
//*-------------------------------------------------------------------- 00819600
//STEP06   EXEC PGM=BP13CS08,COND=(0,NE,STEP03)                         00819700
//BP13F203 DD DSN=&&F203PD,DISP=(OLD,DELETE)                            00819800
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              00819900
//BP13KQ10 DD DSN=BP13.KQ10.DOC.TBL,DISP=SHR                            00820000
//P13F203A DD DSN=BP13.F203.SMS.PD,DISP=SHR                             00820100
//SYSDBG   DD SYSOUT=*                                                  00820200
//SYSDBOUT DD SYSOUT=*                                                  00820300
//SYSOUT   DD SYSOUT=*                                                  00820400
//*-------------------------------------------------------------------* 00820500
//*- SORT IN KEY FIELD                                                  00820600
//*-------------------------------------------------------------------- 00820700
//STEP07   EXEC SORT,COND=(0,NE,STEP03)                                 00820800
//SORTIN   DD DSN=BP13.F203.SMS.PD,DISP=SHR                             00820900
//SORTOUT  DD DSN=&&F203B,DISP=(NEW,PASS),                              00821000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         00821100
//         SPACE=(CYL,(8,5),RLSE)                                       00821200
//SYSIN    DD  *                                                        00821300
   SORT FIELDS=(1,19,A),FORMAT=CH                                       00821400
//*--------------------------------------------------------------------*00821500
//* RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND                 *00821600
//* TO THE MESSAGE QUEUE.                                              *00821700
//*--------------------------------------------------------------------*00821800
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                    00821900
//*-------------------------------------------------------------------* 00822000
//STEP08    EXEC PGM=BP13CFB6,COND=(0,NE,STEP03)                        00822100
//BP13F203  DD DSN=&&F203B,DISP=(OLD,DELETE)                            00822200
//BP13K209  DD DSN=BP13.K209.SMS.MSG,DISP=SHR                           00822300
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                              00822400
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                           00822500
//B13F203A  DD DSN=BP13.F203.ASMS.PD.XML01,DISP=SHR                     00822600
//B13F203B  DD DSN=BP13.F203.ASMS.PD.XML02,DISP=SHR                     00822700
//B13F203C  DD DSN=BP13.F203.ASMS.PD.XML03,DISP=SHR                     00822800
//B13F203D  DD DSN=BP13.F203.ASMS.PD.XML04,DISP=SHR                     00822900
//B13F203E  DD DSN=BP13.F203.ASMS.PD.XML05,DISP=SHR                     00823000
//SYSPRINT  DD SYSOUT=*                                                 00823100
//SYSOUT    DD SYSOUT=*                                                 00823200
//SYSIN     DD *                                                        00823300
/*                                                                      00823400
//**********************************************************************00823500
//* FTP FILE(S) THAT ARE NOT EMPTY                                      00823600
//**********************************************************************00823700
//STEP08A  EXEC PGM=IDCAMS,COND=(0,NE,STEP08)                           00823800
//SYSPRINT DD SYSOUT=*                                                  00823900
//FILE1 DD DSN=BP13.F203.ASMS.PD.XML01,DISP=SHR                         00824000
//SYSUDUMP DD SYSOUT=*                                                  00824100
//SYSIN DD *                                                            00824200
  PRINT INFILE(FILE1) -                                                 00824300
  DUMP COUNT(1)                                                         00824400
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       00824500
/*                                                                      00824600
//STARTIF IF (STEP08A.RC = 0) THEN                                      00824700
//**********************************************************************00824800
//*          GENERATE THE FILELIST DATASET                              00824900
//**********************************************************************00825000
//STEP08B   EXEC SAS,COND=(0,NE,STEP08A)                                00825100
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00825200
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN.SATP,DISP=MOD                   00825300
//SYSPRINT  DD  SYSOUT=*                                                00825400
//SYSIN     DD  *                                                       00825500
DATA _NULLS_;                                                           00825600
FILE FILELST;                                                           00825700
TDAY=DATE();                                                            00825800
   PUT @001 "BP13A20"                                                   00825900
       @008 TDAY   YYMMDD6.                                             00826000
       @014 '0805000006.xml';                                           00826100
//**********************************************************************00826200
//*          GENERATE THE CURRENT FTP DATE FILE                         00826300
//**********************************************************************00826400
//STEP08C   EXEC SAS,COND=(0,NE,STEP08A)                                00826500
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00826600
//FTPDATE   DD  DSN=BP13.F203.PD.FTP,DISP=OLD                           00826700
//SYSPRINT  DD  SYSOUT=*                                                00826800
//SYSIN     DD  *                                                       00826900
DATA _NULLS_;                                                           00827000
FILE FTPDATE;                                                           00827100
TDAY=DATE();                                                            00827200
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 00827300
   PUT @001 "put 'BP13.F203.ASMS.PD.XML01' BP13A20"                     00827400
       @038 TDAY   YYMMDD6.                                             00827500
       @044 '0805000006.xml';                                           00827600
   PUT @001 'quit';                                                     00827700
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           00827800
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          00827900
//INPUT    DD DSN=BP13.F203.PD.FTP,DISP=OLD                             00828000
/*                                                                      00828100
//STOPIF   ENDIF                                                        00828200
/*                                                                      00828300
//*-------------------------------------------------------------------* 00828400
//*  SPLIT SMS.PCD CASES                                                00828500
//*-------------------------------------------------------------------- 00828600
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                    00828700
//*-------------------------------------------------------------------* 00828800
//STEP09    EXEC PGM=BP13CFB6,COND=(0,NE,STEP08)                        00828900
//BP13F203  DD DSN=BP13.F203.SMS.PCD,DISP=SHR                           00829000
//BP13K209  DD DSN=BP13.K209.SMS.MSG,DISP=SHR                           00829100
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                              00829200
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                           00829300
//B13F203A  DD DSN=BP13.F203.ASMS.PCD.XML01,DISP=SHR                    00829400
//B13F203B  DD DSN=BP13.F203.ASMS.PCD.XML02,DISP=SHR                    00829500
//B13F203C  DD DSN=BP13.F203.ASMS.PCD.XML03,DISP=SHR                    00829600
//B13F203D  DD DSN=BP13.F203.ASMS.PCD.XML04,DISP=SHR                    00829700
//B13F203E  DD DSN=BP13.F203.ASMS.PCD.XML05,DISP=SHR                    00829800
//SYSPRINT  DD SYSOUT=*                                                 00829900
//SYSOUT    DD SYSOUT=*                                                 00830000
//SYSIN     DD *                                                        00830100
/*                                                                      00830200
//**********************************************************************00830300
//* FTP FILE(S) THAT ARE NOT EMPTY                                      00830400
//**********************************************************************00830500
//STEP09A  EXEC PGM=IDCAMS,COND=(0,NE,STEP09)                           00830600
//SYSPRINT DD SYSOUT=*                                                  00830700
//FILE1 DD DSN=BP13.F203.ASMS.PCD.XML01,DISP=SHR                        00830800
//SYSUDUMP DD SYSOUT=*                                                  00830900
//SYSIN DD *                                                            00831000
  PRINT INFILE(FILE1) -                                                 00831100
  DUMP COUNT(1)                                                         00831200
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       00831300
/*                                                                      00831400
//STARTIF IF (STEP09A.RC = 0) THEN                                      00831500
//**********************************************************************00831600
//*          GENERATE THE FILELIST DATASET                              00831700
//**********************************************************************00831800
//STEP09B   EXEC SAS,COND=(0,NE,STEP09A)                                00831900
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00832000
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN.SATP,DISP=MOD                   00832100
//SYSPRINT  DD  SYSOUT=*                                                00832200
//SYSIN     DD  *                                                       00832300
DATA _NULLS_;                                                           00832400
FILE FILELST;                                                           00832500
TDAY=DATE();                                                            00832600
   PUT @001 "BP13A20"                                                   00832700
       @008 TDAY   YYMMDD6.                                             00832800
       @014 '0805000011.xml';                                           00832900
//**********************************************************************00833000
//*          GENERATE THE CURRENT FTP DATE FILE                         00833100
//**********************************************************************00833200
//STEP09C   EXEC SAS,COND=(0,NE,STEP09A)                                00833300
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00833400
//FTPDATE   DD  DSN=BP13.F203.PCD.FTP,DISP=OLD                          00833500
//SYSPRINT  DD  SYSOUT=*                                                00833600
//SYSIN     DD  *                                                       00833700
DATA _NULLS_;                                                           00833800
FILE FTPDATE;                                                           00833900
TDAY=DATE();                                                            00834000
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 00834100
   PUT @001 "put 'BP13.F203.ASMS.PCD.XML01' BP13A20"                    00834200
       @039 TDAY   YYMMDD6.                                             00834300
       @045 '0805000011.xml';                                           00834400
   PUT @001 'quit';                                                     00834500
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           00834600
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          00834700
//INPUT    DD DSN=BP13.F203.PCD.FTP,DISP=OLD                            00834800
/*                                                                      00834900
//STOPIF   ENDIF                                                        00835000
/*                                                                      00835100
//**********************************************************************00835200
//* FTP FILE(S) THAT ARE NOT EMPTY                                      00835300
//**********************************************************************00835400
//STEP09D  EXEC PGM=IDCAMS,COND=(0,NE,STEP09)                           00835500
//SYSPRINT DD SYSOUT=*                                                  00835600
//FILE1 DD DSN=BP13.F203.ASMS.PCD.XML02,DISP=SHR                        00835700
//SYSUDUMP DD SYSOUT=*                                                  00835800
//SYSIN DD *                                                            00835900
  PRINT INFILE(FILE1) -                                                 00836000
  DUMP COUNT(1)                                                         00836100
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       00836200
/*                                                                      00836300
//STARTIF IF (STEP09D.RC = 0) THEN                                      00836400
//**********************************************************************00836500
//*          GENERATE THE FILELIST DATASET                              00836600
//**********************************************************************00836700
//STEP09E   EXEC SAS,COND=(0,NE,STEP09D)                                00836800
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00836900
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN.SATP,DISP=MOD                   00837000
//SYSPRINT  DD  SYSOUT=*                                                00837100
//SYSIN     DD  *                                                       00837200
DATA _NULLS_;                                                           00837300
FILE FILELST;                                                           00837400
TDAY=DATE();                                                            00837500
   PUT @001 "BP13A20"                                                   00837600
       @008 TDAY   YYMMDD6.                                             00837700
       @014 '0805000012.xml';                                           00837800
//**********************************************************************00837900
//*          GENERATE THE CURRENT FTP DATE FILE                         00838000
//**********************************************************************00838100
//STEP09F   EXEC SAS,COND=(0,NE,STEP09D)                                00838200
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00838300
//FTPDATE   DD  DSN=BP13.F203.PCD.FTP,DISP=OLD                          00838400
//SYSPRINT  DD  SYSOUT=*                                                00838500
//SYSIN     DD  *                                                       00838600
DATA _NULLS_;                                                           00838700
FILE FTPDATE;                                                           00838800
TDAY=DATE();                                                            00838900
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 00839000
   PUT @001 "put 'BP13.F203.ASMS.PCD.XML02' BP13A20"                    00839100
       @039 TDAY   YYMMDD6.                                             00839200
       @045 '0805000012.xml';                                           00839300
   PUT @001 'quit';                                                     00839400
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           00839500
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          00839600
//INPUT    DD DSN=BP13.F203.PCD.FTP,DISP=OLD                            00839700
/*                                                                      00839800
//STOPIF   ENDIF                                                        00839900
/*                                                                      00840000
//*--------------------------------------------------------------------*00840100
//* CLEAR BP13.F203.SMS.PCD                                             00840200
//*--------------------------------------------------------------------*00840300
//STEP09H  EXEC PGM=IEBGENER,COND=(0,NE,STEP09)                         00840400
//SYSPRINT DD  SYSOUT=*                                                 00840500
//SYSUT1   DD  DSN=NULLFILE,                                            00840600
//             RECFM=FB,LRECL=200,                                      00840700
//             BLKSIZE=0                                                00840800
//SYSUT2   DD  DSN=BP13.F203.SMS.PCD,                                   00840900
//             DISP=SHR                                                 00841000
//SYSIN    DD  DUMMY                                                    00841100
//*                                                                     00841200
//*-------------------------------------------------------------------- 00841300
//* EXTRACT REGNS TO SEND SMS FOR AUTO BOOKED CASES VIA SELF BOOKING    00841400
//*-------------------------------------------------------------------- 00841500
//STEP10A  EXEC SORT,COND=(0,NE,STEP09)                                 00841600
//SORTIN   DD DSN=BP13.F203.SMS.SBK.AUTO,DISP=SHR                       00841700
//SORTOUT  DD DSN=&&F203SBK,DISP=(NEW,PASS),                            00841800
//          DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                         00841900
//          SPACE=(CYL,(5,1),RLSE)                                      00842000
//SYSOUT   DD SYSOUT=*                                                  00842100
//SYSIN    DD *                                                         00842200
   SORT FIELDS=(12,8,A),FORMAT=CH                                       00842300
   INCLUDE COND=(9,2,CH,EQ,C'W2')                                       00842400
//*                                                                     00842500
//*--------------------------------------------------------------------*00842600
//* RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND                  00842700
//* TO THE MESSAGE QUEUE (BY SMS)                                       00842800
//* APPT TYPE = (W2)                                                    00842900
//*--------------------------------------------------------------------*00843000
//*-------------------------------------------------------------------* 00843100
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                    00843200
//*-------------------------------------------------------------------* 00843300
//STEP10B   EXEC PGM=BP13CFB6,COND=(0,NE,STEP09)                        00843400
//BP13F203  DD DSN=&&F203SBK,DISP=(OLD,DELETE)                          00843500
//BP13K209  DD DSN=BP13.K209.SMS.MSG,DISP=SHR                           00843600
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                              00843700
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                           00843800
//B13F203A  DD DSN=BP13.F203.ASMS.SBK.XML01,DISP=SHR                    00843900
//B13F203B  DD DSN=BP13.F203.ASMS.SBK.XML02,DISP=SHR                    00844000
//B13F203C  DD DSN=BP13.F203.ASMS.SBK.XML03,DISP=SHR                    00844100
//B13F203D  DD DSN=BP13.F203.ASMS.SBK.XML04,DISP=SHR                    00844200
//B13F203E  DD DSN=BP13.F203.ASMS.SBK.XML05,DISP=SHR                    00844300
//SYSPRINT  DD SYSOUT=*                                                 00844400
//SYSOUT    DD SYSOUT=*                                                 00844500
//SYSIN     DD *                                                        00844600
/*                                                                      00844700
//**********************************************************************00844800
//* FTP FILE(S) THAT ARE NOT EMPTY                                      00844900
//**********************************************************************00845000
//STEP10C  EXEC PGM=IDCAMS,COND=(0,NE,STEP10B)                          00845100
//SYSPRINT DD SYSOUT=*                                                  00845200
//FILE1 DD DSN=BP13.F203.ASMS.SBK.XML01,DISP=SHR                        00845300
//SYSUDUMP DD SYSOUT=*                                                  00845400
//SYSIN DD *                                                            00845500
  PRINT INFILE(FILE1) -                                                 00845600
  DUMP COUNT(1)                                                         00845700
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       00845800
/*                                                                      00845900
//STARTIF IF (STEP10C.RC = 0) THEN                                      00846000
//**********************************************************************00846100
//*          GENERATE THE FILELIST DATASET                              00846200
//**********************************************************************00846300
//STEP10D   EXEC SAS,COND=(0,NE,STEP10C)                                00846400
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00846500
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN.SATP,DISP=MOD                   00846600
//SYSPRINT  DD  SYSOUT=*                                                00846700
//SYSIN     DD  *                                                       00846800
DATA _NULLS_;                                                           00846900
FILE FILELST;                                                           00847000
TDAY=DATE();                                                            00847100
   PUT @001 "BP13A20"                                                   00847200
       @008 TDAY   YYMMDD6.                                             00847300
       @014 '0805000016.xml';                                           00847400
//**********************************************************************00847500
//*          GENERATE THE CURRENT FTP DATE FILE                         00847600
//**********************************************************************00847700
//STEP10E   EXEC SAS,COND=(0,NE,STEP10C)                                00847800
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00847900
//FTPDATE   DD  DSN=BP13.F203.SBK.FTP,DISP=OLD                          00848000
//SYSPRINT  DD  SYSOUT=*                                                00848100
//SYSIN     DD  *                                                       00848200
DATA _NULLS_;                                                           00848300
FILE FTPDATE;                                                           00848400
TDAY=DATE();                                                            00848500
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 00848600
   PUT @001 "put 'BP13.F203.ASMS.SBK.XML01' BP13A20"                    00848700
       @039 TDAY   YYMMDD6.                                             00848800
       @045 '0805000016.xml';                                           00848900
   PUT @001 'quit';                                                     00849000
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           00849100
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          00849200
//INPUT    DD DSN=BP13.F203.SBK.FTP,DISP=OLD                            00849300
/*                                                                      00849400
//STOPIF   ENDIF                                                        00849500
/*                                                                      00849600
//*-------------------------------------------------------------------- 00849700
//* EXTRACT REGNS TO SEND EMAIL FOR AUTO BOOKED CASES VIA SELF BOOKING  00849800
//*-------------------------------------------------------------------- 00849900
//STEP11A  EXEC SORT,COND=(0,NE,STEP10B)                                00850000
//SORTIN   DD DSN=BP13.F23B.EMAIL.SBK.AUTO,DISP=SHR                     00850100
//SORTOUT  DD DSN=&&F23BSBK,DISP=(NEW,PASS),                            00850200
//          DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                         00850300
//          SPACE=(CYL,(5,1),RLSE)                                      00850400
//SYSOUT   DD SYSOUT=*                                                  00850500
//SYSIN    DD *                                                         00850600
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00850700
   INCLUDE COND=(9,2,CH,EQ,C'W2')                                       00850800
//*                                                                     00850900
//*--------------------------------------------------------------------*00851000
//* RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND                  00851100
//* TO THE MESSAGE QUEUE (BY EMAIL)                                     00851200
//* APPT TYPE = (W2)                                                    00851300
//*--------------------------------------------------------------------*00851400
//STEP11B  EXEC MQBATCH,NAME=BP13CS12,COND=(0,NE,STEP10B)               00851500
//STEPLIB  DD                                                           00851600
//         DD                                                           00851700
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00851800
//BP13F23B DD DSN=&&F23BSBK,DISP=(OLD,DELETE)                           00851900
//SYSDBG   DD SYSOUT=*                                                  00852000
//SYSOUT   DD SYSOUT=*                                                  00852100
//SYSDBOUT DD SYSOUT=*                                                  00852200
//SYSABOUT DD SYSOUT=*                                                  00852300
//SYSPRINT DD SYSOUT=*                                                  00852400
//SYSIN    DD DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                          00852500
/*                                                                      00852600
//*-------------------------------------------------------------------* 00852700
//*  SPLIT CPF.SOCA CASES INTO 4 PARTS                                  00852800
//*-------------------------------------------------------------------- 00852900
//STEP12    EXEC PGM=BP13CFB6,COND=(0,NE,STEP10B)                       00853000
//BP13F203  DD DSN=BP13.F203.SMS.CPF.SOCA,DISP=SHR                      00853100
//BP13K209  DD DSN=BP13.K209.SMS.MSG,DISP=SHR                           00853200
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                              00853300
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                           00853400
//B13F203A  DD DSN=BP13.F203.ASMS.CPF.SOCA.XML01,DISP=SHR               00853500
//B13F203B  DD DSN=BP13.F203.ASMS.CPF.SOCA.XML02,DISP=SHR               00853600
//B13F203C  DD DSN=BP13.F203.ASMS.CPF.SOCA.XML03,DISP=SHR               00853700
//B13F203D  DD DSN=BP13.F203.ASMS.CPF.SOCA.XML04,DISP=SHR               00853800
//B13F203E  DD DSN=BP13.F203.ASMS.CPF.SOCA.XML05,DISP=SHR               00853900
//SYSPRINT  DD SYSOUT=*                                                 00854000
//SYSOUT    DD SYSOUT=*                                                 00854100
//SYSIN     DD *                                                        00854200
/*                                                                      00854300
//**********************************************************************00854400
//* FTP FILE(S) THAT ARE NOT EMPTY                                      00854500
//**********************************************************************00854600
//STEP12A  EXEC PGM=IDCAMS,COND=(0,NE,STEP12)                           00854700
//SYSPRINT DD SYSOUT=*                                                  00854800
//FILE1 DD DSN=BP13.F203.ASMS.CPF.SOCA.XML01,DISP=SHR                   00854900
//SYSUDUMP DD SYSOUT=*                                                  00855000
//SYSIN DD *                                                            00855100
  PRINT INFILE(FILE1) -                                                 00855200
  DUMP COUNT(1)                                                         00855300
  IF LASTCC EQ 4 THEN SET MAXCC=1                                       00855400
/*                                                                      00855500
//STARTIF IF (STEP12A.RC = 0) THEN                                      00855600
//**********************************************************************00855700
//*          GENERATE THE FILELIST DATASET                              00855800
//**********************************************************************00855900
//STEP12B   EXEC SAS                                                    00856000
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00856100
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN.SATP,DISP=MOD                   00856200
//SYSPRINT  DD  SYSOUT=*                                                00856300
//SYSIN     DD  *                                                       00856400
DATA _NULLS_;                                                           00856500
FILE FILELST;                                                           00856600
TDAY=DATE();                                                            00856700
   PUT @001 "BP13A20"                                                   00856800
       @008 TDAY   YYMMDD6.                                             00856900
       @014 '0805000021.xml';                                           00857000
//**********************************************************************00857100
//*          GENERATE THE CURRENT FTP DATE FILE                         00857200
//**********************************************************************00857300
//STEP12C   EXEC SAS                                                    00857400
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00857500
//FTPDATE   DD  DSN=BP13.F203.CPF.SOCA.FTP,DISP=OLD                     00857600
//SYSPRINT  DD  SYSOUT=*                                                00857700
//SYSIN     DD  *                                                       00857800
DATA _NULLS_;                                                           00857900
FILE FTPDATE;                                                           00858000
TDAY=DATE();                                                            00858100
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 00858200
   PUT @001 "put 'BP13.F203.ASMS.CPF.SOCA.XML01' BP13A20"               00858300
       @044 TDAY   YYMMDD6.                                             00858400
       @050 '0805000021.xml';                                           00858500
   PUT @001 'quit';                                                     00858600
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           00858700
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          00858800
//INPUT    DD DSN=BP13.F203.CPF.SOCA.FTP,DISP=OLD                       00858900
/*                                                                      00859000
//STOPIF   ENDIF                                                        00859100
/*                                                                      00859200
//*-------------------------------------------------------------------- 00859300
//*          FTP TO BulkSMS-File-List.txt                               00859400
//*-------------------------------------------------------------------- 00859500
//STEP13    EXEC SAS,COND=(0,NE,STEP03)                                 00859600
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                         00860000
//FTPDATE   DD  DSN=BP13.BULKSMS.FILEIN.SATP.FTP,DISP=OLD               00870000
//SYSPRINT  DD  SYSOUT=*                                                00880000
//SYSIN     DD  *                                                       00890000
DATA _NULLS_;                                                           00900000
FILE FTPDATE;                                                           00910000
TDAY=DATE();                                                            00920000
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                 00930000
   PUT @001 "put 'BP13.BULKSMS.FILEIN.SATP' BulkSMS-File-List.txt";     00940000
   PUT @001 'quit';                                                     00950000
//FTP013   EXEC FTP,PARM='LANSFTPP01   (EXIT'                           00960000
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          00970000
//INPUT    DD DSN=BP13.BULKSMS.FILEIN.SATP.FTP,DISP=OLD                 00980000
/*                                                                      00990000
