//BP13M302 JOB (BP13P),'BP13M302',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//* OBJECTIVE    : TO PRINT RECORDS OF IN EX-APPLICANT                *         
//*                FILE PENDING CPF REFUND                            *         
//* FREQUENCY    : MONTHLY                                            *         
//* SORT SEQ     : K150-NUM-ORIG-REGN                                 *         
//*---------------------------------------------------------------------        
//* CHG REF   DATE      OIC   REMARKS                                           
//* --------  ----      ----  -------                                           
//* BP130418  19980828  CLT1  Y2K IMPLEMENTATION                                
//*                           - BM06 AND BP13K800                               
//* BP130883  20001027  CLT1  -MOVE BP13C904 AND CALL BP13C913                  
//* BP132208  20020912  MALC  -READ BP13K800 TO VFY CASE IF EXIST               
//* BP132371  20030710  SSS   -REMOVE C447 AND S457                             
//* BP135171  20140214  RJE1  -TO CATER FOR DB2 UPGRADE                         
//* BP137652  20190131  DN8   -TO CREATE & SEND REPORT ON CANCELLATION          
//*                            OF FLAT UNDER LBS - NEW PROG BP13C32E            
//* BP138203  20200309  KTM3  -TO CEASE REPORT BP13C32E                         
//* BP138619  20210721  KV8   -TO CREATE & SEND REPORT ON CANCELLATION          
//*                            OF FLAT UNDER CX&CY - NEW PROG BP13C32G          
//* BP138865  20211028  KR13  -CONVERT REPORT L322A TO IOM8.                    
//********************************************************************/         
//*          TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                     
//********************************************************************          
//STEP0    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//*  INCLUDE ONLY SOC CASES                                                     
//*---------------------------------------------------------------------        
//PSM020   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=13')                                                  
//SORTOUT  DD DSN=&&BP13K800,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(250,20),RLSE),UNIT=SYSDA,                             
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
      SORT FIELDS=(4,8,A),FORMAT=CH,SIZE=E200000                                
      INCLUDE COND=(259,2,CH,EQ,C'AI',OR,                                       
       259,2,CH,EQ,C'AW')                                                       
//*---------------------------------------------------------------------        
//*  PRINT A LIST OF CASES ALREADY CANCELLED FOR MORE THAN 3 MONTHS             
//*  STILL WITH OUTSTANDING BALANCE FOR THE MONTH ENDING                        
//*---------------------------------------------------------------------        
//PSM040   EXEC  PGM=BP13C317,COND=(0,NE)                                       
//BP13F800 DD DSN=&&BP13K800,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L317 DD SYSOUT=2,OUTPUT=(*.STEP0.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON CASES WHERE DELIVERY POSSESSION DATE IS DUE IN              
//* TWO MONTHS TIME FOR KEY AVAILABLE AND KEY NOT AVAILABLE.                    
//*---------------------------------------------------------------------        
//PSM050   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB14K501 DD DSN=BB14.K500.BLKLEASE.PATH1,DISP=SHR,                            
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13L322A DD SYSOUT=8,DEST=IOM8                                                
//P13L322B DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C322) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*---------------------------------------------------------------------        
//* SORT BP13K800 FOR CANCEL REASON "CX" OR "CY"                                
//*---------------------------------------------------------------------        
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&F800,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                              
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH                                             
      INCLUDE COND=(193,2,CH,EQ,C'CX',OR,193,2,CH,EQ,C'CY')                     
//*                                                                             
//*---------------------------------------------------------------------        
//* CREATE MAIL FOR REPORT ON CANCELLATION OF FLATS UNDER LBS                   
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C32G,REGION=1024K                                       
//BP13F800 DD DSN=&&F800,DISP=(OLD,DELETE)                                      
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//F800RPT  DD DSN=BP13.MAILRPT.CANCEL.CXY,DISP=SHR                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP03   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.CANCEL.CXY,DISP=SHR                              
//*-----------------------------------------------------------------            
//*---------------------------------------------------------------------        
//* END BP13M302                                                                
//*---------------------------------------------------------------------        
