//BP13D515 JOB (BP13P),'BP13D515',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//*  FOR 4 ROOM WALK-IN EXERCISE                                      *         
//*  TO UPDATE DEMAND/SUPPLY                                          *         
//*                                                                   *         
//*===================================================================*         
//* CHG REF  BY  ON       DESCRIPTION                                 *         
//* -------- --- -------- -----------                                 *         
//* BP133008 CLT 260307   FOR 4 ROOM WIA                              *         
//* BP133125 CLT 060807   FOR 4 ROOM WIC                              *         
//* BP133125 CLT 160807   CATER FOR 5 DIGIT DEMAND                    *         
//* BP133166 CLT 041007   FOR OCT 07 WIA                              *         
//* BP133213 CLT 051207   FOR DEC 07 WIB                              *         
//* BP133258 CLT 040208   FOR FEB 08 WIC                              *         
//* BP133311 CCC 080408   FOR APR 08 WIA                              *         
//* BP133451 CCC 081008   FOR OCT 08 WIH                              *         
//* BP133576 CCC 090409   FOR APR 09 WIH                              *         
//* BP136891 CCC 280717   SYNC WITH D517 FOR ROF LAUNCH               *         
//* BP138215 AM2 230420   UPDATE OUTREC FOR BP13K766                  *         
//* BP139207 PP11 160622   AUTO OPENING FILE                          *         
//*===================================================================*         
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD  DSN=BP13.K766.WIS.DEMAND,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------* 00001330
//* TO UPDATE DEMAND / SUPPLY OF BTO EXERCISE                          *        
//*--------------------------------------------------------------------*        
//STEP03 EXEC  PGM=BP13C73A,COND=(0,NE)                                         
//BP13FF01 DD  DSN=BP13.FF01.SALES.DEMAND,DISP=SHR                              
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K762 DD  DSN=BP13.K766.WIS.DEMAND,DISP=OLD,                               
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13L730 DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------*00000850
//*--------------------------------------------------------------------         
//* TO EXTRACT DEMAND FOR 1B ROOM TYPE (SA WITH 45 SQM)                         
//*--------------------------------------------------------------------         
//STEP04  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K766.WIS.DEMAND,DISP=SHR                                  
//SORTOUT DD DSN=&&BP13K762,                                                    
//           DISP=(,PASS),                                                      
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(5,5),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                                 
//SORTWK01 DD UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=(4,2,CH,EQ,C'1A')                                                
  OUTREC FIELDS=(1,3,C'1B',6,16,C'00000000000000',36,165)                       
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*   TO UPDATE 1B SA WITH THE SAME DEMAND AS 1A SA                             
//*--------------------------------------------------------------------         
//STEP05  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&BP13K762,DISP=(OLD,PASS)                                   
//OUTPUT1   DD DSN=BP13.K766.WIS.DEMAND,DISP=OLD                                
//SYSIN     DD *                                                                
  REPRO INFILE(INPUT1) OUTFILE(OUTPUT1) REPLACE                                 
//*-------------------------------------------------------------------*         
//* SORT K766 TO SEQUENTIAL FILE                                      *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K766.WIS.DEMAND,DISP=SHR                                 
//SORTOUT  DD DSN=BP13.F762.BTO.DEMAND,DISP=MOD                                 
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,14,A),FORMAT=CH                                               
   OMIT COND=(4,2,CH,EQ,C'1B')                                                  
//*-------------------------------------------------------------------*         
//* DELETE FILE BP13.FF02.SUPPLY.DEMAND.ROF                                     
//*-------------------------------------------------------------------*         
//STEP09A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FF02.SUPPLY.DEMAND.ROF')                                        
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*  GENERATE BP13.FF02.SUPPLY.DEMAND.ROF FOR USER DOWNLOAD                     
//*--------------------------------------------------------------------         
//STEP09B EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K766.WIS.DEMAND,DISP=SHR                                  
//SORTOUT DD DSN=BP13.FF02.SUPPLY.DEMAND.ROF,DISP=(NEW,CATLG),                  
//           SPACE=(CYL,(2,1),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                  
//SYSOUT  DD SYSOUT=*                                                           
//SYSIN   DD *                                                                  
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  OUTREC FIELDS=(1,3,C';',4,2,C';',6,5,C';',11,4,C';',75,4,C';',                
                45,4,C';',36,5,C';',79,4,C';',53,4,C';',49,4,C';',              
                83,4,C';',71,4,C';',67,4,C';',16X)                              
//*-------------------------------------------------------------------*         
//* AUTO-OPEN FILES                                                   *         
//*-------------------------------------------------------------------*         
//STEP09Z  EXEC PGM=IKJEFT01,PARM='OPNFILE',COND=(0,NE)                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//GETJOBNW DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*--------------------------------------------------------------------         
//STEP10   EXEC WTOG,COND=(0,NE)                                                
   ---->    BP13D515 COMPLETED, PLEASE CHECK BP13K766 IS AUTO-OPEN.             
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
