//BP13A650 JOB (BP13P),'BP13A650',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*====================================================================         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR PRINTING CONFIRMATION LETTERS (BTO/SBF)                     
//*====================================================================         
//* CHG-REF#  BY  DDMMCCYY DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP138104 AM25 30122019 NEW JOB STREAM                                       
//* BP138495 AM25 06112020 ADD STEP TO EXCLUDE PRINTING OF CASES                
//* BP138495 IL5  02112020 DEFINE NEW DATASET TO EXCLUDE INTERRACIAL            
//*                        LETTERS                                              
//* BP138591 AM25 26012021 ADD BP13C09Z FOR CCA LETTERS                         
//* BP139376 IL5  12012023 CHANGE IOMS SERVER FROM HDBIOMNFS TO                 
//*                        HDBIOM3NFSP1                                         
//*====================================================================         
//*--------------------------------------------------------------------         
//* DELETE SEQUENTIAL FILE                                                      
//*--------------------------------------------------------------------         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL (BP13.F730.MATURERQ.A650)                                              
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*--------------------------------------------------------------------         
//* REPRO VSAM FILE TO SEQUENTIAL FILE                                          
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F730.MATURERQ.A650,DISP=(NEW,CATLG),                     
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            SPACE=(CYL,(80,10),RLSE),DATACLAS=MULTIVOL                        
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*--------------------------------------------------------------------         
//* OMIT CANCELLED APPLICATIONS                                                 
//*--------------------------------------------------------------------         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A,29,2,A),FORMAT=CH                                      
    OMIT COND=(260,1,CH,EQ,C'C')                                                
//*--------------------------------------------------------------------         
//* SELECT LAST RECORD GEN FOR EACH APPL                                        
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=BP13CB14,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//P13F740B DD DSN=&&F730LAST,DISP=(,PASS),                                      
//            UNIT=(SYSDA,3),SPACE=(CYL,(48,10),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* UPDATE BALLOT CHANCES INTO BP13K730                                         
//*--------------------------------------------------------------------         
//STEP05   EXEC PGM=BP13CB19,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730LAST,DISP=(OLD,PASS)                                    
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* UPDATE BALLOT HOUSEHOLD INTO BP13K730                                       
//*--------------------------------------------------------------------         
//STEP06   EXEC PGM=BP13CF63,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730LAST,DISP=(OLD,PASS)                                    
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* MATCH REGN IF NOT MATCH, TO INCLUDE FOR PRINTING                            
//*--------------------------------------------------------------------         
//STEP06A  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&F730LAST,DISP=(OLD,PASS)                            00005003
//SORTJNF2 DD DSN=BP13.F730.BP13A650.EXCLUDE,DISP=SHR                   00006003
//UNMATCH  DD DSN=&&F730INC1,DISP=(,PASS),                                      
//            UNIT=(SYSDA,3),SPACE=(CYL,(48,10),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                    00009403
   JOINKEYS FILE=F2,FIELDS=(123,8,A)                                    00009503
   JOIN UNPAIRED,F1,F2                                                  00009503
   REFORMAT FIELDS=(?,F1:1,500)                                         00009703
   OPTION COPY                                                          00009703
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),BUILD=(1:2,500)      00009802
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*--------------------------------------------------------------------         
//* SEPARATE PRINTING FOR APPL MADE BEFORE 200710                               
//*--------------------------------------------------------------------         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=&&F730INC1,DISP=(OLD,DELETE)                                  
//SORTOUT1 DD DSN=&&F730STU,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE)                                
//SORTOUT2 DD DSN=&&F730OTH,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,1,CH,EQ,C'2',AND,                        
              (210,1,CH,EQ,C'F',OR,210,1,CH,EQ,C'S'))                           
   OUTFIL FNAMES=SORTOUT2,INCLUDE=(211,1,CH,NE,C'2',OR,                         
              (210,1,CH,NE,C'F',AND,210,1,CH,NE,C'S'))                          
//*--------------------------------------------------------------------         
//* SEPARATE PRINTING FOR CCA LETTERS                                           
//*--------------------------------------------------------------------         
//STEP07A  EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=&&F730OTH,DISP=(OLD,DELETE)                                   
//SORTOUT1 DD DSN=&&F730OTH1,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE)                                
//SORTOUT2 DD DSN=&&F730CCA,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,2,CH,NE,C'1F')                           
   OUTFIL FNAMES=SORTOUT2,INCLUDE=(211,2,CH,EQ,C'1F')                           
//*--------------------------------------------------------------------         
//* REFORMAT F730 TO GET DTE-DEBAR FOR MATCHING REGNO FROM BP13CH14             
//*--------------------------------------------------------------------         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&F730OTH1,DISP=(OLD,DELETE)                          00005003
//SORTJNF2 DD DSN=BP13.FH14.BP13A601,DISP=SHR                           00006003
//OUTPUT   DD DSN=&&F730OTH2,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                    00009403
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                      00009503
   JOIN UNPAIRED,F1                                                     00009503
   REFORMAT FIELDS=(F2:35,10,F1:11,490)                                 00009703
   OPTION COPY                                                          00009703
   OUTFILE FNAMES=OUTPUT                                                00009802
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*--------------------------------------------------------------------         
//* GENERATE CONFIRMATION LETTERS RAW-DATA USING IOMS                           
//*--------------------------------------------------------------------         
//STEP09   EXEC PGM=BP13C07Z,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730OTH2,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13B7ZXY DD DSN=BP13.FIOMSB10.A650C07Z.BP13XY,DISP=OLD                        
//P13H7ZXY DD DSN=BP13.FIOMSH10.A650C07Z.BP13XY,DISP=OLD                        
//P13B7ZY1 DD DSN=BP13.FIOMSB10.A650C07Z.BP13Y1,DISP=OLD                        
//P13H7ZY1 DD DSN=BP13.FIOMSH10.A650C07Z.BP13Y1,DISP=OLD                        
//P13B7ZBD DD DSN=BP13.FIOMSB10.A650C07Z.BP13BD,DISP=OLD                        
//P13H7ZBD DD DSN=BP13.FIOMSH10.A650C07Z.BP13BD,DISP=OLD                        
//P13B7ZYT DD DSN=BP13.FIOMSB10.A650C07Z.BP13YT,DISP=OLD                        
//P13H7ZYT DD DSN=BP13.FIOMSH10.A650C07Z.BP13YT,DISP=OLD                        
//P13B7ZXT DD DSN=BP13.FIOMSB10.A650C07Z.BP13XT,DISP=OLD                        
//P13H7ZXT DD DSN=BP13.FIOMSH10.A650C07Z.BP13XT,DISP=OLD                        
//P13B7ZYM DD DSN=BP13.FIOMSB10.A650C07Z.BP13YM,DISP=OLD                        
//P13H7ZYM DD DSN=BP13.FIOMSH10.A650C07Z.BP13YM,DISP=OLD                        
//P13B7ZAI DD DSN=BP13.FIOMSB10.A650C07Z.BP13AI,DISP=OLD                        
//P13H7ZAI DD DSN=BP13.FIOMSH10.A650C07Z.BP13AI,DISP=OLD                        
//P13B7ZAS DD DSN=BP13.FIOMSB10.A650C07Z.BP13AS,DISP=OLD                        
//P13H7ZAS DD DSN=BP13.FIOMSH10.A650C07Z.BP13AS,DISP=OLD                        
//P13B7Z77 DD DSN=BP13.FIOMSB10.A650C07Z.BP1377,DISP=OLD                        
//P13H7Z77 DD DSN=BP13.FIOMSH10.A650C07Z.BP1377,DISP=OLD                        
//P13B7ZYX DD DSN=BP13.FIOMSB10.A650C07Z.BP13YX,DISP=OLD                        
//P13H7ZYX DD DSN=BP13.FIOMSH10.A650C07Z.BP13YX,DISP=OLD                        
//P13B7ZXQ DD DSN=BP13.FIOMSB10.A650C07Z.BP13XQ,DISP=OLD                        
//P13H7ZXQ DD DSN=BP13.FIOMSH10.A650C07Z.BP13XQ,DISP=OLD                        
//P13B7ZYR DD DSN=BP13.FIOMSB10.A650C07Z.BP13YR,DISP=OLD                        
//P13H7ZYR DD DSN=BP13.FIOMSH10.A650C07Z.BP13YR,DISP=OLD                        
//P13B7Z74 DD DSN=BP13.FIOMSB10.A650C07Z.BP1374,DISP=OLD                        
//P13H7Z74 DD DSN=BP13.FIOMSH10.A650C07Z.BP1374,DISP=OLD                        
//P13B7Z76 DD DSN=BP13.FIOMSB10.A650C07Z.BP1376,DISP=OLD                        
//P13H7Z76 DD DSN=BP13.FIOMSH10.A650C07Z.BP1376,DISP=OLD                        
//P13B7Z7I DD DSN=BP13.FIOMSB10.A650C07Z.BP137I,DISP=OLD                        
//P13H7Z7I DD DSN=BP13.FIOMSH10.A650C07Z.BP137I,DISP=OLD                        
//P13B7ZYW DD DSN=BP13.FIOMSB10.A650C07Z.BP13YW,DISP=OLD                        
//P13H7ZYW DD DSN=BP13.FIOMSH10.A650C07Z.BP13YW,DISP=OLD                        
//P13B7ZXS DD DSN=BP13.FIOMSB10.A650C07Z.BP13XS,DISP=OLD                        
//P13H7ZXS DD DSN=BP13.FIOMSH10.A650C07Z.BP13XS,DISP=OLD                        
//P13B7ZYQ DD DSN=BP13.FIOMSB10.A650C07Z.BP13YQ,DISP=OLD                        
//P13H7ZYQ DD DSN=BP13.FIOMSH10.A650C07Z.BP13YQ,DISP=OLD                        
//P13B7Z7F DD DSN=BP13.FIOMSB10.A650C07Z.BP137F,DISP=OLD                        
//P13H7Z7F DD DSN=BP13.FIOMSH10.A650C07Z.BP137F,DISP=OLD                        
//P13B7Z7H DD DSN=BP13.FIOMSB10.A650C07Z.BP137H,DISP=OLD                        
//P13H7Z7H DD DSN=BP13.FIOMSH10.A650C07Z.BP137H,DISP=OLD                        
//P13B7ZBC DD DSN=BP13.FIOMSB10.A650C07Z.BP13BC,DISP=OLD                        
//P13H7ZBC DD DSN=BP13.FIOMSH10.A650C07Z.BP13BC,DISP=OLD                        
//P13B7ZYS DD DSN=BP13.FIOMSB10.A650C07Z.BP13YS,DISP=OLD                        
//P13H7ZYS DD DSN=BP13.FIOMSH10.A650C07Z.BP13YS,DISP=OLD                        
//P13B7ZXK DD DSN=BP13.FIOMSB10.A650C07Z.BP13XK,DISP=OLD                        
//P13H7ZXK DD DSN=BP13.FIOMSH10.A650C07Z.BP13XK,DISP=OLD                        
//P13B7ZYL DD DSN=BP13.FIOMSB10.A650C07Z.BP13YL,DISP=OLD                        
//P13H7ZYL DD DSN=BP13.FIOMSH10.A650C07Z.BP13YL,DISP=OLD                        
//P13B7ZAH DD DSN=BP13.FIOMSB10.A650C07Z.BP13AH,DISP=OLD                        
//P13H7ZAH DD DSN=BP13.FIOMSH10.A650C07Z.BP13AH,DISP=OLD                        
//P13B7ZAM DD DSN=BP13.FIOMSB10.A650C07Z.BP13AM,DISP=OLD                        
//P13H7ZAM DD DSN=BP13.FIOMSH10.A650C07Z.BP13AM,DISP=OLD                        
//P13B7ZBE DD DSN=BP13.FIOMSB10.A650C07Z.BP13BE,DISP=OLD                        
//P13H7ZBE DD DSN=BP13.FIOMSH10.A650C07Z.BP13BE,DISP=OLD                        
//P13B7ZYU DD DSN=BP13.FIOMSB10.A650C07Z.BP13YU,DISP=OLD                        
//P13H7ZYU DD DSN=BP13.FIOMSH10.A650C07Z.BP13YU,DISP=OLD                        
//P13B7ZXM DD DSN=BP13.FIOMSB10.A650C07Z.BP13XM,DISP=OLD                        
//P13H7ZXM DD DSN=BP13.FIOMSH10.A650C07Z.BP13XM,DISP=OLD                        
//P13B7ZYO DD DSN=BP13.FIOMSB10.A650C07Z.BP13YO,DISP=OLD                        
//P13H7ZYO DD DSN=BP13.FIOMSH10.A650C07Z.BP13YO,DISP=OLD                        
//P13B7ZAQ DD DSN=BP13.FIOMSB10.A650C07Z.BP13AQ,DISP=OLD                        
//P13H7ZAQ DD DSN=BP13.FIOMSH10.A650C07Z.BP13AQ,DISP=OLD                        
//P13B7ZAT DD DSN=BP13.FIOMSB10.A650C07Z.BP13AT,DISP=OLD                        
//P13H7ZAT DD DSN=BP13.FIOMSH10.A650C07Z.BP13AT,DISP=OLD                        
//P13B7ZEB DD DSN=BP13.FIOMSB10.A650C07Z.BP13EB,DISP=OLD                        
//P13H7ZEB DD DSN=BP13.FIOMSH10.A650C07Z.BP13EB,DISP=OLD                        
//P13B7ZYV DD DSN=BP13.FIOMSB10.A650C07Z.BP13YV,DISP=OLD                        
//P13H7ZYV DD DSN=BP13.FIOMSH10.A650C07Z.BP13YV,DISP=OLD                        
//P13B7ZXO DD DSN=BP13.FIOMSB10.A650C07Z.BP13XO,DISP=OLD                        
//P13H7ZXO DD DSN=BP13.FIOMSH10.A650C07Z.BP13XO,DISP=OLD                        
//P13B7ZYP DD DSN=BP13.FIOMSB10.A650C07Z.BP13YP,DISP=OLD                        
//P13H7ZYP DD DSN=BP13.FIOMSH10.A650C07Z.BP13YP,DISP=OLD                        
//P13B7ZAR DD DSN=BP13.FIOMSB10.A650C07Z.BP13AR,DISP=OLD                        
//P13H7ZAR DD DSN=BP13.FIOMSH10.A650C07Z.BP13AR,DISP=OLD                        
//P13B7ZEA DD DSN=BP13.FIOMSB10.A650C07Z.BP13EA,DISP=OLD                        
//P13H7ZEA DD DSN=BP13.FIOMSH10.A650C07Z.BP13EA,DISP=OLD                        
//BP13FTP  DD DSN=BP13.FIOMSFTP.A650C07Z,DISP=OLD                               
//P13L07ZA DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZB DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZC DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZD DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZE DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZF DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZG DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZH DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZI DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZJ DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZK DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZL DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZM DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZN DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZO DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZP DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZQ DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZR DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZS DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZT DD SYSOUT=8,DEST=IOM8                                                
//P13L07ZZ DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
BP13A650                                                                        
BP13.FIOMSB10.A650C07Z                                                          
BP13.FIOMSH10.A650C07Z                                                          
//*--------------------------------------------------------------------         
//* SORT F730 FILE                                                              
//*--------------------------------------------------------------------         
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730STU,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F730STU1,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(50,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*--------------------------------------------------------------------         
//* GENERATE CONFIRMATION LETTERS RAW-DATA USING IOMS                           
//* 2-ROOM FLEXI FLAT ONLY                                                      
//*--------------------------------------------------------------------         
//STEP11   EXEC PGM=BP13C08Z,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730STU1,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13B8Z5P DD DSN=BP13.FIOMSB10.A650C08Z.BP135P,DISP=OLD                        
//P13H8Z5P DD DSN=BP13.FIOMSH10.A650C08Z.BP135P,DISP=OLD                        
//P13B8ZES DD DSN=BP13.FIOMSB10.A650C08Z.BP13ES,DISP=OLD                        
//P13H8ZES DD DSN=BP13.FIOMSH10.A650C08Z.BP13ES,DISP=OLD                        
//P13B8Z5J DD DSN=BP13.FIOMSB10.A650C08Z.BP135J,DISP=OLD                        
//P13H8Z5J DD DSN=BP13.FIOMSH10.A650C08Z.BP135J,DISP=OLD                        
//P13B8ZEU DD DSN=BP13.FIOMSB10.A650C08Z.BP13EU,DISP=OLD                        
//P13H8ZEU DD DSN=BP13.FIOMSH10.A650C08Z.BP13EU,DISP=OLD                        
//P13B8ZEW DD DSN=BP13.FIOMSB10.A650C08Z.BP13EW,DISP=OLD                        
//P13H8ZEW DD DSN=BP13.FIOMSH10.A650C08Z.BP13EW,DISP=OLD                        
//P13B8ZBQ DD DSN=BP13.FIOMSB10.A650C08Z.BP13BQ,DISP=OLD                        
//P13H8ZBQ DD DSN=BP13.FIOMSH10.A650C08Z.BP13BQ,DISP=OLD                        
//BP13FTP  DD DSN=BP13.FIOMSFTP.A650C08Z,DISP=OLD                               
//P13L08ZA DD SYSOUT=8,DEST=IOM8                                                
//P13L08ZB DD SYSOUT=8,DEST=IOM8                                                
//P13L08ZC DD SYSOUT=8,DEST=IOM8                                                
//P13L08ZD DD SYSOUT=8,DEST=IOM8                                                
//P13L08ZE DD SYSOUT=8,DEST=IOM8                                                
//P13L08ZF DD SYSOUT=8,DEST=IOM8                                                
//P13L08ZZ DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
BP13A650                                                                        
BP13.FIOMSB10.A650C08Z                                                          
BP13.FIOMSH10.A650C08Z                                                          
//*--------------------------------------------------------------------         
//* SORT F730 FILE                                                              
//*--------------------------------------------------------------------         
//STEP11A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CCA,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F730CCA1,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(50,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*--------------------------------------------------------------------         
//* GENERATE CONFIRMATION LETTERS RAW-DATA USING IOMS                           
//* COMMUNITY CARE APARTMENT ONLY                                               
//*--------------------------------------------------------------------         
//STEP11B  EXEC PGM=BP13C09Z,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730CCA1,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13B9ZP1 DD DSN=BP13.FIOMSB10.A650C09Z.BP13P1,DISP=OLD                        
//P13H9ZP1 DD DSN=BP13.FIOMSH10.A650C09Z.BP13P1,DISP=OLD                        
//P13B9ZJ1 DD DSN=BP13.FIOMSB10.A650C09Z.BP13J1,DISP=OLD                        
//P13H9ZJ1 DD DSN=BP13.FIOMSH10.A650C09Z.BP13J1,DISP=OLD                        
//P13B9ZG1 DD DSN=BP13.FIOMSB10.A650C09Z.BP13G1,DISP=OLD                        
//P13H9ZG1 DD DSN=BP13.FIOMSH10.A650C09Z.BP13G1,DISP=OLD                        
//P13B9ZB1 DD DSN=BP13.FIOMSB10.A650C09Z.BP13B1,DISP=OLD                        
//P13H9ZB1 DD DSN=BP13.FIOMSH10.A650C09Z.BP13B1,DISP=OLD                        
//BP13FTP  DD DSN=BP13.FIOMSFTP.A650C09Z,DISP=OLD                               
//P13L09ZA DD SYSOUT=8,DEST=IOM8                                                
//P13L09ZB DD SYSOUT=8,DEST=IOM8                                                
//P13L09ZC DD SYSOUT=8,DEST=IOM8                                                
//P13L09ZD DD SYSOUT=8,DEST=IOM8                                                
//P13L09ZZ DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
BP13A650                                                                        
BP13.FIOMSB10.A650C09Z                                                          
BP13.FIOMSH10.A650C09Z                                                          
//*--------------------------------------------------------------------         
//* GENERATE REPORT BP13L037                                                    
//*--------------------------------------------------------------------         
//STEP12   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                   
//BP13F730 DD DSN=&&F730LAST,DISP=(OLD,PASS)                                    
//BP13L037 DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S037),DISP=SHR                             
//*--------------------------------------------------------------------         
//* MATCH REGN IF NOT MATCH, TO INCLUDE FOR PRINTING                            
//*--------------------------------------------------------------------         
//STEP12A  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&F730LAST,DISP=(OLD,DELETE)                          00005003
//SORTJNF2 DD DSN=BP13.F730.BP13A650.EXCLUDE.INTRRCL,DISP=SHR           00006003
//UNMATCH  DD DSN=&&F730INC2,DISP=(,PASS),                                      
//            UNIT=(SYSDA,3),SPACE=(CYL,(48,10),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                    00009403
   JOINKEYS FILE=F2,FIELDS=(123,8,A)                                    00009503
   JOIN UNPAIRED,F1,F2                                                  00009503
   REFORMAT FIELDS=(?,F1:1,500)                                         00009703
   OPTION COPY                                                          00009703
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),BUILD=(1:2,500)      00009802
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*--------------------------------------------------------------------         
//* GENERATE INTER-RACIAL LETTERS RAW-DATA USING IOMS                           
//*--------------------------------------------------------------------         
//STEP13   EXEC PGM=BP13CJ01,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730INC2,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR,                                       
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13FB10 DD DSN=BP13.FIOMSB10.A650CJ01,DISP=OLD                               
//BP13FH10 DD DSN=BP13.FIOMSH10.A650CJ01,DISP=OLD                               
//BP13FTP  DD DSN=BP13.FIOMSFTP.A650CJ01,DISP=OLD                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
BP13A650                                                                        
BP13.FIOMSB10.A650CJ01                                                          
BP13.FIOMSH10.A650CJ01                                                          
//*====================================================================         
//* STEP TO FTP SEQUENTIAL FILES TO IOMS SERVER                                 
//*====================================================================         
//*--------------------------------------------------------------------         
//* PRINT CONFIRMATION LETTERS                                                  
//*--------------------------------------------------------------------         
//PS0900A EXEC FTP,PARM='HDBIOM3NFSP1 (EXIT',COND=(0,NE)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.FIOMSFTP.A650C07Z,DISP=SHR                               
//*--------------------------------------------------------------------         
//* PRINT CONFIRMATION LETTERS - 2-ROOM FLEXI FLAT                              
//*--------------------------------------------------------------------         
//PS0900B EXEC FTP,PARM='HDBIOM3NFSP1 (EXIT',COND=(0,NE)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.FIOMSFTP.A650C08Z,DISP=SHR                               
//*--------------------------------------------------------------------         
//* PRINT INTER-RACIAL LETTERS                                                  
//*--------------------------------------------------------------------         
//PS0900C EXEC FTP,PARM='HDBIOM3NFSP1 (EXIT',COND=(0,NE)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.FIOMSFTP.A650CJ01,DISP=SHR                               
//*--------------------------------------------------------------------         
//* PRINT CONFIRMATION LETTERS - COMMUNITY CARE APARTMENT                       
//*--------------------------------------------------------------------         
//PS0900D EXEC FTP,PARM='HDBIOM3NFSP1 (EXIT',COND=(0,NE)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.FIOMSFTP.A650C09Z,DISP=SHR                               
//*--------------------------------------------------------------------         
//*                      END OF JOB                                             
//*--------------------------------------------------------------------         
