//BP13WBK3 JOB (BP13P),'BP13WBK3',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//*====================================================================*        
//* BP130487 SSS 980507 - CHG UNIT=3480 TO UNIT=CART                            
//* BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//*====================================================================*        
//* REPRO SOCHIST FILE TO WEEKLY CARTRIDGE - 5 GDG                              
//*====================================================================*        
//STEP1    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                  
//             AMP=('BUFND=33')                                                 
//OUTPUT1   DD DSN=BP13.F130.SOCHIST.WEEK(+1),                                  
//             DISP=(NEW,PASS,DELETE),                                          
//             UNIT=CART,LABEL=(,SL),                                           
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=150,RECFM=FB)                  
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*---------------------------------------------------------------------        
//*  CATALOG GDG                                                                
//*---------------------------------------------------------------------        
//STEP2     EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT2    DD DSN=BP13.F130.SOCHIST.WEEK(+1),DISP=(OLD,CATLG),                 
//             UNIT=(,,DEFER)                                                   
//*--------------------------------------------------------------------------   
//*  SORT EX-APPL FILE TO TEMP FILE                                             
//*---------------------------------------------------------------------------  
//STEP3    EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F150.EXAPPL,DISP=SHR                                     
//SORTOUT  DD DSN=&&TEMP1,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400),                           
//            SPACE=(TRK,(10,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*--------------------------------------------------------------------------   
//*  DELETE DEFINE EX-APPL FILE                                                 
//*---------------------------------------------------------------------------  
//STEP4    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT3   DD DSN=&&TEMP1,DISP=(OLD,PASS,DELETE)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K150.EXAPPL) CL PURGE                                        
         DEF CL (NAME(BP13.K150.EXAPPL)   -                                     
                 TRK(5 2)                 -                                     
                 UNIQUE                   -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 SHR(2 3))                -                                     
                 DATA                     -                                     
                 (NAME(BP13.K150.EXAPPL.DATA) -                                 
                 KEYS(17 0)              -                                      
                 RECSZ(150 150)           -                                     
                 CISZ(4096))              -                                     
                 INDEX                    -                                     
                 (NAME(BP13.K150.EXAPPL.INDEX) -                                
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN               -                                     
           REPRO IFILE(INPUT3)            -                                     
                 ODS(BP13.K150.EXAPPL)                                          
