//BP13Y723 JOB (BP13P),'BP13Y723',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* FILE FROM EC DEVELOPER                                                      
//* UPDATE DBSS S&P TO BP13KD15, BP18K300 FRESH SALES AGREEMENT DATE            
//*=================================================================            
//*=================================================================            
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F032.SNPDATE,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F032,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(TRK,(30,30),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*-------------------------------------------------------------------*         
//* UPDATE DTE-SNP                                                              
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=BP13CD9A,COND=(0,NE)                                        
//BP13F032 DD DSN=&&BP13F032,DISP=(OLD,PASS)                                    
//BP13KD15 DD DSN=BP13.KD15.DBSSTP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD11 DD DSN=BP13.KD15.DBSSTP.PATH1,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD17 DD DSN=BP13.KD15.DBSSTP.PATH2,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP18K300 DD DSN=BP18.K300.MASTER,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
