//BP13D221 JOB (BP13P),'BP13D221',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*================================================================== *         
//* JCL TO DETERMINE PURE SECOND TIMER HARDLUCK                                 
//* FT HARDLUCK = BP13.F595.SOCNOTFD.AFQUE.AY0H, OUTPUT IN JOB BP13D22C         
//* FT/2T HARDLUCK = BP13.F595.AY0J.RDBCHK, OUTPUT IN JOB BP13D22G              
//* 2T HARDLUCK FILE = BP13.F595.AY0J.PURE2T, OUTPUT IN JOB BP13D221            
//*================================================================== *         
//* BP135237 LSB 101013 - NEW JCL                                               
//* BP136160 SMR 110316 OUTREC HOUSEHOLD, BALLOT-HH & FT2T TO BP13F007          
//* BP136866 LSB 140817 BYPASS NTIMER, STS, SSE, NSE, JSE                       
//*-BP137958 KV6 310719 DELETE INLCUDE COND (COL 487)IN STEP05 & STEP09         
//*-BP139512 LSB 010323 ADD DATACLAS=MULTIVOL                                   
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = YJ                                  
//* OUTREC TO OPTION = UG                                                       
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K20H.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB),DATACLAS=MULTIVOL                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YJ')                                               
  OUTREC FIELDS=(1,13,C'UG',16,65)                                              
//*================================================================== *         
//* ALL SECOND TIME FILE                                                        
//* OMIT BALLOT-HOUSEHOLD = N-TIMER                                             
//* SECOND TIMER ELDERLY                                                        
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0J,DISP=SHR                        
//SORTOUT  DD DSN=&&F595UPG,DISP=(NEW,PASS),                                    
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                          
//         SPACE=(CYL,(180,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  OMIT COND=(209,1,CH,EQ,C'Y',OR,                                               
             213,3,CH,EQ,C'STS',OR,                                             
             248,3,CH,EQ,C'SSE',OR,                                             
             248,3,CH,EQ,C'JSE',OR,                                             
             248,3,CH,EQ,C'NSE')                                                
//*---------------------------------------------------------------------        
//* SECOND TIMER UPDATE AS FT2T                                                 
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.AY0J.RDBCHK,DISP=SHR                                
//SORTOUT  DD DSN=&&K595FT2T,DISP=(NEW,PASS),                                   
//         UNIT=(SYSDA,3),                                                      
//         DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                          
//         SPACE=(CYL,(180,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
//*-------------------------------------------------------------------*         
//* MATCH TO GET PURE 2T                                                        
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=BP13CY20,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595UPG,DISP=(OLD,PASS)                                     
//BP13K595 DD DSN=&&K595FT2T,DISP=(OLD,PASS)                                    
//BP13F730 DD DSN=BP13.F595.AY0J.PURE2T,DISP=OLD                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* INCLUDE BTO COUNT > 00 BY NRIC                                              
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.AY0J.PURE2T,DISP=SHR                                 
//SORTOUT  DD DSN=&&F595CY89,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(100,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A),FORMAT=CH                                                
   INCLUDE COND=(467,2,CH,GE,C'01')                                             
//*-----------------------------------------------------------------            
//* SORT BY NRIC1/DTE-BALLOT/DTE-REQUEST                                        
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.AY0J.CY46,DISP=SHR                                   
//SORTOUT  DD DSN=&&F595QTR,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(180,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                                
//*-----------------------------------------------------------------            
//* PREFIX CONTROL RECORD = UG                                                  
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K20H.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&F205PURE,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB),DATACLAS=MULTIVOL                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  OUTREC FIELDS=(1,13,C'UG',16,65)                                              
//*---------------------------------------------------------------------        
//* CREATE HARDLUCK FILE, TRANS-TYPE = 3                                        
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13CY89,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595CY89,DISP=(OLD,PASS)                                    
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13F730 DD DSN=&&F595QTR,DISP=(OLD,PASS)                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F585 DD DSN=BP13.F585.PURE2T,DISP=SHR                                     
//BP13LY89 DD DSN=BP13.LY89.BP13CY89.AY0J.PURE2T,DISP=SHR                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*------------------------------------------------------------------           
//* SORT OUT HIGH ATTEMPT CASE                                                  
//* COL 487 - BYPASS REQUEST-STATUS=S                                           
//*------------------------------------------------------------------           
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.AY0J.PURE2T,DISP=SHR                                 
//SORTOUT DD DSN=&&BP13F007,DISP=(,PASS),                                       
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=200),                                             
//        SPACE=(CYL,(80,12),RLSE)                                              
//SYSIN   DD  *                                                                 
   SORT FIELDS=(470,2,A,123,8,A),FORMAT=CH                                      
   INCLUDE COND=(467,2,CH,GE,C'01')                                             
  OUTREC FIELDS=(41,9,123,8,82,9,376,3,187,3,211,2,213,3,3X,334,6,              
                225,1,116,1,461,1,475,1,150X)                                   
//*-----------------------------------------------------------------    00170000
//* PRINT PROFILE                                                       00180000
//*-----------------------------------------------------------------    00210000
//STEP10   EXEC  PGM=BP13CY90,COND=(0,NE)                               01360018
//BP13F007 DD  DSN=&&BP13F007,DISP=(OLD,PASS)                           00230001
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00240000
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                          00250000
//             AMP=('BUFND=4','BUFNI=8')                                00260000
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                            00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K585 DD  DSN=BP13.K585.HARDLUCK,DISP=SHR,                         00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K828 DD  DSN=BP13.K828.HISTOCCP,DISP=SHR,                         00330002
//             AMP=('BUFND=4','BUFNI=8')                                00340000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00350002
//             AMP=('BUFND=4','BUFNI=8')                                00360002
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                    00350002
//             AMP=('BUFND=4','BUFNI=8')                                00360002
//BP13K593 DD  DSN=BP13.K593.UNSUCCNT,DISP=SHR,                         00370008
//             AMP=('BUFND=4','BUFNI=8')                                00380006
//BP13K595 DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                               
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K591 DD  DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                         
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13F008 DD  DSN=BP13.F008.PURE2T,DISP=OLD                            00450005
//SUMMARY   DD SYSOUT=2                                                         
//SYSPRINT DD  SYSOUT=*                                                 01620002
//SYSOUT   DD  SYSOUT=*                                                 01630002
