//BP13D51B  JOB (BP13P),'BP13D51B',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//*=================================================================            
//* OBJECTIVE : DAILY JOB TO DELETE/DEFINE FILES REQUIRED FOR USE               
//*             IN THE INTERNET WHEN ORIGINAL FILES ARE CLOSED FOR              
//*             BATCH RUN - BP13K76F                                            
//*-----------------------------------------------------------------            
//* CHG REF   DATE       BY    DESCRIPTION                                      
//* ========  ========== ====  ===========                                      
//* BP135144  20/11/2013 CCC5  ADD THIS JCL                                     
//* BP139207  16/06/2022 PP11  AUTO OPENING FILE.                               
//*=================================================================            
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                                   
//*-----------------------------------------------------------------            
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K76F.DEMAND.LIMIT.INET,DISP=OLD                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT FILE FOR BP13C76F INPUT                                                
//*---------------------------------------------------------------------        
//STEP06  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K76F.DEMAND.LIMIT,DISP=SHR                                
//SORTOUT DD DSN=&&BP13K76F,                                                    
//           DISP=(,PASS),                                                      
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(5,5),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                 
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,14,A),FORMAT=CH                                               
/*                                                                              
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=&&BP13K76F,DISP=(OLD,PASS)                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL (BP13.K76F.DEMAND.LIMIT.INET) CL PURGE                            
          DEF CLUSTER                                -                          
              (NAME(BP13.K76F.DEMAND.LIMIT.INET)          -                     
              CYL(10 5)                              -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K76F.DEMAND.LIMIT.INET.DATA)     -                     
              KEYS(14 0)                             -                          
              RECSZ(100 100)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K76F.DEMAND.LIMIT.INET.INDEX))                         
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K76F.DEMAND.LIMIT.INET)         -                          
            REUSE                                                               
/*                                                                              
//*-------------------------------------------------------------------*         
//* AUTO-OPEN FILES                                                   *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC PGM=IKJEFT01,PARM='OPNFILE',COND=(0,NE)                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//GETJOBNW DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC WTOG,COND=(0,NE)                                                
   ---->    BP13D51B COMPLETED, PLEASE CHECK BP13K76G IS AUTO-OPEN.             
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
