//BP13A555 JOB (BP13P),'BP13A555',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR CANCELLING THE WIS CASES AND PRINTING THE LETTER            
//******************************************************************            
//*CHG REF  OIC   DATE    DESCRIPTION                                           
//*-------- ---- -------- -----------                                           
//*BP132370 CKK7 30072003 NEW JCL FOR CANCELLATION OF WIS & 3R CASES            
//*BP132577 SK   20082004 INCLUDE BP13F915 IN BP13C381                          
//*BP133508 ESA1 15012009 CATER FOR DNS,NF AND NC LETTER                        
//*****************************************************************             
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY(FORM TO CATER FOR DNS LETTER UNDER 3R)                
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1B CP-1',END;                                    
1$DJDE$ JDE=13POT1,JDL=BP13,FORMS=BP13E5,END;                                   
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAP1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*****************************************************************             
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY(FORM TO CATER FOR NC LETTER UNDER 3R)                 
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1B CP-1',END;                                    
1$DJDE$ JDE=13POT1,JDL=BP13,FORMS=BP13E3,END;                                   
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAP1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*****************************************************************             
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY(FORM TO CATER FOR NF LETTER UNDER 3R)                 
//*-----------------------------------------------------------------            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1B CP-1',END;                                    
1$DJDE$ JDE=13POT1,JDL=BP13,FORMS=BP13E4,END;                                   
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAP1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY(FORM TO CATER FOR DNS LETTER UNDER SA)                
//*-----------------------------------------------------------------            
//PRT05  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1B CP-1',END;                                    
1$DJDE$ JDE=13POT1,JDL=BP13,FORMS=BP13E8,END;                                   
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAP1B                                   
//SYSUT2   DD  SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY(FORM TO CATER FOR NC LETTER UNDER SA)                 
//*-----------------------------------------------------------------            
//PRT06    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1B CP-1',END;                                    
1$DJDE$ JDE=13POT1,JDL=BP13,FORMS=BP13E6,END;                                   
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAP1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*****************************************************************             
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY(FORM TO CATER FOR NF LETTER UNDER SA)                 
//*-----------------------------------------------------------------            
//PRT07    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1B CP-1',END;                                    
1$DJDE$ JDE=13POT1,JDL=BP13,FORMS=BP13E7,END;                                   
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAP1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*****************************************************************             
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY(FORM TO CATER FOR DNS LETTER UNDER WIH)               
//*-----------------------------------------------------------------            
//PRT08    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1B CP-1',END;                                    
1$DJDE$ JDE=13POT1,JDL=BP13,FORMS=BP13E2,END;                                   
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAP1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY(FORM TO CATER FOR NC LETTER UNDER WIH)                
//*-----------------------------------------------------------------            
//PRT09    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1B CP-1',END;                                    
1$DJDE$ JDE=13POT1,JDL=BP13,FORMS=BP13E0,END;                                   
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAP1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*****************************************************************             
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY(FORM TO CATER FOR NF LETTER UNDER WIH)                
//*-----------------------------------------------------------------            
//PRT10    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1B CP-1',END;                                    
1$DJDE$ JDE=13POT1,JDL=BP13,FORMS=BP13E1,END;                                   
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAP1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K800.APPLN,DISP=OLD                                     
//INPUT2   DD  DSN=BP13.K810.WAITHIST,DISP=OLD                                  
//INPUT3   DD  DSN=BP13.K848.BKIMAGE,DISP=OLD                                   
//INPUT4   DD  DSN=BP13.K840.APPLHIST,DISP=OLD                                  
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
/*                                                                              
//*****************************************************************             
//* SORT OUT WIS OR 3R CASES THAT HAS NOT BOOKED A FLAT AND NOT CANCEL          
//*****************************************************************             
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//             UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                            
//             SPACE=(CYL,(30,20),RLSE)                                         
//SYSIN    DD  *                                                                
        SORT FIELDS=(4,8,A),FORMAT=CH                                           
        INCLUDE COND=(1,1,CH,NE,C'C',AND,                                       
                      155,11,CH,EQ,C'           ',AND,                          
                      (924,2,CH,EQ,C'WI',OR,924,3,CH,EQ,C'3R '))                
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION S1/S2 - CANCELLATION OF WIS/3R APPLICATION              
//*--------------------------------------------------------------------         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&F205,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=80),                                             
//        SPACE=(CYL,(5,2),RLSE)                                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'S1',OR,                                           
                 14,2,CH,EQ,C'S2',OR,                                           
                 14,2,CH,EQ,C'S3')                                              
//*****************************************************************             
//* TO CANCEL WIS OR 3R APPLICATION THAT DID NOT BOOK FLAT                      
//* REPORT AND CANCELLATION LETTER WILL BE PRINTED                              
//*****************************************************************             
//STEP04   EXEC PGM=BP13C381,COND=(0,NE)                                        
//BP13F205 DD DSN=&&F205,DISP=(OLD,PASS)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                 
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR                                   
//BP13K810 DD DSN=BP13.K810.WAITHIST,DISP=SHR                                   
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR                                    
//BP13F915 DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                   
//P13L381A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L381B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L381C DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                        
//P13L381D DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                        
//P13L381E DD SYSOUT=W,OUTPUT=(*.PRT04.FORMID),DEST=IOMW                        
//P13L381F DD SYSOUT=W,OUTPUT=(*.PRT05.FORMID),DEST=IOMW                        
//P13L381G DD SYSOUT=W,OUTPUT=(*.PRT06.FORMID),DEST=IOMW                        
//P13L381H DD SYSOUT=W,OUTPUT=(*.PRT07.FORMID),DEST=IOMW                        
//P13L381I DD SYSOUT=W,OUTPUT=(*.PRT08.FORMID),DEST=IOMW                        
//P13L381J DD SYSOUT=W,OUTPUT=(*.PRT09.FORMID),DEST=IOMW                        
//P13L381K DD SYSOUT=W,OUTPUT=(*.PRT10.FORMID),DEST=IOMW                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP05 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&F205,DISP=(OLD,PASS)                                       
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,DISP=MOD                                     
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A555                                                                
//*---------------------------------------------------------------------        
