//BP13A224 JOB (BP13P),'BP13A224',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* CHG REF  BY       ON   DESCRIPTION                                          
//* -------- -------- ---- -----------                                          
//* BP130857 20000626 SSS  ADD GROUPID                                          
//* BP130956 20001127 AKT  CHGE BP13K230 LRECL FROM 130 TO 250                  
//* BP132111 20020702 MTD  ADD P13F230B DDNAME                                  
//* BP132278 20030328 JF4  CHGE BP13F230/F240 LRECL TO 450.                     
//* BP132452 20031229 MJ16 INCLUDED NEW PGM BP13C207 TO UPDATE BB14K500         
//*                        & BB14K580                                           
//* BP133610 20090529 ESA1 TO REPLACE BP13K767 WITH BP13K816                    
//* BP133851 20100312 ESA1 TO ADD READING OF BP13KQ30 IN BP13C227               
//* BP134086 20101230 ESD1 CATER TO STOP SENDING TXT TO MEDIACORP               
//*                        PERMANENTLY.                                         
//* BP134521 20120405 ESA1 TO ADD READING OF BM06K100 IN BP13C227               
//* BP134587 20120702 ESA1 TO ADD READING OF BP13KQ50 IN BP13C227               
//*********************************************************************         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR UPDATING OF BOOKING APPMT DATE AND TIME FOR                 
//* MATURE NEW TOWNS ONLY (BOOKING EXERCISE ON NEW TOWN BASIS).                 
//*********************************************************************         
//******************************************************************            
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                           
//*---------------------------------------------------------------------        
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=800,RECFM=FB)                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(559,2,A,546,2,A,291,8,A,544,2,A,23,5,A,1,11,A),               
          FORMAT=CH                                                             
     SUM FIELDS=NONE                                                            
/*                                                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F230.BP13A202                                        
//*--------------------------------------------------------------------         
//STEP10A EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F230.BP13A224,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* REFORMAT THE FLATLIST FILE TO INTV FILE FORMAT                              
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=BP13C227,COND=(0,NE)                                       
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(OLD,PASS)                                                  
//BP13F205 DD  DSN=BP13.F205.APRNREC,                                           
//             DISP=SHR                                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                            
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//BP13KQ30 DD  DSN=BP13.KQ30.PAIR,                                              
//             DISP=SHR                                                         
//BP13KQ31 DD  DSN=BP13.KQ30.PAIR.PATH1,                                        
//             DISP=SHR                                                         
//BP13KQ50 DD  DSN=BP13.KQ50.GROUNIT,                                           
//             DISP=SHR                                                         
//BP13F230 DD  DSN=BP13.F230.BP13A224,                                          
//             DISP=SHR                                                         
//P13F230B DD  DUMMY                                                            
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE BB14K500 & BB14K580 BY LEASE-COMM-DTE AND DTE-UNIT-DELIVERY          
//*---------------------------------------------------------------------        
//STEP03A EXEC    PGM=BP13C207,COND=(0,NE)                                      
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(OLD,PASS)                                                  
//BP13F205 DD  DSN=BP13.F205.APRNREC,                                           
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BB14K580 DD  DSN=BB14.K580.UNTLEASE,                                          
//             DISP=SHR                                                         
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,                                          
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP12 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.APRNREC,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A224                                                                
//*---------------------------------------------------------------------        
