//BP13AMTF JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*    --- NON-MATURE NEW TOWN ---                             *                
//*    PIGEONHOLING OF PRIORITY REQUEST - MTF/TCP/REN/RH/JB/RDC*                
//*                                                            *                
//*    NOT THE DIFFERENCE                                      *                
//*    - TENDER PROGRAM ONLY HAVE NEW FLAT SUPPLY              *                
//*    - SORT OUT ONLY PRIORITY CASES FOR PIGEONHOLING         *                
//*    - AFTER PIGEONHOLING, ALLOW UNSUCC PRIORITY CASES TO    *                
//*      JOIN PUBLIC SCHEME IN PA PIGEONHOLING                 *                
//*    - PRINT SUMMARY RESULT ON PRIORITY CASES                *                
//**************************************************************                
//* CHG REF  BY  ON      DESCRIPTION                                            
//* -------- --- ------  ----------                                             
//* BP130652 SRA 991014  EXPAND F520 RECL FROM 300 TO 500                       
//* BP130871 SSS 000608  LISTING TO EAALSS                                      
//* BP132317 ROM 030315  CHG FOR BTO SORT BY RANDOM-NO                          
//* BP132412 CKK 031006  USE BP13U734 AS PIGEOHOLING PROGRAM                    
//* BP132596 LSB 040920  C524 PRINT FOR 3,4,5 FLAT                              
//* BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                               
//**************************************************************                
//* STEP    DESCRIPTION                                        *                
//* -----   ------------------------------------------------   *                
//* 00-01   LASER PRINTER JCL                                  *                
//* 02      = BACKUP TENDER AND BALLOT FILE                    *                
//* 03 - 04 = SORTING OUT REQUESTS FOR SEPARATE ROUND OF       *                
//*                PIGEONHOLING, OUTPUT PRIORITY CASES ONLY    *                
//* 05 - 10 = PRINT FLAT SYPPLY REPORT BF PIGEONHOLING         *                
//* 11 - 12 = PROCESS PIGEONHOLING(BP13U734 PRIORITY ONLY)     *                
//* 13 - 18 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING         *                
//* 19      = MATCH RELEVANT REQUEST TO GET SUCC & UNSUCC      *                
//*                BALLOT RESULT FOR PRINT REPORT              *                
//* 20      = PRINT SUCC/UNSUCC SUMMARY REPORT BP13S522        *                
//* 21      = PRINT SUPPLY REGISTERED BY NHH/UPG               *                
//* 22 - 23 = BACKUP/ACCUM FILE                                *                
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K520.BALLOT,DISP=OLD                                     
//INPUT3   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT02 : COPIES = 2                                                         
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  BACKUP FILE BEFORE PIGEONHOLING                                            
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.PRIO,DISP=OLD                                
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.PRIO,DISP=SHR                              
//INPUT3   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F520.PIGEON,DISP=OLD                                     
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* OUTPUT FILES FOR SEPARATE PIGEONHOLING PROCESS, PRIORITY, TRANSITION        
//* NHH > 7 MTH, AND COHORTS ( MAX 5 )                                          
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C741,COND=(0,NE),ADDRSPC=VIRT,REGION=4096K              
//BP13F520 DD DSN=BP13.F520.PIGEON,DISP=SHR                                     
//BP13PR   DD DSN=BP13.F520.BALLOT.PRIO,DISP=OLD                                
//BP13GRO  DD DSN=BP13.F520.BALLOT.GRO,DISP=OLD                                 
//BP13MGP  DD  DUMMY                                                            
//BP13PUB  DD DSN=&&BP13PUB,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(50,5),RLSE)                                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010N,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010N,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 1A,2A,E  FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING            
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010D,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY FOR DESIGN AND BUILD FLATS IN TAP              
//* BEFORE PIGEON-HOLING                                                        
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010D,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT PRIORITY REQUEST BY SEQUENCE-NO/JB-PARENT-REGN/REGN-NO             
//* FOR NON-JB CASES, MOVE REGN-NO TO JB-PARENT-REGN-NO                         
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.BALLOT.PRIO,DISP=SHR                                
//SORTOUT  DD DSN=&&F520PRIO,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
//* SORT FIELDS=(131,8,A,155,8,A,123,8,A),FORMAT=CH                             
//*-----------------------------------------------------------------            
//* TO PROCESS PIGEON-HOLDING FOR PRIORITY CASES, THE PROGRAM WILL              
//* ONLY ALLOCATE THE PRIORITY SUPPLY QUOTA                                     
//* PRIO REQUEST INCLUDE MTF/TCP/RH/REN/JB IN NON-MATURE NT                     
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=BP13U734,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F520 DD DSN=&&F520PRIO,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=OLD,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=OLD,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L734 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L734A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*-----------------------------------------------------------------            
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP14   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&K010AFN,DISP=(OLD,PASS)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 1A,2A,E  FLATS TO PRINT FLAT SUPPLY AFTER  PIGEONHOLING            
//*-----------------------------------------------------------------            
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFD,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY FOR DESIGN AND BUILD FLATS IN TAP              
//* AFTER  PIGEON-HOLING                                                        
//*-----------------------------------------------------------------            
//STEP16   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&K010AFD,DISP=(OLD,PASS)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* REPRO BALLOT FILE TO SEQUENTIAL FILE FOR MATCHING BP13C817                  
//*-----------------------------------------------------------------            
//STEP19   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT5  DD DSN=&&F520BALT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(130,20),RLSE),                             
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
//*-----------------------------------------------------------------            
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*-----------------------------------------------------------------            
//STEP20   EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=BP13.F520.BALLOT.PRIO,DISP=SHR                                
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,PASS)                                    
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT SUMMARY BALLOT RESULT FOR EACH PRIORITY SCHEME                        
//*-----------------------------------------------------------------            
//STEP20   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//P13FSUCC DD  DSN=&&P13SUCC,DISP=(OLD,PASS)                                    
//P13FUNSC DD  DSN=&&P13UNSUC,DISP=(OLD,PASS)                                   
//PRIOFMT  DD  DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT42F001 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                            
//*-----------------------------------------------------------------            
//* PRINT REPORTS ON FLAT ALLOCATED/REGISTERED FOR NHH/UPG                      
//*-----------------------------------------------------------------            
//STEP21   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L552 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP22   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER(+1),DISP=(NEW,CATLG),                        
//            SPACE=(TRK,(5,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*-----------------------------------------------------------------            
//STEP23   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//OUTPUT1  DD DSN=BP13.F525.APPL.ACCUM,DISP=OLD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT LAST SUCC REGN-NO IN NT/FT ORDER                                       
//*-----------------------------------------------------------------            
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F525,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=20000)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,4,2,A,53,3,A,11,1,A),FORMAT=CH                            
//*-----------------------------------------------------------------            
//* PRINT REPORT TO SHOW LAST SUCC REGN-NO HIT MAX ZONE/ALLOC/CAT               
//*-----------------------------------------------------------------            
//STEP25    EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                 
//BP13K525  DD DSN=&&BP13F525,DISP=(OLD,PASS)                                   
//FT18F001  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S502),DISP=SHR                            
