//BP13A525 JOB (BP13P),'BP13A525',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//*    NOTE THE DIFFERENCE                                                      
//*    - TENDER PROGRAM ONLY HAVE NEW FLAT SUPPLY                               
//*    - ADD PA MAX-CAT TO GRO MAX-CAT                                          
//*-----------------------------------------------------------------            
//* STEP    DESCRIPTION                                                         
//* -----   -----------                                                         
//* 02      = BACKUP TENDER AND RESIDENT FILE                                   
//* 03 - 06 = PRINT FLAT SYPPLY REPORT BF TRANSFERRING                          
//* 07      = ADD PA MAX-CAT TO GRO MAX-CAT                                     
//* 08 - 11 = PRINT FLAT SYPPLY REPORT AF TRANSFERRING                          
//* 12 - 14 = ADJUST RESIDENT QUOTA                                             
//* 15 - 17 = ADJUST FLAT QUOTA FOR NHH/UPG                                     
//* 23      = DEFINE ALTERNATE KEY FOR BP13K740                                 
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- --------------------                                           
//* BP130341 LSB 970709   ADJUST BP13K712 BAL FROM PRIORITY TO                  
//*                       PA ACCORDINGLY FOR NH/UG                              
//* BP130652     990825   EXPAND F520,K520 RECL 300 TO 500                      
//* BP130857 SSS 000626   ADD GROUPID                                           
//* BP132596 PGS 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E            
//* BP132653 CKK 14022005 TO REMOVE UNWANTED STEP                               
//* BP132693 CKK 14052005 TO INCLUDE DEFINATION OF K740 ALT KEY                 
//* BP133501 IL5 15012009 TO REMOVE PRINTING OF REPORT BP13L752                 
//* BP133582 IL5 23042009 TO REMOVE STEP TO DEFINE ALT INDEX FOR K740           
//* BP133913 IL5 25052010 TO JDE FOR BP13C524 TO BP13D (PRINT 1 COPY)           
//* BP134782 SMR 07022013 TO PREPARE FLAT AND ETHINIC QUOTA FOR                 
//*                       SHORTLISTING 2ND HUNDRED PERCENT                      
//* BP134861 EAA1 30042013 EXPAND BP13K010 TO 600                               
//* BP135392 SMR2 19062014 CATER FOR 3P FLAT TYPE                               
//* BP135708 SMR2 31032015 CHANGE CLASS=2 TO CLASS=J                            
//* BP136055 IL5  17122015 CATE FOR 2F FLAT TYPE                                
//* BP138078 AM25 21032019 REPLACE BP13C750 WITH BP13C756                       
//* BP138301 AM25 14052020 HARDCOPY REPORTS CONVERSION                          
//* BP139516 AM25 27022023 INCLUDE BP13CF7G AND BP13CF7H                        
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN                                            
//*-----------------------------------------------------------------            
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K720.RESIDENT,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//INPUT4   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//OUTPUT1   DD DSN=BP13.F010.TENDER.GROUPD,DISP=OLD                             
//INPUT2    DD DSN=BP13.K720.RESIDENT,DISP=SHR                                  
//OUTPUT2   DD DSN=BP13.F720.RESIDENT.GROUPD,DISP=OLD                           
//INPUT3    DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                  
//OUTPUT3   DD DSN=BP13.F712.FLATNHUG.GROUPD,DISP=OLD                           
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* TO OUTPUT BP13K762 RECORDS MEETING FOLLOWING CONDITIONS:                    
//*    - NTS FOR 3-ROOM AND BIGGER FLATS UNDER BTO AND                          
//*    - FT FAMILY RATE IS LESS THAN 3 TIMES AND                                
//*    - OVERALL APPLICATION RATE > 1 TIME                                      
//*---------------------------------------------------------------------        
//STEP02A  EXEC PGM=BP13CF7G,COND=(0,NE)                                        
//BP13K762 DD DSN=BP13.K762.BTO.DEMAND,DISP=SHR                                 
//BP13F762 DD DSN=BP13.F762.BTO.DEMAND.BP13A525,DISP=OLD                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* TO UPDATE NUM-CAP-UPGRADER IN BP13K010                                      
//*---------------------------------------------------------------------        
//STEP02B  EXEC PGM=BP13CF7H,COND=(0,NE)                                        
//BP13F010 DD DSN=BP13.F010.TENDER.GROUPD,DISP=SHR                              
//BP13F762 DD DSN=BP13.F762.BTO.DEMAND.BP13A525,DISP=SHR                        
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* TO PREPARE FLAT AND ETHINIC QUOTA FOR SHORTLISTING 200%                     
//*---------------------------------------------------------------------        
//STEP02C  EXEC PGM=BP13CF79,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13F010 DD DSN=BP13.F010.TENDER.PA,DISP=OLD                                  
//P13F010A DD DSN=BP13.F010.TENDER.PA.MAXCAT,DISP=OLD                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE TRANSFERRING               
//*---------------------------------------------------------------------        
//STEP03    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010A,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,4,2,CH,EQ,C'4P',OR,                                   
       4,2,CH,EQ,C'5 ',OR,4,2,CH,EQ,C'5P')                                      
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE TRANSFERRING                     
//*---------------------------------------------------------------------        
//STEP04    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010A,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY BEFORE TRANSFERRING             
//*---------------------------------------------------------------------        
//STEP05    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010B,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE TRANSFERRING                     
//*---------------------------------------------------------------------        
//STEP06    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010B,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3P FLATS TO PRINT FLAT SUPPLY BEFORE TRANSFERRING                  
//*---------------------------------------------------------------------        
//STEP06A   EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT   DD DSN=&&P13K010C,DISP=(,PASS),                                     
//          UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                              
//          DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                  
//SYSIN     DD *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3P')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE TRANSFERRING                     
//*---------------------------------------------------------------------        
//STEP06B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010C,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* ADD MAX-PA-CAT1/CAT2/CAT3 TO MAX-CCC-CAT1/CAT2/CAT3                         
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C756,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER TRANSFERRING                
//*---------------------------------------------------------------------        
//STEP08    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010N,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,4,2,CH,EQ,C'4P',OR,                                   
       4,2,CH,EQ,C'5 ',OR,4,2,CH,EQ,C'5P')                                      
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER TRANSFERRING                      
//*---------------------------------------------------------------------        
//STEP09    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010N,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY AFTER TRANSFERRING              
//*---------------------------------------------------------------------        
//STEP10    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010M,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER TRANSFERRING                      
//*---------------------------------------------------------------------        
//STEP11    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010M,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3P FLATS TO PRINT FLAT SUPPLY AFTER TRANSFERRING                   
//*---------------------------------------------------------------------        
//STEP11A   EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT   DD DSN=&&P13K010L,DISP=(,PASS),                                     
//          UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                              
//          DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                  
//SYSIN     DD *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3P')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER TRANSFERRING                      
//*---------------------------------------------------------------------        
//STEP11B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010L,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-------------------------------------------------------------------          
//* COMPUTE THE MINIMUM FLAT QUOTA FOR RESIDENT AND                             
//*         THE MAXIMUM FLAT QUOTA FOR NON-RESIDENT                             
//*-------------------------------------------------------------------          
//*STEP12   EXEC PGM=BP13C749,COND=(0,NE)                                       
//*BP13K720 DD DSN=BP13.K720.RESIDENT,DISP=SHR                                  
//*BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------         
//* PRINT REPORT ON RESIDENT FILE INFO ON TOTAL RES/NON-RES, FLAT QUOTA         
//* RES/NON-RES, TOTAL-REG-RES/NON-RES                                          
//*--------------------------------------------------------------------         
//*STEP13   EXEC PGM=BP13C752,COND=(0,NE)                                       
//*BP13K720 DD DSN=BP13.K720.RESIDENT,DISP=SHR                                  
//*BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//*BP13F713 DD DSN=BP13.BLANK.CHAR20,DISP=SHR                                   
//*BP13L752 DD SYSOUT=8,DEST=IOM8                                               
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* INCLUDE TCP/MTF NHH/UPG TO TRANSFER TO GRO                                  
//*---------------------------------------------------------------------        
//*STEP14   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                  
//*SORTOUT  DD DSN=&&F712NHUG,DISP=(,PASS),                                     
//*            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                           
//*            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(1,10,A),FORMAT=CH                                             
//*  INCLUDE COND=(8,3,CH,EQ,C'MTF',OR,                                         
//*            8,3,CH,EQ,C'TCP')                                                
//*---------------------------------------------------------------------        
//* ADD BALANCE NHH/UPG OF TCP/MTF TO CCC SCHEME                                
//*---------------------------------------------------------------------        
//*STEP15   EXEC PGM=BP13C572,COND=(0,NE)                                       
//*BP13F713 DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//*BP13F712 DD DSN=&&F712NHUG,DISP=(OLD,PASS)                                   
//*BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                  
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG FOR EACH COHORT                    
//*---------------------------------------------------------------------        
//*STEP16   EXEC PGM=BP13C552,COND=(0,NE)                                       
//*BP13F713 DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                
//*BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                  
//*BP13L552 DD SYSOUT=8,DEST=IOM8                                               
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT OUT UNSUCC REQUEST CASES                                               
//*---------------------------------------------------------------------        
//*STEP17   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//*            AMP=('BUFND=8','BUFNI=4')                                        
//*SORTOUT  DD DSN=&&F740REN,DISP=(,PASS),                                      
//*            UNIT=(SYSDA,1),SPACE=(CYL,(60,20),RLSE),                         
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                           
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(1,28,A),FORMAT=CH                                            
//*   INCLUDE COND=(226,3,CH,EQ,C'   ')                                         
//*---------------------------------------------------------------------        
//* UNSUCC REN REQUESTS WILL BE PIGEONHOLE AGAIN AS PA CASE                     
//*---------------------------------------------------------------------        
//*STEP18   EXEC PGM=BP13C762,COND=(0,NE)                                       
//*BP13F520 DD DSN=&&F740REN,DISP=(OLD,PASS)                                    
//*BP13PA   DD DSN=BP13.F740.MATUREBA.RENGRO,DISP=OLD                           
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT UNSUCC REN AFTER PRIORITY PIGEONHOLING                 
//*---------------------------------------------------------------------        
//*STEP19   EXEC  SAS,COND=(0,NE)                                               
//*BP13K520 DD DSN=BP13.F740.MATUREBA.RENGRO,DISP=SHR                           
//*BP13L511 DD SYSOUT=8,DEST=IOM8                                               
//*SYSIN    DD DSN=BP13.BATCH.SRC(BP13S511),DISP=SHR                            
//*---------------------------------------------------------------------        
//* SORT OUT UNSUCC REQUEST CASES                                               
//*---------------------------------------------------------------------        
//*STEP20   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                   
//*            AMP=('BUFND=8','BUFNI=4')                                        
//*SORTOUT  DD DSN=&&F520REN,DISP=(,PASS),                                      
//*            UNIT=(SYSDA,1),SPACE=(CYL,(60,20),RLSE),                         
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                           
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(1,28,A),FORMAT=CH                                            
//*   INCLUDE COND=(226,3,CH,EQ,C'   ')                                         
//*---------------------------------------------------------------------        
//* UNSUCC REN REQUESTS WILL BE PIGEONHOLE AGAIN AS PA CASE                     
//*---------------------------------------------------------------------        
//*STEP21  EXEC PGM=BP13C762,COND=(0,NE)                                        
//*BP13F520 DD  DSN=&&F520REN,DISP=(OLD,PASS)                                   
//*BP13PA   DD  DSN=BP13.F520.BALLOT.RENGRO,DISP=OLD                            
//*SYSDBG   DD  SYSOUT=*                                                        
//*SYSDBOUT DD  SYSOUT=*                                                        
//*SYSOUT   DD  SYSOUT=*                                                        
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT UNSUCC REN AFTER PRIORITY PIGEONHOLING                 
//*---------------------------------------------------------------------        
//*STEP22   EXEC  SAS,COND=(0,NE)                                               
//*BP13K520 DD DSN=BP13.F520.BALLOT.RENGRO,DISP=SHR                             
//*BP13L511 DD SYSOUT=8,DEST=IOM8                                               
//*SYSIN    DD DSN=BP13.BATCH.SRC(BP13S511),DISP=SHR                            
//*--------------------------------------------------------------------         
