//BP13ADP7 JOB (BP13P),'BP13ADP7',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//* CREATE BP13KB20 -DBSS FILE FOR BOOKING                                      
//*=================================================================            
//* CHG REF  BY   ON     DESCRIPTION                                            
//* -------- ---- ------ -----------                                            
//* BP139931 AM25 290224 CHANGE CLASS J TO CLASS 2                              
//*=================================================================            
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.KB20.DBSBK,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAP1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//********************************************************************          
//* SORT OUT GRO CASES WITH PA REGN-NO, RANDOM-NO WITH P AT 28TH COL            
//*-------------------------------------------------------------------          
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.DBS,DISP=SHR                               
//SORTOUT  DD DSN=&&F740SUCC,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(20,5),RLSE),                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  OMIT COND=(28,1,CH,EQ,C'P')                                                   
//*-----------------------------------------------------------------            
//* CREATE FILE FOR DBSS BOOKING AND RELEASE RESULT WITH QUEUE-NO               
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13CD04,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K740 DD DSN=BP13.K740.MATUREBA.DBS,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K800 DD DSN=BP13.K800.APPLN.DBS,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K200 DD DSN=BP13.K200.BKAPPMT.EC,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K201 DD DSN=BP13.K200.BKAPPMT.EC.PATH1,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LD04 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------- 00000230
//*  TO CREATE VSAM FILE BP13K200 (BP13.K200.BKAPPMT.EC)                00000240
//*-------------------------------------------------------------------- 00000250
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE),                                00000260
//             REGION=4096K                                             00000270
//SYSPRINT DD  SYSOUT=*                                                 00000280
//INPUT    DD  DSN=BP13.BLANK.CHAR300,                                  00000290
//             DISP=SHR                                                 00000300
//SYSIN    DD  *                                                        00000310
           DEL (BP13.K200.BKAPPMT.EC) CL PURGE                                  
           DEF CLUSTER                                     -            00800000
               (NAME(BP13.K200.BKAPPMT.EC)                 -            00810000
                TRK(10 5)                                  -            00830000
                UNIQUE                                     -            00840000
                STORCLAS(PRODRLS)                          -                    
                LOG(NONE)                                  -                    
                SHR(2 3))                                  -            00850000
               DATA                                        -            00860000
               (NAME(BP13.K200.BKAPPMT.EC.DATA)            -            00870000
                KEYS(21 0)                                 -            00880000
                RECSZ(300 300)                             -            00890000
                CISZ(4096)                                 -            00900000
                FSPC(10 10))                               -            00910000
               INDEX                                       -            00920000
               (NAME(BP13.K200.BKAPPMT.EC.INDEX)           -            00930000
                CISZ(4096))                                             00940000
           IF MAXCC = 0  THEN                              -            00950000
              REPRO IFILE(INPUT)                           -            00960000
              ODS(BP13.K200.BKAPPMT.EC)                                 00720000
            DEF AIX (NAME(BP13.K200.BKAPPMT.EC.ALTX1)      -                    
                REL(BP13.K200.BKAPPMT.EC)                  -                    
                TRK(2 3)                                   -                    
                SHR(2 3)                                   -                    
                UNIQUE                                     -                    
                KEYS(8 13)                                 -                    
                CISZ(4096)                                 -                    
                RECSZ(33 117))                                                  
            IF LASTCC = 0 THEN                             -                    
               DEF PATH(NAME(BP13.K200.BKAPPMT.EC.PATH1)   -                    
                   PENT(BP13.K200.BKAPPMT.EC.ALTX1))                            
            IF LASTCC = 0 THEN                             -                    
               BIX IDS(BP13.K200.BKAPPMT.EC)               -                    
                   ODS(BP13.K200.BKAPPMT.EC.ALTX1)                              
/*                                                                      00000320
