//BP13D123 JOB (BP13P),'BP13D123',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* LOAD DATA INTO GRANT TABLES (GRANT ASMNT AND PERSON)                        
//*=================================================================            
//* BP138048 SRG1 21112019 - NEW JOB                                            
//*=================================================================            
//*                                                                             
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13GASM DD  DSN=BP13.GASM.LOAD.TABLE,DISP=OLD                                
//BP13GAPN DD  DSN=BP13.GAPN.LOAD.TABLE,DISP=OLD                                
//BP13DASM DD  DSN=BP13.GASM.DUP.LOAD.TABLE,DISP=OLD                            
//BP13DAPN DD  DSN=BP13.GAPN.DUP.LOAD.TABLE,DISP=OLD                            
//BP13DASM DD  DSN=BP13.GASM.ERR.LOAD.TABLE,DISP=OLD                            
//BP13DAPN DD  DSN=BP13.GAPN.ERR.LOAD.TABLE,DISP=OLD                            
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CB3I) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
