//BP13DR02 JOB (BP13P),'BP13DR01',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-------------------------------------------------------------------*         
//* CHG-NO    ON    BY  - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP135678 050615 IL  - CHANGE SERVER NAME FR SGISFTP TO SGNETSTAGE           
//* BP139082 280322 LJL - AUTO TRIGGER OF INCOMING SCRIPT VIA TEXT FILE         
//* BP139082 260422 LJL - TO CATER FOR REJECTED CPF SNP FILE                    
//*-------------------------------------------------------------------*         
//*=================================================================            
//*  ------------------------------------                                       
//* CREATE DUMMY STEP TO CHECK DATA FROM SERVER                                 
//*=================================================================            
//*=====================================================================        
//*   GET DATASET FROM FTP SERVER REJECTION FILE                                
//*   PROD PATH --> /PROD/APPN/DATA/BP13/FROM-HDB/CPF/MF                        
//*   TEST PATH --> /TEST/APPN/DATA/BP13/FROM-HDB/CPF/MF                        
//*=====================================================================        
//S09      EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD /PROD/APPN/DATA/BP13/TO-HDB/CPF                                            
  BINARY                                                                        
  GET HBLREJSNPS.TXT.ZIP 'BP13.F106.CPFSNP.RECV1.ZIP' (REPLACE                  
  QUIT                                                                          
/*                                                                              
//*=====================================================================        
//*   UNZIP FILE REJECT FILE                                                    
//*=====================================================================        
//S10      EXEC PKUNZIP,COND=(0,NE)                                             
-ARCHIVE(BP13.F106.CPFSNP.RECV1.ZIP)                                            
-UNZIPPED_DSN(**,BP13.F106.CPFSNP.RECV.REJ)                                     
-TEXT                                                                           
-OVERWRITE                                                                      
/*                                                                              
//*=====================================================================        
//*   DELETE DATASET FROM FTP SERVER FOR REJECTION                              
//*=====================================================================        
//S11      EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD /PROD/APPN/DATA/BP13/TO-HDB/CPF                                            
  DIR                                                                           
  BINARY                                                                        
  MDEL HBLREJSNPS.TXT.ZIP                                                       
  DIR                                                                           
  QUIT                                                                          
/*                                                                              
//*=====================================================================        
//*   DELETE ENCRYPTED DATASET FROM FTP SERVER REJECTION                        
//*=====================================================================        
//S12      EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD /PROD/APPN/DATA/BP13/TO-HDB/CPF                                            
  DIR                                                                           
  BINARY                                                                        
  MDEL HBLREJSNPS.TXT.ZIP.P7                                                    
  DIR                                                                           
  QUIT                                                                          
/*                                                                              
//*=================================================================            
