//BP13A638 JOB (BP13P),'BP13A638',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*====================================================================         
//* BATCH REPORT ON BTO/SBF APPLICANTS WITH EA/EB/ET/R1/R2 DEBARMENT            
//*====================================================================         
//* CHG REF   BY    ON        DESCRIPTION                                       
//* --------  ----  --------  ----------------------------------------          
//* BP135254  SMR2  12052014  NEW JCL                                           
//* BP135414  IL5   30072014  ADD DD REFERENCE TO BP13K831 FOR BP13C920         
//* BP136609  SMR2  02032017  ADD DD FOR NEW OUTPUT IN BP13C920                 
//* BP136902  SMR2  16082017  REMOVE CHECKING OF ALLO-CAT                       
//* BP137102  AM25  18122018  SORT OUT NUM-OPTION S9 FOR BP13C54D               
//*====================================================================         
//* DELETE SEQUENTIAL FILE/S                                                    
//*--------------------------------------------------------------------         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DEL (BP13.REPORT.EAEBET.BP13A638)                                           
    DEL (BP13.REPORT.EAEBET.BP13A638.SERS)                                      
    IF MAXCC < 12 THEN                                                          
       SET MAXCC = 0                                                            
//*--------------------------------------------------------------------         
//* SORT OUT ONLY S9 NUM-OPTION M555 OPTION 9                                   
//* THIS JCL IS FOR BTO AND SBF EXERCISES                                       
//*--------------------------------------------------------------------         
//STEPA    EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K205,DISP=(NEW,PASS),                                    
//            SPACE=(TRK,(1,1),RLSE),UNIT=SYSDA,                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'S9')                                               
//*--------------------------------------------------------------------         
//* PROGRAM TRIGGER VIA ONLINE BP13B555                                         
//* EXTRACT RELEVANT EXERCISE CASES                                             
//*--------------------------------------------------------------------         
//STEP01   EXEC PGM=BP13C54D,COND=(0,NE)                                        
//BP13F205 DD DSN=&&P13K205,DISP=(OLD,DELETE)                                   
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                                 
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F500 DD DSN=&&P13F500,DISP=(NEW,PASS),                                    
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE)                              
//BP13L54D DD DUMMY                                                             
//BP13L54E DD DUMMY                                                             
//BP13L54F DD DUMMY                                                             
//BP13L54G DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* OMIT CANCELLED CASES                                                        
//*--------------------------------------------------------------------         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F500,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F730MAT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(260,1,CH,NE,C'C')                                             
//*--------------------------------------------------------------------         
//* SORT OUT BY REGN NO & NRIC                                                  
//*--------------------------------------------------------------------         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F825ALL,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
//*--------------------------------------------------------------------         
//* EXTRACT MATCHING RECORDS FROM BP13K825                                      
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F730MAT,DISP=(OLD,DELETE)                                   
//SORTJNF2 DD DSN=&&F825ALL,DISP=(OLD,DELETE)                                   
//MATCH    DD DSN=&&F825MAT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   REFORMAT FIELDS=(F2:1,200)                                                   
   OUTFILE FNAMES=MATCH                                                         
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* MATCH DEBARMENT MASTER TO EXTRACT ONLY VALID REASON CODE                    
//*--------------------------------------------------------------------         
//STEP05   EXEC PGM=BP13C920,COND=(0,NE)                                        
//BP13F825 DD DSN=&&F825MAT,DISP=(OLD,DELETE)                                   
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K120 DD DSN=BP17.K120.SERSUNIT,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K110 DD DSN=BP17.K110.SERSBLK,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K111 DD DSN=BP17.K110.SERSBLK.PATH1,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K100 DD DSN=BP17.K100.SERSPROJ,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F824A DD DSN=BP13.REPORT.EAEBET.BP13A638,DISP=(NEW,CATLG),                 
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(2,3),RLSE)                                            
//P13F824B DD DSN=BP13.REPORT.EAEBET.BP13A638.SERS,DISP=(NEW,CATLG),            
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
