//BP13A279 JOB (BP13P),'USER:BP13',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//             NOTIFY=CSD0071                                                   
/*JOBPARM      LINECT=0                                                         
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR PRINTING OF APPLICATION LETTERS FOR NPL                     
//*********************************************************************         
//* BP133813 20100201 ESA1 JCL FOR PRINTING APPLICATION FORM FOR NPL            
//* BP135198 20150227 ESA1 TO ROUTE PRINTING IN CLASS=J                         
//* BP135799 20150511 ESA1 REMOVE BP13F740 & REPLACE WITH BP13F200              
//*====================================================================         
//* SORT THE CONTROL REC FOR THIS OPTION                                        
//*--------------------------------------------------------------------         
//STEP00   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'PD')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                 
//* PRT01 : COPIES = 1            ** (SALES - ALLOCATION SECTION)               
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=J,                                                        
//             OUTPUT=(*.FORMID),DEST=IOMJ                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* APPLN LETTER (ORIG)                                                         
//*-----------------------------------------------------------------            
//PRT0A    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALST1A CP-1',END;                                    
1$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                       
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1A                                   
//SYSUT2   DD SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT F200 BY ADTE/NT/FT/DTE-APPT/TIME/REGN                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,5,A,50,6,A,57,5,A),FORMAT=CH                                  
/*                                                                              
//*-----------------------------------------------------------------            
//*  TO REMOVE CASES WITH SHORTLIST-QTR NOT THE SAME AS BALLOT-QTR              
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C23T,COND=(0,NE)                                        
//BP13F205 DD DSN=BP13.F205.PRTAPREC,DISP=SHR                                   
//BP13F200 DD DSN=&&P13F200A,                                                   
//            DISP=(SHR,PASS)                                                   
//P13F200A DD DSN=&&P13F200B,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CANCELLATION RECORDS AND BOOKED FLAT                                        
//*--------------------------------------------------------------------*        
//STEP03 EXEC    PGM=BP13C23U,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//P13L23UA DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
//P13L23UB DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
/*                                                                              
//*-----------------------------------------------------------------            
//*  PRINT APPLICATION FORM                                                     
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13C89F,COND=(0,NE)                                        
//BP13F200 DD DSN=&&P13F200C,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13K062 DD DSN=BP13.K062.CODETBL,DISP=SHR                                    
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//P13P89DA DD SYSOUT=J,OUTPUT=(*.PRT0A.FORMID),DEST=IOMJ                        
//P13L89DA DD SYSOUT=J,OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                        
//P13L89DB DD SYSOUT=J,OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  ACCUMULATE CONTROL REC INTO CTLREC-ACC FILE                                
//*-----------------------------------------------------------------            
//STEP05   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.PRTAPREC,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-----------------------------------------------------------------            
//* END BP13A279                                                                
//*-----------------------------------------------------------------            
