//BP13ADPG  JOB (BP13P),'BP13ADPG',CLASS=I,MSGCLASS=N,                  JOB00344
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//*   TAG 'S' AND 'R' FOR DBSS SHORTLISTING                                     
//*   WHEN SHORTLISTING CAN BE COMPLETED IN 200%                                
//*---------------------------------------------------------------------        
//* 1) BP13K740 - TAG RESULT OF SHORTLISTING                                    
//**********************************************************************        
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP133425 IL5  20081210 NEW JCL TO FOR DBSS                                  
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------------        
//* SORT OUT SUCC REQUEST CASES                                                 
//* SET CDE-REQUEST-STATUS TO 'S' FOR 1ST 100% CASES                            
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   INCLUDE COND=(226,3,CH,NE,C'   ')                                            
//*---------------------------------------------------------------------00000030
//* UPDATE CDE-REQUEST-STATUS = S (SUCC WITHIN 100%)                    00000030
//*---------------------------------------------------------------------00000030
//STEP02   EXEC  PGM=BP13C717,COND=(0,NE)                               00002680
//BP13F740 DD  DSN=&&F740SUCC,DISP=(OLD,DELETE)                         00002710
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//*---------------------------------------------------------------------        
//* SORT OUT SUCC REQUEST CASES                                                 
//* SET CDE-REQUEST-STATUS TO 'R' FOR 1ST 200% CASES                            
//** NOTE NT IS HARDCODED IN JCL                                                
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740NSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   INCLUDE COND=(226,3,CH,EQ,C'   ')                                            
   OUTREC FIELDS=(1,225,C'BH ',229,272)                                         
//*--------------------------------------------------------------------         
//* REPRO THE UPDATED BALLOT FILE                                               
//* UPDATE 100% SUCC AS 'S' IN NUM-REQUEST-STATUS                               
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&F740NSUC,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*---------------------------------------------------------------------00000030
//* UPDATE CDE-REQUEST-STATUS = R                                       00000030
//*---------------------------------------------------------------------00000030
//STEP02   EXEC  PGM=BP13C71A,COND=(0,NE)                               00002680
//BP13F740 DD  DSN=&&F740NSUC,DISP=(OLD,DELETE)                         00002710
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//****************************************************************              
//* END BP13ADPG                                                                
//****************************************************************              
