//BP13D524 JOB (BP13P),'BP13D524',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//         NOTIFY=CSD0071                                               00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//*===================================================================* 00040000
//*                                                                   * 00050000
//*  THIS JOB IS USE ONLY FOR DBSS                                    * 00060000
//*  TO UPDATE INTERNET APPLICATION FILE                              * 00070000
//*                                                                   * 00080000
//*===================================================================* 00090000
//* CHG REF  BY  ON       DESCRIPTION                                 * 00100000
//* -------- --- -------- -----------                                 * 00110000
//* BP132886 CKK 041006   NEW JCL                                     * 00120000
//* BP133533 ZDD 140409   UPDATE FOR BP13KB20                         * 00121000
//* BP135339 LSB 140723   ADD BACKUP BP13KB25                         * 00122002
//* BP135825 ZDD 151112   ADD BP13CH54 FOR UPD ON BP13KH50            * 00123002
//* BP136319 KSJ 160923   STEP0A: ADD VERIFY BP13KH50                 * 00124000
//*                       STEP04: EXPAND PASS TO CYL 50,20            * 00125000
//* BP136319 ZDD 160926   ADD BP13CH58 TO UPDATE TP-INC FOR K820      * 00126000
//* BP136413 RJB 161103   TO INCLUDE PGM BP13C000                     * 00127000
//* BP136539 RJB 161130   TO INCLUDE PGM BP13CAA4                     * 00128001
//* BP136539 RJB 161205   STEP10 CHG DISP OF OUTPUTS FROM SHR TO MOD  * 00129002
//* BP136413 NST 161227   TO SHIFT BP13C000 TO BP13D119               * 00129102
//* BP136307 CCC 170810   INCREASE SPACE ALLOCATE FOR STEP6 &&FH50CH58* 00129204
//* BP136307 CCC 170905   INCREASE SPACE ALLOCATE FOR STEP4 &&FH50CH58* 00129304
//* BP137360 LSB 180709   ADD BP13K820 VERIFY FILE                      00129406
//* BP138336 LJL 271120   ADD DATE1P AND DATE1P-1 FH50.INET RECORDS     00129508
//* BP138336 LJL 291120   TO UPDATE KEY ISSUE DATE TO KH50  RECORDS     00129610
//* BP138336 LSB 130323   DELETE DBS FILE                               00129712
//*===================================================================* 00130000
//*-------------------------------------------------------------------* 00140000
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                    * 00150000
//* PRT01 : COPIES =1     FOR CONTROL LISTING                         * 00160000
//*-------------------------------------------------------------------* 00170000
//PRT01    EXEC PGM=IEBGENER                                            00180000
//SYSUT1   DD *                                                         00190000
$DJDE$ JDE=BP13D,JDL=BP13,END;                                          00200000
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1A                           00210000
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00220000
//SYSPRINT DD SYSOUT=*                                                  00230000
//SYSIN    DD DUMMY                                                     00240000
//*-------------------------------------------------------------------- 00250000
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                       00260000
//*-------------------------------------------------------------------- 00270000
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                   00280000
//INPUT3   DD DSN=BP13.KH50.UPD.FP,DISP=OLD                             00292000
//INPUT4   DD DSN=BP13.K820.OCCUP,DISP=OLD                              00293005
//INPUT5   DD DSN=BP13.K859.PCD.EMAIL,DISP=OLD                          00294007
//SYSPRINT DD SYSOUT=*                                                  00300000
//SYSIN   DD *                                                          00310000
          VFY FILE(INPUT3)                                              00322000
          VFY FILE(INPUT4)                                              00323005
          VFY FILE(INPUT5)                                              00324007
//*                                                                     00330000
//*------------------------------------------------------------------   00800000
//* SORT ALL CASES THAT WILL BE WRITTEN TON BP13KH50                    00810000
//*------------------------------------------------------------------   00820000
//STEP04   EXEC SORT,COND=(0,NE)                                        00830000
//SORTIN   DD DSN=BP13.KH50.UPD.FP.INET,DISP=SHR,                       00840000
//            AMP=('BUFND=23')                                          00850000
//SORTOUT  DD DSN=&&BP13FH50,DISP=(,PASS),                              00860000
//            UNIT=(SYSDA,20),DCB=(RECFM=FB,LRECL=3000),                00870003
//            SPACE=(CYL,(50,20),RLSE)                                  00880000
//SYSIN    DD  *                                                        00890000
  SORT FIELDS=(1,8,A),FORMAT=CH                                         00900000
   INCLUDE COND=((218,08,ZD,EQ,DATE1P),OR,                              00910008
                 (218,08,ZD,EQ,DATE1P-1))                               00911008
//*------------------------------------------------------------------   00920000
//* TO UPDATE BP13KH50                                                  00930000
//*------------------------------------------------------------------   00940000
//STEP05   EXEC PGM=BP13CH54,COND=(0,NE)                                00950000
//BP13FH50 DD DSN=&&BP13FH50,DISP=(OLD,DELETE)                          00960000
//BP13KH50 DD DSN=BP13.KH50.UPD.FP,DISP=SHR                             00970000
//SYSOUT   DD SYSOUT=*                                                  00980000
//SYSTSPRT DD SYSOUT=*                                                  00990000
//SYSPRINT DD SYSOUT=*                                                  01000000
//SYSDBG   DD SYSOUT=*                                                  01010000
/*                                                                      01020000
//*------------------------------------------------------------------   01021000
//* SORT ALL CASES THAT WILL BE WRITTEN TON BP13KH50                    01022000
//*------------------------------------------------------------------   01023000
//STEP06   EXEC SORT,COND=(0,NE)                                        01024000
//SORTIN   DD DSN=BP13.KH50.UPD.FP.INET,DISP=SHR,                       01025000
//            AMP=('BUFND=23')                                          01026000
//SORTOUT  DD DSN=&&FH50CH58,DISP=(,PASS),                              01027000
//            UNIT=(SYSDA,20),DCB=(RECFM=FB,LRECL=3000),                01028002
//            SPACE=(CYL,(50,20),RLSE)                                  01029000
//SYSIN    DD  *                                                        01029100
  SORT FIELDS=(1,8,A),FORMAT=CH                                         01029200
//*---------------------------------------------------------------------01030000
//* TO UPDATE TP-ICNOME                                                 01040000
//*---------------------------------------------------------------------01050000
//STEP07    EXEC PGM=BP13CH58,COND=(0,NE)                               01060000
//BP13FH50  DD DSN=&&FH50CH58,DISP=(OLD,DELETE)                         01070000
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR                             01080000
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                              01090000
//SYSPRINT  DD SYSOUT=*                                                 01100000
//SYSOUT    DD SYSOUT=*                                                 01110000
//*-------------------------------------------------------------------* 01111009
//* UPDATE EFPF FILE RECORDS AFTER KEY ISSUED                         * 01114009
//*-------------------------------------------------------------------* 01115009
//STEP07A EXEC    PGM=BP13C31K,COND=(0,NE)                              01116009
//BP13F410 DD DSN=BP13.F410.DAILYSO,DISP=SHR                            01117009
//BP13KH50 DD DSN=BP13.KH50.UPD.FP,DISP=SHR                             01118009
//SYSPRINT DD SYSOUT=*                                                  01119009
//SYSOUT   DD SYSOUT=*                                                  01119109
//*-----------------------------------------------------------------    01120000
//* HOUSE KEEPING OF RECORDS AFTER KEY ISSUE                            01480001
//*-------------------------------------------------------------------  01490001
//STEP08   EXEC PGM=BP13CAA4,COND=(0,NE)                                01500002
//BP13F410 DD DSN=BP13.F410.DAILYSO,DISP=SHR                            01510001
//BP13KH50 DD DSN=BP13.KH50.UPD.FP,DISP=SHR,                            01520001
//            AMP=('BUFND=4','BUFNI=8')                                 01530001
//BP13K859 DD DSN=BP13.K859.PCD.EMAIL,DISP=SHR,                         01540001
//            AMP=('BUFND=4','BUFNI=8')                                 01550001
//BP13FH50 DD DSN=BP13.FH50.UPD.FP.ACCUM,DISP=MOD                       01560002
//BP13F859 DD DSN=BP13.F859.PCD.EMAIL.ACCUM,DISP=MOD                    01570002
//SYSOUT   DD SYSOUT=*                                                  01580001
//SYSTSPRT DD SYSOUT=*                                                  01590001
//SYSPRINT DD SYSOUT=*                                                  01600001
//SYSDBG   DD SYSOUT=*                                                  01610001
//*---------------------------------------------------------------------01730011
//STEP09   EXEC SORT,COND=(0,NE)                                        01740011
//SORTIN   DD DSN=BP13.KH50.UPD.FP,DISP=SHR                             01750011
//SORTOUT DD DSN=BP13.FH50.UPD.FP.KEYISSUE,DISP=MOD                     01760011
//SYSIN     DD  *                                                       01770011
   SORT FIELDS=(1,19,A),FORMAT=CH                                       01780011
   INCLUDE COND=(234,8,CH,GT,C'00000000')                               01790011
//*---------------------------------------------------------------------01800011
//*---------------------------------------------------------------------01810011
//STEP10   EXEC SORT,COND=(0,NE)                                        01820011
//SORTIN   DD DSN=BP13.KH50.UPD.FP,DISP=SHR                             01830011
//SORTOUT DD DSN=BP13.FH50.UPD.FP.KEYISSUE.DAILY,DISP=SHR               01840011
//SYSIN     DD  *                                                       01850011
   SORT FIELDS=(1,19,A),FORMAT=CH                                       01860011
   INCLUDE COND=(234,8,CH,GT,C'00000000')                               01870011
//********************************************************************* 01890011
//*      CLEAN UP EFPF FILE                                             01900011
//*--------------------------------------------------                   01910011
//*-------------------------------------------------------------------* 01980011
//* TO DELETE RECORD FROM BP13KH50 FOR NOV BTO                          01990011
//*-------------------------------------------------------------------* 02000011
//STEP10   EXEC PGM=BP13C31L,COND=(0,NE)                                02010011
//BP13FH50 DD DSN=BP13.FH50.UPD.FP.KEYISSUE.DAILY,DISP=SHR              02020011
//BP13KH50 DD DSN=BP13.KH50.UPD.FP,DISP=SHR,                            02030011
//            AMP=('BUFND=4','BUFNI=8')                                 02040011
//SYSDBG   DD SYSOUT=*                                                  02050011
//SYSDBOUT DD SYSOUT=*                                                  02060011
//SYSOUT   DD SYSOUT=*                                                  02070011
/*                                                                      02080011
