//BP13ADPS JOB (BP13P),'BP13ADPS',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* THE OJECTIVE OF THIS JCL IS TO ASSIGN REGN NO AND QUEUE NO TO               
//* RESERVED CASES. (200%, 300% COHORT =01)                                     
//* THIS JCL IS MODELLED AFTER BP13A510                                         
//*=================================================================            
//* CHG REF  BY   ON     DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP132463 CKK 291203  NEW JCL TO ASSIGN REGN NO TO RESERVED BE CASES         
//* BP132496 CKK 040504  TO UPDATE FILE LAYOUT FOR BP13C745                     
//* BP132555 CKK 190704  TO CHECK FOR SUCC-NT FIELD DURING SORTING              
//* BP133056 CKK 190507  TO REMOVE BP13C512                                     
//* BP133147 IL5 031007  TO REMOVE VERIFY FOR BP13K825 AND BP13K830             
//* BP133730 IL5 100318  TO CEASE PRINTING BP13L536 (BP13S536)                  
//* BP133913 IL5 100605  TO CEASE PRINTING BP13L535 (BP13S535)                  
//* BP134371 IL5 111023  TO QUEUE APPLICATION BY HH                             
//* BP134400 IL5 111101  REVERSE CHANGES DONE FOR BP134371                      
//* BP135016 IL5 050813  SKIP GRO QUEUE                                         
//* BP135043 SMR 210813  CATER FOR EC BALLOTING                                 
//* BP135872 SMR 310715  CHANGE CLASS 2 TO CLASS J                              
//* BP139931 AM2 290224  CHANGE CLASS J TO CLASS 2                              
//*=================================================================            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//*-  REPRO BALLOT FILE TO SEQ FILE                                             
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.DAILY(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(48,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* SORT OUT RESERVED BE CASES                                                  
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SORTOUT  DD DSN=&&F740MAT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,213,2,A,10,19,A),FORMAT=CH                            
     INCLUDE COND=(260,1,CH,EQ,C'R',AND,                                        
                   226,2,CH,NE,C'  ')                                           
//*-----------------------------------------------------------------            
//* OUTPUT FILES FOR SEPARATE PIGEONHOLING PROCESS, PRIORITY,                   
//* TRANSITION NHH > 7 MTH, AND COHORTS ( MAX 5 )                               
//*-----------------------------------------------------------------            
//STEP6A   EXEC PGM=BP13C741,COND=(0,NE),ADDRSPC=VIRT,REGION=4096K              
//BP13F520 DD  DSN=&&F740MAT,DISP=(OLD,PASS)                                    
//BP13MGP  DD  DUMMY                                                            
//BP13PR   DD  DSN=&&F740PRO,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13GRO  DD  DSN=&&F740GR1,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13PUB  DD DSN=&&F740PUB,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//SYSDBG   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* OUTREC AAA TO ALLOC-SCH FOR ALL GRO CASES                                   
//*---------------------------------------------------------------------        
//STEP06A  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740GR1,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(,PASS),                                       
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(35,2),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,373,3,A,163,2,A,10,19,A),FORMAT=CH                       
  OUTREC FIELDS=(1,212,C'AAA',216,284)                                          
//*---------------------------------------------------------------------        
//* OUTREC SPACES TO WARD AND GRO-RANKING FOR NON-GRO CASES                     
//* OUTREC PA TO ALLOC-SCH FOR NON-GRO CASES                                    
//*---------------------------------------------------------------------        
//STEP06C  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740PUB,DISP=(OLD,PASS)                                     
//         DD DSN=&&F740PRO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(MOD,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,10,19,A),FORMAT=CH                                       
  OUTREC FIELDS=(1,162,C'  ',165,48,C'PA ',216,157,C'   ',376,124)              
//*---------------------------------------------------------------------        
//* SORT BY NT, FT, WARD, GRO-RANK AND 10TH BYTE OF RANDOM NUMBER               
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740GRO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,213,3,A,373,3,A,163,2,A,                      
                  80,2,A,10,19,A),FORMAT=CH                                     
//*---------------------------------------------------------------------        
//*  TO PRINT RESERVED BE CASES ASSIGNED WITH REGISTRATION NO.                  
//*  TO ASSIGN QUEUE NO BASED ON NT,FT,REG NO.                                  
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C514,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L514 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
