//BP13M903 JOB (BP13P),'BP13M903',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//******************************************************************            
//* CHG-NO   BY   DATE     - DESCRIPTION                                        
//* ---------------------------------                                           
//* BP134542 RJE1 23012013 - TO GENERATE REPORT ON MONTHLY REVIEW OF            
//* BM062550                 ADMINISTRATOR'S ACCESS TO SOC AND FIS              
//*-------------------------------------------------------------------*         
//* STEP0  :  TO DELETE SEQ. DATASET                                            
//*-------------------------------------------------------------------*         
//D53HS00E EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.REPORT.BP13M903.BP13LF34')                                      
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//******************************************************************            
//STEP01 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD DSN=BP13.F410.MTHSO,DISP=SHR                                       
//SORTOUT DD DSN=&&BP13F410,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(2,2),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                
//SYSIN   DD *                                                                  
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(1193,7,CH,EQ,C'EA13826',OR,                                  
                   1193,7,CH,EQ,C'EA21881')                                     
//*****************************************************************             
//STEP02 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD DSN=BP13.F300.AGRORDER.ACCUM,DISP=SHR                              
//SORTOUT DD DSN=&&BP13F300,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(2,2),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                
//SYSIN   DD *                                                                  
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(893,7,CH,EQ,C'EA13826',OR,                                   
                   893,7,CH,EQ,C'EA21881')                                      
//*****************************************************************             
//STEP03  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BM06.F190.LOG.MTH,DISP=SHR                                     
//SORTOUT DD DSN=&&BM06F190,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(2,2),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=650,BLKSIZE=0)                                 
//SYSIN   DD *                                                                  
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     INCLUDE COND=(1,11,CH,NE,C'           ',AND,                               
                   643,7,CH,EQ,C'EA13826',OR,                                   
                   643,7,CH,EQ,C'EA21881')                                      
//*****************************************************************             
//STEP04  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K848.BKIMAGE,DISP=SHR                                     
//SORTOUT DD DSN=&&BP13F848,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(2,2),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                
//SYSIN   DD *                                                                  
     SORT FIELDS=(1977,24,A),FORMAT=CH                                          
     INCLUDE COND=(877,7,CH,EQ,C'EA13826',OR,                                   
                   877,7,CH,EQ,C'EA21881')                                      
//*****************************************************************             
//STEP05   EXEC PGM=BP13CF34,COND=(0,NE)                                        
//BP13F410 DD DSN=&&BP13F410,DISP=(OLD,PASS)                                    
//BP13F300 DD DSN=&&BP13F300,DISP=(OLD,PASS)                                    
//BM06F190 DD DSN=&&BM06F190,DISP=(OLD,PASS)                                    
//BP13K848 DD DSN=&&BP13F848,DISP=(OLD,PASS)                                    
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13LF34 DD DSN=BP13.REPORT.BP13M903.BP13LF34,DISP=(NEW,CATLG),               
//         SPACE=(CYL,(20,10),RLSE),                                            
//         DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
