//BP13M517 JOB (BP13P),'BP13M517',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//********************************************************************* 00000040
//* RUN ON 25TH OF THE MONTH                                            00000040
//*1) FS CASES SENT TO ROM TO GET MARRIAGE DATA                         00000040
//*2) FOR EXTRACTION OF RECORDS WITH DATE RECEIVED <=                   00000040
//*   3 MONTHS FROM SYSTEM DATE AND REWRITE TO BP13K517                 00000040
//*-------------------------------------------------------------                
//*CHG-NO   BY  ON     - REMARK                                                 
//*-------------------------------------------------------------                
//*BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                  
//*BP136646 LSB 170911 - DELETE ADHOC CASE, SEND FS CASE MONTHLY                
//*BP137791 LSB 190911 - CREATE FTS/SSC CASES                                   
//*BP138833 LSB 030921 - SENT 3 MONTH PCD NON -MARRIED CASES                    
//*BP138833 LSB 230921 - MOVE NON-FS TO BP13M519                                
//********************************************************************* 00000040
//*-------------------------------------------------------------------*         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                     *         
//*-------------------------------------------------------------------*         
//STEPA    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K517.ROMDATA,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------*         
//*      TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS              *         
//*      PRT01 : CLASS = 2                                            *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* INCLUDE FS BOOKED CASES AND SIGN SALES AGREEMENT                            
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//        AMP=('BUFND=4','BUFNI=8')                                             
//SORTOUT  DD DSN=&&F800ROM,DISP=(,PASS),                                       
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                                  
//        SPACE=(CYL,(150,50),RLSE)                                             
//SYSIN    DD  *                                                                
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=(1,1,CH,NE,C'C',AND,                                          
                  60,3,CH,EQ,C'FS ',AND,                                        
                 155,4,CH,NE,C'    ')                                           
//*-----------------------------------------------------------------            
//* SEND FS CASES TO ROM FOR MARRIAGE DATA                                      
//*-----------------------------------------------------------------            
//STEP02  EXEC PGM=BP13C50A,COND=(0,NE)                                         
//BP13F800 DD DSN=&&F800ROM,DISP=(OLD,PASS)                                     
//BP13K517 DD DSN=BP13.K517.ROMDATA,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13BE01 DD DSN=BP13.F400.SENDID.MRG.BE01,DISP=MOD                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------                
//*  BACKUP  BP13.K517.ROMDATA BEFORE EXTRACTION                                
//*-------------------------------------------------------------                
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K517.ROMDATA,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F517.ROMDATA,DISP=SHR                                    
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,20,A),FORMAT=CH                                               
//*-------------------------------------------------------------                
//* INCLUDE ADHOC CASE                                                          
//*-------------------------------------------------------------                
//STEP04   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K517.ROMDATA,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F517DEL,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750),                           
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
  OMIT COND=(206,7,CH,EQ,C'BP13C50')                                            
//*---------------------------------------------------------------------00000270
//* TO EXTRACT RECORDS WITH DATE RECEIVED <= 3 MONTHS FROM SYSTEM DATE  00000280
//*---------------------------------------------------------------------00000290
//STEP05 EXEC   PGM=BP13C923,COND=(0,NE)                                00000300
//BP13F517 DD  DSN=&&F517DEL,DISP=(OLD,PASS)                            00000310
//P13F517A DD  DSN=&&F517ROM,DISP=(NEW,PASS),                           00000310
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750),                           
//            SPACE=(CYL,(50,10),RLSE)                                          
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00000310
//SYSPRINT DD  SYSOUT=*                                                 00000470
//SYSDBG   DD  SYSOUT=*                                                 00000470
//SYSDBOUT DD  SYSOUT=*                                                 00000480
//SYSOUT   DD  SYSOUT=*                                                 00000480
//*-------------------------------------------------------------                
//* INCLUDE SYSTEM GET FROM ROM ON FS CASES                                     
//*-------------------------------------------------------------                
//STEP06   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K517.ROMDATA,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F517ADD,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750),                           
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
  INCLUDE COND=(206,7,CH,EQ,C'BP13C50')                                         
//*-------------------------------------------------------------                
//* INCLUDE ADHOC CASE                                                          
//*-------------------------------------------------------------                
//STEP07   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F517ADD,DISP=(OLD,PASS)                                     
//         DD DSN=&&F517ROM,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F517FULL,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750),                           
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
//******************************************************************            
//**        DELETE BP13.K517.ROMDATA CLUSTER PURGE                              
//******************************************************************            
//STEP08    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=&&F517FULL,DISP=(OLD,PASS)                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
             DEL 'BP13.K517.ROMDATA' CL PURGE                                   
             DEF CLUSTER                              -                 00800000
               (NAME(BP13.K517.ROMDATA)              -                  00810000
               CYL(40 20)                               -               00830000
               UNIQUE                                 -                 00840000
               SPEED                                  -                         
               STORCLAS(PRODRLS)                      -                         
               LOG(NONE)                              -                         
               SHR(2 3))                              -                 00850000
               DATA                                   -                 00860000
               (NAME(BP13.K517.ROMDATA.DATA)         -                  00870000
               KEYS(20 0)                             -                 00880000
               RECSZ(250 250)                         -                 00890000
               CISZ(4096)                             -                 00900000
               FSPC(10 10))                           -                 00910000
               INDEX                                  -                 00920000
               (NAME(BP13.K517.ROMDATA.INDEX)        -                  00930000
               CISZ(4096))                                              00940000
           IF MAXCC = 0  THEN                         -                 00950000
               REPRO IFILE(INPUT1)                    -                 00960000
               ODS(BP13.K517.ROMDATA)                -                  00720000
               REUSE                                                            
/*                                                                              
//*-------------------------------------------------------------                
//*  BACKUP  BP13.F517.ROMDATA                                                  
//*-------------------------------------------------------------                
//STEP09 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F517.ROMDATA,DISP=SHR                                   
//OUPUT1   DD  DSN=BP13.F517.ROM.MONTH.BACKUP(+1),DISP=(NEW,CATLG),             
//             SPACE=(CYL,(50,30)),                                             
//             DCB=(BP13.GDG,BLKSIZE=27500,LRECL=250,RECFM=FB)                  
//*                                                                             
//INPUT2   DD  DSN=BP13.F517.ROMDATA.DELETE,DISP=SHR                            
//OUPUT2   DD  DSN=BP13.F517.ROMDATA.DELETE.BKUP(+1),DISP=(NEW,CATLG),          
//             SPACE=(CYL,(30,10)),                                             
//             DCB=(BP13.GDG,BLKSIZE=27500,LRECL=250,RECFM=FB)                  
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1) OUTFILE(OUPUT1)                                       
     REPRO INFILE(INPUT2) OUTFILE(OUPUT2)                                       
//*-------------------------------------------------------------                
//*  BACKUP  BP13.L50C.REPORT                                                   
//*-------------------------------------------------------------                
//STEP08 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.L50C.REPORT,DISP=SHR                                    
//OUPUT1   DD  DSN=BP13.L50C.REPORT.PREMTH,DISP=OLD                             
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1) OUTFILE(OUPUT1)                                       
//*-------------------------------------------------------------                
//*  BACKUP  BP13.F517.ROMDATA                                                  
//*-------------------------------------------------------------                
//STEP09 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.BLANK.CHAR250,DISP=SHR                                  
//OUPUT1   DD  DSN=BP13.F517.ROMDATA.DELETE,DISP=OLD                            
//INPUT2   DD DUMMY                                                             
//OUPUT2   DD  DSN=BP13.L50C.REPORT,DISP=OLD                                    
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1) OUTFILE(OUPUT1)                                       
     REPRO INFILE(INPUT2) OUTFILE(OUPUT2)                                       
