//BP13M301 JOB (BP13P),'BP13M301',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP130531  06/08/1998  LSB1 BACKUP CPF PAYMENT & VOUCHER FILE    *           
//* BP130418  31/08/1998  CLT1 Y2K COMPLIANCE CHANGES               *           
//*                            - INCREASE LENGTH FOR BP13F300       *           
//* BP130549  01/11/1998  CLT1 USE AC28 DATASETS INSTEAD OF AC19.   *           
//* BP130883  27/10/2000  CLT1 REMOVE CALLING OF BP13C904           *           
//* BP132362  15/06/2003  CLT1 ADD AC28.F544.SOC                    *           
//* BP132795  23/01/2006  CLT1 CATLG BP13F380                       *           
//* BP134058  01/11/2010  LSB1 EXPAND TEMP FILE                     *           
//* BP134276  21/07/2011  AB9  ADD BP13C36E,BP13C36G PGMS.          *           
//* BP134355  09/09/2011  AB9  SEND EMAIL OF advance cash coll      *           
//* BP134643  25/09/2012  AB9  INCLUDE '6011E' '6020H' '0520C'      *           
//* BP134449  21/02/2013  ZDD1 INCLUDE PGM FOR HLE DEF              *           
//* BP134833  28/03/2013  PCL4 TO CATER FOR PAYMENT TYPE -BP13C36G  *           
//* BP134891  17/05/2013  ZDD1 TO ENHANCE INCLUDE COND FOR HLE      *           
//* BP134974  10/07/2013  RJE1 REMOVE TSH19 AND REPLACE WITH TH1    *           
//* BP134763  27/01/2014  jgo1 add call of BP13C0FW                 *           
//* BP135171  11/02/2014  RJE1 TO CATER FOR DB2 UPGRADE             *           
//* BP135308  29/04/2014  ADDED SEND MAIL FOR PRINTED PCD LETTERS   *           
//* BP135499  15/10/2014  TO CATER FOR BP13C65F AND BP13C65G        *           
//* BP136082  11/02/2016  CHANGED ALL RCPTS TO LONG NAME FORMAT     *           
//*                       IN STEP19 AND 22 AND REPLACED TH1 TO      *           
//*                       KATHIJAH_BEE_ALI_MOHAMED@HDB.GOV.SG       *           
//* BP136642  06/02/2017  SMR2 CATER FOR SYSOUT=8,DEST=IOM8         *           
//* BP136686  03/03/2017  KVL1 ADDED CHIN CHAINN HUEY AS EMAIL RECPT*           
//*                       IN STEPS 19 AND 22                        *           
//* BP136851  20/06/2017  TO UPDATE EMAIL RECIPIENTS                *           
//* BP137325 021018 LJL1 TO CATER FOR NEW FILE FROM CASH PAYMENT KIOSK          
//*                      AC28.F569.SOC                                          
//* BP139891 010224 LJL1 TO CATER FOR cond=4 for step 44.                       
//*=================================================================*           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET, SINGLE COPY       *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* REPRO ACCUMULATED TRANS TO TAPE                                   *         
//*-------------------------------------------------------------------*         
//STEP01 EXEC  PGM=IDCAMS                                                       
//INPUT    DD DSN=BP13.F310.TRANS.ACCUM,DISP=SHR                                
//OUTPUT   DD DSN=BP13.F310.TRANS.BKUP(+1),DISP=(NEW,PASS),                     
//       SPACE=(CYL,(80,30),RLSE),                                              
//       DCB=(BP13.GDG,RECFM=FB,LRECL=150,BLKSIZE=23400)                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPUT) OFILE(OUTPUT)                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* CREATE ACCUMULATED AGREEMENT ORDER FILE                           *         
//*-------------------------------------------------------------------*         
//STEP02 EXEC  PGM=IDCAMS,COND=(0,NE)                                           
//INPUT    DD DSN=BP13.F300.AGRORDER.ACCUM,DISP=SHR                             
//OUTPUT   DD DSN=BP13.F300.AGRORDER.BKUP(+1),DISP=(NEW,PASS),                  
//     SPACE=(CYL,(80,50),RLSE),                                                
//     DCB=(BP13.GDG,RECFM=FB,LRECL=2000,BLKSIZE=18000)                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPUT) OFILE(OUTPUT)                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* CREATE CASH PAYMENT FROM COLLECTION                               *         
//*-------------------------------------------------------------------*         
//STEP03  EXEC  PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.AC28.F526.SOCCASH.MTHACCUM,DISP=OLD                      
//OUTPUT   DD DSN=BP13.AC28.F526.SOCCASH.MTHBKUP,DISP=OLD                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPUT) OFILE(OUTPUT)                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* CREATE CASH PAYMENT FROM COLLECTION                               *         
//*-------------------------------------------------------------------*         
//STEP3A  EXEC  PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.AC28.F569.SOCCASH.MTHACCUM,DISP=OLD                      
//OUTPUT   DD DSN=BP13.AC28.F569.SOCCASH.MTHBKUP,DISP=OLD                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPUT) OFILE(OUTPUT)                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* CREATE CASH PAYMENT FROM COLLECTION                               *         
//*-------------------------------------------------------------------*         
//STEP04  EXEC  PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.AC28.F544.SOC.MTHACCUM,DISP=OLD                          
//OUTPUT   DD DSN=BP13.AC28.F544.SOC.MTHBKUP,DISP=OLD                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPUT) OFILE(OUTPUT)                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT AMR CASES FROM THE SOC-CASH ACCUM FILE                                 
//*-----------------------------------------------------------------            
//STEP04A  EXEC SORT                                                            
//SORTIN   DD DSN=BP13.AC28.F526.SOCCASH.MTHACCUM,DISP=SHR                      
//         DD DSN=BP13.AC28.F569.SOCCASH.MTHACCUM,DISP=SHR                      
//SORTOUT  DD DSN=&&AC28AMR,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     INCLUDE COND=(91,5,CH,EQ,C'6088Z',OR,                                      
                   91,5,CH,EQ,C'6154A',OR,                                      
                   91,5,CH,EQ,C'1279J',OR,                                      
                   91,5,CH,EQ,C'1277G',OR,                                      
                   91,5,CH,EQ,C'1224I',OR,                                      
                   91,5,CH,EQ,C'0520C',OR,                                      
                   91,5,CH,EQ,C'6020H',OR,                                      
                   91,5,CH,EQ,C'6011E')                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE REPORT ON ALL MONEY COME IN CASES                                    
//*-----------------------------------------------------------------            
//STEP04B  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F526 DD DSN=&&AC28AMR,DISP=(OLD,DELETE)                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13L36G DD DSN=&&BP13L36G,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//BP13L36J DD DSN=&&BP13L36J,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//BP13L36K DD DSN=BP13.L36K.BP13C36K,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C36G) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* VALIDATE ALL MONEY COME IN CASES   ON MICROFICHE (2R/3R)                    
//*-----------------------------------------------------------------            
//STEP04C  EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=&&BP13L36G,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* VALIDATE ALL MONEY COME IN CASES ON HARDCOPY (2R/3R)                        
//*-----------------------------------------------------------------            
//STEP04D  EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=&&BP13L36G,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* VALIDATE ALL MONEY COME IN CASES   ON MICROFICHE (STUDIO)                   
//*-----------------------------------------------------------------            
//STEP04E  EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=&&BP13L36J,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* VALIDATE ALL MONEY COME IN CASES ON HARDCOPY (STUDIO)                       
//*-----------------------------------------------------------------            
//STEP04F  EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=&&BP13L36J,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP DELETED CASES FROM KIV FILE                                *         
//*-------------------------------------------------------------------*         
//STEP05 EXEC  PGM=IDCAMS,COND=(0,NE)                                           
//INPUT    DD DSN=BP13.F140.DELETE.ACCUM,DISP=OLD                               
//OUTPUT   DD DSN=BP13.F140.DELETE.BKUP,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPUT) OFILE(OUTPUT)                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* CATALOG ACCUMULATED TRANS FILE                                    *         
//*-------------------------------------------------------------------*         
//STEP06 EXEC  PGM=IEFBR14,COND=(0,NE)                                          
//BP13F300 DD DSN=BP13.F300.AGRORDER.BKUP(+1),DISP=(OLD,CATLG,DELETE)           
//BP13F310 DD DSN=BP13.F310.TRANS.BKUP(+1),DISP=(OLD,CATLG,DELETE)              
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY ACCUMULATED TRANSACTION FILE                                *         
//*-------------------------------------------------------------------*         
//STEP07 EXEC  PGM=IDCAMS,COND=(0,NE)                                           
//INPUT    DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F300.AGRORDER.ACCUM,DISP=OLD                             
//OUTPUT2  DD DSN=BP13.F310.TRANS.ACCUM,DISP=OLD                                
//OUTPUT3  DD DSN=BP13.F310.APPOINT.ACCUM,DISP=OLD                              
//OUTPUT4  DD DSN=BP13.F140.DELETE.ACCUM,DISP=OLD                               
//OUTPUT5  DD DSN=BP13.AC28.F526.SOCCASH.MTHACCUM,DISP=OLD                      
//OUTPUT6  DD DSN=BP13.AC28.F544.SOC.MTHACCUM,DISP=OLD                          
//OUTPUT7  DD DSN=BP13.AC28.F569.SOCCASH.MTHACCUM,DISP=OLD                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPUT) OFILE(OUTPUT1)                                            
  REPRO INFILE(INPUT) OFILE(OUTPUT2)                                            
  REPRO INFILE(INPUT) OFILE(OUTPUT3)                                            
  REPRO INFILE(INPUT) OFILE(OUTPUT4)                                            
  REPRO INFILE(INPUT) OFILE(OUTPUT5)                                            
  REPRO INFILE(INPUT) OFILE(OUTPUT6)                                            
  REPRO INFILE(INPUT) OFILE(OUTPUT7)                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP CD REFUND FILE                                             *         
//*-------------------------------------------------------------------*         
//STEP08 EXEC  PGM=IDCAMS,COND=(0,NE)                                           
//INPUT    DD DSN=BP13.F380.CDREFUND,DISP=SHR                                   
//OUTPUT   DD DSN=BP13.F380.CDREFUND.BKUP(+1),DISP=(,CATLG),                    
//     SPACE=(CYL,(2,1),RLSE),                                                  
//     DCB=(BP13.GDG,RECFM=FB,LRECL=150,BLKSIZE=23400)                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPUT) OFILE(OUTPUT)                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORTS FOR CANCELLED CASES AFTER SA FOR THE MTH AND        *         
//* AFTER 2 MTHS FROM CANCELLATION.                                   *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F380 DD DSN=BP13.F380.CDREFUND,DISP=(OLD,PASS)                            
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13OUT  DD DSN=&&F2010,DISP=(NEW,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,1),RLSE),                               
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                               
//BP13L309 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L309A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C309) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT CD REFUND                                                    *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F2010,DISP=(OLD,PASS)                                       
//SORTOUT  DD DSN=BP13.F380.CDREFUND,DISP=OLD                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*                                                                             
//*-------------------------------------------------------------------*         
//* CREATE CASH PAYMENT FROM FIRST                                    *         
//*-------------------------------------------------------------------*         
//STEP11 EXEC  PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.AG07.F630.VOUCHER,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.AG07.F630.VOUCHER.MTHBKUP,DISP=OLD                       
//INPUT2   DD DSN=BP13.B004.F056.CPF,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.B004.F056.CPF.MTHBKUP,DISP=OLD                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPUT1) OFILE(OUTPUT1)                                           
  REPRO INFILE(INPUT2) OFILE(OUTPUT2)                                           
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY ACCUMULATED TRANSACTION FILE                                *         
//*-------------------------------------------------------------------*         
//STEP12 EXEC  PGM=IDCAMS,COND=(0,NE)                                           
//INPUT    DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.AG07.F630.VOUCHER,DISP=SHR                               
//OUTPUT2  DD DSN=BP13.B004.F056.CPF,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPUT) OFILE(OUTPUT1)                                            
  REPRO INFILE(INPUT) OFILE(OUTPUT2)                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//* CREATE ACCEPTED VOUCHER TRANS BACKUP FILE                         *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F360.PREPVRCH,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F360.PREPVRCH.MTHBKP,DISP=MOD                            
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-------------------------------------------------------------------*         
//* CREATE REPORT ON ACCEPTED VOUCHER TRANS                           *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F360 DD DSN=BP13.F360.PREPVRCH,DISP=SHR                                   
//BP13L36F DD DSN=&&BP13L36F,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//BP13L36H DD DSN=&&BP13L36H,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C36F) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* VALIDATE ALL MONEY COME IN CASES   ON MICROFICHE (2R/3R)                    
//*-----------------------------------------------------------------            
//STEP14A  EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=&&BP13L36F,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* VALIDATE ALL MONEY COME IN CASES ON HARDCOPY (2R/3R)                        
//*-----------------------------------------------------------------            
//STEP14B  EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=&&BP13L36F,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* VALIDATE ALL MONEY COME IN CASES   ON MICROFICHE (STUDIO)                   
//*-----------------------------------------------------------------            
//STEP14C  EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=&&BP13L36H,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* VALIDATE ALL MONEY COME IN CASES ON HARDCOPY (STUDIO)                       
//*-----------------------------------------------------------------            
//STEP14D  EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=&&BP13L36H,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* EMPTY ACCUMULATED VOUCHER TRANSACTIONS                            *         
//*-------------------------------------------------------------------*         
//STEP14E  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT9   DD DUMMY                                                             
//OUTPUT9  DD DSN=BP13.F360.PREPVRCH,DISP=OLD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT9)  OUTFILE(OUTPUT9)                                     
//*                                                                             
//*---------------------------------------------------------------------        
//STEP14F EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K130.SOCHIST,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F130.AMR,DISP=SHR                                        
//SYSIN     DD  *                                                               
  SORT FIELDS=(13,8,A,5,8,A),FORMAT=CH                                          
  INCLUDE COND=((99,3,CH,EQ,C'ADV',OR,                                          
                99,3,CH,EQ,C'ADP',OR,                                           
                99,3,CH,EQ,C'AMR'),AND,                                         
                13,8,CH,GE,C'20101207')                                         
//*-----------------------------------------------------------------            
//* CREATE REPORT OF ADVANCE CASH COLLETION FOR SA & 2R/3R                      
//*-----------------------------------------------------------------            
//STEP15   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F130 DD DSN=BP13.F130.AMR,DISP=SHR                                        
//BP13K350 DD DSN=BP13.K350.STDAPT,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//BM06K115 DD DSN=BM06.K115.DELFIS,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F13A DD DSN=BP13.STUDIO.F130,DISP=SHR                                     
//BP13F13B DD DSN=BP13.AMR.F130,DISP=SHR                                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CA05) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-------------------------------------------------------------------*         
//*- MTHLY REPORT ON ADVANCE CASH COLLECTED FOR SA                    *         
//*-------------------------------------------------------------------*         
//STEP16   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//P13F13A  DD DSN=BP13.STUDIO.F130,DISP=SHR                                     
//BP13LSA1 DD DSN=&&BP13LSA1,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(3,2),RLSE),                                
//            DCB=(RECFM=VB,LRECL=220)                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S13A),DISP=SHR                             
//*-------------------------------------------------------------------*         
//*- MTHLY REPORT ON ADVANCE CASH COLLECTED FOR 2R/3R                 *         
//*-------------------------------------------------------------------*         
//STEP17   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//P13F13B  DD DSN=BP13.AMR.F130,DISP=SHR                                        
//BP13LSA2 DD DSN=&&BP13LSA2,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(3,2),RLSE),                                
//            DCB=(RECFM=VB,LRECL=220)                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S13B),DISP=SHR                             
//*---------------------------------------------------------------------        
//* STEP18 : AUTO-GENERATE MAIL HEADER PART I                                   
//*          HELO SGPHDBX                                                       
//*          MAIL FROM:<XXXXXXXX@SGPHDBX>                                       
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD SYSOUT=*                                                          
//SYSEXEC  DD DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                    
//SMTPHDR  DD DSN=&&P13MHDG,DISP=(NEW,PASS),                                    
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=259,RECFM=VB)                  
//SYSTSIN  DD DUMMY                                                             
//*---------------------------------------------------------------------        
//STEP19   EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                 
//SYSOUT   DD SYSOUT=*                                                          
//MAILNAME DD DSN=&&MAILNAME,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=259)                                          
//MAILRCPT DD DSN=&&MAILRCPT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=259)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
    FILE MAILNAME;                                                              
    PUT @01 '           FILENAME="BP13LSA1.TXT"';                               
    PUT @01 ' ';                                                                
  RUN;                                                                          
                                                                                
  DATA _NULL_;                                                                  
    FILE MAILRCPT;                                                              
    PUT @01 'RCPT TO:<ANG_SUAT_HONG@HDB.GOV.SG>';                               
    PUT @01 'RCPT TO:<JANICE_ML_OH@HDB.GOV.SG>';                                
    PUT @01 'RCPT TO:<LIM_ENG_TIAM@HDB.GOV.SG>';                                
    PUT @01 'RCPT TO:<CHIAM_CHEE_KHIANG@HDB.GOV.SG>';                           
    PUT @01 'RCPT TO:<CHUA_YEE_MIEN@HDB.GOV.SG>';                               
    PUT @01 'RCPT TO:<LAU_HONG_HUAT@HDB.GOV.SG>';                               
    PUT @01 'RCPT TO:<THANGATHURAI_Y_DEVI@HDB.GOV.SG>';                         
    PUT @01 'RCPT TO:<CHEW_LAY_CHENG@HDB.GOV.SG>';                              
    PUT @01 'RCPT TO:<KUI_MEAU_KIAN@HDB.GOV.SG>';                               
    PUT @01 'RCPT TO:<CHIN_CHAINN_HUEY@HDB.GOV.SG>';                            
    PUT @01 'DATA';                                                             
    PUT @01 'FROM:SOC SYSTEM - EMAIL ALERT';                                    
    PUT @01 'TO:<ANG_SUAT_HONG@HDB.GOV.SG>';                                    
    PUT @01 'TO:<JANICE_ML_OH@HDB.GOV.SG>';                                     
    PUT @01 'TO:<LIM_ENG_TIAM@HDB.GOV.SG>';                                     
    PUT @01 'TO:<CHIAM_CHEE_KHIANG@HDB.GOV.SG>';                                
    PUT @01 'TO:<CHIN_CHAINN_HUEY@HDB.GOV.SG>';                                 
    PUT @01 'CC:<CHUA_YEE_MIEN@HDB.GOV.SG>';                                    
    PUT @01 'CC:<LAU_HONG_HUAT@HDB.GOV.SG>';                                    
    PUT @01 'CC:<THANGATHURAI_Y_DEVI@HDB.GOV.SG>';                              
    PUT @01 'CC:<CHEW_LAY_CHENG@HDB.GOV.SG>';                                   
    PUT @01 'CC:<KUI_MEAU_KIAN@HDB.GOV.SG>';                                    
    PUT @01 'SUBJECT : Monthly report on Advance cash collected for SA';        
  RUN;                                                                          
//*---------------------------------------------------------------------        
//STEP20   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=*.STEP18.SMTPHDR,DISP=(OLD,DELETE)                            
//         DD DSN=&&MAILRCPT,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&MAILNAME,DISP=(OLD,DELETE)                                  
//         DD *                                                                 
//         DD DSN=&&BP13LSA1,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILOUT.BP13S13A,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* STEP21 : AUTO-GENERATE MAIL HEADER PART I                                   
//*          HELO SGPHDBX                                                       
//*          MAIL FROM:<XXXXXXXX@SGPHDBX>                                       
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD SYSOUT=*                                                          
//SYSEXEC  DD DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                    
//SMTPHDR  DD DSN=&&P13MHD,DISP=(NEW,PASS),                                     
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=259,RECFM=VB)                  
//SYSTSIN  DD DUMMY                                                             
//*---------------------------------------------------------------------        
//STEP22   EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                 
//SYSOUT   DD SYSOUT=*                                                          
//MAILNAME DD DSN=&&MAILNAM,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=259)                                          
//MAILRCPT DD DSN=&&MAILRCP,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=259)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
    FILE MAILNAME;                                                              
    PUT @01 '           FILENAME="BP13LSA2.TXT"';                               
    PUT @01 ' ';                                                                
  RUN;                                                                          
                                                                                
  DATA _NULL_;                                                                  
    FILE MAILRCPT;                                                              
    PUT @01 'RCPT TO:<BEATRICE_HQ_NEO@HDB.GOV.SG>';                             
    PUT @01 'RCPT TO:<JANICE_ML_OH@HDB.GOV.SG>';                                
    PUT @01 'RCPT TO:<LIM_ENG_TIAM@HDB.GOV.SG>';                                
    PUT @01 'RCPT TO:<CHIAM_CHEE_KHIANG@HDB.GOV.SG>';                           
    PUT @01 'RCPT TO:<CHEW_LAY_CHENG@HDB.GOV.SG>';                              
    PUT @01 'RCPT TO:<KUI_MEAU_KIAN@HDB.GOV.SG>';                               
    PUT @01 'RCPT TO:<CHIN_CHAINN_HUEY@HDB.GOV.SG>';                            
    PUT @01 'DATA';                                                             
    PUT @01 'FROM:SOC SYSTEM - EMAIL ALERT';                                    
    PUT @01 'TO:<BEATRICE_HQ_NEO@HDB.GOV.SG>';                                  
    PUT @01 'TO:<JANICE_ML_OH@HDB.GOV.SG>';                                     
    PUT @01 'TO:<LIM_ENG_TIAM@HDB.GOV.SG>';                                     
    PUT @01 'TO:<CHIAM_CHEE_KHIANG@HDB.GOV.SG>';                                
    PUT @01 'TO:<CHIN_CHAINN_HUEY@HDB.GOV.SG>';                                 
    PUT @01 'CC:<CHEW_LAY_CHENG@HDB.GOV.SG>';                                   
    PUT @01 'CC:<KUI_MEAU_KIAN@HDB.GOV.SG>';                                    
    PUT @01 'SUBJECT : Monthly report on Advance cash collected for 2R/3R';     
  RUN;                                                                          
//*---------------------------------------------------------------------        
//STEP23   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=*.STEP21.SMTPHDR,DISP=(OLD,DELETE)                            
//         DD DSN=&&MAILRCP,DISP=(OLD,DELETE)                                   
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&MAILNAM,DISP=(OLD,DELETE)                                   
//         DD *                                                                 
//         DD DSN=&&BP13LSA2,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILOUT.BP13S13B,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*------------------------------------------------------------------           
//* SORT ALL BP13K800 RECORDS WITH HLE TAG OF DEFER DATE                        
//*------------------------------------------------------------------           
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=((912,1,CH,EQ,C'Y'),OR,(1383,8,CH,NE,C'        ',AND,            
                                    1383,8,CH,NE,C'00000000',AND,               
                                    1383,8,CH,NE,C'CCYYMMDD'))                  
//*------------------------------------------------------------------           
//* GENERATE EMAIL FOR HLE DEFERMENT                                            
//*------------------------------------------------------------------           
//STEP25   EXEC PGM=BP13CF75,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//BP13LF75 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* GENERATE EMAIL FOR HLE DEFERMENT                                            
//*------------------------------------------------------------------           
//STEP26   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//BP13LF82 DD DSN=&&BP13LF82,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=80),                                          
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CF82) PLAN(BP13PCC) -                                      
         LIB    ('BP13.BATCH.LOADCOB')                                          
     END                                                                        
/*                                                                              
//*---------------------------------------------------------------------        
//* EXTRACT TO SEQUENTIAL FILE                                                  
//*--------------------------------------------------------------------         
//STEP27 EXEC   SORT                                                            
//SORTIN   DD  DSN=BP13.K462.SOC.TOL,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13FR01,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=1000,RECFM=FB)                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=COPY                                                             
//*-----------------------------------------------------------------            
//* WEEKLY REPORT ON RESALE COMPLETION MONITORING                               
//*-----------------------------------------------------------------            
//STEP28 EXEC PGM=BP13C0FW,COND=(0,NE)                                          
//BP13F462 DD DSN=&&BP13FR01,                                                   
//          DISP=(OLD,PASS)                                                     
//BP13K410  DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                   
//BP13K462  DD DSN=BP13.K462.SOC.TOL,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K450  DD DSN=BP13.K454.APPTABLE,DISP=SHR                                  
//BP13K451  DD DSN=BP13.K454.APPTABLE.PATH1,DISP=SHR                            
//BB24K010  DD DSN=BB24.K010.MASTER,DISP=SHR                                    
//BB24K011  DD DSN=BB24.K010.MASTER.PATH1,DISP=SHR                              
//BM06K110  DD DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BM06K111  DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                             
//BB24K130  DD DSN=BB24.K130.CANCEL,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F0FW  DD DSN=BP13.MAILOUT.RSL.SOCWEEK,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------                 
//* TO GENERATE MAIL REPORT FOR PRINTED PCD LETTERS                             
//*------------------------------------------------------------                 
//STEP29 EXEC PGM=BP13CA40,COND=(0,NE)                                          
//BP13F205 DD DSN=BP13.F205.ACCUM,DISP=SHR                                      
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13MAIL DD DSN=&&BP13L205,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=132),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//*    SORT BP13K800                                                            
//*--------------------------------------------------------------------         
//STEP30   EXEC  SORT                                                           
//SORTIN   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//             SPACE=(CYL,(50,100),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD  *                                                                
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=(1258,9,CH,NE,C'         ',AND,                               
                   1286,1,CH,NE,C'        ',AND,                                
                   1401,1,CH,EQ,C'        ')                                    
//*--------------------------------------------------------------------         
//* BP13C65F - REPORT ON DOCUMENT SENT MORE THAN 1 MONTH                        
//*            AND HLE STILL PENDING                                            
//*--------------------------------------------------------------------         
//STEP31 EXEC    PGM=BP13C65F,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&BP13F800,DISP=(SHR,PASS)                                   
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR                                    
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                              
//BP27K025 DD  DSN=BP27.K025.CAOIC,DISP=SHR                                     
//BP27K021 DD  DSN=BP27.K025.CAOIC.PATH1,DISP=SHR                               
//BP27K800 DD  DSN=BP27.K800.HLAPPLN,DISP=SHR                                   
//BP13L800 DD  DSN=BP13.L800.BP13C65F,DISP=SHR                                  
//BP13L80A DD  DSN=BP13.L80A.BP13C65F,DISP=SHR                                  
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*****************************************************************             
//*         AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*****************************************************************             
//STEP32   EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD DSN=&&P13MHDG,DISP=(NEW,PASS),                                    
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=205,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*                                                                             
//*---------------------------------------------------------------------        
//STEP33   EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                 
//SYSOUT   DD SYSOUT=*                                                          
//MAILNAME DD DSN=&&MAILNAME,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=205)                                          
//MAILRCPT DD DSN=&&MAILRCPT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=205)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
    FILE MAILNAME;                                                              
    PUT @01 '           FILENAME="BP13L65F.TXT"';                               
    PUT @01 ' ';                                                                
  RUN;                                                                          
//         DD DSN=BP13.MAIL.BP13C65F,DISP=SHR                                   
//         DD *                                                                 
    PUT @01 'SUBJECT : REPORT ON DOCUMENT SENT AND HLE STILL PENDING';          
//*---------------------------------------------------------------------        
//STEP34   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=*.STEP32.SMTPHDR,DISP=(OLD,DELETE)                            
//         DD DSN=&&MAILRCPT,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&MAILNAME,DISP=(OLD,DELETE)                                  
//         DD *                                                                 
//         DD DSN=BP13.L800.BP13C65F,DISP=SHR                                   
//         DD DSN=BP13.L80A.BP13C65F,DISP=SHR                                   
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILRPT.BP13C65F,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*--------------------------------------------------------------------         
//*    SORT BP13K800                                                            
//*--------------------------------------------------------------------         
//STEP35   EXEC  SORT                                                           
//SORTIN   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//             SPACE=(CYL,(50,100),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD  *                                                                
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=(155,11,CH,NE,C'           ',AND,                             
                   1286,1,CH,NE,C'        ',AND,                                
                   1401,1,CH,NE,C'        ')                                    
//*--------------------------------------------------------------------         
//* BP13C65G - REPORT ON DOCUMENT SENT MORE THAN 1 MONTH                        
//*            AND HLE STILL PENDING                                            
//*--------------------------------------------------------------------         
//STEP36 EXEC    PGM=BP13C65G,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&BP13F800,DISP=(SHR,PASS)                                   
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BP27K800 DD  DSN=BP27.K800.HLAPPLN,DISP=SHR                                   
//BP13L800 DD  DSN=BP13.L800.BP13C65G,DISP=SHR                                  
//BP13L80A DD  DSN=BP13.L80A.BP13C65G,DISP=SHR                                  
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*****************************************************************             
//*         AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*****************************************************************             
//STEP37   EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD DSN=&&P13MHDG,DISP=(NEW,PASS),                                    
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=205,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*                                                                             
//*---------------------------------------------------------------------        
//STEP38   EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                 
//SYSOUT   DD SYSOUT=*                                                          
//MAILNAME DD DSN=&&MAILNAME,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=205)                                          
//MAILRCPT DD DSN=&&MAILRCPT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=205)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
    FILE MAILNAME;                                                              
    PUT @01 '           FILENAME="BP13L65G.TXT"';                               
    PUT @01 ' ';                                                                
  RUN;                                                                          
//         DD DSN=BP13.MAIL.BP13C65G,DISP=SHR                                   
//         DD *                                                                 
    PUT @01 'SUBJECT : REPORT ON SENT DATE AND HLE STILL PENDING';              
//*---------------------------------------------------------------------        
//STEP39   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=*.STEP37.SMTPHDR,DISP=(OLD,DELETE)                            
//         DD DSN=&&MAILRCPT,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&MAILNAME,DISP=(OLD,DELETE)                                  
//         DD *                                                                 
//         DD DSN=BP13.L800.BP13C65G,DISP=SHR                                   
//         DD DSN=BP13.L80A.BP13C65G,DISP=SHR                                   
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILRPT.BP13C65G,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*-------------------------------------------------------------------*         
//STEP40   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.BP13S13B,DISP=SHR                                
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*-------------------------------------------------------------------*         
//STEP41   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.BP13S13A,DISP=SHR                                
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*-------------------------------------------------------------------*         
//STEP42   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=&&BP13LF82,DISP=(OLD,DELETE)                                  
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*-------------------------------------------------------------------*         
//STEP43   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.RSL.SOCWEEK,DISP=SHR                             
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL - PCD REPORT                                *         
//*-------------------------------------------------------------------*         
//STEP44   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13L205,DISP=(OLD,DELETE)                                  
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*  DETAILS OF THE HLE TRANSACTIONS                                  *         
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//STEP45   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13C65F,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*  DETAILS OF REPORT ON SENT DATE AND HLE STILL PENDING             *         
//*-------------------------------------------------------------------*         
//STEP46   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13C65G,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//*                   END   OF    JOB                                 *         
//*-------------------------------------------------------------------*         
