//BP13D114 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),         00010000
//       NOTIFY=CSD0071                                                 00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//* ============================================================== *    00040000
//*                                                                *    00050000
//*             D A I L Y    F I N A N C I A L    J O B            *    00060000
//*                                                                *    00070000
//* ============================================================== *    00080000
//* CHG REF  BY   ON       DESCRIPTION                                  00090000
//* -------- --   ------   -----------                                  00100000
//* BP136182 MRN1 190416   CREATE GRANT CREDITING FILE                  00110000
//* BP138088 PP11 261119   CATER  FOR EHG CHANGES                       00120000
//* BP138332 PP11 241120   CATER  FOR LHG CHANGES                       00121000
//* ================================================================    00130000
//*-----------------------------------------------------------------    00140000
//* EMPTY AB02 FILE                                                   * 00150000
//*-------------------------------------------------------------------* 00160000
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                  00170000
//SYSPRINT DD SYSOUT=*                                                  00180000
//INPUT1   DD DUMMY                                                     00190000
//OUTPUT1  DD DSN=BP13.AB02.F930.DBSSEC,DISP=OLD                        00200000
//SYSIN    DD *                                                         00210000
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                          00220000
//*                                                                     00230000
//*-----------------------------------------------------------------    00240000
//* EMPTY AB02 FILE                                                   * 00250000
//*-------------------------------------------------------------------* 00260000
//STEP0B   EXEC PGM=IDCAMS,COND=(0,NE)                                  00270000
//SYSPRINT DD SYSOUT=*                                                  00280000
//INPUT1   DD DUMMY                                                     00290000
//OUTPUT1  DD DSN=BP13.AB02.F930.DPFLAT,DISP=OLD                        00300000
//SYSIN    DD *                                                         00310000
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                          00320000
//*                                                                     00330000
//*-----------------------------------------------------------------    00340000
//* EMPTY AB02 FILE                                                   * 00350000
//*-------------------------------------------------------------------* 00360000
//STEP0C   EXEC PGM=IDCAMS,COND=(0,NE)                                  00370000
//SYSPRINT DD SYSOUT=*                                                  00380000
//INPUT1   DD DUMMY                                                     00390000
//OUTPUT1  DD DSN=BP13.AB02.F930.EAPG,DISP=OLD                          00400000
//SYSIN    DD *                                                         00410000
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                          00420000
//*                                                                     00430000
//*-------------------------------------------------------------------- 00440000
//*  CREATE HOUSING GRANT FILE, SORT ONLY 'HGT' CASES                   00450000
//*---------------------------------------------------------------------00460000
//STEP01   EXEC  SORT,COND=(0,NE)                                       00470000
//SORTIN   DD  DSN=BP13.FD10.VOUCHOIC.DAILY,DISP=SHR                    00480000
//SORTOUT  DD  DSN=&&BP13FD10,                                          00490000
//             DISP=(,PASS),                                            00500000
//             UNIT=(SYSDA,1),                                          00510000
//             SPACE=(CYL,(10,5),RLSE),                                 00520000
//             DCB=(RECFM=FB,LRECL=1400,BLKSIZE=0)                      00530000
//SYSIN    DD  *                                                        00540000
        SORT FIELDS=(1,3,A,4,8,A),FORMAT=CH                             00550000
        INCLUDE COND=(1,3,CH,EQ,C'HGT',AND,                             00560000
                      451,2,CH,EQ,C'  ')                                00570000
//*-----------------------------------------------------------------    00580000
//* CREATE HOUSING GRANT CREDITING FILE - DBSS AND EC                   00590000
//*-----------------------------------------------------------------    00600000
//STEP02 EXEC PGM=BP13CB3A,COND=(0,NE)                                  00610000
//BP13FD10 DD DSN=&&BP13FD10,DISP=(OLD,PASS)                            00620000
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                           00630000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              00640000
//AB02F930 DD DSN=BP13.AB02.F930.DBSSEC,DISP=OLD                        00650000
//*           DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                       00660000
//*           SPACE=(CYL,(10,10),RLSE)                                  00670000
//B02F930A DD DUMMY                                                     00680000
//SYSOUT   DD SYSOUT=*                                                  00690000
//SYSDBOUT DD SYSOUT=*                                                  00700000
/*                                                                      00710000
//*-------------------------------------------------------------------- 00720000
//* TO SORT RECORDS IN REGN SEQUENCE                                    00730000
//*---------------------------------------------------------------------00740000
//STEP03   EXEC  SORT,COND=(0,NE)                                       00750000
//SORTIN   DD  DSN=BP13.F633.AHGPVJV.DAILY,DISP=SHR                     00760000
//SORTOUT  DD  DSN=&&BP13F633,                                          00770000
//             DISP=(,PASS),                                            00780000
//             UNIT=(SYSDA,1),                                          00790000
//             SPACE=(CYL,(10,5),RLSE),                                 00800000
//             DCB=(RECFM=FB,LRECL=450,BLKSIZE=0)                       00810000
//SYSIN    DD  *                                                        00820000
        SORT FIELDS=(1,8,A),FORMAT=CH                                   00830000
//*-----------------------------------------------------------------    00840000
//* CREATE HOUSING GRANT CREDITING FILE                                 00850000
//*-----------------------------------------------------------------    00860000
//STEP04 EXEC PGM=BP13CB6A,COND=(0,NE)                                  00870000
//BP13F633 DD DSN=&&BP13F633,DISP=(OLD,PASS)                            00880000
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                           00890000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              00900000
//AB02F930 DD DSN=BP13.AB02.F930.DPFLAT,DISP=OLD                        00910000
//*           DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                       00920000
//*           SPACE=(CYL,(10,10),RLSE)                                  00930000
//B02F930A DD DUMMY                                                     00940000
//SYSOUT   DD SYSOUT=*                                                  00950000
//SYSDBOUT DD SYSOUT=*                                                  00960000
/*                                                                      00970000
//*-------------------------------------------------------------------* 00980000
//* SORT VOUCHER OIC FILE BY VOUCHER NO, INCLUDE SRG,ASG,REG,SUG,FSG  * 00990000
//*-------------------------------------------------------------------* 01000000
//STEP05   EXEC SORT,COND=(0,NE)                                        01010000
//SORTIN   DD DSN=BP13.FD10.VOUCHOIC.DAILY,DISP=SHR                     01020000
//SORTOUT  DD  DSN=&&P13FD10A,DISP=(,PASS),                             01030000
//            UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                       01040000
//            DCB=(RECFM=FB,LRECL=1400,BLKSIZE=0)                       01050000
//SYSIN    DD *                                                         01060000
      SORT FIELDS=(24,11,CH,A),FORMAT=CH                                01070000
      INCLUDE COND=((1,3,CH,EQ,C'SRG',AND,24,3,CH,EQ,C'PRD'),OR,        01080000
                    (1,3,CH,EQ,C'REG',AND,24,2,CH,EQ,C'RH'),OR,         01090000
                    (1,3,CH,EQ,C'FSG',AND,24,2,CH,EQ,C'RH'),OR,         01100000
                    (1,3,CH,EQ,C'ASG',AND,24,2,CH,EQ,C'SS'),OR,         01110000
                    (1,3,CH,EQ,C'EHG',AND,24,2,CH,EQ,C'SS'),OR,         01120000
                    (1,3,CH,EQ,C'LHG',AND,24,2,CH,EQ,C'SS'),OR,         01121000
                    (1,3,CH,EQ,C'HGT',AND,24,2,CH,EQ,C'SS',AND,         01130000
                     4,1,CH,EQ,C'6',AND,451,2,CH,NE,C'  '),OR,          01140000
                    (1,3,CH,EQ,C'TUG',AND,24,2,CH,EQ,C'SS'),OR,         01150000
                    (1,3,CH,EQ,C'ATG',AND,24,2,CH,EQ,C'SS'),OR,         01160000
                    (1,3,CH,EQ,C'SUG',AND,24,2,CH,EQ,C'SS')),FORMAT=CH  01170000
//*---------------------------------------------------------------------01180000
//* SORT THOSE STATUS PREVIOUSLY NOT A                                  01190000
//*---------------------------------------------------------------------01200000
//STEP06 EXEC    SORT,COND=(0,NE)                                       01210000
//SORTIN   DD  DSN=BP13.AB02.F930.GRNT.STATNOTA,DISP=SHR                01220000
//SORTOUT  DD  DSN=&&AB02F93A,DISP=(,PASS),                             01230000
//         UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                           01240000
//         DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                       01250000
//SYSIN    DD  *                                                        01260000
  SORT FIELDS=(57,11,CH,A),FORMAT=CH                                    01270000
//*-----------------------------------------------------------------    01280000
//* CREATE HOUSING GRANT CREDITING FILE                                 01290000
//*-----------------------------------------------------------------    01300000
//STEP07 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K         01310000
//BP13FD10 DD DSN=&&P13FD10A,DISP=(OLD,PASS)                            01320000
//AB02F93A DD DSN=&&AB02F93A,DISP=(OLD,PASS)                            01330000
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                           01340000
//BP13KD10 DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR                           01350000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              01360000
//AB02F930 DD DSN=BP13.AB02.F930.EAPG,DISP=OLD                          01370000
//AB02F93B DD DSN=BP13.AB02.F930.GRNT.STATNOTA,DISP=OLD                 01380000
//AB02F93C DD DSN=BP13.AB02.F930.GRNT.BKP,DISP=MOD                      01390000
//AB02F93D DD DSN=BP13.AB02.F930.GRNT.STATA,DISP=MOD                    01400000
//SYSOUT   DD SYSOUT=*                                                  01410000
//SYSTSPRT DD SYSOUT=*                                                  01420000
//SYSPRINT DD SYSOUT=*                                                  01430000
//SYSDBG   DD SYSOUT=*                                                  01440000
//SYSDBOUT DD SYSOUT=*                                                  01450000
//SYSTSIN  DD *                                                         01460000
  DSN SYSTEM(DSN)                                                       01470000
  RUN PROGRAM(BP13CB3C) PLAN(BP13PCC) -                                 01480000
      LIB('BP13.BATCH.LOADCOB')                                         01490000
  END                                                                   01500000
/*                                                                      01510000
//*---------------------------------------------------------------------01520000
//* MOD TO DAILY FILE                                                   01530000
//*---------------------------------------------------------------------01540000
//STEP08 EXEC    SORT,COND=(0,NE)                                       01550000
//SORTIN   DD  DSN=BP13.AB02.F930.DBSSEC,DISP=SHR                       01560000
//         DD  DSN=BP13.AB02.F930.DPFLAT,DISP=SHR                       01570000
//         DD  DSN=BP13.AB02.F930.EAPG,DISP=SHR                         01580000
//SORTOUT  DD  DSN=&&AB02F930,DISP=(,PASS),                             01590000
//         UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                           01600000
//         DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                       01610000
//SYSIN    DD  *                                                        01620000
  SORT FIELDS=(1,64,CH,A),FORMAT=CH                                     01630000
//*---------------------------------------------------------------------01640000
//*REMOVE DUPLICATE RECORDS                                             01650000
//*-----------------------------------------------------------------    01660000
//STEP09 EXEC PGM=BP13CB7A,COND=(0,NE)                                  01670000
//AB02F930 DD DSN=&&AB02F930,DISP=(OLD,DELETE)                          01680000
//B02F930A DD DSN=BP13.AB02.F930.GRNT,DISP=MOD                          01690000
//B02F930B DD DSN=BP13.AB02.F930.GRNT.DUPL,DISP=MOD                     01700000
//SYSOUT   DD SYSOUT=*                                                  01710000
//SYSDBOUT DD SYSOUT=*                                                  01720000
//*-----------------------------------------------------------------    01730000
//* BACKUP FILE                                                         01740000
//*---------------------------------------------------------------------01750000
//STEP10 EXEC    SORT,COND=(0,NE)                                       01760000
//SORTIN   DD  DSN=BP13.AB02.F930.GRNT,DISP=SHR                         01770000
//SORTOUT  DD  DSN=BP13.AB02.F930.DAILY,DISP=OLD                        01780000
//SYSIN    DD  *                                                        01790000
  SORT FIELDS=(1,64,CH,A),FORMAT=CH                                     01800000
//*-------------------------------------------------------------------* 01810000
//*          E N D      O F     J O B                                 * 01820000
//*-------------------------------------------------------------------* 01830000
