//BP13A503 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* PRE-ELIGIBILITY CHECK FOR NON-MATURE ESTATES                                
//*-----------------------------------------------------------------            
//* CHG REF  BY  ON      DESCRIPTION                                            
//*--------- --- ------  -----------                                            
//* BP130418 CLT 980922  Y2K COMPLIANCE CHANGE :                                
//*                      STEP12 - BM06K110                                      
//*                      STEP20 - BP13K800                                      
//* BP130652     990823  EXPAND F500, F520, K520 RECL 300-500                   
//* BP130871 SSS 000609  LISTING FOR EAALSS                                     
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET                                                                    
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=====================================================================        
//* SORT THE SEQUENCE FILE UPDATED WITH HOUSEHOLD TYPE IN REGN-NO ORDER         
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.WAITLIST,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F500,DISP=(,PASS),                                      
//            UNIT=(SYSDA,3),SPACE=(CYL,(80,20),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* TO CREATE THE BALLOT FILE FOR NON-MATURE NEW TOWN REQUESTS                  
//* THE FILE IS READY FOR PIGEONHOLING/ONLINE UPDATE OF WEIGHTAGE               
//*      DEL (BP13.K520.BP13A518) CL PURGE                                      
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEF CL (NAME(BP13.K520.BP13A518)        -                              
                 CYL(100 20)                     -                              
                 UNIQUE                          -                              
                 SPEED                           -                              
                 IMBED                           -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K520.BP13A518.DATA)  -                              
                 KEYS(8 122)                     -                              
                 RECSZ(500 500)                  -                              
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K520.BP13A518)                                        
//*=====================================================================        
//*   TO CREATE A FILE WITH NRIC1 AND REGN NO                                   
//*   EXTRACTED FROM BP13K800                                                   
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13OUTR,DISP=(,PASS),                                       
//            SPACE=(CYL,(100,10),RLSE),UNIT=SYSDA,                             
//            DCB=(RECFM=FB,LRECL=30,BLKSIZE=23460)                             
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     OUTREC FIELDS=(4,8,88,9,13X)                                               
//*---------------------------------------------------------------------        
//*   ACCUM FILE WITH NRIC2 AND REGN NO                                         
//*   EXTRACTED FROM BP13K800                                                   
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13OUTR,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     OMIT COND=(97,9,CH,EQ,C'         ')                                        
     OUTREC FIELDS=(4,8,97,9,13X)                                               
//*---------------------------------------------------------------------        
//*   ACCUM FILE WITH NRIC3 AND REGN NO                                         
//*   EXTRACTED FROM BP13K800                                                   
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13OUTR,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     OMIT COND=(106,9,CH,EQ,C'         ')                                       
     OUTREC FIELDS=(4,8,106,9,13X)                                              
//*---------------------------------------------------------------------        
//*   ACCUM FILE WITH NRIC4 AND REGN NO                                         
//*   EXTRACTED FROM BP13K800                                                   
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13OUTR,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     OMIT COND=(115,9,CH,EQ,C'         ')                                       
     OUTREC FIELDS=(4,8,115,9,13X)                                              
//*---------------------------------------------------------------------        
//*   SORT P13F586 IN NRIC SEQUENCE                                             
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13OUTR,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&BP13MR,DISP=(,PASS),                                        
//            SPACE=(CYL,(100,10),RLSE),UNIT=SYSDA,                             
//            DCB=(RECFM=FB,LRECL=30,BLKSIZE=23460)                             
//SYSIN    DD *                                                                 
      SORT FIELDS=(9,9,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//*   SORT NRIC FROM BP13K825                                                   
//*     (OMIT LESSEE-CHK TAG = 'N')                                             
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&P13SOC,DISP=(,PASS),                                        
//            SPACE=(CYL,(80,15),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=30,BLKSIZE=23460)                             
//SYSIN    DD *                                                                 
     SORT FIELDS=(9,9,A),FORMAT=CH                                              
     OMIT COND=(9,1,CH,LE,C' ',OR,                                              
                131,1,CH,EQ,C'N')                                               
     OUTREC FIELDS=(8X,9,9,1,8,5X)                                              
//*---------------------------------------------------------------------        
//*   SORT P13REQ  IN NRIC SEQUENCE                                             
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13SOC,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&P13REQ,DISP=(,PASS),                                        
//            SPACE=(CYL,(100,10),RLSE),UNIT=SYSDA,                             
//            DCB=(RECFM=FB,LRECL=30,BLKSIZE=23460)                             
//SYSIN    DD *                                                                 
      SORT FIELDS=(9,9,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//*   MATCHED REQUEST REC WITH NRIC IN RFF MASTER, IF MATCHED,                  
//*   OUTPUT NRIC AND REGN NO                                                   
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13C580,COND=(0,NE)                                        
//BP13REQ  DD DSN=&&P13REQ,DISP=(OLD,PASS)                                      
//BP13MR   DD DSN=&&BP13MR,DISP=(OLD,PASS)                                      
//BP13F587 DD DSN=&&BP13F587,DISP=(,PASS),                                      
//            SPACE=(TRK,(200,10),RLSE),UNIT=SYSDA,                             
//            DCB=(RECFM=FB,LRECL=30,BLKSIZE=23460)                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  SORT REGN/NRIC FILE BY NRIC , REGN  ORDER                                  
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F587,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F586C,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(200,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=30,BLKSIZE=23460)                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A,1,8,A),FORMAT=CH,FILSZ=E1500                              
//*---------------------------------------------------------------------        
//*   TO  MATCH THE REGN NO IN BP13K800 WITH BM06K211                           
//*   UPDATE INELIGIBLE TAG 'SS' OR 'SL' OR 'RJ' OR 'RE' TO REQ FILE            
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13C573,COND=(0,NE)                                        
//BP13K520 DD DSN=BP13.K520.BP13A518,DISP=SHR                                   
//BP13F586 DD DSN=&&P13F586C,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//            AMP=('BUFND=8','BUFNI=4')                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*   SORT BP13K780 BY NT, FT, NRIC SEQUENCE                                    
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BP13A518,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&INELIG,DISP=(,PASS),                                        
//            SPACE=(CYL,(80,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(41,9,A),FORMAT=CH                                            
      OMIT    COND=(258,2,CH,EQ,C'  ')                                          
//*---------------------------------------------------------------------        
//*   INCLUDE INELIGIBLE REQUESTS - SHORTLIST (SL)                              
//*---------------------------------------------------------------------        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&INELIG,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&SLIST,DISP=(,PASS),                                         
//            SPACE=(CYL,(80,20),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      INCLUDE COND=(258,2,CH,EQ,C'SL')                                          
//*---------------------------------------------------------------------        
//*   INCLUDE INELIGIBLE REQUESTS - OTHER THAN SHORTLISTED                      
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&INELIG,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&OTHER,DISP=(,PASS),                                         
//            SPACE=(CYL,(80,20),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      OMIT COND=(258,2,CH,EQ,C'SL',OR,                                          
                 258,2,CH,EQ,C'U ')                                             
//*-----------------------------------------------------------------            
//*   TO  PRINT OUT THE INELIGIBLE CASES REQUESTS                               
//*   DUE TO SHORTLISTED (SL)                                                   
//*-----------------------------------------------------------------            
//STEP16   EXEC PGM=BP13C578,COND=(0,NE)                                        
//BP13F520 DD DSN=&&SLIST,DISP=(OLD,PASS)                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K825 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//P13L578A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*   TO  PRINT OUT THE INELIGIBLE CASES REQUESTS                               
//*   DUE TO REASONS OTHER THAN SHORTLISTED                                     
//*-----------------------------------------------------------------            
//STEP17   EXEC PGM=BP13C578,COND=(0,NE)                                        
//BP13F520 DD DSN=&&OTHER,DISP=(OLD,PASS)                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K825 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//P13L578A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*  REPRO BALLOT FILE TO SEQUENTIAL FILE                                       
//*-----------------------------------------------------------------            
//STEP18   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K520.BP13A518,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F500.WAITLIST,DISP=OLD                                   
//SYSIN    DD *                                                                 
    REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                      
//*                                                                             
//*-----------------------------------------------------------------            
//* DELETE TEMPORARY FILE                                                       
//*-----------------------------------------------------------------            
//STEP19   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DEL (BP13.K520.BP13A518) CL PURGE                                           
//*                                                                             
//*-----------------------------------------------------------------            
//* EXTRACT WAITING LIST APPLICATIONS                                           
//*-----------------------------------------------------------------            
//STEP20   EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=&&BP13F800,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(150,10),RLSE),                            
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                4,1,CH,LT,C'9',AND,                                             
                30,1,CH,NE,C'3',AND,                                            
                32,1,CH,NE,C'C',AND,                                            
                155,11,CH,EQ,C'           ')                                    
/*                                                                              
//*-----------------------------------------------------------------            
//*  VALIDATE ZONE/DTE-BALLOT/HOUSEHOLD TYPE                                    
//*-----------------------------------------------------------------            
//STEP21   EXEC PGM=BP13C878,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13L878 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
