//BP13ARSB JOB (BP13P),'SBF RSLT',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*                                                                             
//*===================================================================*         
//*         TO CREATE RESULT FILE FOR                                 *         
//*         SALE OF BALANCE FLATS                                     *         
//*===================================================================*         
//*  TO MERGE PAST RECORDS -REMOVE OLD RESULTS                                  
//*-------------------------------------------------------------------*         
//EXTOLD  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K761.BTO.RESULT,DISP=SHR                                  
//SORTOUT DD DSN=&&BP13F76A,DISP=(,PASS),                                       
//           UNIT=SYSDA,DCB=(RECFM=FB,LRECL=50),                                
//           SPACE=(CYL,(50,25),RLSE)                                           
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   OMIT COND=(31,6,CH,LE,C'201808')                                             
//*-------------------------------------------------------------------*         
//* CREATE FILE                                                                 
//*-------------------------------------------------------------------*         
//CRK761    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=&&BP13F76A,DISP=SHR                                          
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL (BP13.K761.BTO.RESULT) CL PURGE                                   
          DEF CLUSTER                                -                          
              (NAME(BP13.K761.BTO.RESULT)            -                          
              CYL(50 20)                             -                          
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              IMBED                                  -                          
              SPEED                                  -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K761.BTO.RESULT.DATA)       -                          
              KEYS(17 0)                             -                          
              RECSZ(50 50)                           -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K761.BTO.RESULT.INDEX) -                               
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K761.BTO.RESULT)                                         
           DEF AIX (NAME(BP13.K761.BTO.RESULT.ALTX1) -                          
               REL(BP13.K761.BTO.RESULT)              -                         
               CYL(20 10)                              -                        
               REUSE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K761.BTO.RESULT.ALTX1.DATA) -                         
               KEYS(9  8)                              -                        
               CISZ(4096)                              -                        
               RECSZ(82 82)                            -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K761.BTO.RESULT.PATH1) -                          
               PENT(BP13.K761.BTO.RESULT.ALTX1))                                
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K761.BTO.RESULT)               -                        
               ODS(BP13.K761.BTO.RESULT.ALTX1)                                  
//*---------------------------------------------------------------------        
//* ADD IN CURRENT SBF RESULT EG.MAY 16 SBF                                     
//*---------------------------------------------------------------------        
//ADDRES   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F52O,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(50,25),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(33,8,A),FORMAT=CH                                                
//*                                                                             
//*-------------------------------------------------------------------*         
//* RUN BP13CRSB TO CREATE RESULT FILE                                *         
//*-------------------------------------------------------------------*         
//CRERES   EXEC PGM=BP13CRSB,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F52O,DISP=(OLD,PASS)                                    
//BP13K761 DD DSN=BP13.K761.BTO.RESULT,DISP=SHR                                 
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13LC30 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
