//BP13REVF JOB (BP13P),'BP13REVF',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//        NOTIFY=CSD0071,TYPRUN=HOLD                                            
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* CHG-NO   BY  ON     - DESCRIPTION                                           
//*-----------------------------------------------                              
//* BP134304 LSB 180811 - EXPAND REC SIZE                                       
//******************************************************************            
//* RESTORE BP13.K895.OCCUP.HISTORY FROM BACKUP TAPE                            
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F895.OCCUP.HISTORY.YEAR(0),DISP=SHR,                     
//            UNIT=CART,LABEL=(2,SL)                                    00000870
//SORTOUT  DD DSN=&&BP13F895,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=450,BLKSIZE=0),                               
//            SPACE=(CYL,(600,30),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(418,33,A),FORMAT=CH                                             
   SUM FIELDS=NONE                                                              
//*-----------------------------------------------------------------            
//*  CREATE SOC OCCUP.HISTORYIER FILE ( BP13.K895.OCCUP.HISTORY )               
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13F895,DISP=(OLD,PASS)                                    
//SYSIN    DD  *                                                                
          DEL 'BP13.K895.OCCUP.HISTORY' CL PURGE                        00810000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K895.OCCUP.HISTORY)         -                  00810000
              CYL(600 50)                           -                   00830000
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K895.OCCUP.HISTORY.DATA)    -                  00870000
              KEYS(33 417)                             -                00880000
              RECSZ(450 450)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K895.OCCUP.HISTORY.INDEX)   -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K895.OCCUP.HISTORY)                              00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.K895.OCCUP.HISTORY.ALTX1) -               00980000
               REL(BP13.K895.OCCUP.HISTORY)          -                  00990000
               REUSE                                 -                  01010000
               KEYS(9 425)                             -                01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.K895.OCCUP.HISTORY.ALTX1.DATA) -              01070000
               CYL(300 50)                          -                   01080000
               RECSZ(150 2150)                         -                01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.K895.OCCUP.HISTORY.ALTX1.INDEX) -             01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.K895.OCCUP.HISTORY.PATH1) -              01160000
               PENT(BP13.K895.OCCUP.HISTORY.ALTX1))                     01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.K895.OCCUP.HISTORY)          -                  01190000
               ODS(BP13.K895.OCCUP.HISTORY.ALTX1)                       01200000
