//BP13A616 JOB (BP13P),'BP13A616',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//         NOTIFY=CSD0071                                               00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//**************************************************************        00030100
//* JCL TO SPLIT STUDIO AND NON-STUDIO FLATS (QUARTERLY SALE)           00030200
//*-------------------------------------------------------------        00030300
//* CHGE REQ  BY     DATE    DESCRIPTION                                00030400
//* -------- ---- -------- -----------------------------------------    00030500
//* BP133440  IL5 20102008 NEW                                          00030600
//*-----------------------------------------------------------------    00030700
//**************************************************************        00030800
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT          00030900
//*  DATASET                                                            00031000
//**************************************************************        00031100
//PRT01    EXEC PGM=IEBGENER                                            00031200
//SYSUT1   DD *                                                         00031300
$DJDE$ JDE=13K520,JDL=BP13,END;                                         00031400
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSSS1A                           00031500
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00031600
//SYSPRINT DD SYSOUT=*                                                  00031700
//SYSIN    DD DUMMY                                                     00031800
//**************************************************************        00031900
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT          00032000
//*  DATASET                                                            00032100
//**************************************************************        00032200
//PRT02    EXEC PGM=IEBGENER                                            00032300
//SYSUT1   DD *                                                         00032400
$DJDE$ JDE=13K520,JDL=BP13,END;                                         00032500
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSSS1B                           00032600
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00032700
//SYSPRINT DD SYSOUT=*                                                  00032800
//SYSIN    DD DUMMY                                                     00032900
//*---------------------------------------------------------------------00033000
//* DELETE INTERMEDIATE FILES                                           00033100
//*---------------------------------------------------------------------00033200
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                  00033300
//SYSPRINT DD SYSOUT=*                                                  00033400
//SYSIN    DD *                                                         00033500
         DEL 'BP13.F740.MATUREBA.NNSTUDIO.BALLOT'                       00033700
              IF MAXCC < 12 THEN                                        00033801
                 SET MAXCC = 0                                          00033901
//*-------------------------------------------------------------------* 00034000
//* SORT BP13F740 BY REGN NO, RANDOM KEY DESC (STUDIO APT)            * 00034100
//*-------------------------------------------------------------------* 00034200
//STEP02   EXEC SORT,COND=(0,NE)                                        00034300
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                            00034400
//SORTOUT DD DSN=BP13.F740.MATUREBA.NNSTUDIO.BALLOT,DISP=(,CATLG),      00034500
//      SPACE=(CYL,(48,10),RLSE),                                       00034600
//      DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                          00034700
//SYSIN   DD  *                                                         00034800
    SORT FIELDS=(1,28,A),FORMAT=CH                                      00034900
//*-------------------------------------------------------------------* 00035000
//* SORT BP13F740 BY REGN NO, RANDOM KEY DESC (NON-STUDIO APARTMENT)  * 00035100
//*-------------------------------------------------------------------* 00035200
//STEP03   EXEC SORT,COND=(0,NE)                                        00035300
//SORTIN  DD DSN=BP13.F740.MATUREBA.STUDIO,DISP=SHR                     00035400
//        DD DSN=BP13.F740.MATUREBA.NNSTUDIO.BALLOT,DISP=SHR            00035500
//SORTOUT DD DSN=&&BP13F740,DISP=(NEW,PASS),                            00035600
//      SPACE=(CYL,(48,10),RLSE),                                       00035700
//      DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                          00035800
//SYSIN   DD  *                                                         00035900
    SORT FIELDS=(1,28,A),FORMAT=CH                                      00036000
//*---------------------------------------------------------------------00036100
//* DELETE BALLOT FILE                                                  00036200
//*---------------------------------------------------------------------00036300
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                  00036400
//SYSPRINT DD SYSOUT=*                                                  00036500
//SYSIN    DD *                                                         00036600
         DEL (BP13.K740.MATUREBA) CL PURGE                              00036700
//*---------------------------------------------------------------------00036800
//* TO CREATE THE BALLOT FILE & TO ENSURE THAT NO DUPLICATE RANDOM NO   00036900
//* BY USINF DEFINE VSAM BALLOT FILE                                    00037000
//*---------------------------------------------------------------------00037100
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                  00038000
//SYSPRINT DD SYSOUT=*                                                  00039000
//INPUT    DD DSN=&&BP13F740,DISP=(SHR,DELETE)                          00040000
//SYSIN    DD *                                                         00041000
         DEF CL (NAME(BP13.K740.MATUREBA)        -                      00042000
                 CYL(36 5)                       -                      00042100
                 UNIQUE                          -                      00042200
                 SPEED                           -                      00042300
                 STORCLAS(PRODRLS)               -                      00042400
                 LOG(NONE)                       -                      00042500
                 SHR(2 3))                       -                      00042600
                 DATA                            -                      00042700
                 (NAME(BP13.K740.MATUREBA.DATA)  -                      00042800
                 KEYS(28 0)                      -                      00042900
                 RECSZ(500 500)                  -                      00043000
                 FSPC(10 10)                     -                      00043100
                 CISZ(4096))                                            00043200
         IF LASTCC = 0 THEN                      -                      00043300
           REPRO IFILE(INPUT)                    -                      00043400
                 ODS(BP13.K740.MATUREBA)                                00043500
//*-------------------------------------------------------------------- 00043600
//*      TO CREATE PATH/ALTX FOR MATUREBA BALLOT FILE                   00043700
//*-------------------------------------------------------------------- 00043800
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                  00043900
//SYSPRINT DD SYSOUT=*                                                  00044000
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR                           00045000
//SYSIN    DD  *                                                        00046000
           DEF AIX (NAME(BP13.K740.MATUREBA.ALTX1)   -                  00047000
               REL(BP13.K740.MATUREBA)               -                  00048000
               REUSE                                 -                  00049000
               KEYS(8 122)                            -                 00050000
               SHR(2 3)                              -                  00060000
               NUNQK)                                -                  00070000
               DATA                                  -                  00080000
               (NAME(BP13.K740.MATUREBA.ALTX1.DATA) -                   00090000
               CYL(10 5)                              -                 00100000
               RECSZ(31 354)                         -                  00110000
               FSPC(10 10)                           -                  00120000
               CISZ(4096))                           -                  00130000
               INDEX                                 -                  00140000
               (NAME(BP13.K740.MATUREBA.ALTX1.INDEX) -                  00150000
               CISZ(4096))                                              00160000
         IF MAXCC = 0 THEN                           -                  00170000
           DEF PATH (NAME(BP13.K740.MATUREBA.PATH1) -                   00180000
               PENT(BP13.K740.MATUREBA.ALTX1))                          00190000
         IF MAXCC = 0 THEN                                              00200000
           BIX IDS(BP13.K740.MATUREBA)               -                  00210000
               ODS(BP13.K740.MATUREBA.ALTX1)                            00220000
