//BP13A344 JOB (BP13P),'BP13A344',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR PRINTING OF LIST OF REGN NUMBER FOR                         
//* CLOSING CEREMONY PER BLOCK                                                  
//******************************************************************            
//*CHG REQ  OIC   DATE    DESCRIPTION                                           
//*=====================================                                        
//*BP133926 ESA1 24/06/10 NEW JCL                                               
//******************************************************************            
//*                   FOR CONTROL LIST                                          
//******************************************************************            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*--------------------------------------------------------------------         
//*    SORT OUT RECORDS UPDATED THROUGH M198 PANEL                              
//*--------------------------------------------------------------------         
//STEP01   EXEC  SORT                                                           
//SORTIN   DD  DSN=BM06.K190.LOG,                                               
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F190,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=650,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
   INCLUDE COND=(637,6,CH,EQ,C'B34400')                                         
   SUM FIELDS=NONE                                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* BP13C41B - PRINT REPORT ON CLOSING CEREMONY FILE                            
//*--------------------------------------------------------------------         
//STEP02 EXEC    PGM=BP13C41B,COND=(0,NE)                                       
//BM06F190 DD  DSN=&&BM06F190,DISP=(SHR,PASS)                                   
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR                                     
//BM06K510 DD  DSN=BM06.K510.ESTCDE,DISP=SHR                                    
//BP13K421 DD  DSN=BP13.K421.CC.INFO,DISP=SHR                                   
//BP13L41B DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* END OF BP13A344                                                             
//*-----------------------------------------------------------------            
