//BP13A59I  JOB (BP13P),'BP13A59I',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//*                                                                             
//*  THIS JOB IS USE FOR GENERATING BP13F23A FOR EMAIL SENDING FOR              
//*  ROF CASES                                                                  
//*                                                                             
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---  -------- -----------                                          
//* BP136922 ZDD1 100817   NEW JCL                                              
//* BP137460 MRN1 130918   SPLIT F23A INTO TWO FOR BOTH R1 AND R2               
//*                        - FIRST 2000 AND NEXT 2000 RECS                      
//* BP137698 MRN1 280219   CLEAR FILES BEFORE ALL THE STEPS                     
//*=================================================================            
//*-------------------------------------------------------------------*         
//*      CLEAR BP13.F23A.EMAIL.ROF.R1.F01                             *         
//*            BP13.F23A.EMAIL.ROF.R1.F02                             *         
//*            BP13.F23A.EMAIL.ROF.R2.F01                             *         
//*            BP13.F23A.EMAIL.ROF.R2.F02                             *         
//*-------------------------------------------------------------------*         
//STEP00    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DUMMY                                                            
//OUTPUT1   DD DSN=BP13.F23A.EMAIL.ROF.R1.F01,DISP=OLD                          
//OUTPUT2   DD DSN=BP13.F23A.EMAIL.ROF.R1.F02,DISP=OLD                          
//OUTPUT3   DD DSN=BP13.F23A.EMAIL.ROF.R2.F01,DISP=OLD                          
//OUTPUT4   DD DSN=BP13.F23A.EMAIL.ROF.R2.F02,DISP=OLD                          
//SYSIN     DD *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT2)                                     
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT3)                                     
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT4)                                     
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO CREATE BP13F23A RECORD                                      *           
//*  BP13F74A - THOSE CASES WITH OUT HP AND EMAIL                   *           
//*-----------------------------------------------------------------*           
//STEP01   EXEC PGM=BP13CFA7,COND=(0,NE)                                        
//BP13F740 DD DSN=BP13.F740.WITH.EMAIL.ROF,DISP=SHR                             
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR,                                     
//           AMP=('BUFND=4','BUFNI=8')                                          
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//           AMP=('BUFND=4','BUFNI=8')                                          
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//           AMP=('BUFND=4','BUFNI=8')                                          
//BP13F23A DD DSN=&&BP13F23A,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                            
//             DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB)                           
//BP13F74A DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT ALL SMS FILES                                                          
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F23A,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.F23A.EMAIL.ROF,DISP=SHR                                  
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,19,A),FORMAT=CH                                                
//*-------------------------------------------------------------------*         
//*  BACKUP SMS FILES                                                           
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.ROF,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.ROF.BACKUP(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(50,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* SEPARATE R1                                                                 
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F23A.EMAIL.ROF,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F23A.EMAIL.ROF.R1,DISP=SHR                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,19,A),FORMAT=CH                                                
  INCLUDE COND=(11,2,CH,EQ,C'R1')                                               
//*---------------------------------------------------------------------        
//* SEPARATE R2                                                                 
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F23A.EMAIL.ROF,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F23A.EMAIL.ROF.R2,DISP=SHR                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,19,A),FORMAT=CH                                                
  INCLUDE COND=(11,2,CH,EQ,C'R2')                                               
//*-------------------------------------------------------------------          
//* STEP06:  GET FIRST 2000 RECS FOR EMAIL                             *        
//*--------------------------------------------------------------------*        
//STEP06   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.ROF.R1,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.ROF.R1.F01,DISP=SHR                           
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000)                         
//*--------------------------------------------------------------------*        
//* STEP07:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP06.RC = 0) THEN                                               
//STEP07   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.ROF.R1,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.ROF.R1.F02,DISP=SHR                           
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(2000)              
//ENDTEST1  ENDIF                                                               
//*-------------------------------------------------------------------*         
//* STEP08:  GET FIRST 2000 RECS FOR EMAIL                             *        
//*--------------------------------------------------------------------*        
//STEP08   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.ROF.R2,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.ROF.R2.F01,DISP=SHR                           
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000)                         
//*--------------------------------------------------------------------*        
//* STEP09:  GET NEXT 2000 RECS FOR EMAIL                              *        
//*--------------------------------------------------------------------*        
//IFTEST1 IF (STEP08.RC = 0) THEN                                               
//STEP09   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F23A.EMAIL.ROF.R2,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.F23A.EMAIL.ROF.R2.F02,DISP=SHR                           
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) COUNT(2000) SKIP(2000)              
//ENDTEST1  ENDIF                                                               
