//BP13A226 JOB (BP13P),'USER:BP13',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),   00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//********************************************************************* 00000050
//* IMPORTANT NOTE :                                                    00000060
//* THIS JCL IS FOR PRINTING CHECKLIST OF APPOINTMENT LETTERS FOR       00000070
//* STUDIO APARTMENT ONLY (BOOKING EXERCISE ON NEW TOWN BASIS).         00000080
//********************************************************************* 00000090
//* PRINT CHECKLIST OF APPOINTMENT LETTER FOR STUDIO APARTMENT          00000100
//* NO UPDATE OF APPOINTMENT DATE/TIME TO BP13K800 AND BP13K200         00000110
//********************************************************************* 00000120
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP135404 EL27 20140711 CHANGE PRINTER FROM L03Z TO X6AI                     
//* BP135404 NST1 20140719 CHANGE PRINTER FROM X6AI TO X6AU(LANDSCAPE)          
//* BP135561 ESA1 20150115 OUTPUT TO DATASET BEFORE SENDING TO PRINTER          
//********************************************************************* 00000120
//*---------------------------------------------------------------------00000130
//* SORT OUT THE CONTROL REC FOR THIS OPTION                            00000140
//*-------------------------------------------------------------------- 00000150
//STEP01 EXEC    SORT,COND=(0,NE)                                       00000160
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                    00000170
//             DISP=SHR                                                 00000180
//SORTOUT  DD  DSN=BP13.F205.SADFREC,                                   00000190
//             DISP=OLD                                                 00000200
//SYSIN    DD  *                                                        00000210
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'S1',AND,30,1,CH,EQ,C'T')                          
/*                                                                      00000220
//*-------------------------------------------------------------------- 00000230
//*  TO CREATE VSAM FILE BP13K200 (BP13.K200.BKAPPMT.DRAFT)             00000240
//*-------------------------------------------------------------------- 00000250
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE),                                00000260
//             REGION=4096K                                             00000270
//SYSPRINT DD  SYSOUT=*                                                 00000280
//INPUT    DD  DSN=BP13.BLANK.CHAR300,                                  00000290
//             DISP=SHR                                                 00000300
//SYSIN    DD  *                                                        00000310
           DEL (BP13.K200.BKAPPMT.DRAFT) CL PURGE                               
           DEF CLUSTER                                     -            00800000
               (NAME(BP13.K200.BKAPPMT.DRAFT)              -            00810000
                CYL(4 2)                                   -            00830000
                UNIQUE                                     -            00840000
                SHR(2 3))                                  -            00850000
               DATA                                        -            00860000
               (NAME(BP13.K200.BKAPPMT.DRAFT.DATA)         -            00870000
                KEYS(21 0)                                 -            00880000
                RECSZ(300 300)                             -            00890000
                CISZ(4096)                                 -            00900000
                FSPC(10 10))                               -            00910000
               INDEX                                       -            00920000
               (NAME(BP13.K200.BKAPPMT.DRAFT.INDEX)        -            00930000
                CISZ(4096))                                             00940000
           IF MAXCC = 0  THEN                              -            00950000
              REPRO IFILE(INPUT)                           -            00960000
              ODS(BP13.K200.BKAPPMT.DRAFT)                              00720000
      DEF AIX (NAME(BP13.K200.BKAPPMT.DRAFT.ALTX1)        -                     
          REL(BP13.K200.BKAPPMT.DRAFT)                    -                     
          TRK(2 3)                                   -                          
          SHR(2 3)                                   -                          
          UNIQUE                                     -                          
          KEYS(8 13)                                 -                          
          CISZ(4096)                                 -                          
          RECSZ(33 117))                                                        
      IF LASTCC = 0 THEN                             -                          
         DEF PATH(NAME(BP13.K200.BKAPPMT.DRAFT.PATH1)     -                     
             PENT(BP13.K200.BKAPPMT.DRAFT.ALTX1))                               
      IF LASTCC = 0 THEN                             -                          
         BIX IDS(BP13.K200.BKAPPMT.DRAFT)                 -                     
             ODS(BP13.K200.BKAPPMT.DRAFT.ALTX1)                                 
/*                                                                      00000320
//*--------------------------------------------------------------------*00000330
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO               00000340
//*--------------------------------------------------------------------*00000350
//STEP03 EXEC    SORT,COND=(0,NE)                                       00000360
//SORTIN   DD  DSN=BP13.F200.BKAPPMT,                                   00000370
//             DISP=SHR                                                 00000380
//SORTOUT  DD  DSN=&&P13F200A,                                          00000390
//             DISP=(NEW,PASS),                                         00000400
//             UNIT=SYSDA,                                              00000410
//             SPACE=(CYL,(10,5),RLSE),                                 00000420
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00000430
//SYSIN    DD  *                                                        00000440
    SORT FIELDS=(9,3,A,12,2,A,50,6,A,57,5,A),FORMAT=CH                          
/*                                                                      00000450
//*--------------------------------------------------------------------*00000460
//* TO EXTRACT RECORD FROM SOC MASTER ON THE REGISTERED APPLICANTS      00000470
//* BASED ON THE CONTROL RECORDS BY NT AND DATE BALLOT                  00000480
//*--------------------------------------------------------------------*00000490
//STEP04 EXEC    PGM=BP13C240,COND=(0,NE)                               00000500
//BP13F200 DD  DSN=&&P13F200A,                                          00000510
//             DISP=(SHR,PASS)                                          00000520
//BP13F205 DD  DSN=BP13.F205.SADFREC,                                   00000530
//             DISP=SHR                                                 00000540
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000550
//             DISP=SHR                                                 00000560
//P13F200O DD  DSN=&&P13F200B,                                          00000570
//             DISP=(NEW,PASS),                                         00000580
//             UNIT=SYSDA,                                              00000590
//             SPACE=(CYL,(10,5),RLSE),                                 00000600
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00000610
//P13F240O DD DSN=&&P13F240O,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FBA,LRECL=133)                                         
//SYSDBG   DD  SYSOUT=*                                                 00000640
//SYSDBOUT DD  SYSOUT=*                                                 00000650
//SYSOUT   DD  SYSOUT=*                                                 00000660
/*                                                                      00000680
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP04 IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP4A EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&P13F240O,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------*00000690
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE      00000700
//* CASES WITH DIFFERENT BALLOT QUARTER.                                00000710
//*--------------------------------------------------------------------*00000720
//STEP4B EXEC    PGM=BP13C273,COND=(0,NE)                               00000730
//BP13F200 DD  DSN=&&P13F200B,                                          00000740
//             DISP=(SHR,PASS)                                          00000750
//BP13F205 DD  DSN=BP13.F205.SADFREC,                                   00000760
//             DISP=SHR                                                 00000770
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000780
//             DISP=SHR                                                 00000790
//P13F200O DD  DSN=&&P13F200C,                                          00000800
//             DISP=(NEW,PASS),                                         00000810
//             UNIT=SYSDA,                                              00000820
//             SPACE=(CYL,(10,5),RLSE),                                 00000830
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00000840
//BP13L273 DD  DSN=&&BP13L273,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FBA,LRECL=133)                                        
//SYSDBG   DD  SYSOUT=*                                                 00000870
//SYSDBOUT DD  SYSOUT=*                                                 00000880
//SYSOUT   DD  SYSOUT=*                                                 00000890
/*                                                                      00000900
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP4B IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP4C EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L273,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------*00000910
//* TO CHECK SOC MASTER FILE FOR CASES ALREADY ACCEPTED A FLAT.         00000920
//*--------------------------------------------------------------------*00000930
//STEP4D EXEC    PGM=BP13C285,COND=(0,NE)                               00000940
//BP13F200 DD  DSN=&&P13F200C,                                          00000950
//             DISP=(SHR,PASS)                                          00000960
//BP13F205 DD  DSN=BP13.F205.SADFREC,                                   00000970
//             DISP=SHR                                                 00000980
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000990
//             DISP=SHR                                                 00001000
//P13F200O DD  DSN=&&P13F200D,                                          00001010
//             DISP=(NEW,PASS),                                         00001020
//             UNIT=SYSDA,                                              00001030
//             SPACE=(CYL,(10,5),RLSE),                                 00001040
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00001050
//BP13L285 DD DSN=&&BP13L285,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FBA,LRECL=133)                                         
//SYSDBG   DD  SYSOUT=*                                                 00001080
//SYSDBOUT DD  SYSOUT=*                                                 00001090
//SYSOUT   DD  SYSOUT=*                                                 00001100
/*                                                                      00001110
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP4D IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP4E EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L285,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------*00000690
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE      00000700
//* CASES WITH DIFFERENT ZONE/NT/FT.                                    00000710
//*--------------------------------------------------------------------*00000720
//STEP4F EXEC    PGM=BP13C27A,COND=(0,NE)                               00000730
//BP13F200 DD  DSN=&&P13F200D,                                          00000740
//             DISP=(SHR,PASS)                                          00000750
//BP13F205 DD  DSN=BP13.F205.SADFREC,                                   00000760
//             DISP=SHR                                                 00000770
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000780
//             DISP=SHR                                                 00000790
//P13F200O DD  DSN=&&P13F200E,                                          00000800
//             DISP=(NEW,PASS),                                         00000810
//             UNIT=SYSDA,                                              00000820
//             SPACE=(CYL,(10,5),RLSE),                                 00000830
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00000840
//BP13L27A DD DSN=&&BP13L27A,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FBA,LRECL=133)                                         
//SYSDBG   DD  SYSOUT=*                                                 00000870
//SYSDBOUT DD  SYSOUT=*                                                 00000880
//SYSOUT   DD  SYSOUT=*                                                 00000890
/*                                                                      00000900
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP4F IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP4G EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L27A,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------*00001120
//*  TO SCHEDULE BOOKING APPOINTMENT BY NT/FT/REGN-NO BASED ON THE     *00001130
//*  BOOKING WORK PLAN                                                 *00001140
//*--------------------------------------------------------------------*00001150
//STEP05 EXEC    PGM=BP13C249,COND=(0,NE)                               00001160
//BP13F200 DD  DSN=&&P13F200E,                                          00001170
//             DISP=(SHR,DELETE)                                        00001180
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000550
//             DISP=SHR                                                 00000560
//BP13K200 DD  DSN=BP13.K200.BKAPPMT.DRAFT,                             00001190
//             DISP=SHR,                                                00001200
//             AMP=('BUFND=8','BUFNI=4')                                00001210
//BP13K201 DD  DSN=BP13.K200.BKAPPMT.DRAFT.PATH1,                       00001190
//             DISP=SHR,                                                00001200
//             AMP=('BUFND=8','BUFNI=4')                                00001210
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                  00001220
//             DISP=SHR,                                                00001230
//             AMP=('BUFND=8','BUFNI=4')                                00001240
//SYSDBG   DD  SYSOUT=*                                                 00001250
//SYSDBOUT DD  SYSOUT=*                                                 00001260
//SYSOUT   DD  SYSOUT=A,                                                00001270
//             DEST=X6AU                                                00001280
/*                                                                      00001290
//*--------------------------------------------------------------------*00001300
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO               00001310
//*--------------------------------------------------------------------*00001320
//STEP06 EXEC    SORT,COND=(0,NE)                                       00001330
//SORTIN   DD  DSN=BP13.K200.BKAPPMT.DRAFT,                             00001340
//             DISP=SHR                                                 00001350
//SORTOUT  DD  DSN=&&P13F200F,                                          00001360
//             DISP=(NEW,PASS),                                         00001370
//             UNIT=SYSDA,                                              00001380
//             SPACE=(CYL,(10,5),RLSE),                                 00001390
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00001400
//SYSIN    DD  *                                                        00001410
    SORT FIELDS=(1,13,A,57,5,A),FORMAT=CH                                       
/*                                                                      00001420
//*----------------------------------------------------------------     00001430
//*   TO PRINT CHECK LIST OF APPOINTMENT LETTER                         00001440
//*----------------------------------------------------------------     00001450
//STEP07 EXEC    PGM=BP13C246,COND=(0,NE)                               00001460
//BP13F205 DD  DSN=BP13.F205.SADFREC,                                   00001470
//             DISP=SHR                                                 00001480
//BP13F200 DD  DSN=&&P13F200F,                                          00001490
//             DISP=(SHR,DELETE)                                        00001500
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00001510
//             DISP=SHR,                                                00001520
//             AMP=('BUFNI=8','BUFND=4')                                00001530
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                     00001540
//             DISP=SHR,                                                00001550
//             AMP=('BUFNI=8','BUFND=4')                                00001560
//BP13K830 DD  DSN=BP13.K830.ADDR,                                      00001570
//             DISP=SHR,                                                00001580
//             AMP=('BUFNI=8','BUFND=4')                                00001590
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                00001600
//             DISP=SHR,                                                00001610
//             AMP=('BUFNI=8','BUFND=4')                                00001620
//BP13L246 DD  DSN=&&BP13L246,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FBA,LRECL=133)                                        
//SYSDBG   DD  SYSOUT=*                                                 00001650
//SYSDBOUT DD  SYSOUT=*                                                 00001660
//SYSOUT   DD  SYSOUT=*                                                 00001670
/*                                                                      00001680
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP07 IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP7B EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L246,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------*00001300
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO               00001310
//*--------------------------------------------------------------------*00001320
//STEP6A EXEC    SORT,COND=(0,NE)                                       00001330
//SORTIN   DD  DSN=BP13.K200.BKAPPMT.DRAFT,                             00001340
//             DISP=SHR                                                 00001350
//SORTOUT  DD  DSN=&&P13F200G,                                          00001360
//             DISP=(NEW,PASS),                                         00001370
//             UNIT=SYSDA,                                              00001380
//             SPACE=(CYL,(10,5),RLSE),                                 00001390
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00001400
//SYSIN    DD  *                                                        00001410
    INCLUDE COND=(185,1,CH,EQ,C'P',OR,185,1,CH,EQ,C'C')                         
    SORT FIELDS=(187,5,A,185,1,D),FORMAT=CH                                     
//*----------------------------------------------------------------     00001420
//*   TO PRINT CHECK LIST OF APPOINTMENT LETTER                         00001430
//*----------------------------------------------------------------     00001440
//STEP7A EXEC    PGM=BP13C24J,COND=(0,NE)                               00001450
//BP13F200 DD  DSN=&&P13F200G,                                          00001480
//             DISP=(SHR,DELETE)                                        00001490
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00001500
//             DISP=SHR,                                                00001510
//             AMP=('BUFNI=8','BUFND=4')                                00001520
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                     00001530
//             DISP=SHR,                                                00001540
//             AMP=('BUFNI=8','BUFND=4')                                00001550
//BP13K830 DD  DSN=BP13.K830.ADDR,                                      00001560
//             DISP=SHR,                                                00001570
//             AMP=('BUFNI=8','BUFND=4')                                00001580
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                00001590
//             DISP=SHR,                                                00001600
//             AMP=('BUFNI=8','BUFND=4')                                00001610
//BP13L24J DD  DSN=&&BP13L24J,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FBA,LRECL=133)                                        
//SYSDBG   DD  SYSOUT=*                                                 00001640
//SYSDBOUT DD  SYSOUT=*                                                 00001650
//SYSOUT   DD  SYSOUT=*                                                 00001660
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP7A IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP7C EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L24J,                                                  
//             DISP=(OLD,PASS)                                                  
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*----------------------------------------------------------------     00001690
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                    00001700
//*----------------------------------------------------------------     00001710
//STEP08 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00001720
//SYSPRINT DD  SYSOUT=*                                                 00001730
//INPUT1   DD  DSN=BP13.F205.SADFREC,                                   00001740
//             DISP=SHR                                                 00001750
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                     00001760
//             DISP=MOD                                                 00001770
//SYSIN    DD  *                                                        00001780
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                      00001790
//*----------------------------------------------------------------             
//*  CREATE SOFTCOPY REPORT FOR ALL REPORTS PRINTED                             
//*----------------------------------------------------------------             
//STEP09 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&P13F240O,DISP=(SHR,PASS)                                   
//         DD  DSN=&&BP13L273,DISP=(SHR,PASS)                                   
//         DD  DSN=&&BP13L285,DISP=(SHR,PASS)                                   
//         DD  DSN=&&BP13L27A,DISP=(SHR,PASS)                                   
//         DD  DSN=&&BP13L246,DISP=(SHR,PASS)                                   
//         DD  DSN=&&BP13L24J,DISP=(SHR,PASS)                                   
//OUTPUT1  DD  DSN=BP13.L226.RPT,                                               
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
//*                                                                             
//*---------------------------------------------------------------------00001800
//* END BP13A210                                                        00001810
//*---------------------------------------------------------------------00001820
