//BP13D540 JOB (BP13P),'BP13D540',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB02288
//         NOTIFY=CSD0071                                                       
//*====================================================================         
//* BATCH DAILY JOB TO EXTRACT RECORDS FROM BP13K730                            
//* TAGGED AS 'P' AND 'S' IN NUM-CCA FIELD                                      
//*====================================================================         
//* CHG REF#   BY   MMDDCCYY  DESCRIPTION                                       
//* --------  ----  --------  -----------------------------------------         
//* BP138591  AM25  27012021  NEW JOB STREAM                                    
//*           IL5   04022021  EXTRACT ALL 1F APPLICATION INSTEAD OF             
//*                           ONLY 'P' AND 'S'                                  
//*                 08022021  INCLUDE EMAIL FROM BP13K757                       
//* BP139409  AM25  17112022  ADD BP13K830, INCR RECL OF BP13FM00 TO            
//*                           984 FROM 829 & WORKSET SPACE FOR BP13S575         
//*           AM25  24112022  REMOVE BP13K830 AND CHG RECL OF BP13FM00          
//*                           TO 949 FROM 984 FOR BP13S575                      
//*====================================================================         
//*--------------------------------------------------------------------         
//* STEP0  :  TO DELETE DATASETS                                                
//*--------------------------------------------------------------------         
//STEP0    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.BP13FM00.BP13D540')                                             
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*--------------------------------------------------------------------         
//* SORT OUT CCA TAG P/S IN K730                                                
//*--------------------------------------------------------------------         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730,DISP=(NEW,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(211,2,CH,EQ,C'1F')                                            
//*--------------------------------------------------------------------         
//* FORMAT SALES INTERFACE FILE FROM EXTRACTED RECORDS                          
//*--------------------------------------------------------------------         
//STEP10   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//BP13F730 DD DSN=&&F730,DISP=(OLD,DELETE)                                      
//BP13F825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//BP13FM00 DD DSN=BP13.BP13FM00.BP13D540,DISP=(NEW,CATLG),                      
//            DCB=(RECFM=FB,LRECL=949,BLKSIZE=0),                               
//            SPACE=(CYL,(50,10),RLSE),DATACLAS=MULTIVOL                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S575),DISP=SHR                             
/*                                                                              
