//BP13M518  JOB (BP13P),'BP13M518',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),   00000108
//        NOTIFY=CSD0071                                                00000208
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00000308
//*---------------------------------------------------------------------00000408
//* MONTH JOB TO PROCESS AHG/SHG FOR HDB FLATS EXCLUDE EC/DBSS          00000508
//*=====================================================================00000608
//*---------------------------------------------------------------------00000708
//* CHG REF  OIC  DATE     DESCRIPTION                                  00000808
//* -------- ---- -------- -----------                                  00000908
//* BP134641 MDT2 20120806 EXPAND RECORD LENGTH OF BP13KD05 FROM 300 TO 00001008
//*                        500                                          00001108
//* BP135129 LJL1 20140228 TO CATER FOR SUG AND PRINT FINANCE'S         00001208
//*                        AHG/SHG RECONCILIATION REPORT                00001308
//* BP134970 LJL1 20140331 TO FILTER OUT SERS CASES THAT DO NOT HAVE    00001408
//*                        AHG/SHG/SUG DISBURSED.                       00001508
//* BP135398 LJL1 20140715 TO CATER FOR REGN STARTING WITH '3'          00001608
//* BP135762 MRN1 20150519 TO CREATE/UPDATE KD09 WITH SERS GRANT RECORD 00001708
//* BP136237 LSB1 20170122 INCLUDE REPORT TO MA&B                       00001808
//*=====================================================================00001908
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                        00002008
//* PRT01 : 1 COPY                           (AGREEMENT TEAM)           00002108
//*-----------------------------------------------------------------    00002208
//PRT01    EXEC PGM=IEBGENER                                            00002308
//SYSUT1   DD *                                                         00002408
$DJDE$ JDE=BP13D,JDL=BP13,END;                                          00002508
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                            00002608
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00002708
//SYSPRINT DD SYSOUT=*                                                  00002808
//SYSIN    DD DUMMY                                                     00002908
//*                                                                     00003008
//*-----------------------------------------------------------------    00003210
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                        00003310
//* PRT01 : 1 COPY                           (MA&B TEAM)                00003410
//*-----------------------------------------------------------------    00003510
//PRT02    EXEC PGM=IEBGENER                                            00003610
//SYSUT1   DD *                                                         00003710
$DJDE$ JDE=BP13D,JDL=BP13,END;                                          00003810
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAAMB1A                           00003910
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00004010
//SYSPRINT DD SYSOUT=*                                                  00004110
//SYSIN    DD DUMMY                                                     00004210
//*                                                                     00004310
//*===================================================================  00004410
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                            00004510
//*-----------------------------------------------------------------    00004610
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                  00004710
//INPUT1   DD DSN=BP13.KD09.GRANT,DISP=OLD                              00004810
//SYSPRINT DD SYSOUT=*                                                  00004910
//SYSIN   DD *                                                          00005010
          VFY FILE(INPUT1)                                              00005110
//*-------------------------------------------------------------------* 00005210
//* BACKUP LAST MONTH STATUS                                            00005310
//*-------------------------------------------------------------------* 00005410
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                  00005510
//SYSPRINT DD SYSOUT=*                                                  00005610
//INPUT1   DD DSN=BP13.KD09.GRANT,DISP=SHR,                             00005710
//            AMP=('BUFND=23')                                          00005810
//OUTPUT1  DD DSN=BP13.FD09.GRANT.MBKUP(+1),DISP=(NEW,CATLG),           00005910
//            SPACE=(CYL,(30,10)),                                      00006010
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=500,RECFM=FB)               00006110
//*                                                                     00006210
//SYSIN    DD  *                                                        00006310
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                               00006410
//*---------------------------------------------------------------------00006510
//* DEFINE GRANT.TEMP FILE BP13.KD09                                    00006610
//*---------------------------------------------------------------------00006710
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                  00006810
//SYSPRINT DD SYSOUT=*                                                  00006910
//INPUT    DD DSN=BP13.BLANK.CHAR500,DISP=SHR                           00007010
//SYSIN    DD *                                                         00007110
  DEL 'BP13.KD09.GRANT.TEMP' CL PURGE                                   00007210
  DEF CLUSTER                                          -                00007310
        (NAME(BP13.KD09.GRANT.TEMP)                    -                00007410
        SHR(2,3)                                       -                00007510
        KEYS(8 0)                                     -                 00008008
        CYL(40 10)                                      -               00009008
        RECSZ(500 500)                                 -                00010008
        FREESPACE(10 10)                               -                00011008
        CISZ(4096)                                     -                00012008
        STORCLAS(PRODRLS)                              -                00012108
        LOG(NONE)                                      -                00012208
        IXD                                            -                00012308
        UNQ)                                           -                00012408
      DATA                                             -                00012508
        (NAME(BP13.KD09.GRANT.TEMP.DATA))              -                00012608
      INDEX                                            -                00012708
        (NAME(BP13.KD09.GRANT.TEMP.INDEX))                              00012808
      IF LASTCC = 0 THEN                               -                00012908
        REPRO IFILE(INPUT)                             -                00013008
              ODS(BP13.KD09.GRANT.TEMP)                                 00013108
      IF MAXCC = 0 THEN                                -                00013208
        DEF AIX (NAME(BP13.KD09.GRANT.TEMP.ALTX1)      -                00013308
            REL(BP13.KD09.GRANT.TEMP)                  -                00013408
            CYL(20 8)                                  -                00013508
            UNIQUE                                     -                00013608
            SHR(2 3))                                  -                00013708
            DATA                                       -                00013808
            (NAME(BP13.KD09.GRANT.TEMP.ALTX1.DATA)     -                00013908
            KEYS(11 10)                                  -              00014008
            CISZ(4096)                                 -                00014108
            RECSZ(100 500)                              -               00014208
            NUNQK)                                                      00014308
      IF MAXCC = 0 THEN                                -                00014408
        DEF PATH(NAME(BP13.KD09.GRANT.TEMP.PATH1)      -                00014508
            PENT(BP13.KD09.GRANT.TEMP.ALTX1))                           00014608
      IF MAXCC = 0 THEN                                -                00014708
        BIX IDS(BP13.KD09.GRANT.TEMP)                  -                00014808
            ODS(BP13.KD09.GRANT.TEMP.ALTX1)                             00014908
//*---------------------------------------------------------------------00015008
//* TO GET DP FLATS AND DBSS FLATS                                      00015108
//*---------------------------------------------------------------------00015208
//STEP04   EXEC SORT,CYL=30,COND=(0,NE)                                 00015308
//SORTIN   DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                           00015408
//SORTOUT  DD DSN=&&BP13FD05,DISP=(,PASS),                              00015508
//            UNIT=SYSDA,                                               00015608
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                       00015708
//            SPACE=(CYL,(50,30),RLSE)                                  00015808
//SYSIN    DD  *                                                        00015908
  SORT FIELDS=(1,17,A),FORMAT=CH                                        00016008
  OMIT COND=(1,1,CH,EQ,C' ',OR,                                         00016108
             1,1,CH,EQ,C'6')                                            00016208
//*---------------------------------------------------------------------00016308
//* CREATE/UPDATE BP13KD09                                              00016408
//*---------------------------------------------------------------------00016508
//STEP05   EXEC PGM=BP13CE08,COND=(0,NE)                                00016608
//BP13FD05 DD DSN=&&BP13FD05,DISP=(OLD,PASS)                            00016708
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00016808
//         AMP=('BUFND=4','BUFNI=8')                                    00016908
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     00017008
//         AMP=('BUFND=4','BUFNI=8')                                    00017108
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                           00017208
//         AMP=('BUFND=4','BUFNI=8')                                    00017308
//BP13KD09 DD DSN=BP13.KD09.GRANT.TEMP,DISP=SHR,                        00017408
//         AMP=('BUFND=4','BUFNI=8')                                    00017508
//P13LE08A DD DSN=BP13.LE08A.BP13LE08,DISP=OLD                          00017608
//P13LE08B DD DSN=BP13.LE08B.BP13LE08,DISP=OLD                          00017708
//P13LE08C DD DSN=BP13.LE08C.BP13LE08,DISP=OLD                          00017808
//P13LE08D DD DSN=BP13.LE08D.BP13LE08,DISP=OLD                          00017908
//SYSUDUMP DD SYSOUT=*                                                  00018008
//SYSOUT   DD SYSOUT=*                                                  00018108
//SYSDBOUT DD SYSOUT=*                                                  00018208
//*---------------------------------------------------------------------00018308
//STEP5A   EXEC SORT,COND=(0,NE)                                        00018408
//SORTIN   DD DSN=BP13.K130.SOCHIST,DISP=SHR                            00018508
//SORTOUT DD DSN=BP13.F130.AHG,DISP=SHR                                 00018608
//SYSIN     DD  *                                                       00018708
   SORT FIELDS=(5,19,A),FORMAT=CH                                       00018808
   INCLUDE COND=(91,8,CH,GE,C'20060401',AND,                            00018908
                (99,3,CH,EQ,C'AHG',OR,                                  00019008
                 99,3,CH,EQ,C'SHG',OR,                                  00020008
                 99,3,CH,EQ,C'SUG',OR,                                  00021008
                 99,3,CH,EQ,C'HGT'),AND,                                00022008
                (5,1,CH,EQ,C'1',OR,                                     00022108
                 5,1,CH,EQ,C'2',OR,                                     00022208
                 5,1,CH,EQ,C'3'))                                       00022308
//*-----------------------------------------------------------------    00022408
//* TO EXTRACT KD09 RECORDS WITH AHG DISBURSEMENT                       00022508
//*-----------------------------------------------------------------    00022608
//STEP06 EXEC PGM=BP13CE14,COND=(0,NE)                                  00022708
//BP13KD09 DD DSN=BP13.KD09.GRANT.TEMP,DISP=SHR                         00022808
//BP13K130 DD DSN=BP13.F130.AHG.CAN.NOTFND,DISP=SHR                     00022908
//BP13F130 DD DSN=BP13.F130.AHG,DISP=SHR                                00023008
//BP13FD09 DD DSN=BP13.FD09.GRANT.BEFORE,DISP=SHR                       00023108
//SYSOUT   DD SYSOUT=*                                                  00023208
//*-------------------------------------------------------------------* 00023308
//* SORTOUT ALL DIRECT PURCHASE CASES                                   00023408
//*-------------------------------------------------------------------- 00023508
//STEP07   EXEC SORT,COND=(0,NE)                                        00023608
//SORTIN   DD DSN=BP13.FD09.GRANT.BEFORE,DISP=SHR                       00023708
//SORTOUT  DD DSN=BP13.FD09.GRANT.AFTER,DISP=SHR                        00023808
//SYSOUT   DD SYSOUT=*                                                  00023908
//SYSIN    DD  *                                                        00024008
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00024108
   SUM FIELDS=NONE                                                      00024208
//*---------------------------------------------------------------------00024308
//* DEFINE GRANT     FILE BP13.KD09                                     00024408
//*---------------------------------------------------------------------00024508
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                  00024608
//SYSPRINT DD SYSOUT=*                                                  00024708
//INPUT    DD DSN=BP13.FD09.GRANT.AFTER,DISP=SHR                        00024808
//SYSIN    DD *                                                         00024908
  DEL 'BP13.KD09.GRANT' CL PURGE                                        00025008
  DEF CLUSTER                                          -                00026008
        (NAME(BP13.KD09.GRANT)                         -                00026108
        SHR(2,3)                                       -                00026208
        KEYS(8 0)                                     -                 00026308
        CYL(40 10)                                      -               00026408
        RECSZ(500 500)                                 -                00026508
        FREESPACE(10 10)                               -                00026608
        CISZ(4096)                                     -                00026708
        STORCLAS(PRODRLS)                              -                00026808
        LOG(NONE)                                      -                00026908
        IXD                                            -                00027008
        UNQ)                                           -                00027108
      DATA                                             -                00027208
        (NAME(BP13.KD09.GRANT.DATA))                   -                00027308
      INDEX                                            -                00027408
        (NAME(BP13.KD09.GRANT.INDEX))                                   00027508
      IF LASTCC = 0 THEN                               -                00027608
        REPRO IFILE(INPUT)                             -                00027708
              ODS(BP13.KD09.GRANT)                                      00027808
      IF MAXCC = 0 THEN                                -                00027908
        DEF AIX (NAME(BP13.KD09.GRANT.ALTX1)           -                00028008
            REL(BP13.KD09.GRANT)                       -                00028108
            CYL(20 8)                                  -                00028208
            UNIQUE                                     -                00028308
            SHR(2 3))                                  -                00028408
            DATA                                       -                00028508
            (NAME(BP13.KD09.GRANT.ALTX1.DATA)          -                00028608
            KEYS(11 10)                                  -              00028708
            CISZ(4096)                                 -                00028808
            RECSZ(100 500)                              -               00028908
            NUNQK)                                                      00029008
      IF MAXCC = 0 THEN                                -                00029108
        DEF PATH(NAME(BP13.KD09.GRANT.PATH1)           -                00029208
            PENT(BP13.KD09.GRANT.ALTX1))                                00029308
      IF MAXCC = 0 THEN                                -                00029408
        BIX IDS(BP13.KD09.GRANT)                       -                00029508
            ODS(BP13.KD09.GRANT.ALTX1)                                  00029608
//*-------------------------------------------------------------------* 00029708
//* BACKUP FILES                                                        00029808
//*-------------------------------------------------------------------* 00029908
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                  00030008
//SYSPRINT DD SYSOUT=*                                                  00031008
//INPUT1   DD DSN=BP13.LE08C.BP13LE08,DISP=SHR                          00032008
//OUTPUT1  DD DSN=BP13.LE08C.BP13LE08.MBKUP(+1),DISP=(NEW,CATLG),       00033008
//            SPACE=(CYL,(20,10)),                                      00033108
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)               00033208
//INPUT2   DD DSN=BP13.LE08D.BP13LE08,DISP=SHR                          00033308
//OUTPUT2  DD DSN=BP13.LE08D.BP13LE08.MBKUP(+1),DISP=(NEW,CATLG),       00033408
//            SPACE=(CYL,(20,10)),                                      00033508
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)               00033608
//*                                                                     00033708
//SYSIN    DD  *                                                        00033808
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                               00033908
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                               00034008
//*-------------------------------------------------------------------* 00034108
//* SORTOUT ALL DIRECT PURCHASE CASES                                   00034208
//*-------------------------------------------------------------------- 00034308
//STEP10   EXEC SORT,COND=(0,NE)                                        00034408
//SORTIN   DD DSN=BP13.KD05.CPFGRANT,DISP=SHR                           00034508
//SORTOUT  DD DSN=&&FD05,DISP=(NEW,PASS),                               00034608
//            UNIT=SYSDA,                                               00034708
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                       00034808
//            SPACE=(CYL,(100,50),RLSE)                                 00034908
//SYSOUT   DD SYSOUT=*                                                  00035008
//SYSIN    DD  *                                                        00036008
   SORT FIELDS=COPY                                                     00037008
   OMIT COND=(1,1,CH,EQ,C'5',OR,                                        00038008
              1,1,CH,EQ,C'6')                                           00039008
//*-------------------------------------------------------------------* 00040008
//* CREATE REPORT BP1311CA AND BP1311CB                                 00050008
//*-------------------------------------------------------------------- 00060008
//STEP11   EXEC PGM=BP13C11C,COND=(0,NE)                                00070008
//BP13FD05 DD DSN=&&FD05,DISP=(OLD,PASS)                                00080008
//BP13KD09 DD DSN=BP13.KD09.GRANT,DISP=SHR,                             00090008
//            AMP=('BUFND=4','BUFNI=8')                                 00100008
//BP1311CA DD DSN=BP13.CANCEL.BP1311CA,DISP=SHR                         00110008
//BP1311CB DD DSN=BP13.NOCANCEL.BP1311CB,DISP=SHR                       00120008
//SYSOUT   DD SYSOUT=*                                                  00130008
//*---------------------------------------------------------------------00140008
//* CREATE/UPDATE BP13KD09 WITH SERS GRANT                              00150008
//*---------------------------------------------------------------------00160008
//STEP12   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00170008
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00180008
//         AMP=('BUFND=4','BUFNI=8')                                    00190008
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                     00200008
//         AMP=('BUFND=4','BUFNI=8')                                    00210008
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                           00220008
//         AMP=('BUFND=4','BUFNI=8')                                    00230008
//BP13KD09 DD DSN=BP13.KD09.GRANT,DISP=SHR,                             00240008
//         AMP=('BUFND=4','BUFNI=8')                                    00250008
//BP13FD09 DD DSN=BP13.FD09.GRANT.DB2,DISP=SHR                          00260008
//SYSOUT   DD SYSOUT=*                                                  00270008
//SYSTSPRT DD SYSOUT=*                                                  00280008
//SYSPRINT DD SYSOUT=*                                                  00290008
//SYSDBG   DD SYSOUT=*                                                  00300008
//SYSDBOUT DD SYSOUT=*                                                  00310008
//SYSTSIN  DD *                                                         00320008
  DSN SYSTEM(DSN)                                                       00330008
  RUN PROGRAM(BP13CE15) PLAN(BP13PCC) -                                 00340008
      LIB('BP13.BATCH.LOADCOB')                                         00350008
  END                                                                   00360008
//*---------------------------------------------------------------------00370008
//* REMOVE DUPLICATES                                                   00380008
//*---------------------------------------------------------------------00390008
//STEP13  EXEC SORT,COND=(0,NE)                                         00400008
//SORTIN  DD DSN=BP13.FD09.GRANT.DB2,DISP=SHR                           00410008
//SORTOUT DD DSN=BP13.FD09.GRANT.DB2,DISP=OLD                           00420008
//SYSIN   DD  *                                                         00430008
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00440008
   SUM FIELDS=NONE                                                      00441008
//*-------------------------------------------------------------------* 00441111
//* SORTOUT GRANT DATA                                                  00441211
//*-------------------------------------------------------------------- 00441311
//STEP14   EXEC SORT,COND=(0,NE)                                        00441411
//SORTIN   DD DSN=BP13.KD09.GRANT,DISP=SHR                              00441511
//SORTOUT  DD DSN=&&FD09GRNT,DISP=(NEW,PASS),                           00441611
//            UNIT=SYSDA,                                               00441711
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                       00441811
//            SPACE=(CYL,(50,50),RLSE)                                  00441911
//SYSOUT   DD SYSOUT=*                                                  00442011
//SYSIN    DD  *                                                        00442111
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00442312
   INCLUDE COND=(216,4,CH,GE,C'2017')                                   00442412
//*-----------------------------------------------------------------    00442510
//* PRINT REPORT ON GRANT TO MA&B                                       00443012
//*-----------------------------------------------------------------    00444010
//STEP15   EXEC  SAS,COND=(0,NE)                                        00445013
//BP13FD09 DD DSN=&&FD09GRNT,DISP=(OLD,PASS)                            00446011
//BP13L834 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                          00447012
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S834),DISP=SHR                     00449110
//*-------------------------------------------------------------------* 00580009
//* END OF JOB                                                          00590009
//*-------------------------------------------------------------------- 00600009
