//BP13D115 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),         00010000
//       NOTIFY=CSD0071                                                 00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//* ============================================================== *    00040000
//* BP136181 220416 CT2    BP13D101, BP13D107 GRANT PROCESING STEPS     00050000
//*                        EXTRACTED INTO BP13D115                      00060000
//* BP136190 170516 MRN1   ADDED SORT 'AHPS' IN STEP06                  00070000
//* BP136309 180816 MRN1   TAKE IN EC CASES IN STEP11                   00080000
//* BP136414 300816 ZDD1   ADD VERIFY STEP                              00090000
//* BP136884 030118 MRN1   ADD FSG/FSR                                  00100000
//* BP137562 311018 PP11   SEND EXCEPTION REPORT FOR NON ACC            00110000
//* BP137515 300419 MRN1   ADD STEPS FOR REPORTS DA='Y'                 00120000
//* BP137823 080519 PP11   CATER TO CHANGE THE COND=(4,LT) FROM STEP31  00130000
//*                        TO STEP36                                    00140000
//* BP137823 100519 PP11   ADDED STEP32A TO CHECK WHETHER INCOM RPT1 IS 00150000
//*                        NOT EMPTY AND THE INCOME REPT1 WILL SEND TO  00160000
//*                        RECIPIENT.                                   00170000
//* BP137515 230519 PP11   REMOVED SAS PROGRAM FOR SENDING MAIL AND     00180000
//*                        INCLUDED THE STEP33, STEP35 FOR SENDING THE  00190000
//*                        PCD NOTIFY REPORT TO USER.                   00200000
//* BP137849 290519 PP11   INCLUDED THE STEP38 AND STEP39 TO SEND THE   00210000
//*                        EXCEPTOIN REPORT WHO BOOKED COMPLETED FLATS  00220000
//* BP137844 030619 PP11   SEND THE EXCEPTOIN REPORT TO USER WHEN REPORT00230000
//*                        IS NOT EMPTY                                 00240000
//* BP138015 161019 PP11   CATER TO CHANGE FOR EHG                      00250000
//* BP138265 23032020 PP11 CATER TO CHANGE REVERSAL FOR EHG(EHR)        00260000
//* BP138332 24112020 PP11 CATER TO CHANGE FOR LHG                      00270000
//* BP138555 22022021 PP11 CATER TO CHANGE FOR LHG                      00280000
//* BP138555 22022021 PP11 CATER TO INCLUDE K800 IN STEP11              00290000
//* BP138575 26022021 PP11 CATER TO CHANGE FOR LHG                      00300000
//* BP138704 30072021 PP11 CATER FOR TRANS ID CCAS                      00301002
//* ==================================================================  00310000
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                       00320000
//*-------------------------------------------------------------------- 00330000
//STEPA1  EXEC PGM=IDCAMS,COND=(0,NE)                                   00340000
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=OLD                              00350000
//SYSPRINT DD SYSOUT=*                                                  00360000
//SYSIN   DD *                                                          00370000
          VFY FILE(INPUT1)                                              00380000
//*=================================================================    00390000
//* INCLUDE "AHG/SHG/SUG" CASES                                         00400000
//*-----------------------------------------------------------------    00410000
//STEP01   EXEC SORT,COND=(0,NE)                                        00420000
//SORTIN   DD DSN=AG07.F630.SOC,DISP=SHR                                00430000
//SORTOUT  DD DSN=&&AG07F630,DISP=(NEW,PASS),                           00440000
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                        00450000
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                    00460000
//SYSIN    DD *                                                         00470000
    SORT FIELDS=(35,11,A),FORMAT=CH                                     00480000
    INCLUDE COND=(20,4,CH,EQ,C'AHPS',OR,20,4,CH,EQ,C'EHPS',OR,          00490000
                  20,4,CH,EQ,C'LHGS')                                   00500000
//*                                                                     00510000
//*---------------------------------------------------------------------00520000
//* DROP DUPLICATE VOUCHER NO                                           00530000
//*---------------------------------------------------------------------00540000
//STEP02   EXEC  SORT,COND=(0,NE)                                       00550000
//SORTIN   DD DSN=&&AG07F630,DISP=(OLD,DELETE)                          00560000
//SORTOUT  DD DSN=&&AG07F63A,DISP=(,PASS),                              00570000
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                        00580000
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                    00590000
//SYSIN    DD *                                                         00600000
  SORT FIELDS=(35,11,CH,A),FORMAT=CH                                    00610000
//*-------------------------------------------------------------------* 00620000
//* SORT AHG VOUCHER OIC FILE BY VOUCHER NO                           * 00630000
//*-------------------------------------------------------------------* 00640000
//STEP03   EXEC SORT,COND=(0,NE)                                        00650000
//SORTIN   DD DSN=BP13.K633.AHGPVJV,DISP=SHR                            00660000
//SORTOUT  DD DSN=&&BP13F63A,                                           00670000
//            DISP=(NEW,PASS),                                          00680000
//            UNIT=SYSDA,                                               00690000
//            SPACE=(TRK,(10,5),RLSE),                                  00700000
//            DCB=(RECFM=FB,LRECL=450,BLKSIZE=0)                        00710000
//SYSIN    DD *                                                         00720000
      SORT FIELDS=(9,11,CH,A),FORMAT=CH                                 00730000
//*-------------------------------------------------------------------* 00740000
//* VALIDATE VOUCHER TRANSACTIONS (PAYMENT SYSTEM)                    * 00750000
//*-------------------------------------------------------------------* 00760000
//STEP04   EXEC PGM=BP13CB03,COND=(0,NE)                                00770000
//P13F633A DD DSN=&&BP13F63A,DISP=(OLD,DELETE)                          00780000
//AG07F630 DD DSN=&&AG07F63A,DISP=(OLD,DELETE)                          00790000
//BP13KD07 DD DSN=BP13.KD07.GRANTMAS,DISP=SHR                           00800000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              00810000
//BP13K633 DD DSN=BP13.K633.AHGPVJV,DISP=SHR                            00820000
//BP13F125 DD DSN=BP13.F125.CPFGRNT1,DISP=OLD                           00830000
//P13F633B DD DSN=BP13.F633.AHGPVJV.DAILY,DISP=OLD                      00840000
//BP13LB03 DD SYSOUT=*                                                  00850000
//SYSDBG   DD SYSOUT=*                                                  00860000
//SYSDBOUT DD SYSOUT=*                                                  00870000
//SYSOUT   DD SYSOUT=*                                                  00880000
/*                                                                      00890000
//*-------------------------------------------------------------------* 00900000
//* BACKUP FILE                                                         00910000
//*-------------------------------------------------------------------* 00920000
//STEP05   EXEC SORT,COND=(0,NE)                                        00930000
//SORTIN   DD DSN=BP13.F633.AHGPVJV.DAILY,DISP=SHR                      00940000
//SORTOUT  DD DSN=BP13.F633.AHGPVJV.MONTH,DISP=MOD                      00950000
//SYSIN    DD *                                                         00960000
      SORT FIELDS=(1,8,CH,A),FORMAT=CH                                  00970000
//*-------------------------------------------------------------------* 00980000
//* INCLUDE "DBSS", "EC", "SRSG, "RELG" CASES                         * 00990000
//*-------------------------------------------------------------------* 01000000
//STEP06   EXEC SORT,COND=(0,NE)                                        01010000
//SORTIN   DD DSN=AG07.F630.SOC,DISP=SHR                                01020000
//SORTOUT  DD DSN=&&AG07F6AA,DISP=(NEW,PASS),                           01030000
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                        01040000
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                    01050000
//SYSIN    DD *                                                         01060000
    SORT FIELDS=(35,11,A),FORMAT=CH                                     01070000
    INCLUDE COND=(20,4,CH,EQ,C'CHPS',OR,20,4,CH,EQ,C'SRSG',OR,          01080000
                  20,4,CH,EQ,C'RELG',OR,20,4,CH,EQ,C'AHPS',OR,          01090000
                  20,4,CH,EQ,C'FRST',OR,20,4,CH,EQ,C'EHPS',OR,          01100000
                  20,4,CH,EQ,C'LHGS',OR,20,4,CH,EQ,C'CCAS')             01110001
//*                                                                     01120000
//*---------------------------------------------------------------------01130000
//* DROP DUPLICATE VOUCHER NO                                           01140000
//*---------------------------------------------------------------------01150000
//STEP07 EXEC    SORT,COND=(0,NE)                                       01160000
//SORTIN   DD  DSN=&&AG07F6AA,DISP=(OLD,PASS)                           01170000
//SORTOUT  DD  DSN=&&AG07F63B,DISP=(,PASS),                             01180000
//         UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                           01190000
//         DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                       01200000
//SYSIN    DD  *                                                        01210000
  SORT FIELDS=(35,11,CH,A),FORMAT=CH                                    01220000
  SUM FIELDS=NONE                                                       01230000
//*-------------------------------------------------------------------* 01240000
//* SORT AHG VOUCHER OIC FILE BY VOUCHER NO                           * 01250000
//*-------------------------------------------------------------------* 01260000
//STEP08   EXEC SORT,COND=(0,NE)                                        01270000
//SORTIN   DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR                           01280000
//SORTOUT  DD DSN=&&BP13F63C,                                           01290000
//            DISP=(NEW,PASS),                                          01300000
//            UNIT=SYSDA,                                               01310000
//            SPACE=(TRK,(10,5),RLSE),                                  01320000
//            DCB=(RECFM=FB,LRECL=1400,BLKSIZE=0)                       01330000
//SYSIN    DD *                                                         01340000
      SORT FIELDS=(24,11,CH,A),FORMAT=CH                                01350000
      INCLUDE COND=(1,3,CH,EQ,C'HGT',AND,                               01360000
                    24,1,CH,EQ,C'S',AND,                                01370000
                    451,2,CH,EQ,C'  '),FORMAT=CH                        01380000
//*-------------------------------------------------------------------* 01390000
//* VALIDATE VOUCHER TRANSACTIONS (PAYMENT SYSTEM)                    * 01400000
//*-------------------------------------------------------------------* 01410000
//STEP09   EXEC PGM=BP13CB04,COND=(0,NE)                                01420000
//AG07F630 DD DSN=&&AG07F63B,DISP=(OLD,PASS)                            01430000
//P13FD10A DD DSN=&&BP13F63C,DISP=(OLD,PASS)                            01440000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              01450000
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR                            01460000
//BP13KD07 DD DSN=BP13.KD07.GRANTMAS,DISP=SHR                           01470000
//BP13KD10 DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR                           01480000
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                             01490000
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                       01500000
//BP13F125 DD DSN=BP13.F125.CPFGRANT,DISP=OLD                           01510000
//P13FD10B DD DSN=BP13.FD10.VOUCHOIC.DAILY,DISP=OLD                     01520000
//BP13LB04 DD SYSOUT=*                                                  01530000
//SYSDBG   DD SYSOUT=*                                                  01540000
//SYSDBOUT DD SYSOUT=*                                                  01550000
//SYSOUT   DD SYSOUT=*                                                  01560000
/*                                                                      01570000
//*-------------------------------------------------------------------* 01580000
//* SORT VOUCHER OIC FILE BY VOUCHER NO                               * 01590000
//*-------------------------------------------------------------------* 01600000
//STEP10   EXEC SORT,COND=(0,NE)                                        01610000
//SORTIN   DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR                           01620000
//SORTOUT  DD DSN=&&FD10SRG,                                            01630000
//            DISP=(NEW,PASS),                                          01640000
//            UNIT=SYSDA,                                               01650000
//            SPACE=(TRK,(10,5),RLSE),                                  01660000
//            DCB=(RECFM=FB,LRECL=1400,BLKSIZE=0)                       01670000
//SYSIN    DD *                                                         01680000
      SORT FIELDS=(24,11,CH,A),FORMAT=CH                                01690000
      INCLUDE COND=((1,3,CH,EQ,C'SRG',AND,24,3,CH,EQ,C'PRD'),OR,        01700000
                    (1,3,CH,EQ,C'REG',AND,24,2,CH,EQ,C'RH'),OR,         01710000
                    (1,3,CH,EQ,C'FSG',AND,24,2,CH,EQ,C'RH'),OR,         01720000
                    (1,3,CH,EQ,C'ASG',AND,24,2,CH,EQ,C'SS'),OR,         01730000
                    (1,3,CH,EQ,C'EHG',AND,24,2,CH,EQ,C'SS'),OR,         01740000
                    (1,3,CH,EQ,C'LHG',AND,24,2,CH,EQ,C'SS'),OR,         01750000
                    (1,3,CH,EQ,C'HGT',AND,24,2,CH,EQ,C'SS',AND,         01760000
                     4,1,CH,EQ,C'6',AND,451,2,CH,NE,C'  '),OR,          01770000
                    (1,3,CH,EQ,C'TUG',AND,24,2,CH,EQ,C'SS'),OR,         01780000
                    (1,3,CH,EQ,C'ATG',AND,24,2,CH,EQ,C'SS'),OR,         01790000
                    (1,3,CH,EQ,C'SUG',AND,24,2,CH,EQ,C'SS')),FORMAT=CH  01800000
//*-------------------------------------------------------------------* 01810000
//* PROCESS VOUCHER TRANSACTIONS (PAYMENT SYSTEM) FOR SRG,REG,ASG,SUG,  01820000
//*                                                   FSG               01830000
//*-------------------------------------------------------------------* 01840000
//STEP11   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       01850000
//BP13KD10 DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR                           01860000
//AG07F630 DD DSN=&&AG07F63B,DISP=(OLD,PASS)                            01870000
//P13FD10A DD DSN=&&FD10SRG,DISP=(OLD,PASS)                             01880000
//BP17K000 DD DSN=BP17.K000.SCHREF,DISP=SHR                             01890000
//BP17K001 DD DSN=BP17.K000.SCHREF.PATH1,DISP=SHR                       01900000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              01910000
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR                             01920000
//SY08K011 DD DSN=SY08.K010.USERID.PATH1,DISP=SHR                       01930000
//BP13F125 DD DSN=BP13.F125.SRSGRANT,DISP=OLD                           01940000
//P13FD10B DD DSN=BP13.FD10.VOUCHOIC.DAILY,DISP=MOD                     01950000
//BP13LB0A DD SYSOUT=*                                                  01960000
//SYSOUT   DD SYSOUT=*                                                  01970000
//SYSTSPRT DD SYSOUT=*                                                  01980000
//SYSPRINT DD SYSOUT=*                                                  01990000
//SYSDBG   DD SYSOUT=*                                                  02000000
//SYSDBOUT DD SYSOUT=*                                                  02010000
//SYSTSIN  DD *                                                         02020000
  DSN SYSTEM(DSN)                                                       02030000
  RUN PROGRAM(BP13CB0A) PLAN(BP13PCC) -                                 02040000
      LIB('BP13.BATCH.LOADCOB')                                         02050000
  END                                                                   02060000
/*                                                                      02070000
//*-------------------------------------------------------------------* 02080000
//* SORT REVERSAL VOUCHER OIC FILE BY VOUCHER NO                      * 02090000
//*-------------------------------------------------------------------* 02100000
//STEP12   EXEC SORT,COND=(0,NE)                                        02110000
//SORTIN   DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR                           02120000
//SORTOUT  DD DSN=&&FD10REVC,                                           02130000
//            DISP=(NEW,PASS),                                          02140000
//            UNIT=SYSDA,                                               02150000
//            SPACE=(TRK,(10,5),RLSE),                                  02160000
//            DCB=(RECFM=FB,LRECL=1400,BLKSIZE=0)                       02170000
//SYSIN    DD *                                                         02180000
      SORT FIELDS=(24,11,CH,A),FORMAT=CH                                02190000
      INCLUDE COND=((1,3,CH,EQ,C'SRR',AND,24,3,CH,EQ,C'PRD'),OR,        02200000
                    (1,3,CH,EQ,C'RER',AND,24,2,CH,EQ,C'RH'),OR,         02210000
                    (1,3,CH,EQ,C'FSR',AND,24,2,CH,EQ,C'RH'),OR,         02220000
                    (1,3,CH,EQ,C'ASR',AND,24,2,CH,EQ,C'SS'),OR,         02230000
                    (1,3,CH,EQ,C'EHR',AND,24,2,CH,EQ,C'SS'),OR,         02240000
                    (1,3,CH,EQ,C'LHR',AND,24,2,CH,EQ,C'SS'),OR,         02250000
                    (1,3,CH,EQ,C'HGR',AND,24,2,CH,EQ,C'SS',AND,         02260000
                     4,1,CH,EQ,C'6',AND,451,2,CH,NE,C'  '),OR,          02270000
                    (1,3,CH,EQ,C'TUR',AND,24,2,CH,EQ,C'SS'),OR,         02280000
                    (1,3,CH,EQ,C'ATR',AND,24,2,CH,EQ,C'SS'),OR,         02290000
                    (1,3,CH,EQ,C'SUR',AND,24,2,CH,EQ,C'SS')),FORMAT=CH  02300000
      SUM FIELDS=NONE                                                   02310000
//*-------------------------------------------------------------------* 02320000
//* PROCESS REVERSAL VOUCHER BEFORE GRANT CREDITED TO CPFB            * 02330000
//*-------------------------------------------------------------------* 02340000
//STEP13   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       02350000
//AG07F630 DD DSN=&&AG07F63B,DISP=(OLD,PASS)                            02360000
//P13FD10A DD DSN=&&FD10REVC,DISP=(OLD,PASS)                            02370000
//BP13KD10 DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR                           02380000
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR                             02390000
//SY08K011 DD DSN=SY08.K010.USERID.PATH1,DISP=SHR                       02400000
//BP13F125 DD DSN=BP13.F125.SRSGRANT,DISP=MOD                           02410000
//P13FD10B DD DUMMY                                                     02420000
//BP13LB0C DD SYSOUT=*                                                  02430000
//SYSOUT   DD SYSOUT=*                                                  02440000
//SYSTSPRT DD SYSOUT=*                                                  02450000
//SYSPRINT DD SYSOUT=*                                                  02460000
//SYSDBG   DD SYSOUT=*                                                  02470000
//SYSDBOUT DD SYSOUT=*                                                  02480000
//SYSTSIN  DD *                                                         02490000
  DSN SYSTEM(DSN)                                                       02500000
  RUN PROGRAM(BP13CB0C) PLAN(BP13PCC) -                                 02510000
      LIB('BP13.BATCH.LOADCOB')                                         02520000
  END                                                                   02530000
/*                                                                      02540000
//*-------------------------------------------------------------------* 02550000
//* BACKUP FILE                                                         02560000
//*-------------------------------------------------------------------* 02570000
//STEP14   EXEC SORT,COND=(0,NE)                                        02580000
//SORTIN   DD DSN=BP13.FD10.VOUCHOIC.DAILY,DISP=SHR                     02590000
//SORTOUT  DD DSN=BP13.FD10.VOUCHOIC.MONTH,DISP=MOD                     02600000
//SYSIN    DD *                                                         02610000
      SORT FIELDS=(24,11,CH,A),FORMAT=CH                                02620000
//*-------------------------------------------------------------------* 02630000
//* MERGE DAILY FINANCIAL TRANS WITH SALES AGRMT HIST TRANS           * 02640000
//*-------------------------------------------------------------------* 02650000
//STEP15   EXEC SORT,COND=(0,NE)                                        02660000
//SORTIN   DD DSN=BP13.F125.CPFGRNT1,DISP=SHR                           02670000
//         DD DSN=BP13.F125.CPFGRANT,DISP=SHR                           02680000
//         DD DSN=BP13.F125.SRSGRANT,DISP=SHR                           02690000
//SORTOUT  DD DSN=&&BP13F126,DISP=(NEW,PASS),                           02700000
//            UNIT=SYSDA,SPACE=(TRK,(20,5),RLSE),                       02710000
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                    02720000
//SYSIN    DD *                                                         02730000
     SORT FIELDS=(5,19,A),FORMAT=CH                                     02740000
/*                                                                      02750000
//*-------------------------------------------------------------------* 02760000
//*  WRITE FINANCIAL TRANS FOR DAY TO TRANS LOG FILE                  * 02770000
//*-------------------------------------------------------------------* 02780000
//STEP16   EXEC PGM=BP13C107,COND=(0,NE)                                02790000
//BP13F125 DD DSN=&&BP13F126,DISP=(OLD,DELETE)                          02800000
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                           02810000
//            AMP=('BUFND=4','BUFNI=8')                                 02820000
//SYSDBG   DD SYSOUT=*                                                  02830000
//SYSDBOUT DD SYSOUT=*                                                  02840000
//SYSOUT   DD SYSOUT=*                                                  02850000
//*                                                                     02860000
//*-------------------------------------------------------------------* 02870000
//* ACCUMULATE DAILY PAYMENT TRANS TO MTHLY PAYMENT TRANS             * 02880000
//*-------------------------------------------------------------------* 02890000
//STEP17   EXEC SORT,COND=(0,NE)                                        02900000
//SORTIN   DD DSN=BP13.F125.CPFGRANT,DISP=SHR                           02910000
//SORTOUT  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                       02920000
//SYSIN    DD *                                                         02930000
     SORT FIELDS=(1,2,A,5,19,A),FORMAT=CH                               02940000
     INCLUDE COND=(5,1,CH,NE,C'6')                                      02950000
//*                                                                     02960000
//*-------------------------------------------------------------------* 02970000
//* ACCUMULATE SERS GRANT DAILY PAYMENT TRANS TO MTHLY PAYMENT TRANS  * 02980000
//*-------------------------------------------------------------------* 02990000
//STEP18   EXEC SORT,COND=(0,NE)                                        03000000
//SORTIN   DD DSN=BP13.F125.CPFGRNT1,DISP=SHR                           03010000
//         DD DSN=BP13.F125.SRSGRANT,DISP=SHR                           03020000
//SORTOUT  DD DSN=BP13.F136.MTHTRAN,DISP=MOD                            03030000
//SYSIN    DD *                                                         03040000
     SORT FIELDS=(1,2,A,5,19,A),FORMAT=CH                               03050000
//*                                                                     03060000
//*-------------------------------------------------------------------* 03070000
//* SORT BY VOUCHER NO                                                  03080000
//*-------------------------------------------------------------------* 03090000
//STEP19   EXEC SORT,COND=(0,NE)                                        03100000
//SORTIN   DD DSN=BP13.F633.AHGPVJV.DAILY,DISP=SHR                      03110000
//SORTOUT  DD DSN=&&F633MAIL,DISP=(NEW,PASS),                           03120000
//            UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                       03130000
//            DCB=(RECFM=FB,LRECL=450,BLKSIZE=0)                        03140000
//SYSIN    DD *                                                         03150000
    SORT FIELDS=(1,8,A),FORMAT=CH                                       03160000
    INCLUDE COND=(9,2,CH,EQ,C'SU',OR,9,2,CH,EQ,C'SS')                   03170000
//*-------------------------------------------------------------------* 03180000
//* CREATE MAILOUT FILE ON APPROVED HOUSING GRANT                       03190000
//*-------------------------------------------------------------------* 03200000
//STEP20   EXEC PGM=BP13CF98,COND=(0,NE)                                03210000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               03220000
//BP13F633 DD DSN=&&F633MAIL,DISP=(OLD,DELETE)                          03230000
//BP13MAIL DD DSN=BP13.MAILOUT.CF98,DISP=SHR                            03240000
//BP13EACC DD DUMMY                                                     03250000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              03260000
//BP13KB00 DD DSN=BP13.KB00.BEBTO,DISP=SHR                              03270000
//SYSDBG   DD SYSOUT=*                                                  03280000
//SYSDBOUT DD SYSOUT=*                                                  03290000
//SYSOUT   DD SYSOUT=*                                                  03300000
//*                                                                     03310000
//*-------------------------------------------------------------------* 03320000
//* DELETE BP13KH60 CASES THAT EMAIL WAS ALREADY SENT                   03330000
//*-----------------------------------------------------------------    03340000
//STEP21   EXEC  PGM=BP13CF1C,COND=(0,NE)                               03350000
//BP13F23A DD DSN=BP13.F23A.EMAIL.GRANT.ALL,DISP=SHR                    03360000
//BP13KH60 DD DSN=BP13.KH60.GRANT.EMAIL,DISP=SHR                        03370000
//SYSOUT   DD SYSOUT=*                                                  03380000
//SYSDBOUT DD SYSOUT=*                                                  03390000
//*                                                                     03400000
//******************************************************************    03410000
//* SORT BP13K23A NEW CASES FOR SENDING OF EMAIL                        03420000
//*------------------------------------------------------------------   03430000
//STEP22  EXEC SORT,COND=(0,NE)                                         03440000
//SORTIN  DD DSN=BP13.KH60.GRANT.EMAIL,DISP=SHR                         03450000
//SORTOUT DD DSN=BP13.F23A.EMAIL.GRANT.ALL,DISP=SHR                     03460000
//SYSIN   DD  *                                                         03470000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        03480000
//*-------------------------------------------------------------------* 03490000
//* SORT BY VOUCHER NO                                                  03500000
//*-------------------------------------------------------------------* 03510000
//STEP23   EXEC SORT,COND=(0,NE)                                        03520000
//SORTIN   DD DSN=BP13.FD10.VOUCHOIC.DAILY,DISP=SHR                     03530000
//SORTOUT  DD DSN=&&FD10MAIL,DISP=(NEW,PASS),                           03540000
//            UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                       03550000
//            DCB=(RECFM=FB,LRECL=1400,BLKSIZE=0)                       03560000
//SYSIN    DD *                                                         03570000
    SORT FIELDS=(430,5,A,4,8,A,24,11,CH,A),FORMAT=CH                    03580000
    INCLUDE COND=(1,3,CH,EQ,C'HGT',OR,                                  03590000
                  1,3,CH,EQ,C'TUG',OR,                                  03600000
                  1,3,CH,EQ,C'ATG')                                     03610000
//*-------------------------------------------------------------------* 03620000
//* CREATE MAILOUT FILE ON APPROVED HOUSING GRANT                       03630000
//*-------------------------------------------------------------------* 03640000
//STEP24   EXEC PGM=BP13CB10,COND=(0,NE)                                03650000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               03660000
//BP13FD10 DD DSN=&&FD10MAIL,DISP=(OLD,PASS)                            03670000
//BP13MAIL DD DSN=BP13.MAILOUT.CB10,DISP=SHR                            03680000
//SYSDBG   DD SYSOUT=*                                                  03690000
//SYSDBOUT DD SYSOUT=*                                                  03700000
//SYSOUT   DD SYSOUT=*                                                  03710000
//*                                                                     03720000
//*---------------------------------------------------------------------03730000
//* REFORMAT BP13FD10 TO BP13F633 FORMAT, INCLUDE ONLY ASG GRANT TYPE   03740000
//* REGNO IN COLUMN 1                                                   03750000
//* VRNO IN COLUMN 9                                                    03760000
//* GRANT TYPE IN COLUMN 328                                            03770000
//*---------------------------------------------------------------------03780000
//STEP25   EXEC SORT,COND=(0,NE)                                        03790000
//SORTIN   DD DSN=BP13.FD10.VOUCHOIC.DAILY,DISP=SHR                     03800000
//OUTPUT1  DD DSN=&&F633MAIL,DISP=(NEW,PASS),                           03810000
//            UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                       03820000
//            DCB=(RECFM=FB,LRECL=450,BLKSIZE=0)                        03830000
//SYSPRINT DD SYSOUT=*                                                  03840000
//SYSOUT   DD SYSOUT=*                                                  03850000
//SYSIN    DD *                                                         03860000
  SORT FIELDS=(4,8,CH,A)                                                03870000
      INCLUDE COND=((1,3,CH,EQ,C'ASG',OR,1,3,CH,EQ,C'EHG',OR,           03880000
                     1,3,CH,EQ,C'LHG'),                                 03890000
                    AND,24,2,CH,EQ,C'SS')                               03900000
  OUTFIL FNAMES=OUTPUT1,                                                03910000
                OUTREC=(4,8,24,11,308X,1,3,120X)                        03920000
//*-------------------------------------------------------------------* 03930000
//* CREATE MAILOUT FILE ON APPROVED HOUSING GRANT                       03940000
//*-------------------------------------------------------------------* 03950000
//STEP26   EXEC PGM=BP13CF98,COND=(0,NE)                                03960000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               03970000
//BP13F633 DD DSN=&&F633MAIL,DISP=(OLD,PASS)                            03980000
//BP13MAIL DD DSN=BP13.MAILOUT.CF98.ASG,DISP=SHR                        03990000
//BP13EACC DD DSN=BP13.MAILOUT.CF98.ASG.EXPTACC,DISP=SHR                04000000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              04010000
//BP13KB00 DD DSN=BP13.KB00.BEBTO,DISP=SHR                              04020000
//SYSDBG   DD SYSOUT=*                                                  04030000
//SYSDBOUT DD SYSOUT=*                                                  04040000
//SYSOUT   DD SYSOUT=*                                                  04050000
//*                                                                     04060000
//*-------------------------------------------------------------------* 04070000
//* SEND ALERT MAIL ON ASG                                              04080000
//*-----------------------------------------------------------------    04090000
//STEP27   EXEC SENDMAIL,COND=(4,LT)                                    04100000
//INPUT    DD DSN=BP13.MAILOUT.CF98.ASG,DISP=SHR                        04110000
//*                                                                     04120000
//*-------------------------------------------------------------------* 04130000
//* SEND ALERT MAIL ON AHG/SHG/SUG                                      04140000
//*-----------------------------------------------------------------    04150000
//STEP28   EXEC SENDMAIL,COND=(4,LT)                                    04160000
//INPUT    DD DSN=BP13.MAILOUT.CB10,DISP=SHR                            04170000
//*                                                                     04180000
//*-------------------------------------------------------------------* 04190000
//* SEND ALERT MAIL ON EC/DBSS GRANT                                    04200000
//*-----------------------------------------------------------------    04210000
//STEP29   EXEC SENDMAIL,COND=(4,LT)                                    04220000
//INPUT    DD DSN=BP13.MAILOUT.CF98,DISP=SHR                            04230000
//*                                                                     04240000
//*-------------------------------------------------------------------* 04250000
//* SEND ALERT MAIL ON NON ACC                                          04260000
//*-----------------------------------------------------------------    04270000
//STEP30   EXEC SENDMAIL,COND=(4,LT)                                    04280000
//INPUT    DD DSN=BP13.MAILOUT.CF98.ASG.EXPTACC,DISP=SHR                04290000
//*                                                                     04300000
//*---------------------------------------------------------------------04310000
//* SORT OUT DA='Y', WITHOUT CANCEL REASON, WITH BOOKING DATE,          04320000
//*          WITH SCHEME ACCOUNT                                        04330000
//*---------------------------------------------------------------------04340000
//STEP31   EXEC SORT,CYL=30,COND=(4,LT)                                 04350000
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                              04360000
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                           04370000
//            UNIT=SYSDA,SPACE=(CYL,(150,150),RLSE),                    04380000
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                       04390000
//SYSIN    DD  *                                                        04400000
  SORT FIELDS=(4,8,A),FORMAT=CH                                         04410000
  INCLUDE COND=(1857,1,CH,EQ,C'Y',AND,                                  04420000
                193,2,CH,LE,C'00',AND,                                  04430000
                509,8,CH,NE,C'        ',AND,                            04440000
                155,9,CH,GT,C'000000000')                               04450000
//*---------------------------------------------------------------------04460000
//* REPORT ON K800-NUM-DEFER-INCOME-ASSESS = Y                          04470000
//* BP13RPT1 - WITH K100-DTE-PACD-NOTIFY                                04480000
//* BP13RPT2 - WITHOUT K100-DTE-PACD-NOTIFY                             04490000
//*---------------------------------------------------------------------04500000
//STEP32   EXEC PGM=BP13CB0S,COND=(4,LT)                                04510000
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                            04520000
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                            04530000
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                      04540000
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                              04550000
//BP13RPT1 DD DSN=BP13.REPORT.DEFER.INCOME.RPT1,DISP=OLD                04560000
//BP13RPT2 DD DSN=BP13.REPORT.DEFER.INCOME.RPT2,DISP=OLD                04570000
//SYSUDUMP DD SYSOUT=*                                                  04580000
//SYSOUT   DD SYSOUT=*                                                  04590000
//SYSDBOUT DD SYSOUT=*                                                  04600000
//*---------------------------------------------------------------------04610000
//*                                                                     04620000
//*          BP13.REPORT.DEFER.INCOME.RPT1 IF NOT EMPTY                 04630000
//*                                                                     04640000
//*---------------------------------------------------------------------04650000
//STEP32A  EXEC PGM=IDCAMS,COND=(4,LT)                                  04660000
//SYSPRINT DD SYSOUT=*                                                  04670000
//FILE1 DD DSN=BP13.REPORT.DEFER.INCOME.RPT1,DISP=SHR                   04680000
//SYSUDUMP DD SYSOUT=*                                                  04690000
//SYSIN DD *                                                            04700000
  PRINT INFILE(FILE1) -                                                 04710000
  DUMP COUNT(1)                                                         04720000
  IF LASTCC EQ 4 THEN SET MAXCC=4                                       04730000
/*                                                                      04740000
//*                                                                     04750000
//STARTIF IF (STEP32A.RC = 0) THEN                                      04760000
//*---------------------------------------------------------------------04770000
//* SORT BY PCD NOTIFICATION DATE                                       04780000
//*---------------------------------------------------------------------04790000
//STEP33   EXEC SORT,CYL=30,COND=(4,LT)                                 04800000
//SORTIN   DD DSN=BP13.REPORT.DEFER.INCOME.RPT1,DISP=SHR                04810000
//SORTOUT  DD DSN=&&BP13T089,DISP=(NEW,PASS),                           04820000
//            UNIT=SYSDA,SPACE=(CYL,(150,150),RLSE),                    04830000
//            DCB=(BLKSIZE=0,LRECL=259,RECFM=VB)                        04840000
//SYSIN    DD  *                                                        04850000
  SORT FIELDS=(11,8,A),FORMAT=CH                                        04860000
/*                                                                      04870000
//*---------------------------------------------------------------------04880000
//* PCD REPORT FORMATED FOR SENDING MAIL                                04890000
//*---------------------------------------------------------------------04900000
//STEP35   EXEC PGM=BP13CG05,COND=(4,LT)                                04910000
//BP13F089 DD DSN=&&BP13T089,DISP=(OLD,DELETE)                          04920000
//BP13MAIL DD DSN=BP13.MAILOUT.BP13PCD1,DISP=OLD                        04930000
//SYSUDUMP DD SYSOUT=*                                                  04940000
//SYSOUT   DD SYSOUT=*                                                  04950000
//SYSDBOUT DD SYSOUT=*                                                  04960000
//*-------------------------------------------------------------------* 04970000
//*  SEND MAINFRAME EMAIL                                             * 04980000
//*-------------------------------------------------------------------* 04990000
//STEP37   EXEC SENDMAIL,COND=(4,LT)                                    05000000
//INPUT    DD DSN=BP13.MAILOUT.BP13PCD1,DISP=SHR                        05010000
/*                                                                      05020000
//STOPIF   ENDIF                                                        05030000
//*---------------------------------------------------------------------05040000
//* REPORT ON K800-NUM-DEFER-INCOME-ASSESS = Y                          05050000
//* BP13MAIL - EXCEPTION REPORT FOR BOOKED FLATS                        05060000
//*---------------------------------------------------------------------05070000
//*---------------------------------------------------------------------05080000
//* EXCEPTION REPORT FORMATED FOR SENDING MAIL                          05090000
//*---------------------------------------------------------------------05100000
//STEP38   EXEC PGM=BP13CB0T,COND=(4,LT)                                05110000
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                            05120000
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                            05130000
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                      05140000
//BP13MAIL DD DSN=BP13.MAILOUT.EXCPT.RPT,DISP=OLD                       05150000
//SYSUDUMP DD SYSOUT=*                                                  05160000
//SYSOUT   DD SYSOUT=*                                                  05170000
//SYSDBOUT DD SYSOUT=*                                                  05180000
//*-------------------------------------------------------------------* 05190000
//*  SEND MAINFRAME EMAIL                                             * 05200000
//*-------------------------------------------------------------------* 05210000
//STEP39   EXEC SENDMAIL,COND=(0,NE,STEP38)                             05220000
//INPUT    DD DSN=BP13.MAILOUT.EXCPT.RPT,DISP=SHR                       05230000
/*                                                                      05240000
//*-------------------------------------------------------------------* 05250000
//*          E N D      O F     J O B                                 * 05260000
//*-------------------------------------------------------------------* 05270000
