//BP13A803 JOB (BP13P),'BP13A803',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*---------------------------------------------------------------------        
//*- FOR SUCC SERS REQUEST,                                                     
//*- TO LOAD BALLOTED RECORD TO SOC MASTER / SOC OCCUP FILE                     
//*-                            SOC ADDRESS                                     
//*-----------------------------------------------------------------            
//* CHG REF   BY   ON     DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130195 LSB 961106 - TO TAKE OUT CONTROL LIST FOR BP13C579                 
//* BP130330 LSB 970626 - TO UPDATE SOC MASTER FOR NOT REGN CASE                
//* BP130418 CLT 980922 - Y2K COMPLIANCE CHANGES                                
//* BP130652     990826 - EXPAND F740,K740 RECL 300 TO 500                      
//* BP130778 YCH 991215 - INCLUDE BP137F13 IN BP13C579 TO DETERMINE             
//*                       F200-NUM-FLAT-TYPE                                    
//*                       BP13.F713.PIGEON.PA FOR ALL FLAT TYPE                 
//* BP130830 LSB 000428 - EXCLUDE FT=9 WHEN OUTPUT TO BP13F200                  
//* BP132222 ED  021015 - NEW STEPS FOR BP13C158                                
//* BP132500 YCH 050404 - INCLUDE ASSIGN OIC & KIV CASES                        
//* BP132500 YCH 150404 - GET ADDRESS FROM BP17K830 INSTEAD OF BP13K830         
//* BP132553 YCH 090704 - OMIT FLAT TYPE 9 & P WHEN CREATE BP13F200             
//* BP132862 CKK 150606 - INCLUDE BP13K648 IN BP13C528                          
//* BP133201 YCH 221107 - APPEND SERS                                           
//* BP133527 YCH 310309 - INCLUDE UPDATE OF RESALE LEVY 'LN' OR 'LNS'           
//* BP133639 ZDD 080709 - INCLUDE BP13K595 ON BP13C145                          
//*                       INCLUDE OTHER ALTERNATE FILES OF BP13K595             
//*          ZDD 090809 - INCLUDE BP13K730 ON BP13C145                          
//* BP134024 ZDD 300910 - INCLUDE BP13K813 ON BP13C528                          
//* BP134838 EAA1 060313- ADDED BP13C71R                                        
//* BP134838 EAA1 230513- CHANGE INPUT FILE IN BP13C71R                         
//* BP135168 YCH2 131213- INCLUDE BP17K270 FOR HLE NUMBER                       
//* BP135225 ZDD1 091215- INCLUDE BP13CH56                                      
//* BP137724 AM25 210619- INCLUDE UPDATE OF DEFERRED INCOME TAG                 
//******************************************************************            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1B CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSRS1C CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1C                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*- BACKUP SOC MASTER                                                          
//*-----------------------------------------------------------------            
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//   AMP=('BUFND=13')                                                           
//OUTPUT1   DD DSN=BP13.F800.APPLN,DISP=OLD                                     
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER FOR ALL CASES INCLUDE NT/FT = SPACES                 
//*-----------------------------------------------------------------            
//STEP02  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                              
//   AMP=('BUFND=22')                                                           
//SORTOUT DD DSN=&&BP13F740,DISP=(NEW,PASS),                                    
//       UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                     
//       SPACE=(CYL,(70,10),RLSE)                                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* TO EXTRACT THE SUCCESSFUL BALLOTED APPLICANT'S & OCCUPIER INFOR             
//* TO UPDATE THE SOC MASTER AND SOC OCCUPIER FILE                              
//* TO PASS RECORDS TO CFS FOR PRE-ELIGIBILITY CHECK                            
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13C528,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                   
//            SPACE=(CYL,(150,50),RLSE)                                         
//BP13F520 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13K530 DD DSN=BP13.K530.ISSUENO,DISP=SHR                                    
//BP13K825 DD DSN=BP17.K825.REQOCCP,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K648 DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13F310 DD DSN=BP13.F310.APPOINT,DISP=MOD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* INCLUDE ONLY HALF-IDP APPLICATIONS                                          
//*--------------------------------------------------------------------         
//STEP03A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F740DEF,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(465,1,CH,EQ,C'S')                                               
  SUM FIELDS=NONE                                                               
//*--------------------------------------------------------------------         
//* MATCH SERS SCHEME ACCOUNT FOR SOC REGNO                                     
//*--------------------------------------------------------------------         
//STEP03B  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP17.K000.SCHREF.SERSITE,DISP=SHR                             
//SORTJNF2 DD DSN=BP17.L384B.RGTHHD,DISP=SHR                                    
//MATCH    DD DSN=&&F000DEF,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   JOINKEYS FILE=F1,FIELDS=(1,9,A)                                              
   JOINKEYS FILE=F2,FIELDS=(1,9,A)                                              
   REFORMAT FIELDS=(F1:1,200)                                                   
   OUTFILE FNAMES=MATCH                                                         
   SORT FIELDS=(18,8,A),FORMAT=CH                                               
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* UPDATE BP13K800 WITH DEFERRED INCOME ASSESSMENT TAG FOR SERS CASES          
//*--------------------------------------------------------------------         
//STEP03C  EXEC PGM=BP13CF7M,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740DEF,DISP=(OLD,DELETE)                                   
//BP17F000 DD DSN=&&F000DEF,DISP=(OLD,DELETE)                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* ASSIGNING RESISTRATION NUMBER TO OIC                                        
//*-----------------------------------------------------------------            
//STEP03D  EXEC PGM=BP13C144,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13L144 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SKIP F800 CASES WHERE DTE-REGN IS NOT = F001-CURR-DTE                       
//*-----------------------------------------------------------------            
//STEP03E  EXEC PGM=BP13C145,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                                 
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR                           
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR                           
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR                           
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR                           
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                             
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                             
//P13L145A DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L145B DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REGN NO ORDER                                                          
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&BP13F830,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250,BLKSIZE=0),                    
//            SPACE=(CYL,(40,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(20,8,A),FORMAT=CH                                               
   OUTREC FIELDS=(20,8,8,11,20,231)                                             
//*---------------------------------------------------------------------        
//* SORT REGN NO ORDER                                                          
//*---------------------------------------------------------------------        
//STEP04A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F830,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F830SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250,BLKSIZE=0),                    
//            SPACE=(CYL,(40,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,9,A),FORMAT=CH                                                
//*----------------------------------------------------------------*            
//* REPRO SERS ADDR TO SOC                                                      
//*--------------------------------------------------------------------         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&F830SORT,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=BP13.K830.ADDR,DISP=OLD,                                      
//            AMP=('BUFND=23')                                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)  REPLACE                            
//*---------------------------------------------------------------------        
//* SORT THE REGN NO ORDER                                                      
//* INCLUDE ONLY SUCC-NT NOT = SPACES                                           
//* OMIT FLAT TYPE '9' AND 'P'                                                  
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(226,3,CH,EQ,C'   ',OR,(211,1,CH,EQ,C'0',OR,                       
       211,1,CH,EQ,C'9',OR,211,1,CH,EQ,C'P'))                                   
//*----------------------------------------------------------------*            
//* TO EXTRACT SUCCESSFUL APPLICANTS FROM REQUEST FILE             *            
//*----------------------------------------------------------------*            
//STEP07   EXEC PGM=BP13C579,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                  
//BP13F520 DD DSN=&&F740SUCC,DISP=(SHR,PASS)                                    
//BP13F200 DD DSN=&&P13F200A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=23400)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* TO APPEND BP13F200 RECORDS TO BOOKING APPOINTMENT FILE                      
//*---------------------------------------------------------------------        
//STEP08    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&P13F200A,DISP=(SHR,PASS)                                   
//OUTPUT1   DD DSN=BP13.F200.BKAPPMT,DISP=MOD                                   
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                        
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT SERS FILE BY NUM-NRIC, INCLUDE RECS WITH SPOUSE IC                     
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.K210.SERSOCCP,DISP=SHR                                   
//SORTOUT  DD DSN=&&F210,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,DCB=(BLKSIZE=0,LRECL=400,RECFM=FB),                       
//         SPACE=(CYL,(75,50),RLSE)                                             
//SYSIN    DD *                                                                 
    SORT FIELDS=(10,9,A),FORMAT=CH                                              
    INCLUDE COND=(145,9,CH,NE,C'         ')                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT REQ OCCUP FILE BY NRIC, INCLUDE RECS WITH SPOUSE IC                    
//*-------------------------------------------------------------------*         
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.K825.REQOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F825,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                       
//         SPACE=(CYL,(50,50),RLSE)                                             
//SYSIN    DD *                                                                 
    SORT FIELDS=(9,9,A),FORMAT=CH                                               
    INCLUDE COND=(160,9,CH,NE,C'         ')                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE SPOUSE NAME FROM SERS FILE INTO OCCUP FILE                           
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=BP13C158,COND=(0,NE)                                        
//BP13F825 DD DSN=&&F825,DISP=(OLD,DELETE)                                      
//BP17F210 DD DSN=&&F210,DISP=(OLD,DELETE)                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//   AMP=('BUFND=13')                                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* PRINT REPORTS AFTER ISSUING OF REGNO AND UPLOAD IN SOC                      
//*-------------------------------------------------------------------*         
//STEP12   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13F820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13F830 DD DSN=BP17.K830.ADDR,DISP=SHR                                       
//P13L045A DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L045B DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L045C DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//P13L045D DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S045),DISP=SHR                             
//*---------------------------------------------------------------------        
//* TO UPDATE RESALE STATUS = 'LN' OR 'LNS' TO MASTER                           
//* AFTER DETAIL UPDATED TO MASTER                                              
//*---------------------------------------------------------------------        
//STEP21    EXEC PGM=BP13C71N,COND=(0,NE)                                       
//BP13F520  DD DSN=&&BP13F740,DISP=(OLD,PASS)                                   
//BP13K825  DD DSN=BP17.K825.REQOCCP,DISP=SHR                                   
//BB24K510  DD DSN=BB24.K510.UINHIST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BB24K500  DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* TO UPDATE THE FOLLOWING TO MASTER                                           
//*   -> K200-NUM-HH-CITIZENSHIP                                                
//*   -> K200-NUM-SPRQUOTA-TAG                                                  
//*   -> K200-NUM-SCSPR-OPT                                                     
//*   -> K200-NUM-LBS                                                           
//*   -> K200-NUM-BAL-LEASE                                                     
//*   -> K200-NUM-BUY-SELL-TAG                                                  
//*   -> K200-NUM-SERS-RSL-STATUS                                               
//*---------------------------------------------------------------------        
//STEP30    EXEC PGM=BP13C71R,COND=(0,NE)                                       
//BP13F520  DD DSN=&&BP13F740,DISP=(OLD,PASS)                                   
//BP17K000  DD DSN=BP17.K000.SCHREF.SERSITE,DISP=SHR,                           
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP17K001  DD DSN=BP17.K000.SCHREF.SERSITE.PATH1,DISP=SHR,                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP17K270  DD DSN=BP17.K270.HLEAPPLN,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP17K200  DD DSN=BP17.K200.SERSAPPL,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//STEP31   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP17.K000.SCHREF.SERSITE,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP17F000,DISP=(NEW,PASS),                                  
//         UNIT=SYSDA,DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                       
//         SPACE=(CYL,(50,50),RLSE)                                             
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,9,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* UPDATE BP13KD07 (KD07-NUM-HALF-GRANT)                                       
//*-----------------------------------------------------------------            
//STEP32 EXEC PGM=BP13CH56,COND=(0,NE)                                          
//BP17F000 DD DSN=&&BP17F000,DISP=(OLD,DELETE)                                  
//BP17K200 DD DSN=BP17.K200.SERSAPPL,DISP=SHR                                   
//BP13KD07 DD DSN=BP13.KD07.GRANTMAS,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
