//BP13MBK3 JOB (BP13P),'BP13MBK3',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010003
//         NOTIFY=CSD0071                                               00020003
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030003
//**********************************************************************00040003
//* BACKUP AND REDEFINE BP13.K879.ACCESS.LOG                            00050003
//*---------------------------------------------------------------------00051003
//* CHG REF  BY  ON       DESCRIPTION                                   00052003
//* -------  --  --       ----------------------------------------------00053003
//* BP135439 IL5 20140814 - NEW                                         00054003
//* BP135420 ESD 20141020   ADD BCKUP FOR KC00 F340 AND K800 FILE 2ND CA00055003
//* BP135664 ESA 20150508   ADD BCKUP FOR BP27F341 FOR 1ST CA           00056003
//* BP136030 LSB 20160202   ADD BCKUP FOR BP13F860/F870/F096 OT FILE    00057003
//* BP135533 LJL 20160503   ADD VERIFY STEP FOR BP13KC00                00057103
//**********************************************************************00058003
//*      VERIFY FILES BEFORE JOB RUN                                    00059003
//*-----------------------------------------------------------------    00060003
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                   00070003
//INPUT1   DD DSN=BP13.K879.ACCESS.LOG,DISP=OLD                         00080003
//SYSPRINT DD SYSOUT=*                                                  00090003
//SYSIN   DD *                                                          00100003
          VFY FILE(INPUT1)                                              00110003
              IF LASTCC=12 THEN DO                                      00120003
                SET MAXCC=0                                             00120103
                VFY FILE(INPUT1)                                        00120203
              END                                                       00120303
/*                                                                      00120403
//**********************************************************************00120503
//*      VERIFY FILES BEFORE JOB RUN                                    00120603
//*-----------------------------------------------------------------    00120703
//STEP0B  EXEC PGM=IDCAMS,COND=(0,NE)                                   00120803
//INPUT1A  DD DSN=BP13.KC00.SECONDCA,DISP=OLD                           00120903
//SYSPRINT DD SYSOUT=*                                                  00121003
//SYSIN   DD *                                                          00121103
          VFY FILE(INPUT1A)                                             00121203
/*                                                                      00121703
//*-----------------------------------------------------------------    00121803
//*  BACKUP BP13K879 - 13 GDG                                           00121903
//*---------------------------------------------------------------------00122003
//STEP01   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00122103
//SYSPRINT DD  SYSOUT=*                                                 00122203
//INPUT1   DD  DSN=BP13.K879.ACCESS.LOG,DISP=SHR,                       00122304
//         AMP=('BUFND=13')                                             00122504
//OUTPUT1  DD  DSN=&&BP13F879,DISP=(,PASS),                             00122604
//         UNIT=SYSDA,                                                  00122804
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900),                      00123004
//         SPACE=(CYL,(50,10),RLSE)                                     00123104
//*                                                                     00123204
//SYSIN    DD  *                                                        00123304
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                              00123404
//*---------------------------------------------------------------------00123504
//STEP1A EXEC    SORT,COND=(0,NE)                                       00123604
//SORTIN   DD  DSN=BP13.F879.ACCESS.LOG.ACCUM,DISP=SHR                  00123704
//         DD  DSN=&&BP13F879,DISP=(OLD,PASS)                           00123804
//SORTOUT  DD  DSN=&&F879SORT,DISP=(,PASS),                             00123904
//         UNIT=SYSDA,                                                  00124004
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900),                      00124104
//         SPACE=(CYL,(50,10),RLSE)                                     00124204
//SYSIN    DD  *                                                        00124304
  SORT FIELDS=(1,27,A),FORMAT=CH                                        00124404
//*-----------------------------------------------------------------    00124704
//*  BACKUP BP13K879 - 13 GDG                                           00124804
//*---------------------------------------------------------------------00124904
//STEP1B   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00125004
//SYSPRINT DD  SYSOUT=*                                                 00125104
//INPUT1   DD  DSN=&&F879SORT,DISP=(OLD,PASS)                           00125204
//OUTPUT1  DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(+1),                  00125504
//             DISP=(,PASS),                                            00125604
//             UNIT=CART,                                               00125704
//             LABEL=(1,SL),                                            00125804
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)              00125904
//*                                                                     00126004
//SYSIN    DD  *                                                        00126104
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                              00126204
//*---------------------------------------------------------------------00126304
//*  CATALOG GDG                                                        00126404
//*---------------------------------------------------------------------00126504
//STEP02 EXEC    PGM=IEFBR14,COND=(0,NE)                                00126604
//INPUT1   DD  DSN=BP13.F879.ACCESS.LOG.BKUP.TAPE(+1),                  00126704
//             DISP=(OLD,CATLG),                                        00126804
//             UNIT=(,,DEFER)                                           00126904
//*---------------------------------------------------------------------00127004
//* DELETE AND DEFINE VSAM FILE BP13K879                                00127104
//*---------------------------------------------------------------------00127204
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00127304
//INPUT1   DD  DSN=BP13.BLANK.CHAR100,DISP=SHR                          00127404
//SYSPRINT DD  SYSOUT=*                                                 00127504
//SYSIN    DD  *                                                        00127603
                                                                        00128003
        DELETE 'BP13.K879.ACCESS.LOG' CL PURGE                          00129003
        DEF CL (NAME(BP13.K879.ACCESS.LOG)            -                 00130003
              CYL(40 30)                            -                   00140003
              SHR(2 3)                               -                  00150003
              INDEXED -                                                 00160003
              KEYS(27 0)                             -                  00170003
              CISZ(4096)                             -                  00180003
              STORCLAS(PRODRLS)                      -                  00190003
              LOG(NONE)                              -                  00200003
              RECSZ(100 100))                        -                  00210003
              DATA(NAME(BP13.K879.ACCESS.LOG.DATA)) -                   00220003
              INDEX(NAME(BP13.K879.ACCESS.LOG.INDEX))                   00230003
                                                                        00240003
      IF MAXCC = 0  THEN                             -                  00250003
      REPRO IFILE(INPUT1)                            -                  00260003
            ODS(BP13.K879.ACCESS.LOG)                -                  00270003
            REUSE                                                       00280003
//*-----------------------------------------------------------------    00281004
//*  EMPTY FILE                                                         00282004
//*---------------------------------------------------------------------00283004
//STEP3A   EXEC  PGM=IDCAMS,COND=(0,NE)                                 00284004
//SYSPRINT DD  SYSOUT=*                                                 00285004
//INPUT1   DD  DSN=BP13.BLANK.CHAR100,DISP=SHR                          00286004
//OUTPUT1  DD  DSN=BP13.F879.ACCESS.LOG.ACCUM,DISP=OLD                  00288004
//*                                                                     00289304
//SYSIN    DD  *                                                        00289404
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                              00289504
//*-----------------------------------------------------------------    00290003
//* BACKUP FILE BP13.KC00.SECONDCA                                      00300003
//*-----------------------------------------------------------------    00310003
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                  00320003
//SYSPRINT DD SYSOUT=*                                                  00330003
//INPUT1   DD DSN=BP13.KC00.SECONDCA,DISP=SHR                           00340003
//OUTPUT1  DD DSN=BP13.FC00.SECONDCA.BKUP(+1),DISP=(,CATLG,DELETE),     00350003
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=1000,RECFM=FB),            00360003
//             SPACE=(CYL,(80,10),RLSE)                                 00370003
//SYSIN    DD *                                                         00380003
        REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                           00390003
//*-----------------------------------------------------------------    00400003
//* DELETE RECORD IN KC00 IF KEY ISSUED                                 00410003
//*-----------------------------------------------------------------    00420003
//STEP4A  EXEC PGM=BP13C90F,COND=(0,NE)                                 00430003
//BP13FC00 DD DSN=BP13.FC00.SECONDCA.BKUP(+1),DISP=SHR                  00440003
//BP13KC00 DD DSN=BP13.KC00.SECONDCA,DISP=SHR                           00450003
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                           00460003
//            AMP=('BUFND=4','BUFNI=8')                                 00470003
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                     00480003
//            AMP=('BUFND=4','BUFNI=8')                                 00490003
//SYSDBG   DD SYSOUT=*                                                  00500003
//SYSDBOUT DD SYSOUT=*                                                  00510003
//SYSABOUT DD SYSOUT=*                                                  00520003
//SYSOUT   DD SYSOUT=*                                                  00530003
//*-----------------------------------------------------------------    00540003
//* BACKUP FILE BP27F340                                                00550003
//*-----------------------------------------------------------------    00560003
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                  00570003
//SYSPRINT DD SYSOUT=*                                                  00580003
//INPUT1   DD DSN=BP13.BP27.F340.ACCUM,DISP=SHR                         00590003
//OUTPUT1  DD DSN=BP13.BP27.F340.BKUP(+1),DISP=(,CATLG,DELETE),         00600003
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=50,RECFM=FB),              00610003
//             SPACE=(CYL,(10,5),RLSE)                                  00620003
//SYSIN    DD *                                                         00630003
        REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                           00640003
//*-----------------------------------------------------------------    00650003
//* BACKUP FILE BP13.F800.SECONDCA                                      00660003
//*-----------------------------------------------------------------    00670003
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                  00680003
//SYSPRINT DD SYSOUT=*                                                  00690003
//INPUT1   DD DSN=BP13.F800.SECONDCA.LOWRISK,DISP=SHR                   00700003
//OUTPUT1  DD DSN=BP13.F800.SECONDCA.BKUP(+1),DISP=(,CATLG),            00710003
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=2000,RECFM=FB),            00720003
//             SPACE=(CYL,(50,10),RLSE)                                 00730003
//SYSIN    DD *                                                         00740003
        REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                           00750003
//*-------------------------------------------------------------------- 00760003
//* EMPTY FILE                                                          00770003
//*-------------------------------------------------------------------- 00780003
//STEP07 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00790003
//SYSPRINT DD  SYSOUT=*                                                 00800003
//INPUT1   DD  DUMMY                                                    00810003
//OUTPUT1  DD  DSN=BP13.F800.SECONDCA.LOWRISK,                          00820003
//             DISP=OLD                                                 00830003
//OUTPUT2  DD  DSN=BP13.BP27.F340.ACCUM,                                00840003
//             DISP=OLD                                                 00850003
//SYSIN    DD  *                                                        00860003
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                             00870003
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                             00880003
//*-----------------------------------------------------------------    00890003
//* BACKUP FILE BP27F341                                                00900003
//*-----------------------------------------------------------------    00910003
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                  00920003
//SYSPRINT DD SYSOUT=*                                                  00930003
//INPUT1   DD DSN=BP13.BP27.F341.ACCUM,DISP=SHR                         00940003
//OUTPUT1  DD DSN=BP13.BP27.F341.BKUP(+1),DISP=(,CATLG,DELETE),         00950003
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=50,RECFM=FB),              00960003
//             SPACE=(CYL,(10,5),RLSE)                                  00970003
//SYSIN    DD *                                                         00980003
        REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                           00990003
//*                                                                     01000003
//*-----------------------------------------------------------------    01010003
//* BACKUP FILE BP13F860/F870/F096 OT FILE                              01020003
//*-----------------------------------------------------------------    01030003
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                  01040003
//SYSPRINT DD SYSOUT=*                                                  01050003
//INPUT1   DD DSN=BP13.F860.USER.OT,DISP=SHR                            01060003
//OUTPUT1  DD DSN=BP13.F860.USER.OT.MONTH(+1),DISP=(,CATLG,DELETE),     01070003
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=80,RECFM=FB),              01080003
//             SPACE=(CYL,(20,10),RLSE)                                 01090003
//INPUT2   DD DSN=BP13.F870.PANEL.OT,DISP=SHR                           01100003
//OUTPUT2  DD DSN=BP13.F870.PANEL.OT.MONTH(+1),DISP=(,CATLG,DELETE),    01110003
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=30,RECFM=FB),              01120003
//             SPACE=(CYL,(30,10),RLSE)                                 01130003
//INPUT3   DD DSN=BP13.F096.SECURITY.OT,DISP=SHR                        01140003
//OUTPUT3  DD DSN=BP13.F096.SECURITY.OT.MONTH(+1),DISP=(,CATLG,DELETE), 01150003
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB),             01160003
//             SPACE=(CYL,(50,10),RLSE)                                 01170003
//SYSIN    DD *                                                         01180003
        REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                           01190003
        REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                           01200003
        REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                           01210003
//*                                                                     01220003
//*-------------------------------------------------------------------- 01230003
//* EMPTY FILE                                                          01240003
//*-------------------------------------------------------------------- 01250003
//STEP10 EXEC    PGM=IDCAMS,COND=(0,NE)                                 01260003
//SYSPRINT DD  SYSOUT=*                                                 01270003
//INPUT1   DD  DUMMY                                                    01280003
//OUTPUT1  DD  DSN=BP13.F860.USER.OT,                                   01290003
//             DISP=OLD                                                 01300003
//OUTPUT2  DD  DSN=BP13.F870.PANEL.OT,                                  01310003
//             DISP=OLD                                                 01320003
//OUTPUT3  DD  DSN=BP13.F096.SECURITY.OT,                               01330003
//             DISP=OLD                                                 01340003
//SYSIN    DD  *                                                        01350003
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                             01360003
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                             01370003
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT3)                             01380003
