//BP13ADP9 JOB (BP13P),'BP13ADP9',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* PROGRAM TO CHECK BP13KB78 WITH BP13K730 ON TCP/MCPS/CAT                     
//*=================================================================            
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* SORT REGN-NO ORDER                                                          
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13FB78,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=3300,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=(6,8,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* SORT REGN-NO ORDER                                                          
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F730,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* VALIDATE TCP/MCPS/CAT BETWEEN INTERNET BP13KB78 AND BP13K730                
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13CD11,COND=(0,NE)                                        
//BP13FB78 DD DSN=&&BP13FB78,DISP=(OLD,PASS)                                    
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F73A DD DSN=&&BP13TCP,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          00740000
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
/*                                                                              
