//BP13ADPJ JOB (BP13P),'BP13ADPJ',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//**************************************************************                
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//*----------------------------------                                           
//* BP134259     300611 - NEW                                                   
//*=================================================================            
//* DBSS                                                                        
//*=================================================================            
//********************************************************************* 00000090
//* PRINT CHECKLIST AND ATTENDANT LIST FOR DBSS                         00000100
//********************************************************************* 00000120
//* SORT BY QUEUE NUMBER                                                        
//*-----------------------------------------------------------------            
//SORT01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K200.BKAPPMT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&F200SUCC,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(57,5,A),FORMAT=CH                                              
    INCLUDE COND=(14,1,CH,EQ,C'5')                                              
//********************************************************************* 00000090
//* PRINT CHECKLIST AND ATTENDANT LIST FOR DBSS                         00000100
//********************************************************************* 00000120
//*----------------------------------------------------------------     00001430
//*   TO PRINT CHECK LIST OF APPOINTMENT LETTER                         00001440
//*----------------------------------------------------------------     00001450
//STEP05 EXEC    PGM=BP13C24A,COND=(0,NE)                               00001460
//BP13F200 DD  DSN=&&F200SUCC,DISP=(SHR,PASS)                                   
//BP13KB20 DD  DSN=BP13.KB20.DBSBK,                                     00001510
//             DISP=SHR,                                                00001520
//             AMP=('BUFNI=8','BUFND=4')                                00001530
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                 00001510
//             DISP=SHR,                                                00001520
//             AMP=('BUFNI=8','BUFND=4')                                00001530
//BP13K820 DD  DSN=BP13.K820.OCCUP.DBS,                                 00001540
//             DISP=SHR,                                                00001550
//             AMP=('BUFNI=8','BUFND=4')                                00001560
//BP13K830 DD  DSN=BP13.K830.ADDR,                                      00001570
//             DISP=SHR,                                                00001580
//             AMP=('BUFNI=8','BUFND=4')                                00001590
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                00001600
//             DISP=SHR,                                                00001610
//             AMP=('BUFNI=8','BUFND=4')                                00001620
//BP13L24A DD  DSN=BP13.L24A.CHKLIST,DISP=SHR                           00001630
//SYSDBG   DD  SYSOUT=*                                                 00001650
//SYSDBOUT DD  SYSOUT=*                                                 00001660
//SYSOUT   DD  SYSOUT=*                                                 00001670
/*                                                                      00001680
//*---------------------------------------------------------------------00001260
//* SORT F200 BY ADTE/NT/FT/DTE-APPT/TIME/REGN                          00001270
//*---------------------------------------------------------------------00001280
//STEP06 EXEC    SORT,COND=(0,NE)                                       00001290
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                   00001300
//             DISP=SHR                                                 00001310
//SORTOUT  DD  DSN=&&P13F200H,                                          00001320
//             DISP=(NEW,PASS),                                         00001330
//             SPACE=(CYL,(10,5),RLSE),                                 00001340
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00001350
//SYSIN    DD  *                                                        00001360
   SORT FIELDS=(1,13,A,38,12,A,57,5,A),FORMAT=CH                                
   INCLUDE COND=(14,1,CH,EQ,C'5')                                               
/*                                                                      00001370
//*-------------------------------------------------------------------- 00002070
//*     PRINT ATTENDANCE LIST                                           00002080
//*     BP13C231 REPLACE FOCUS BM06705A                                 00002090
//*-------------------------------------------------------------------- 00002100
//STEP24 EXEC    PGM=BP13C24B,COND=(0,NE)                               00002110
//BP13F200 DD  DSN=&&P13F200H,                                          00002140
//             DISP=(SHR,PASS)                                          00002150
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,                                 00002160
//             DISP=SHR,                                                00002170
//             AMP=('BUFNI=8','BUFND=4')                                00002180
//BP13K820 DD  DSN=BP13.K820.OCCUP.DBS,                                 00002190
//             DISP=SHR,                                                00002200
//             AMP=('BUFNI=8','BUFND=4')                                00002210
//BP13KB20 DD  DSN=BP13.KB20.DBSBK,                                     00002190
//             DISP=SHR,                                                00002200
//             AMP=('BUFNI=8','BUFND=4')                                00002210
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                   00002220
//             DISP=SHR,                                                00002230
//             AMP=('BUFNI=8','BUFND=4')                                00002240
//BP13L24B DD  DSN=BP13.L24B.ATTLIST,                                   00002250
//             DISP=SHR                                                 00002260
//SYSDBG   DD  SYSOUT=*                                                 00002270
//SYSDBOUT DD  SYSOUT=*                                                 00002280
//SYSOUT   DD  SYSOUT=*                                                 00002290
/*                                                                      00002300
