//BP13M208  JOB (BP13P),'BP13M208',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* REPORT TO SHOW APPLNT CURRENT SMS-FT/RSL-FT/TENANT/NEW APPLNT               
//*=================================================================            
//* CHG REF  ON       BY    DESCRIPTION                                         
//* -------- -------- ----- -----------                                         
//* BP132235 20030305 ANC1  NEW JCL                                             
//* BP132384 20030801 ANC1  CHANGE PROCESS OF REPORT, GET INFO FROM             
//*                         BP13F800.                                           
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : COPIES = 1                                                          
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAMPPA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*---------------------------------------------------------------------        
//*--BYPASS COND=99--                                                           
//*---------------------------------------------------------------------        
//* SORT F800, INCLUDE CASES WITH SCH-ACCT-NO                                   
//* - ALLOC CAT  = WIS (BOOKED CASES ONLY)                                      
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.F800.APPLN.BOOK,DISP=SHR                                 
//SORTOUT  DD DSN=&&F800WIS4,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                              
//            SPACE=(CYL,(150,100),RLSE),UNIT=SYSDA                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,CH,A),FORMAT=CH                                              
  INCLUDE COND=(155,1,CH,NE,C' ',AND,                                           
                924,3,CH,EQ,C'WIS',AND,                                         
                30,1,CH,EQ,C'4')                                                
  OUTREC FIELDS=(1,923,C'WI4',927,1073)                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  TABULATE REPORT ON NEWHOUSEHOLD FOR BOOKING SYSTEM                         
//*  ON OCCUPIER AND TENANTS   (BM06TBL5 ==>BP13S092)                           
//*---------------------------------------------------------------------        
//STEP02   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP13UPG  DD DSN=&&F800WIS4,DISP=(OLD,PASS)                                    
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S092),DISP=SHR                             
/*                                                                              
