//BP13D217 JOB (BP13P),'BP13D217',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* CHG REF  ON     BY    DESCRIPTION                                           
//* ---------------------------------                                           
//* BP134253 110603 DW5   NEW JCL TO CONTINUE BP13A211 JOB AFTER                
//*                       AFTER OFFICE HOUR                                     
//* BP134521 040512 ESA1  ADD BM06K100 IN BP13C227                              
//* BP134587 070212 ESA1  ADD BP13KQ50 IN BP13C227                              
//* BP134769 050313 SMR2  REMOVE SIMILAR STEPS IN BP13D216 FOR THE              
//*                       CREATION OF BP13F230 AND EQMS FILE                    
//* BP13XXXX 061113 EL27  UNIT=(SYSDA,10) FOR 200.BKAPPMT FILES                 
//* BP135404 030714 ESA1  REMOVE CNTRL REPORT PRINTING FOR BP13C240             
//*********************************************************************         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR UPDATING OF BOOKING APPMT DATE AND TIME FOR                 
//* MATURE NEW TOWNS ONLY (BOOKING EXERCISE ON NEW TOWN BASIS).                 
//*********************************************************************         
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID),DEST=IOM2                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 5 - SCHEDULE BOOKING APPMT (ZONE)                       
//*--------------------------------------------------------------------         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F205.APNTREC,DISP=SHR                                    
//SORTOUT  DD DSN=&&F205A,DISP=(NEW,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=80),                                             
//        SPACE=(CYL,(5,2),RLSE)                                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'UN')                                              
   SUM FIELDS=NONE                                                              
//*--------------------------------------------------------------------*        
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO                       
//*--------------------------------------------------------------------*        
//STEP14 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200F,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(9,3,A,12,2,A,50,6,A,57,5,A),FORMAT=CH                          
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CASES WITH DIFFERENT ZONE/NT/FT.                                            
//*--------------------------------------------------------------------*        
//STEP15 EXEC    PGM=BP13C27C,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200F,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=&&F205A,                                                     
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13L27C DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM2                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO                       
//*--------------------------------------------------------------------*        
//STEP16 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(9,3,A,12,2,A,50,6,A,57,5,A),FORMAT=CH                          
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CANCELLATION CASES                                                          
//*--------------------------------------------------------------------*        
//STEP17 EXEC    PGM=BP13C240,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&F205A,                                                     
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,DELETE)                                                
//P13F200O DD  DSN=&&P13F200B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//P13F240O DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM2                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CASES WITH SHORTLIST-QTR NOT THE SAME AS BALLOT-QTR.                        
//*--------------------------------------------------------------------*        
//STEP18 EXEC    PGM=BP13C273,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=&&F205A,                                                     
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L273 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM2                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK SOC MASTER FILE FOR CASES ALREADY ACCEPTED A FLAT.                 
//*--------------------------------------------------------------------*        
//STEP19 EXEC    PGM=BP13C285,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200C,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=&&F205A,                                                     
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L285 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM2                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CASES WITH DIFFERENT ZONE/NT/FT.                                            
//*--------------------------------------------------------------------*        
//STEP20 EXEC    PGM=BP13C27A,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200D,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=&&F205A,                                                     
//             DISP=(SHR,DELETE)                                                
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200E,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L27A DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM2                                
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* TO GET BP13F800 FROM BP13F200                                               
//*---------------------------------------------------------------------        
//STEP21 EXEC    PGM=BP13C23D,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200E,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13F800 DD  DSN=&&BP13F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                              
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO EXTRACT OCCUPIER RECORDS                                                
//*---------------------------------------------------------------------        
//STEP22 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=&&BP13F820,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,75),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*   TO RETRIEVE CORRESPONDING F820 BASED ON F800-NUM-REGN                     
//*--------------------------------------------------------------------         
//STEP23 EXEC    PGM=BP13C268,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&BP13F800,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F820 DD  DSN=&&BP13F820,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F82A DD  DSN=&&P13F820A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,75),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* TO CHECK UTS                                                                
//*--------------------------------------------------------------------         
//STEP24  EXEC   PGM=BP13C23B,COND=(0,NE)                                       
//BP13F820 DD  DSN=&&P13F820A,DISP=(SHR,PASS)                                   
//BR11K010 DD  DSN=BR11.K010.LESSEE,DISP=SHR                                    
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* TO SORT RECORD BY KEY-FLD                                                   
//*---------------------------------------------------------------------        
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.BLANK.CHAR400,DISP=SHR                                   
//         DD DSN=&&P13F820A,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&TEMP1,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),                               
//            SPACE=(TRK,(100,50),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*      TO CREATE SOC OCCUPIER FILE  (BP13.K820.BP13A211)                      
//*--------------------------------------------------------------------         
//STEP26    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=&&TEMP1,DISP=(OLD,PASS)                                       
//SYSIN     DD  *                                                               
          DEF CLUSTER                                -                          
              (NAME(BP13.K820.BP13A211)             -                           
              CYL(10 5)                            -                            
              SPEED                                  -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K820.BP13A211.DATA)         -                          
              KEYS(17 0)                             -                          
              RECSZ(400 400)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K820.BP13A211.INDEX) -                                 
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K820.BP13A211)                                           
      IF MAXCC = 0  THEN                             -                          
           DEF AIX (NAME(BP13.K820.BP13A211.ALTX1) -                            
               REL(BP13.K820.BP13A211)               -                          
               REUSE                                 -                          
               KEYS(9 8)                             -                          
               SHR(2 3)                              -                          
               NUNQK)                                -                          
               DATA                                  -                          
               (NAME(BP13.K820.BP13A211.ALTX1.DATA) -                           
               CYL(10 5)                          -                             
               RECSZ(31 354)                         -                          
               FSPC(10 10)                           -                          
               CISZ(4096))                           -                          
               INDEX                                 -                          
               (NAME(BP13.K820.BP13A211.ALTX1.INDEX) -                          
               CISZ(4096))                                                      
         IF MAXCC = 0 THEN                           -                          
           DEF PATH (NAME(BP13.K820.BP13A211.PATH1) -                           
               PENT(BP13.K820.BP13A211.ALTX1))                                  
         IF MAXCC = 0 THEN                                                      
           BIX IDS(BP13.K820.BP13A211)               -                          
               ODS(BP13.K820.BP13A211.ALTX1)                                    
//*-----------------------------------------------------------------            
//*   SORT OUT UTS CASES                                                        
//*-----------------------------------------------------------------            
//STEP27 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&P13F820A,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F820B,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),                               
//            SPACE=(TRK,(100,50),RLSE)                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(400,1,CH,EQ,C'Y')                                             
    SUM FIELDS=NONE                                                             
//*---------------------------------------------------------------------        
//* EDTK800W - TO UPDATE BTO ZONE                                               
//*--------------------------------------------------------------------         
//STEP28  EXEC   PGM=BP13C23C,COND=(0,NE)                                       
//BP13F820 DD  DSN=&&P13F820B,DISP=(SHR,PASS)                                   
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR                                   
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                                     
//BP13K820 DD  DSN=BP13.K820.BP13A211,DISP=SHR                                  
//BP13L23C DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM2                                
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* TO DELETE TEMP FILE                                                         
//*---------------------------------------------------------------------        
//STEP29 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   DEL BP13.K820.BP13A211 CL PURGE                                              
/*                                                                              
//*---------------------------------------------------------------------        
//* TO CLEAR UP BP13.F205.APNTREC                                               
//*---------------------------------------------------------------------        
//STEP30 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DUMMY                                                            
//OUTPUT1  DD  DSN=BP13.F205.APNTREC,                                           
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*********************************************************************         
//* END OF BP13D217                                                             
//*********************************************************************         
