//BP13D413 JOB (BP13P),'BP13D413',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//* ============================================================== *            
//* FTP JOB TO FTP INTERFACE FILE TO FPS(ERR) -  ASSET MODULE      *            
//* ============================================================== *            
//* CHGE REQ  DATE        BY   DESCRIPTION                                      
//* --------  ----        ---  -----------                                      
//* BP134021  20110329    DW5  New JCL to ftp interface file to FPS             
//* BP134135  20110812    DW5  ADD CLEAR DATASET AFTER FTP                      
//******************************************************************            
//* FTP ERP FILE TO SAPDBPV02 SERVER                                            
//******************************************************************            
//STEP01   EXEC FTP,PARM='sapcipv01a (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  /appn/ag20/bp13/in/wrk                                                    
  ASCII                                                                         
  PUT 'BP13.F417.AM.ASSET' BP13.F417.AM.ASSET                                   
  QUIT                                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* TO CLEAR UP BP13.F417.AM.ASSET                                              
//*---------------------------------------------------------------------        
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DUMMY                                                            
//OUTPUT1  DD  DSN=BP13.F417.AM.ASSET,                                          
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*---------------------------------------------------------------------        
//* END OF FTP JOB                                                              
//*---------------------------------------------------------------------        
