//BP13Y100 JOB (BP13P),'BP13YEARLY',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),  00000010
//         NOTIFY=CSD0071                                               00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                          00000040
//*=================================================================    00000060
//*                                                                     00000060
//*  NOTE: DO NOT CHANGE STEP NUMBERING FOR STEP11, STEP13              00000060
//*                                                                     00000060
//*=================================================================    00000060
//* CHG REF  DATE     BY   DESCRIPTION                                  00000070
//* -------- ----     ---  -----------                                  00000080
//* BP130857 20000801 SSS  ADD GROUPID                                  00000090
//* BP132627 20041106 GAN1 1.CHG F800.APPLN.KEYISSUE TO BP13K893        00000090
//*                        2.INCLUDE RUN OF REVISED PGM BP13C450        00000090
//*                        3.INCLUDE BACKUP FO BP13K130 AND BP13K410    00000090
//* BP132800 20060116 LMS1 1.TO BACKUP K800, K820 AND K410 TO OFFSITE.  00000090
//* BP133740 20110104 LSB1 EXPAND SPACE FOR K893                        00000090
//* BP134335 20110816 LSB1 EXPAND REC SIZE FOR ALT KEY                  00000090
//* BP134780 20130121 LSB1 EXPAND TEMP SPACES FOR K893                  00000090
//*          20170105 CCC5 EXPAND TEMP SPACES FOR K893, K895            00000090
//* BP137090 20171205 LJL1 EXPAND SPACES FOR K893                       00000090
//* BP137150 20180104 LJL1 EXPAND SPACES FOR &&BP13F893                 00000090
//* BP138645 20210915 CCC5 EXPAND SPACES                                00000090
//*=================================================================    00000100
//* BP13Y100 MUST BE RUN AFTER OR BEFORE BP13W450 AND NOT               00000110
//*   CONCURRENTLY WITH BP13W450 CHG NO. C920697                        00000120
//*=================================================================    00000130
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET      00000140
//*-----------------------------------------------------------------    00000150
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                               00000160
//SYSUT1   DD  *                                                        00000170
$DJDE$ JDE=BP13S,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                           00000180
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                               00000190
//SYSPRINT DD  SYSOUT=*                                                 00000210
//SYSIN    DD  DUMMY                                                    00000220
/*                                                                      00000230
//*---------------------------------------------------------------------        
//*  BACKUP COPYCOB                                                             
//*---------------------------------------------------------------------        
//STEP01 EXEC PGM=IEBCOPY,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DSN=BP13.BATCH.COPYCOB,DISP=SHR                                   
//SYSUT2   DD DSN=BP13.COPYCOB.CY.OFFSITE(+1),                                  
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,                                                        
//            LABEL=(1,SL),                                                     
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=80,RECFM=FB)                        
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* BACKUP EC FILES                                                             
//*---------------------------------------------------------------------        
//STEP02   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=8')                                                  
//OUTPUT1  DD  DSN=BP13.F800.APPLN.CY.OFFSITE(+1),                              
//             DISP=(NEW,PASS),                                                 
//             UNIT=CART,                                                       
//             LABEL=(2,SL),                                                    
//             VOL=REF=*.STEP01.SYSUT2,                                         
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=2000,RECFM=FB)                     
//INPUT2   DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=8')                                                  
//OUTPUT2  DD  DSN=BP13.F820.OCCUP.CY.OFFSITE(+1),                              
//             DISP=(NEW,PASS),                                                 
//             UNIT=CART,                                                       
//             LABEL=(3,SL),                                                    
//             VOL=REF=*.OUTPUT1,                                               
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=400,RECFM=FB)                      
//INPUT3   DD  DSN=BP13.K410.ACCUMSO,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8')                                                  
//OUTPUT3  DD  DSN=BP13.F410.ACCUMSO.CY.OFFSITE(+1),                            
//             DISP=(NEW,PASS),                                                 
//             UNIT=CART,                                                       
//             LABEL=(4,SL),                                                    
//             VOL=REF=*.OUTPUT2,                                               
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=2000,RECFM=FB)                     
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//*  CATALOG GDG                                                                
//*---------------------------------------------------------------------        
//STEP2A   EXEC  PGM=IEFBR14,COND=(0,NE)                                        
//INPUT1   DD  DSN=BP13.COPYCOB.CY.OFFSITE(+1),                                 
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//INPUT2   DD  DSN=BP13.F800.APPLN.CY.OFFSITE(+1),                              
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//INPUT3   DD  DSN=BP13.F820.OCCUP.CY.OFFSITE(+1),                              
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//INPUT4   DD  DSN=BP13.F410.ACCUMSO.CY.OFFSITE(+1),                            
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//*-----------------------------------------------------------------    00000700
//*  REPRO BP13.F820.OCCUP.KEYISSUE TO TAPE BP13.F820.KEYISSUE.TAPE     00000710
//*  REPRO BP13.F800.APPLN.KEYISSUE TO TAPE BP13.F800.KEYISSUE.TAPE     00000720
//*-----------------------------------------------------------------    00000730
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00000740
//SYSPRINT DD  SYSOUT=*                                                 00000750
//INPUT1   DD  DSN=BP13.K893.APPLN.HISTORY,DISP=OLD,                    00000760
//             AMP=('BUFND=13')                                         00000320
//OUTPUT1  DD  DSN=BP13.F893.APPLN.HISTORY.YEAR(+1),DISP=(NEW,PASS),    00000780
//             UNIT=CART,LABEL=(1,SL),                                  00000800
//             DCB=(BP13.GDG,RECFM=FB,LRECL=2050,BLKSIZE=18450)         00000820
//INPUT2   DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=OLD,                    00000830
//             AMP=('BUFND=13')                                         00000320
//OUTPUT2  DD  DSN=BP13.F895.OCCUP.HISTORY.YEAR(+1),DISP=(NEW,PASS),    00000850
//             UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                00000870
//             DCB=(BP13.GDG,RECFM=FB,LRECL=450,BLKSIZE=27900)          00000900
//INPUT3   DD  DSN=BP13.K130.SOCHIST,DISP=OLD,                          00000830
//             AMP=('BUFND=13')                                         00000320
//OUTPUT3  DD  DSN=BP13.F130.SOCHIST.YEAR(+1),DISP=(NEW,PASS),          00000850
//             UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                00000870
//             DCB=(BP13.GDG,RECFM=FB,LRECL=150,BLKSIZE=27900)          00000900
//INPUT4   DD  DSN=BP13.K940.APLCTN.BO,DISP=SHR,                        00000490
//             AMP=('BUFND=13')                                         00000510
//OUTPUT4  DD  DSN=BP13.F940.APLCTN.BO.YEAR(+1),DISP=(,PASS),           00000520
//             UNIT=CART,LABEL=(4,SL),VOL=REF=*.OUTPUT1,                00000540
//             DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)          00000570
//INPUT5   DD  DSN=BP13.K943.OCPR.BO,DISP=SHR,                          00000490
//             AMP=('BUFND=13')                                         00000510
//OUTPUT5  DD  DSN=BP13.F943.OCPR.BO.YEAR(+1),DISP=(,PASS),             00000520
//             UNIT=CART,LABEL=(5,SL),VOL=REF=*.OUTPUT1,                00000540
//             DCB=(BP13.GDG,BLKSIZE=27600,LRECL=200,RECFM=FB)          00000570
//*                                                                     00000580
//SYSIN    DD  *                                                        00000910
        REPRO INFILE(INPUT1) OFILE(OUTPUT1)                                     
        REPRO INFILE(INPUT2) OFILE(OUTPUT2)                                     
        REPRO INFILE(INPUT3) OFILE(OUTPUT3)                                     
        REPRO INFILE(INPUT4) OFILE(OUTPUT4)                                     
        REPRO INFILE(INPUT5) OFILE(OUTPUT5)                                     
/*                                                                      00000920
//*-----------------------------------------------------------------    00000930
//*  CATALOG GDG - 4 GDG                                                00000940
//*-----------------------------------------------------------------    00000950
//STEP04 EXEC    PGM=IEFBR14,COND=(0,NE)                                00000960
//INPUT1   DD  DSN=BP13.F893.APPLN.HISTORY.YEAR(+1),DISP=(OLD,CATLG),   00000970
//             UNIT=(,,DEFER)                                           00000990
//INPUT2   DD  DSN=BP13.F895.OCCUP.HISTORY.YEAR(+1),DISP=(OLD,CATLG),   00001000
//             UNIT=(,,DEFER)                                           00001020
//INPUT3   DD  DSN=BP13.F130.SOCHIST.YEAR(+1),DISP=(OLD,CATLG),         00001000
//             UNIT=(,,DEFER)                                           00001020
//INPUT4   DD  DSN=BP13.F940.APLCTN.BO.YEAR(+1),DISP=(OLD,CATLG),       00000670
//             UNIT=(,,DEFER)                                           00000690
//INPUT5   DD  DSN=BP13.F943.OCPR.BO.YEAR(+1),DISP=(OLD,CATLG),         00000670
//             UNIT=(,,DEFER)                                           00000690
//*-----------------------------------------------------------------    00001030
//* SORT BP13.K893.APPLN.HISTORY CANCELLED CASES                        00001040
//*-----------------------------------------------------------------    00001050
//STEP05 EXEC    SORT,COND=(0,NE)                                       00001060
//SORTIN   DD  DSN=BP13.K893.APPLN.HISTORY,DISP=OLD,                    00001070
//             AMP=('BUFND=13')                                         00000320
//SORTOUT  DD  DSN=&&BP13F893,DISP=(NEW,PASS),                          00001090
//             UNIT=(SYSDA,20),SPACE=(CYL,(1000,50),RLSE),              00001130
//             DCB=(RECFM=FB,LRECL=2050,BLKSIZE=0)                      00001120
//SYSOUT   DD  SYSOUT=*                                                 00001140
//SYSIN    DD  *                                                        00001150
    SORT FIELDS=(2027,8,A),FORMAT=CH                                            
    INCLUDE COND=(1,1,CH,EQ,C'C')                                               
    SUM FIELDS=NONE                                                             
/*                                                                      00001160
//*-------------------------------------------------------------------  00001310
//* TO DELETE K893/K895/K130 BASED ON BP13K893 BASED ON  DATE-CANCELL   00001320
//* FOR MORE THAN 5 YRS                                                 00001330
//*-----------------------------------------------------------------    00001370
//STEP06 EXEC    PGM=BP13C444,COND=(0,NE)                               00001380
//BP13F893 DD  DSN=&&BP13F893,DISP=(OLD,DELETE)                         00001450
//BP13K893 DD  DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                    00001390
//             AMP=('BUFND=13')                                         00000320
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                    00001410
//             AMP=('BUFND=13')                                         00000320
//BP13K130 DD  DSN=BP13.K130.SOCHIST,DISP=SHR,                          00001430
//             AMP=('BUFND=13')                                         00000320
//SYSPRINT DD  SYSOUT=*                                                 00001510
//SYSOUT   DD  SYSOUT=*                                                 00001520
//SYSDBG   DD  SYSOUT=*                                                 00001530
//SYSDBOUT DD  SYSOUT=*                                                 00001540
/*                                                                      00001550
//*-----------------------------------------------------------------    00001030
//*  SORT BP13.K410.ACCUMSO TO &&BP13F410                               00001040
//*-----------------------------------------------------------------    00001050
//STEP07  EXEC    SORT,COND=(0,NE)                                      00001060
//SORTIN   DD  DSN=BP13.K410.ACCUMSO,DISP=SHR,                          00001070
//             AMP=('BUFND=13')                                         00000320
//SORTOUT  DD  DSN=&&BP13F410,DISP=(NEW,PASS),UNIT=SYSDA,               00001090
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                     00001130
//             SPACE=(CYL,(600,50),RLSE)                                00001120
//SYSOUT   DD  SYSOUT=*                                                 00001140
//SYSIN    DD  *                                                        00001150
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
//*-------------------------------------------------------------------  00001310
//* TO DELETE K893/K895/K130 BASED ON SALES ORDER FILE WITH KEY-ISSUED  00001320
//* DATE MORE THAN 5 YRS                                                00001330
//*-------------------------------------------------------------------  00001310
//STEP08 EXEC    PGM=BP13C450,COND=(0,NE)                               00001380
//BP13F410 DD  DSN=&&BP13F410,DISP=(OLD,DELETE)                         00001390
//BP13K410 DD  DSN=BP13.K410.ACCUMSO,DISP=SHR,                          00001390
//             AMP=('BUFND=13')                                         00000320
//BP13K893 DD  DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                    00001390
//             AMP=('BUFND=13')                                         00000320
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                    00001410
//             AMP=('BUFND=13')                                         00000320
//BP13K130 DD  DSN=BP13.K130.SOCHIST,DISP=SHR,                          00001430
//             AMP=('BUFND=13')                                         00000320
//P13F410A DD  DSN=BP13.F410.DELETE,DISP=MOD                                    
//SYSPRINT DD  SYSOUT=*                                                 00001510
//SYSOUT   DD  SYSOUT=*                                                 00001520
//SYSDBG   DD  SYSOUT=*                                                 00001530
//SYSDBOUT DD  SYSOUT=*                                                 00001540
/*                                                                      00001550
//*-----------------------------------------------------------------    00001050
//* SORT OUT BP13K893                                                   00001050
//*-----------------------------------------------------------------    00001050
//STEP10  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                              
//        AMP=('BUFND=13')                                              00000320
//SORTOUT  DD DSN=&&F893BKUP,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,20),SPACE=(CYL,(1000,50),RLSE),                       
//            DCB=(BLKSIZE=0,LRECL=2050,RECFM=FB)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(2027,24,A),FORMAT=CH                                            
   SUM FIELDS=NONE                                                              
//*--------------------------------------------------------------------         
//* DELETE/CREATE SOC HISTORY FILE BP13K893                                     
//*--------------------------------------------------------------------         
//STEP11    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=&&F893BKUP,DISP=(OLD,PASS)                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL 'BP13.K893.APPLN.HISTORY' CL PURGE                        00810000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K893.APPLN.HISTORY)         -                  00810000
              CYL(1000 100)                           -                 00830000
              DATACLAS(VSAMEXTA)                     -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K893.APPLN.HISTORY.DATA)    -                  00870000
              KEYS(24 2026)                          -                  00880000
              RECSZ(2050 2050)                       -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K893.APPLN.HISTORY.INDEX)   -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K893.APPLN.HISTORY)                              00720000
//*--------------------------------------------------------------------------   
//*  SORT OCCUP.HISTORY FILE                                                    
//*---------------------------------------------------------------------------  
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=13')                                             00000320
//SORTOUT  DD DSN=&&BP13F895,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,20),                                                  
//            DCB=(RECFM=FB,LRECL=450,BLKSIZE=0),                               
//            SPACE=(CYL,(500,100),RLSE)                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(418,33,A),FORMAT=CH                                             
   SUM FIELDS=NONE                                                              
//*--------------------------------------------------------------------         
//* DELETE/CREATE SOC OCCUP.HISTORY FILE BP13K895                               
//*--------------------------------------------------------------------         
//STEP13    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=&&BP13F895,DISP=(OLD,PASS)                                    
//SYSIN     DD  *                                                               
          DEL (BP13.K895.OCCUP.HISTORY) CL PURGE                                
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K895.OCCUP.HISTORY)         -                  00810000
              CYL(600 150)                           -                  00830000
              DATACLAS(VSAMEXTA)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K895.OCCUP.HISTORY.DATA)    -                  00870000
              KEYS(33 417)                             -                00880000
              RECSZ(450 450)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K895.OCCUP.HISTORY.INDEX)   -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K895.OCCUP.HISTORY)                              00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.K895.OCCUP.HISTORY.ALTX1) -               00980000
               REL(BP13.K895.OCCUP.HISTORY)          -                  00990000
               REUSE                                 -                  01010000
               KEYS(9 425)                             -                01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.K895.OCCUP.HISTORY.ALTX1.DATA) -              01070000
               CYL(320 80)                          -                   01080000
               RECSZ(150 2150)                         -                01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.K895.OCCUP.HISTORY.ALTX1.INDEX) -             01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.K895.OCCUP.HISTORY.PATH1) -              01160000
               PENT(BP13.K895.OCCUP.HISTORY.ALTX1))                     01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.K895.OCCUP.HISTORY)          -                  01190000
               ODS(BP13.K895.OCCUP.HISTORY.ALTX1)                       01200000
