//BP13A653 JOB (BP13P),'BP13A653',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*====================================================================         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS TO BACKUP AND CLEAR HFE ACCUMULATED FILE                        
//*====================================================================         
//* CHG REQ#  DDMMCCYY   BY   DESCRIPTION                                       
//* --------  --------  ----  -----------------------------------------         
//* BP139744  21112023  AM25  NEW JOB STREAM                                    
//*====================================================================         
//*--------------------------------------------------------------------         
//* BACKUP FILES                                                                
//*--------------------------------------------------------------------         
//STEP010  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FECA.HFE.ACCUM,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.FECA.HFE.ACCUM.BKUP(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(100,50)),DATACLAS=MULTIVOL,                           
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=500,RECFM=FB)                       
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*--------------------------------------------------------------------         
//* CLEAR FILES                                                                 
//*--------------------------------------------------------------------         
//STEP020  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.FECA.HFE.ACCUM,DISP=OLD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT) OUTFILE(OUTPUT1)                                      
/*                                                                              
