//BP13ADB2  JOB (BP13P),'BP13ADB2',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//**************************************************************                
//*THIS JCL IS TO CHECK ON THE RETURNED ROM DATA FOR MCPS CASES                 
//**************************************************************                
//* CHG-NO   BY   DATE      - DESCRIPTION                                       
//*--------------------------------------                                       
//* BP132113 LSB 07/03/2001 - NEW JCL                                           
//* BP132290 CKK 13/03/2003 - ADD VERIFY STEP                                   
//* BP132546 YCH 11/06/2004 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)             
//* BP135171 RJE 10/02/2014 - TO CATER FOR DB2 UPGRADE                          
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-------------------------------------------------------------                
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                         *         
//*-------------------------------------------------------------------*         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K853.MCPS,DISP=OLD                                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------------        
//* INCLUDE ONLY CASES FOR MCPS.                                                
//*---------------------------------------------------------------------        
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K517.ROMDATA,DISP=SHR                                   
//SORTOUT  DD  DSN=&&BP13F517,DISP=(NEW,PASS),                                  
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                                 
//         SPACE=(CYL,(25,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,20,A),FORMAT=CH                                                
  INCLUDE COND=(206,8,CH,EQ,C'BP13C008',AND,                                    
                1,20,CH,NE,C' ')                                                
//*---------------------------------------------------------------------        
//* ELIMINATE THE DUPLICATE NRIC FROM BP13F853                                  
//*---------------------------------------------------------------------        
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F853.MCPS.CDB,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F853,DISP=(NEW,PASS),                                  
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                                 
//         SPACE=(CYL,(25,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(9,9,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* TO GET MCPS CASES THAT MATCHED WITH ROM DATA                                
//* PRINT OUT REPORT ON RESULT OF ROM MATCHING                                  
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F853 DD DSN=&&BP13F853,DISP=(OLD,PASS)                                    
//BP13F517 DD DSN=&&BP13F517,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//P13F853A DD DSN=BP13.F853.MCPS.ROM,DISP=OLD                                   
//P13L031A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L031B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=M                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C031) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//*--------------------------------------------------------------------------   
//*  SORT MCPSIER FILE TO TEMP FILE                                             
//*---------------------------------------------------------------------------  
//STEP4A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K853.MCPS,DISP=SHR                                       
//SORTOUT  DD DSN=&&TEMP1,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=0),                               
//            SPACE=(CYL,(300,100),RLSE)                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------------  
//STEP4B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F853.MCPS.CDB,DISP=SHR                                   
//         DD DSN=BP13.F853.MCPS.ROM,DISP=SHR                                   
//         DD DSN=BP13.F853.MCPS.MTF,DISP=SHR                                   
//SORTOUT  DD DSN=&&TEMP1,DISP=(MOD,PASS)                                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------------  
//STEP4C   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&TEMP1,DISP=(OLD,DELETE)                                     
//SORTOUT  DD DSN=&&TEMP2,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=0),                               
//            SPACE=(CYL,(300,100),RLSE)                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*--------------------------------------------------------------------         
//*      TO CREATE SOC MCPSIER FILE   ( BP13.K853.MCPS )                        
//*--------------------------------------------------------------------         
//STEP05    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=&&TEMP2,DISP=(OLD,PASS)                                       
//SYSIN     DD  *                                                               
          DEL (BP13.K853.MCPS) CL PURGE                                         
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K853.MCPS)                  -                  00810000
              CYL(10 5)                              -                  00830000
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K853.MCPS.DATA)             -                  00870000
              KEYS(17 0)                             -                  00880000
              RECSZ(250 250)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K853.MCPS.INDEX)            -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K853.MCPS)                                       00720000
