//BP13A59R  JOB (BP13P),'BP13A59R',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//*SORT BP13K800                                                                
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//        UNIT=(SYSDA,6),                                                       
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(320,100),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(785,6,A),FORMAT=CH                                               
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                4,1,CH,NE,C'5',AND,                                             
               (68,1,CH,EQ,C'R',OR,68,1,CH,EQ,C'W',OR,                          
                68,1,CH,EQ,C'K'))                                               
//*---------------------------------------------------------------------        
//*OUTREC NRIC1                                                                 
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F800A,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=37,BLKSIZE=27972),                                
//        SPACE=(CYL,(150,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(88,9,A),FORMAT=CH                                                
  OUTREC FIELDS=(1:4,8,9:C';',10:88,9,19:C';',20:785,6,26:C';',                 
                 27:155,11)                                                     
//*---------------------------------------------------------------------        
//*OUTREC NRIC2                                                                 
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F800A,DISP=(MOD,PASS)                                    
//SYSIN    DD  *                                                                
  SORT FIELDS=(97,9,A),FORMAT=CH                                                
  OUTREC FIELDS=(1:4,8,9:C';',10:97,9,19:C';',20:785,6,26:C';',                 
                 27:155,11)                                                     
//*---------------------------------------------------------------------        
//*OUTREC NRIC3                                                                 
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F800A,DISP=(MOD,PASS)                                    
//SYSIN    DD  *                                                                
  SORT FIELDS=(106,9,A),FORMAT=CH                                               
  OUTREC FIELDS=(1:4,8,9:C';',10:106,9,19:C';',20:785,6,26:C';',                
                 27:155,11)                                                     
//*---------------------------------------------------------------------        
//*OUTREC NRIC4                                                                 
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F800A,DISP=(MOD,PASS)                                    
//SYSIN    DD  *                                                                
  SORT FIELDS=(115,9,A),FORMAT=CH                                               
  OUTREC FIELDS=(1:4,8,9:C';',10:115,9,19:C';',20:785,6,26:C';',                
                 27:155,11)                                                     
//*---------------------------------------------------------------------        
//*SORT BY NRIC                                                                 
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F800A,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F800B,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=37,BLKSIZE=27972),                                
//        SPACE=(CYL,(150,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(10,9,A,20,6,A,1,8,A),FORMAT=CH                                   
//*---------------------------------------------------------------------        
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=BP13C9CS,COND=(0,NE)                                        
//BP13FINP DD DSN=&&P13F800B,DISP=(OLD,PASS)                                    
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13F800 DD DSN=&&F800C9CS,DISP=(NEW,PASS),                                   
//        DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                                  
//        SPACE=(CYL,(50,10),RLSE)                                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=BP13C9CU,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800C9CS,DISP=(OLD,PASS)                                    
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K764 DD DSN=BP13.K764.SALES,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13F23A DD DSN=&&F23AC9CU,DISP=(NEW,PASS),                                   
//        DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800),                               
//        SPACE=(CYL,(50,10),RLSE)                                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//STEP09 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&F23AC9CU,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F23A.EMAIL.SL,DISP=OLD                                   
//SYSIN    DD  *                                                                
  SORT FIELDS=(74,50,A),FORMAT=CH                                               
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
