//BP13D415 JOB (BP13P),'BP13D415',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//         NOTIFY=CSD0071                                               00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//*--------------------------------------------------------------------*00040000
//* MODIFICATIONS:                                                      00050000
//* PHASE/      EFFECTIVE                                               00060000
//* CHGE REQ #  DATE       AUTHOR  DESCRIPTION                          00070000
//* ----------  ---------  ------  -----------                          00080000
//* BP136262    05/09/2016   KVL1  NEW JOB TO CREATE SENTIRAS FILE      00090000
//*--------------------------------------------------------------------*00100000
//* DAILY JOB CONSISTS OF :                                             00110000
//* -----------------------                                             00120000
//* PREP   : CLOSE FILES                                                00130000
//* PART 1 : CREATE SENT IRAS FILE                                      00140000
//* PART 2 : BACKUP THE SENTIRAS FILE INTO GDG AND ACCUM FILE           00150000
//* PART 3 : TO PUT IRAS FILE INTO SFTP SERVER                          00160000
//*--------------------------------------------------------------------*00170000
//* PREP   : VERIFY FILES BEFORE CREATING SENTIRAS FILE                 00180000
//*--------------------------------------------------------------------*00190000
//STEP00   EXEC PGM=IDCAMS                                              00200000
//INPUT1   DD DSN=BP13.K62A.STAMPREF,DISP=OLD                           00210000
//SYSPRINT DD SYSOUT=*                                                  00220000
//SYSIN    DD *                                                         00230000
           VFY FILE(INPUT1)                                             00240000
           IF LASTCC=12 THEN                                            00250000
             DO                                                         00260000
                SET MAXCC=0                                             00270000
                VFY FILE(INPUT1)                                        00280000
             END                                                        00290000
//*--------------------------------------------------------------------*00300000
//* PART 1 : STEP01 TO STEP03                                           00310000
//*                                                                     00320000
//*  BUILDS IRAS INTERFACE FILE                                         00330000
//*-------------------------------------------------------------------* 00340000
//* EXTRACT FROM BP13.K62A.STAMPREF                                   * 00350000
//* K62A-DTE-PRC-REFUND = TODAY'S DATE                                * 00360000
//* SORT IN ASCENDING KEY                                             * 00370000
//*-------------------------------------------------------------------* 00380000
//STEP01   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(0,NE)                 00390000
//SYSOUT   DD SYSOUT=*                                                  00400000
//SYSPRINT DD SYSOUT=*                                                  00410000
//SORTIN   DD DSN=BP13.K62A.STAMPREF,DISP=SHR                           00420000
//SORTOUT  DD DSN=&&BP13F62A,DISP=(,PASS),                              00430000
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                      00440000
//            DCB=(RECFM=FB,LRECL=1200,BLKSIZE=27600)                   00450000
//SYSIN    DD *                                                         00460000
  SORT FIELDS=(30,08,A),FORMAT=CH                                       00470000
  INCLUDE COND=(225,08,ZD,EQ,DATE1P,AND,                                        
                12,05,CH,EQ,C'ALEO1')                                           
/*                                                                      00500000
//*-------------------------------------------------------------------* 00510000
//* GET THE NUMBER OF RECORDS FOR HEADER                              * 00520000
//*-------------------------------------------------------------------* 00530000
//STEP02   EXEC SORT,COND=(0,NE),PARM='DYNALLOC=(,255)'                 00540000
//SYSOUT   DD SYSOUT=*                                                  00550000
//SYSPRINT DD SYSOUT=*                                                  00560000
//SORTIN   DD DSN=&&BP13F62A,DISP=(OLD,PASS)                            00570000
//SORTOUT  DD DSN=&&HEADER,DISP=(NEW,PASS),                             00580000
//            UNIT=SYSDA,SPACE=(TRK,(1,5),RLSE),                        00590000
//            DCB=(BLKSIZE=27950,LRECL=50,RECFM=FB)                     00600000
//SYSIN    DD *                                                         00610000
  SORT  FIELDS=COPY                                                     00620000
  OUTFIL REMOVECC,NODETAIL,                                             00630000
  TRAILER1=('TOTAL: ',COUNT=(M11,LENGTH=6))                             00640000
/*                                                                      00650000
//*-------------------------------------------------------------------* 00660000
//* RETRIEVE DETAILS FOR REPORT                                       * 00670000
//*-------------------------------------------------------------------* 00680000
//STEP03   EXEC PGM=BP13C620,COND=(0,NE)                                00690000
//BP13F62A DD DSN=&&BP13F62A,DISP=(OLD,DELETE)                          00700000
//BP13F62H DD DSN=&&HEADER,DISP=(OLD,DELETE)                            00710000
//BP13K62A DD DSN=BP13.K62A.STAMPREF,DISP=SHR                           00720000
//BP13K62E DD DSN=BP13.K62E.STAMPREF.PARTY,DISP=SHR                     00730000
//BP13F620 DD DSN=BP13.F620.SENTIRAS,DISP=SHR                           00740000
//SYSTSPRT DD SYSOUT=*                                                  00750000
//SYSPRINT DD SYSOUT=*                                                  00760000
//SYSUDUMP DD SYSOUT=*                                                  00770000
//SYSOUT   DD SYSOUT=*                                                  00780000
//SYSDBOUT DD SYSOUT=*                                                  00790000
/*                                                                      00800000
//*--------------------------------------------------------------------*00810000
//*        *     E N D     O F     P A R T      1      *                00820000
//*--------------------------------------------------------------------*00830000
//*--------------------------------------------------------------------*00840000
//* PART 2 : STEP04                                                     00850000
//*                                                                     00860000
//*  BACKUP THE SENTIRAS FILE INTO GDG AND ACCUM FILE                   00870000
//*--------------------------------------------------------------------*00880000
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                  00890000
//SYSPRINT DD SYSOUT=*                                                  00900000
//INPUT1   DD DSN=BP13.F620.SENTIRAS,DISP=SHR                           00910000
//OUTPUT1  DD DSN=BP13.F620.SENTIRAS.ACCUM,DISP=MOD                     00920000
//OUTPUT2  DD DSN=BP13.F620.SENTIRAS.BKUP(+1),DISP=(NEW,CATLG,DELETE),  00930000
//            SPACE=(CYL,(50,10),RLSE),                                 00940000
//            DCB=(BP13.GDG,BLKSIZE=27805,LRECL=415,RECFM=FB)           00950000
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                               00960000
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT2)                               00970000
//*--------------------------------------------------------------------*00980000
//*        *     E N D     O F     P A R T      2      *                00990000
//*--------------------------------------------------------------------*01000000
//*--------------------------------------------------------------------*01010000
//* PART 03:    FTP IRAS FILE TO ISD SERVER                             01020000
//*****************************************************************     01030000
//*  DELETE SEQ DATASET FOR FTP PUT FILE BP13.SEQ.FTPPUT1.IRAS          01040000
//*****************************************************************     01050000
//FTPDEL   EXEC  PGM=IEFBR14,COND=(0,NE)                                01060000
//TEMPACK  DD  DSN=BP13.SEQ.FTPPUT1.IRAS,                               01070000
//             DISP=(MOD,DELETE),                                       01080000
//             SPACE=(TRK,0)                                            01090000
//SYSIN    DD  *                                                        01100000
/*                                                                      01110000
//******************************************************************    01120000
//* CREATE SEQ DATASET FOR FTP PUT FILE USING SAS STATEMENTS            01130000
//******************************************************************    01140000
//FTPCRT   EXEC SAS,COND=(0,NE)                                         01150000
//BP13FTP  DD DSN=BP13.SEQ.FTPPUT1.IRAS,                                01160000
//            DISP=(,CATLG,DELETE),                                     01170000
//            AVGREC=K,SPACE=(1,(5,50),RLSE),                           01180000
//            LRECL=70,BLKSIZE=0,RECFM=FB,DSORG=PS                      01190000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               01200000
//SYSOUT   DD SYSOUT=*                                                  01210000
//SYSPRINT DD SYSOUT=*                                                  01220000
//SYSIN    DD *                                                         01230000
  %GLOBAL DDMM;                                                         01240000
                                                                        01250000
  DATA SY02F001;                                                        01260000
     INFILE SY02F001;                                                   01270000
     INPUT @01  CURRYY    $CHAR04.                                      01280000
           @05  CURRMM    $CHAR02.                                      01290000
           @07  CURRDD    $CHAR02.;                                     01300000
                                                                        01310000
  CURRDTE =  CURRYY||CURRMM||CURRDD;                                    01320000
  CALL SYMPUT('CCYYMMDD',CURRDTE);                                      01330000
                                                                        01340000
  DATA _NULL_;                                                          01350000
  FILE BP13FTP;                                                         01360000
                                                                        01370000
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/IRAS/MF';                 01380000
     PUT    'ASCII';                                                    01390000
     STDPUT   = ".TXT";                                                 01400000
     STDPUT01 = "&CCYYMMDD";                                            01410000
     STDPUT02 = "PUT 'BP13.F620.SENTIRAS' ";                            01420000
     STDPUT03 = "ISDSHDBSDRefund_"||STDPUT01||STDPUT;                   01430000
     STDPUT04 = STDPUT02||STDPUT03;                                     01440000
     STDPUT05 = "QUIT";                                                 01450000
     PUT STDPUT04;                                                      01460000
     PUT STDPUT05;                                                      01470000
//*                                                                     01480000
//******************************************************************    01490000
//* RUN FTP STATEMENT TO PUT IRAS STAMP FEE FILE IN MAINFRAME           01500000
//* INTO IDEAL SERVER                                                   01510000
//******************************************************************    01520000
//FTPPUT   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                 01530000
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          01540000
//INPUT    DD DSN=BP13.SEQ.FTPPUT1.IRAS,DISP=SHR                        01550000
//*                                                                     01560000
//*-------------------------------------------------------------------* 01561001
//* TRANSMISSION OF APPLICATION FOR REFUND REPORT                     * 01562002
//*-------------------------------------------------------------------* 01563001
//STEP05   EXEC PGM=BP13C658,COND=(0,NE)                                01564001
//BP13K62A DD  DSN=BP13.K62A.STAMPREF,DISP=SHR                          01565001
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                             01566001
//BM06F120 DD  DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                      01567001
//BP13L658 DD  DSN=BP13.L658.BP13L658,DISP=SHR                          01568004
//MAILL658 DD  DSN=BP13.MAILRPT.BP13L658,DISP=SHR                       01569004
//SYSPRINT DD SYSOUT=*                                                  01569101
//SYSOUT   DD SYSOUT=*                                                  01569201
/*                                                                      01569301
//*-------------------------------------------------------------------- 01569403
//* BP13C658 - SEND MAIL - REFUND CASES                                 01569503
//*-------------------------------------------------------------------- 01569603
//STEP06   EXEC SENDMAIL,COND=(4,LT)                                    01569703
//INPUT    DD DSN=BP13.MAILRPT.BP13L658,DISP=SHR                        01569804
//*----------------------------------------------------------------*    01570000
//*       *     E N D     O F     BP13D415            *                 01580000
//*----------------------------------------------------------------*    01590000
