//BP13D204 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*---------------------------------------------------------------------        
//* CHG REF  BY   ON          DESCRIPTION                                       
//* -------- --  ----------   -----------                                       
//* BP130883 CLT 27/10/2000   REMOVE CALLING OF BP13C904                        
//* BP132546 YCH 11/06/2004 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)             
//* BP132631 LMS 29/03/2005 - REMOVE BP13K285                                   
//* BP135171 RJE 11/02/2014 - TO CATER FOR DB2 UPGRADE                          
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K280.FLATVAC,                                           
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BP13.K280.FLATVAC.ALTX1,                                     
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
/*                                                                              
//*--------------------------------------------------------------------         
//*  TO CREATE SOC FLAT VACANCY FILE (BP13.K280.FLATVAC)                        
//*--------------------------------------------------------------------         
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.BLANK.CHAR150,                                          
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL (BP13.K280.FLATVAC) CL PURGE                                      
          DEF CLUSTER                                -                          
              (NAME(BP13.K280.FLATVAC)               -                          
              CYL(10 5)                              -                          
              UNIQUE                                 -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K280.FLATVAC.DATA)          -                          
              KEYS(11 27)                            -                          
              RECSZ(150 150)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K280.FLATVAC.INDEX)         -                          
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K280.FLATVAC)                                            
      IF MAXCC = 0 THEN                                -                        
        DEF AIX (NAME(BP13.K280.FLATVAC.ALTX1)         -                        
            REL(BP13.K280.FLATVAC)                     -                        
            CYL(5 3)                                   -                        
            UNIQUE                                     -                        
            SHR(2 3))                                  -                        
            DATA                                       -                        
            (NAME(BP13.K280.FLATVAC.ALTX1.DATA)        -                        
            KEYS(38 0)                                 -                        
            CISZ(4096)                                 -                        
            RECSZ(89 89)                               -                        
            FSPC(10 10)                                -                        
            UNIQUEKEY)                                                          
      IF MAXCC = 0 THEN                                -                        
        DEF PATH(NAME(BP13.K280.FLATVAC.PATH1)         -                        
            PENT(BP13.K280.FLATVAC.ALTX1))                                      
      IF MAXCC = 0 THEN                                -                        
        BIX IDS(BP13.K280.FLATVAC)                     -                        
            ODS(BP13.K280.FLATVAC.ALTX1)                                        
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT BM06K110 WHERE ACCEPT-DATE    = ZEROES AND                             
//*                     KEY-ISSUE-DATE = ZEROES                                 
//*--------------------------------------------------------------------         
//STEP03 EXEC    SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F110,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(40,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=500),                                        
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
   INCLUDE COND=((299,8,CH,EQ,C'00000000'),AND,                                 
                 (323,8,CH,EQ,C'00000000'),AND,                                 
                 (128,2,CH,NE,C'SD'))                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*  TO REFORMAT VACANT FLATS IN BP13K280 FORMAT                                
//*--------------------------------------------------------------------         
//STEP04 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BM06F110 DD  DSN=&&BM06F110,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K280 DD  DSN=BP13.K280.FLATVAC,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                            
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C253) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//*                 END OF BP13D204                                             
//*---------------------------------------------------------------------        
