//BP13A648 JOB (BP13P),'BP13A648',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*====================================================================         
//* BATCH REPORT ON SERS PORT CASES                                             
//*====================================================================         
//* CHG REF   BY    ON        DESCRIPTION                                       
//* --------  ----  --------  ----------------------------------------          
//* BP137102  AM25  05092018  NEW JCL                                           
//* BP138038  IL5   29112019  ARISING FROM FB-2019-04458                        
//*====================================================================         
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN >>>> FOR SERS PORT CASE                    
//*-----------------------------------------------------------------            
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*--------------------------------------------------------------------         
//* DELETE SEQUENTIAL FILE/S                                                    
//*--------------------------------------------------------------------         
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DEL (BP13.REPORT.EAEBET.BP13A648.SERSPORT)                                  
    IF MAXCC < 12 THEN                                                          
       SET MAXCC = 0                                                            
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP0B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F730.MATURERQ.PORT.BKUP(+1),                             
//         DISP=(NEW,CATLG),                                                    
//         SPACE=(CYL,(15,10),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*--------------------------------------------------------------------         
//* SORT OUT BY REGN NO                                                         
//*--------------------------------------------------------------------         
//STEP001  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.F872.PORTBNFT.SOC.RSLT,DISP=SHR                          
//SORTOUT  DD DSN=&&BP17F872,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(15,10),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//* SORT OUT BY REGN NO                                                         
//*--------------------------------------------------------------------         
//STEP002  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP17.REPORT.EAEBET.BP13A638.SERS,DISP=SHR                     
//SORTOUT  DD DSN=&&BP17SERS,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=500,RECFM=FB),                                         
//            SPACE=(CYL,(15,10),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(211,8,A),FORMAT=CH                                             
//*--------------------------------------------------------------------         
//* UPDATE PORT-TAG BASED ON RESULT CODE                                        
//*--------------------------------------------------------------------         
//STEP003  EXEC PGM=BP13CF7J,COND=(0,NE)                                        
//BP17F872 DD DSN=&&BP17F872,DISP=(OLD,DELETE)                                  
//P17F872A DD DSN=&&BP17SERS,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//P17F872B DD DSN=BP13.REPORT.EAEBET.BP13A648.SERSPORT,                         
//            DISP=(NEW,CATLG),                                                 
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(15,10),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
