//BP13D503 JOB (BP13P),'BP13D503',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//**************************************************************                
//*  CHG REQ   DATE   OIC DESCRIPTION                                           
//* -------- -------- --- -----------                                           
//* BP130383 14/01/98 LMS TO HAVE PARALLEL RUN FOR NEW OSCARS                   
//*                       FILE BE02F200.                                        
//* BP130383 13/02/98 LMS TO USE NEW FILE LAYOUT BE02F200.                      
//* BP130418 22/09/98 SIA Y2K COMPLIANCE CHANGES                                
//* BP130871 09/06/00 SSS LISTING FOR EAALSS                                    
//* BP138335 17/08/20 AM2 HARDCOPY REPORTS CONVERSION                           
//**************************************************************                
//*  TO BACKUP FILE                                                             
//*--------------------------------------------------------------------         
//STEP00 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BE02.F200.MASTER.DAILY,                                      
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F299.DAILY.NEW.BACKUP,                                  
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*  TO PRINT REPORT ON MATCHED OSCARS UIN/FIN WITH CANCELLED SOC               
//*  APPLICATION (STEP01 - STEP05)                                              
//*---------------------------------------------------------------------        
//*  TO EXTRACT CANCELLED SOC MASTER RECORD                                     
//*---------------------------------------------------------------------        
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=&&BP13F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,75),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   OMIT COND=(4,1,CH,EQ,C'9',OR,1,1,CH,NE,C'C')                                 
//*---------------------------------------------------------------------        
//*  OMIT RESALE CASES AND INCLUDE ON HA1 FROM SOC OCCUP FILE                   
//*---------------------------------------------------------------------        
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=&&BP13F820,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,75),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   OMIT COND=(1,1,CH,EQ,C'9',OR,107,2,CH,NE,C'00')                              
//*--------------------------------------------------------------------         
//*   TO RETRIEVE CORRESPONDING F820 BASED ON F800-NUM-REGN                     
//*--------------------------------------------------------------------         
//STEP03 EXEC    PGM=BP13C268,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&BP13F800,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F820 DD  DSN=&&BP13F820,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F82A DD  DSN=&&BP13F82A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,75),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//*   TO CREATE SOC OCCUPIER FILE FOR CANCELLED APPLICATION                     
//*--------------------------------------------------------------------         
//STEP04 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT    DD  DSN=&&BP13F82A,                                                  
//             DISP=(SHR,DELETE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
         DEF CL (NAME(BP13.K820.CANCEL)                -                        
                 CYL(20 10)                            -                        
                 UNIQUE                                -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K820.CANCEL.DATA)          -                        
                 KEYS(17 0)                            -                        
                 RECSZ(400 400)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K820.CANCEL)                                          
           DEF AIX (NAME(BP13.K820.CANCEL.ALTX1)       -                        
               REL(BP13.K820.CANCEL)                   -                        
               CYL(10 5)                               -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K820.CANCEL.ALTX1.DATA)      -                        
               KEYS(9  8)                              -                        
               CISZ(4096)                              -                        
               RECSZ(400 400)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K820.CANCEL.PATH1)       -                        
               PENT(BP13.K820.CANCEL.ALTX1))                                    
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K820.CANCEL)                   -                        
               ODS(BP13.K820.CANCEL.ALTX1)                                      
//*--------------------------------------------------------------------         
//*  TO PRINT REPORT ON CANCELLED APPLICATION                                   
//*---------------------------------------------------------------------        
//STEP05 EXEC    PGM=BP13C917,COND=(0,NE)                                       
//BE02F200 DD  DSN=BE02.F200.MASTER.DAILY,                                      
//             DISP=SHR                                                         
//BP13K820 DD  DSN=BP13.K820.CANCEL,                                            
//             DISP=SHR                                                         
//BP13K821 DD  DSN=BP13.K820.CANCEL.PATH1,                                      
//             DISP=SHR                                                         
//BP13L917 DD  SYSOUT=8,DEST=IOM8                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//*  TO PRINT REPORT ON MATCHED OSCARS UIN/FIN WITH ACTIVE SOC                  
//*  APPLICATION (STEP06 - STEP10)                                              
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//*  TO EXTRACT ALL ACTIVE SOC MASTER RECORD                                    
//*---------------------------------------------------------------------        
//STEP06 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=&&BP13F80A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,75),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   OMIT COND=(4,1,CH,EQ,C'9',OR,1,1,CH,EQ,C'C')                                 
//*-----------------------------------------------------------                  
//* TO OMIT TP CASES FROM F800                                                  
//*-----------------------------------------------------------                  
//STEP07 EXEC    PGM=BP13C267,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&BP13F80A,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F80A DD  DSN=&&BP13F80B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,75),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000)                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//******************************************************************            
//*  TO CREATE SOC MASTER FILE (BP13.K800.TEMP)                                 
//******************************************************************            
//STEP08 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=&&BP13F80B,                                                  
//             DISP=(SHR,PASS)                                                  
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEF CLUSTER                                -                          
              (NAME(BP13.K800.TEMP)                  -                          
              CYL(500 250)                           -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K800.TEMP.DATA)             -                          
              KEYS(8 3)                              -                          
              RECSZ(2000 2000)                         -                        
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K800.TEMP.INDEX)            -                          
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K800.TEMP)                                               
//*--------------------------------------------------------------------         
//*   TO RETRIEVE CORRESPONDING F820 BASED ON F800-NUM-REGN                     
//*--------------------------------------------------------------------         
//STEP09 EXEC    PGM=BP13C268,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&BP13F80B,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F820 DD  DSN=&&BP13F820,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F82A DD  DSN=&&BP13F82B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(100,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//*   TO CREATE TEMP BP13K820 WITH HA1 RECORDS ONLY                             
//*--------------------------------------------------------------------         
//STEP10 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT    DD  DSN=&&BP13F82B,                                                  
//             DISP=(SHR,DELETE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
         DEF CL (NAME(BP13.K820.TEMP)                  -                        
                 CYL(50 25)                            -                        
                 UNIQUE                                -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K820.TEMP.DATA)            -                        
                 KEYS(17 0)                            -                        
                 RECSZ(400 400)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K820.TEMP)                                            
           DEF AIX (NAME(BP13.K820.TEMP.ALTX1)         -                        
               REL(BP13.K820.TEMP)                     -                        
               CYL(20 10)                              -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K820.TEMP.ALTX1.DATA)        -                        
               KEYS(9  8)                              -                        
               CISZ(4096)                              -                        
               RECSZ(400 400)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K820.TEMP.PATH1)         -                        
               PENT(BP13.K820.TEMP.ALTX1))                                      
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K820.TEMP)                     -                        
               ODS(BP13.K820.TEMP.ALTX1)                                        
//*---------------------------------------------------------------------        
//*  INCLUDE ONLY HA1 FROM SOC OCCUP FILE                                       
//*---------------------------------------------------------------------        
//STEP11 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K825.REQOCCP,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=&&BP13F825,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(100,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=200)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   OMIT COND=(107,2,CH,NE,C'00')                                                
//*---------------------------------------------------------------------        
//*  INCLUDE ONLY HA1 FROM SOC OCCUP FILE                                       
//*---------------------------------------------------------------------        
//STEP11A EXEC    SORT,COND=(0,NE)                                              
//SORTIN   DD  DSN=BP13.BLANK.CHAR200,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F825,                                                  
//             DISP=(MOD,PASS)                                                  
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//*  INCLUDE ONLY HA1 FROM SOC OCCUP FILE                                       
//*---------------------------------------------------------------------        
//STEP11B EXEC    SORT,COND=(0,NE)                                              
//SORTIN   DD  DSN=&&BP13F825,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F825A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(100,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=200)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*   CREATE SOC TEMP REQOCCP FILE                                              
//*--------------------------------------------------------------------         
//STEP12 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT    DD  DSN=&&P13F825A,                                                  
//             DISP=(SHR,DELETE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
         DEF CL (NAME(BP13.K825.TEMP)                 -                         
                 CYL(50 25)                           -                         
                 UNIQUE                               -                         
                 SHR(2 3))                            -                         
                 DATA                                 -                         
                 (NAME(BP13.K825.TEMP.DATA)           -                         
                 KEYS(17 0)                           -                         
                 RECSZ(200 200)                       -                         
                 FSPC(10 10)                          -                         
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                           -                         
           REPRO IFILE(INPUT)                         -                         
                 ODS(BP13.K825.TEMP)                                            
           DEF AIX (NAME(BP13.K825.TEMP.ALTX1)        -                         
               REL(BP13.K825.TEMP)                    -                         
               CYL(20 10)                              -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K825.TEMP.ALTX1.DATA)        -                        
               KEYS(9  8)                              -                        
               CISZ(4096)                              -                        
               RECSZ(200 200)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K825.TEMP.PATH1)         -                        
               PENT(BP13.K825.TEMP.ALTX1))                                      
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K825.TEMP)                     -                        
               ODS(BP13.K825.TEMP.ALTX1)                                        
//*---------------------------------------------------------------------        
//*  TO SORT OUT RECORDS WITH WRONG STREET CODE                                 
//*---------------------------------------------------------------------        
//STEP13 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BE02.F200.MASTER.DAILY,                                      
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BE02F200,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(11,9,A),FORMAT=CH                                               
   INCLUDE COND=(45,1,CH,EQ,C'Y')                                               
/*                                                                              
//*--------------------------------------------------------------------         
//* TO PRINT REPORT ON WRONG STREET CODE FOUND IN SOC                           
//*--------------------------------------------------------------------         
//STEP14 EXEC    PGM=BP13C284,COND=(0,NE)                                       
//BE02F200 DD  DSN=&&BE02F200,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K820 DD  DSN=BP13.K820.TEMP,                                              
//             DISP=SHR                                                         
//BP13K821 DD  DSN=BP13.K820.TEMP.PATH1,                                        
//             DISP=SHR                                                         
//BP13TMP  DD  DSN=BP13.K825.TEMP,                                              
//             DISP=SHR                                                         
//BP13TMP1 DD  DSN=BP13.K825.TEMP.PATH1,                                        
//             DISP=SHR                                                         
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR                                                         
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.TEMP,                                              
//             DISP=SHR                                                         
//BP13K838 DD  DSN=BP13.K838.OSCARS.LOG,                                        
//             DISP=SHR                                                         
//BP13K730 DD  DSN=BP13.K730.MATURERQ,                                          
//             DISP=SHR                                                         
//BP13K500 DD  DSN=BP13.K500.PREREGN,                                           
//             DISP=SHR                                                         
//BP13L284 DD  SYSOUT=8,DEST=IOM8                                               
//P13L284A DD  SYSOUT=8,DEST=IOM8                                               
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO SORT OUT RECORDS WITH NEW NONNCA ADDR                                   
//*---------------------------------------------------------------------        
//STEP15 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BE02.F200.MASTER.DAILY,                                      
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BE2F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(11,9,A),FORMAT=CH                                               
   INCLUDE COND=(91,6,CH,EQ,C'      ')                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*  TO PRINT REPORT ON NON-NCA ADDRESS FOR CASES FOUND IN SOC                  
//*--------------------------------------------------------------------         
//STEP16 EXEC    PGM=BP13C274,COND=(0,NE)                                       
//BE02F200 DD  DSN=&&BE2F200A,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K820 DD  DSN=BP13.K820.TEMP,                                              
//             DISP=SHR                                                         
//BP13K821 DD  DSN=BP13.K820.TEMP.PATH1,                                        
//             DISP=SHR                                                         
//BP13TMP  DD  DSN=BP13.K825.TEMP,                                              
//             DISP=SHR                                                         
//BP13TMP1 DD  DSN=BP13.K825.TEMP.PATH1,                                        
//             DISP=SHR                                                         
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR                                                         
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.TEMP,                                              
//             DISP=SHR                                                         
//BP13K838 DD  DSN=BP13.K838.OSCARS.LOG,                                        
//             DISP=SHR                                                         
//BP13K730 DD  DSN=BP13.K730.MATURERQ,                                          
//             DISP=SHR                                                         
//BP13K500 DD  DSN=BP13.K500.PREREGN,                                           
//             DISP=SHR                                                         
//BP13L274 DD  SYSOUT=8,DEST=IOM8                                               
//P13L274A DD  SYSOUT=8,DEST=IOM8                                               
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO SORT OUT RECORDS WITH NEW NCA ADDRESS                                   
//*---------------------------------------------------------------------        
//STEP17 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BE02.F200.MASTER.DAILY,                                      
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BE2F200B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(11,9,A),FORMAT=CH                                               
   INCLUDE COND=(45,1,CH,NE,C'Y',AND,91,6,CH,NE,C'      ')                      
/*                                                                              
//*--------------------------------------------------------------------         
//*  TO UPDATE APPLICANTS' ADDRESS FOR CASES FOUND IN OSCARS                    
//*--------------------------------------------------------------------         
//STEP18 EXEC    PGM=BP13C269,COND=(0,NE)                                       
//BE02F200 DD  DSN=&&BE2F200B,                                                  
//             DISP=(SHR,PASS)                                                  
//BE02K900 DD  DSN=BE02.K900.LOG,                                               
//             DISP=OLD                                                         
//BP13K820 DD  DSN=BP13.K820.TEMP,                                              
//             DISP=SHR                                                         
//BP13K821 DD  DSN=BP13.K820.TEMP.PATH1,                                        
//             DISP=SHR                                                         
//BP13TMP  DD  DSN=BP13.K825.TEMP,                                              
//             DISP=SHR                                                         
//BP13TMP1 DD  DSN=BP13.K825.TEMP.PATH1,                                        
//             DISP=SHR                                                         
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR                                                         
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.TEMP,                                              
//             DISP=SHR                                                         
//BP13K838 DD  DSN=BP13.K838.OSCARS.LOG,                                        
//             DISP=SHR                                                         
//BP13K730 DD  DSN=BP13.K730.MATURERQ,                                          
//             DISP=SHR                                                         
//BP13K500 DD  DSN=BP13.K500.PREREGN,                                           
//             DISP=SHR                                                         
//BP13L269 DD  SYSOUT=8,DEST=IOM8                                               
//P13L269A DD  SYSOUT=8,DEST=IOM8                                               
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//*  TO PRINT LISTING FOR OSCARS CASES FOUND IN RESERVED LIST                   
//*---------------------------------------------------------------------        
//STEP19 EXEC    PGM=BP13C914,COND=(0,NE)                                       
//BP13F825 DD  DSN=BP13.F825.ACCMOCCP,                                          
//             DISP=SHR                                                         
//BE02F200 DD  DSN=&&BE2F200B,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13L914 DD  SYSOUT=8,DEST=IOM8                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//* TO DELETE ALL TEMPORARY FILES                                               
//*---------------------------------------------------------------------        
//STEP20 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
     DEL (BP13.K800.TEMP)    CL PURGE                                           
     DEL (BP13.K820.TEMP)    CL PURGE                                           
     DEL (BP13.K825.TEMP)    CL PURGE                                           
     DEL (BP13.K820.CANCEL)  CL PURGE                                           
/*                                                                              
//*---------------------------------------------------------------------        
//*     TO CLEAR FILE                                                           
//*---------------------------------------------------------------------        
//STEP21 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             DCB=BP13.F299.DAILY.NEW.BACKUP                                   
//SYSUT2   DD  DSN=BP13.F299.DAILY.NEW.BACKUP,                                  
//             DISP=SHR                                                         
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//* END OF JOB BP13D503                                                         
//*---------------------------------------------------------------------        
