//BP13A403 JOB (BP13P),'BP13A403',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR PCD NOTIFICATION (ADHOC JOB)                                
//* PATTERNED FROM BP13A400 BUT FOCUSED ON PRINTING THE FORMS ONLY.             
//* THERE ARE NO UPDATING/REWRITING TO ANY FILES                                
//* LETTER ID = TP13XJ                                                          
//******************************************************************            
//*CHG REF  OIC   DATE    DESCRIPTION                                           
//*-------- ---- -------- -----------                                           
//*BP136604 RJB1 17012017 NEW JCL (ADHOC JOB TO TEST BP13XJ FORM)               
//*BP136611 NST1 12312017 TO CATER FOR 201N2  C23  296B                         
//*BP136704 RJB1 14032017 TO CATER FOR 402N1  C10  128A                         
//******************************************************************            
//*                   FOR CONTROL LIST                                          
//******************************************************************            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//******************************************************************            
//PRT1A    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1B CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//******************************************************************            
//*            PRINTING OF PCD NOTIFICATION                                     
//******************************************************************            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1B CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=TP13XJ,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//******************************************************************            
//*          DUPLICATE COPY OF PCD NOTIFICATION                                 
//******************************************************************            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1C CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=TP13XJ,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1C                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//******************************************************************            
//*            PRINTING OF PCD NOTIFICATION (QUARTERLY)                         
//******************************************************************            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1D CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=TP13XJ,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1D                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//******************************************************************            
//*          DUPLICATE COPY OF PCD NOTIFICATION (QUARTERLY)                     
//******************************************************************            
//PRT05    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1E CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=TP13XJ,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1E                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*==================================================================           
//*   SORT OUT DATA FROM BM06K110                                               
//*-----------------------------------------------------------------            
//STEP1A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.K110.FLATINV,                                            
//         DISP=SHR                                                             
//SORTOUT  DD DSN=&&BM06F110,                                                   
//         DISP=(NEW,PASS),                                                     
//          UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                              
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                              
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,11,A),FORMAT=CH                                              
    INCLUDE COND=(12,16,CH,EQ,C'402N1  C10  128A',AND,                          
                  180,2,CH,NE,C'##',AND,                                        
                  180,2,CH,NE,C'  ')                                            
//**********************************************************************        
//*             PRINTING OF PCD NOTIFICATION                           *        
//**********************************************************************        
//STEP03   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BM06F110 DD DSN=&&BM06F110,DISP=(OLD,PASS)                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13P491 DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                        
//P13P491B DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                        
//BP13P492 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID),DEST=IOM2                        
//P13P492B DD SYSOUT=2,OUTPUT=(*.PRT05.FORMID),DEST=IOM2                        
//BP13L491 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C494) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
