//BP13D90B JOB (BP13P),'BP13D90B',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*--------------------------------------------------------------------         
//*- CHG-NO   BY  ON  DESC                                                      
//*- --------------------------                                                 
//*- BP133292 LSB ADD 060308 - UPDATE BP13K580 FOR BOOKED DBSS FLAT             
//*-                           STEP14-15 IS COPY FROM BP13D200                  
//*- BP133534 ZDD1ADD 200509   ADD BP13C54E                                     
//*- BP134025 IL5 UPD 300910   CATER FOR EC                                     
//*- BP134215 LSB UPD 270611   ADD EC TO BP13KD15                               
//*- BP134768 IMC ADD 271212   ADD STEP TO CATER FOR REPUDIATION CASES          
//*- BP135171 RJE UPD 110214   TO CATER FOR DB2 UPGRADE                         
//*- BP135237 CCC UPD 130314   TO CHANGE TO MULTI-VOLUME FOR BKUP FILES         
//*- BP135670 ESA1UPD 230415   TO REPLACE BP13.AB03.F021.SMS WITH               
//*-                           BP13.AB03.F021.REJTP                             
//*- BP136331 IL5 UPD 280616   MOD TO NEW FILE BP13.FA40.TRANS.HLE              
//*- BP138645 MRR5UPD 010721 - REMOVE P04K020 FROM BP13C54E STEP                
//*--------------------------------------------------------------------         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KA40.TRANS,DISP=OLD                                      
//INPUT2   DD DSN=BP13.KA80.UPDLOG,DISP=OLD                                     
//INPUT3   DD DSN=BP13.KA90.BOOKLOG,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K022.WISOIC,DISP=OLD                                     
//INPUT5   DD DSN=BP13.KB25.DBSELIG,DISP=OLD                                    
//INPUT6   DD DSN=BP13.K025.CSM.DBSS,DISP=OLD                                   
//INPUT7   DD DSN=BP13.K580.ACCEPT,DISP=OLD                                     
//INPUT8   DD DSN=BP13.KD15.DBSSTP,DISP=OLD                                     
//INPUT9   DD DSN=BP13.KB20.DBSBK,DISP=OLD                                      
//INPUT10  DD DSN=BM06.K100.BLOCK,DISP=OLD                                      
//INPUT11  DD DSN=BM06.K110.FLATINV,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
          VFY FILE(INPUT10)                                                     
          VFY FILE(INPUT11)                                                     
//*---------------------------------------------------------------------        
//* BACKUP FILES                                                                
//*---------------------------------------------------------------------        
//STEP00 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.KB20.DBSBK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT1  DD  DSN=BP13.FB20.DBSBK.BACKUP(+1),                                  
//             DISP=(NEW,CATLG),                                                
//             UNIT=(DISK,10),                                                  
//             SPACE=(CYL,(50,25),RLSE),                                        
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=3300,RECFM=FB)                     
//INPUT2   DD  DSN=BP13.KA30.UNIT,                                              
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT2  DD  DSN=BP13.FA30.UNIT.BACKUP(+1),                                   
//             DISP=(NEW,CATLG),                                                
//             UNIT=(DISK,10),                                                  
//             SPACE=(TRK,(20,10),RLSE),                                        
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                      
//INPUT3   DD  DSN=BP13.KA20.BLOCK,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT3  DD  DSN=BP13.FA20.BLOCK.BACKUP(+1),                                  
//             DISP=(NEW,CATLG),                                                
//             UNIT=(DISK,10),                                                  
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                      
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
/*                                                                              
//*-----------------------------------------------------------------            
//*  EXTRACT PIDB INFO TO TRANSACTION FILE                                      
//*-----------------------------------------------------------------            
//STEP01 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13KA40 DD  DSN=BP13.KA40.TRANS,                                             
//             DISP=SHR                                                         
//BP13FA40 DD  DSN=BP13.FA40.TRANS,                                             
//             DISP=OLD                                                         
//FORMID   OUTPUT FORMS=1WD1                                                    
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CA12) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* TO REPRO RECORDS                                                            
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FA40.TRANS,                                              
//            DISP=SHR                                                          
//OUTPUT1  DD DSN=BP13.FA40.TRANS.ACCUM,                                        
//            DISP=MOD                                                          
//OUTPUT2  DD DSN=BP13.FA40.TRANS.HLE,                                          
//            DISP=MOD                                                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2) REPLACE                             
/*                                                                              
//*--------------------------------------------------------------------         
//* TO REPRO RECORDS                                                            
//*--------------------------------------------------------------------         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KA65.OTPNUM,                                             
//            DISP=SHR                                                          
//OUTPUT1  DD DSN=BP13.FA65.OTPNUM,                                             
//            DISP=SHR                                                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*-----------------------------------------------------------------            
//* SORT OUT REJECTION CASES                                                    
//*-----------------------------------------------------------------            
//STEP04A  EXEC  SORT,CYL=30,COND=(0,NE)                                        
//SORTIN   DD  DSN=BP13.FA40.TRANS,DISP=SHR                                     
//SORTOUT  DD  DSN=&&P13FA40,                                                   
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,10,A),FORMAT=CH                                                
  INCLUDE COND=(9,2,CH,EQ,C'RI',AND,                                            
                (1,1,CH,EQ,C'5',OR,                                             
                 1,1,CH,EQ,C'6'))                                               
//*-------------------------------------------------------------------*         
//* TO REJECT FLAT                                                              
//*---------------------------------------------------------------------        
//STEP04B  EXEC PGM=BP13CA08,COND=(0,NE)                                        
//BP13FA40 DD DSN=&&P13FA40,DISP=(SHR,PASS)                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD15 DD DSN=BP13.KD15.DBSSTP,DISP=SHR                                     
//BP13KD11 DD DSN=BP13.KD15.DBSSTP.PATH1,DISP=SHR                               
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//P13FA40  DD DSN=BP13.FA40.HLE,DISP=MOD                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* SORT BP13KA40 BY REGN NO, CDE-TRANS = 'RI' AND ALLOC-SCH = 'MCP'  *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.FA40.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&FA40RI,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                               
//            SPACE=(CYL,(30,20),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(9,2,CH,EQ,C'RI',AND,127,3,CH,EQ,C'MCP')                         
//*-------------------------------------------------------------------*         
//* OUTPUT RECORD TO BP13F010                                         *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13FA40 DD DSN=&&FA40RI,DISP=(OLD,DELETE)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR                                     
//BP04K010 DD DSN=BP04.K010.DEBAR,DISP=SHR                                      
//BP13K853 DD DSN=BP13.K853.MCPS,DISP=SHR                                       
//BP13K665 DD DSN=BP13.K665.DEBARREF.SOC,DISP=SHR                               
//BP04F010 DD DSN=BP13.F010.MCPS.DEBAR.DELETE,DISP=MOD                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C54E) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT TO TEMP FILE                                                           
//*-----------------------------------------------------------------            
//STEP09A   EXEC PGM=IDCAMS                                                     
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F010.MCPS.DEBAR.DELETE,DISP=SHR                          
//OUTPUT1  DD DSN=&&P04F010,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=300),                                         
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* GET CUSTOMER ID FROM BE01C808                                               
//*-----------------------------------------------------------------            
//STEP17B  EXEC PGM=IKJEFT01,COND=(0,NE),DYNAMNBR=20                            
//P04F010  DD DSN=&&P04F010,DISP=(OLD,PASS)                                     
//BE01KMSG DD DSN=BE01.KMSG.ONLINE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BE01F003 DD DSN=BP13.BE01F003.CUSTUPD.LOGB,DISP=OLD                           
//BE01F903 DD DSN=BP13.BE01F903.INVUPD,DISP=OLD                                 
//BE01F400 DD DSN=BP13.BE01F400.SENDID.NEWID,DISP=OLD                           
//P04F010A DD DSN=BP13.F010.MCPS.DEBAR.DELETE,DISP=OLD                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CZ3M) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* REPRO THE BP13 DATASET AND MOD TO BE01 DATASET                    *         
//*-------------------------------------------------------------------*         
//STEP17C   EXEC PGM=IDCAMS                                                     
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1  DD DSN=BP13.BE01F003.CUSTUPD.LOGB,DISP=SHR                            
//OUTPUT1 DD DSN=BE01.F003.CUSTUPD.LOGB.BP13,DISP=MOD                           
//INPUT2  DD DSN=BP13.BE01F903.INVUPD,DISP=SHR                                  
//OUTPUT2 DD DSN=BE01.F903.INVUPD.BP13,DISP=MOD                                 
//INPUT3  DD DSN=BP13.BE01F400.SENDID.NEWID,DISP=SHR                            
//OUTPUT3 DD DSN=BE01.F400.SENDID.NEWID.BP13,DISP=MOD                           
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
      REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                    
      REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                    
//*-------------------------------------------------------------------*         
//* SUB-TRANSFER CASES, SOC TO PASS NEW LESSEE CODE SMS                         
//* SORT BY SCH-ACC                                                             
//* DTE-EFF-TRANSFER NOT = SPACES                                               
//*-------------------------------------------------------------------*         
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&BP13FD00,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                               03880012
//            DCB=(BLKSIZE=0,LRECL=1600,RECFM=FB),                      03890012
//            SPACE=(CYL,(20,10),RLSE)                                  03890112
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(1485,2,CH,NE,C'  ',AND,                                        
                 1,8,CH,NE,C'        ')                                         
//*-------------------------------------------------------------------*         
//* SORT BY K800-NUM-DBSS-REGN-SUBTRF ( OLD REGN-NO OF SUB-TRF CASE)            
//*-------------------------------------------------------------------*         
//STEP011  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                               03880012
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                      03890012
//            SPACE=(CYL,(20,10),RLSE)                                  03890112
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1328,8,A),FORMAT=CH                                             
   INCLUDE COND=(1328,8,CH,NE,C'        ')                                      
//*-------------------------------------------------------------------*         
//* MATCH BY OLD-REGN OF SUB-TRF CASE, GET NEW-SCH-ACC-NO FROM BP13K800         
//* PASS NEW LESSEE CODE OF SCH-ACC-NO TO SMS                                   
//* FOR EFF-SUB-TRANSFER = SYSTEM-DATE                                          
//*-------------------------------------------------------------------*         
//STEP12   EXEC PGM=BP13CD54,COND=(0,NE)                                        
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD15 DD DSN=BP13.KD15.DBSSTP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD11 DD DSN=BP13.KD15.DBSSTP.PATH2,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03F021 DD DSN=BP13.AB03.F021.SMS,DISP=MOD                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* REJECT AFTER TOP CASES, SOC TO PASS NEW LESSEE CODE SMS                     
//* SORT BY REGNO                                                               
//* NME-PROGRAM = BP13B0H7                                                      
//*-------------------------------------------------------------------*         
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KA80.UPDLOG,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&FD00REPD,DISP=(,PASS)                                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,25,D),FORMAT=CH                                               
   INCLUDE COND=(26,8,CH,EQ,C'BP13B0H7')                                        
   OUTREC FIELDS=(501,1600)                                                     
//*-------------------------------------------------------------------*         
//* PASS NEW LESSEE CODE OF SCH-ACC-NO TO SMS FOR REPUDIATION CASES             
//* FOR DTE-REPUDIATE = SYSTEM-DATE                                             
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=BP13CD5A,COND=(0,NE)                                        
//BP13FD00 DD DSN=&&FD00REPD,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KA30 DD DSN=BP13.KA30.UNIT,DISP=SHR,                                      
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KA31 DD DSN=BP13.KA30.UNIT.PATH1,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03F021 DD DSN=BP13.AB03.F021.SMS,DISP=MOD                                   
//B03F021A DD DSN=BP13.AB03.F021.REJTP,DISP=MOD                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
/*                                                                              
//*-------------------------------------------------------------------*         
//* ACCUMULATE FILE FOR BACKUP                                                  
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.AB03.F021.SMS,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.AB03.F021.SMS.BKUP,DISP=MOD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//* ACCUMULATE FILE FOR BACKUP                                                  
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.AB03.F021.REJTP,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.AB03.F021.SMS.BKUP,DISP=MOD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*--------------------------------------------------------------------         
//*  ACCUMULATE THE USER AND ACCESS LOG REC TO ACCUM FILES                      
//*--------------------------------------------------------------------         
//STEP17   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.KA80.UPDLOG,                                            
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.FA80.UPDLOG.ACCUM,                                      
//             DISP=MOD                                                         
//INPUT2   DD  DSN=BP13.KA90.BOOKLOG,                                           
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.FA90.BOOKLOG.ACCUM,                                     
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
      REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                     
//*---------------------------------------------------------------------        
//* DEFINE UPDLOG VSAM FILE BP13KA80                                            
//*---------------------------------------------------------------------        
//STEP18 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.BLANK.CHAR4000,                                         
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL 'BP13.KA80.UPDLOG' CLUSTER PURGE                                  
          DEF CLUSTER                                -                          
              (NAME(BP13.KA80.UPDLOG)                -                          
              CYL(10 10)                            -                           
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.KA80.UPDLOG.DATA)           -                          
              KEYS(25 0)                             -                          
              RECSZ(4000 4000)                       -                          
              CISZ(12288)                            -                          
              FSPC(0 0))                             -                          
              INDEX                                  -                          
              (NAME(BP13.KA80.UPDLOG.INDEX))                                    
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.KA80.UPDLOG)                                               
//*---------------------------------------------------------------------        
//* DEFINE BOOKLOG VSAM FILE BP13KA90                                           
//*---------------------------------------------------------------------        
//STEP19 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.BLANK.CHAR4000,                                         
//             DISP=SHR                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          DEL 'BP13.KA90.BOOKLOG' CLUSTER PURGE                                 
          DEF CLUSTER                                -                          
              (NAME(BP13.KA90.BOOKLOG)               -                          
              CYL(50 25)                            -                           
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.KA90.BOOKLOG.DATA)          -                          
              KEYS(25 0)                             -                          
              RECSZ(4000 4000)                       -                          
              CISZ(12288)                            -                          
              FSPC(0 0))                             -                          
              INDEX                                  -                          
              (NAME(BP13.KA90.BOOKLOG.INDEX))                                   
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.KA90.BOOKLOG)                                              
//*--------------------------------------------------------------------         
//*    END OF JOB BP13D90B                                                      
//*--------------------------------------------------------------------         
