//BP13A715 JOB (BP13P),'BP13A715',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*--------------------------------------------------------------------         
//*                      FOR DBSS RESERVE LIST                                  
//*                    ########################                                 
//*                                                                             
//*                     THIS JCL SHOULD BE RUN                                  
//*  AFTER THE COMPLETION OF THE ASSIGNMENT OF REGN NO, BP13A513                
//*                              AND                                            
//*                        BEFORE BP13A512                                      
//*                                                                             
//*  FUNCTION :                                                                 
//*       1)  : THIS JCL WILL COPY ALL UNSUCCESSFUL APPLICATION OCCUP           
//*             INFORMATION FROM K825.REQOCCP TO K825.REQOCCP.RESERVE           
//*       2)    THIS JCL WILL MOVE ALL UNSUCCESSFUL APPLICATION FROM            
//*             BP13K520 TO THE RESERVE LIST MASTER FILE, BP13K705.             
//*       3)    THIS JCL WILL DELETE AND DEFINE RESERVE LIST SUPPLY             
//*             FILE, BP13K573                                                  
//*       4)    THE NEXT JCL TO RUN IS BP13A700, WHICH WILL PULL THE            
//*             REQUESTED NT/FT FOR NEXT RESERVE LIST BALLOTING.                
//*             ONLINE PANEL, BP13B797 FOR USER ENTRY ON WHICH NT/FT            
//*                                                                             
//*  ASSUMPTION : DBS CASES HAVE REF NO STARTING WITH '5'                       
//*             : DBS CASES ARE KEPT IN BP13K740                                
//*  EXECUTION  : TO RUN ONCE ONLY. AFTER THE MAIN EXERCISE AND BEFORE          
//*               THE 1ST RESERVE LIST.                                         
//*--------------------------------------------------------------------         
//*---------------------------------------------------------------------        
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP132927 CKK 151106 - NEW JCL FOR DBSS                                      
//*---------------------------------------------------------------------        
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEPAA  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K705.SOCLIST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K573.SOCFLAT,DISP=OLD                                    
//INPUT3   DD DSN=BP13.K823.RSVOCCP,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*---------------------------------------------------------------------        
//* BACKUP RESERVE LIST OCCUP FILE                                              
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K823.RSVOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F825.REQOCCP.RESERVE.BEBKUP,DISP=OLD                     
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SORT SOC OCCUPIER FILE INTO SEQUENTIAL FILE FOR BE CASES                    
//* IN KEY-FLD ORDER.                                                           
//* SORT ONLY THOSE UNSUCCESSFUL CASES                                          
//* ONLY FOR DBS CASES WHERE REF NO STARTS WITH '5'                             
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F825RES,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=23400,LRECL=200,RECFM=FB),                           
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(1,1,CH,EQ,C'5')                                                
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* MERGING FILES                                                               
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F825.REQOCCP.RESERVE.BEBKUP,DISP=OLD                     
//         DD DSN=&&F825RES,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F825NEW,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=23400,LRECL=200,RECFM=FB),                           
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* DEFINE RESERVE LIST OCCUP FILE BP13.K823.RSVOCCP                            
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&F825NEW,DISP=(OLD,DELETE)                                   
//SYSIN    DD *                                                                 
  DEL (BP13.K823.RSVOCCP) CLUSTER PURGE                                         
  DEF CLUSTER                                          -                        
        (NAME(BP13.K823.RSVOCCP)                       -                        
        SHR(2,3)                                       -                        
        KEYS(17 0)                                     -                        
        CYL(45 8)                                      -                        
        RECSZ(200 200)                                 -                        
        FREESPACE(30 30)                               -                        
        CISZ(4096)                                     -                        
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K823.RSVOCCP.DATA))                 -                        
      INDEX                                            -                        
        (NAME(BP13.K823.RSVOCCP.INDEX))                                         
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K823.RSVOCCP)                                            
      IF MAXCC = 0 THEN                                -                        
        DEF AIX (NAME(BP13.K823.RSVOCCP.ALTX1) -                                
            REL(BP13.K823.RSVOCCP)                     -                        
            CYL(25 6)                                  -                        
              UNIQUE                                   -                        
            SHR(2 3))                                  -                        
            DATA                                       -                        
            (NAME(BP13.K823.RSVOCCP.ALTX1.DATA) -                               
            KEYS(9 8)                                  -                        
            CISZ(4096)                                 -                        
            RECSZ(60 300)                              -                        
            NUNQK)                                                              
      IF MAXCC = 0 THEN                                -                        
        DEF PATH(NAME(BP13.K823.RSVOCCP.PATH1) -                                
            PENT(BP13.K823.RSVOCCP.ALTX1))                                      
      IF MAXCC = 0 THEN                                -                        
        BIX IDS(BP13.K823.RSVOCCP)                     -                        
            ODS(BP13.K823.RSVOCCP.ALTX1)                                        
//*------------------------------------------------------------------           
//* BACKUP BP13K705.                                                            
//*------------------------------------------------------------------           
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.K705.SOCLIST,DISP=SHR                                     
//SORTOUT DD DSN=BP13.F705.SOCLIST.BEBKUP,DISP=OLD                              
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,49,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* SORT OUT ALL CASES THAT ARE UNSUCCESSFUL                                    
//*------------------------------------------------------------------           
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                                    
//SORTOUT DD DSN=&&P13F705,DISP=(NEW,PASS),                                     
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=500),                                             
//        SPACE=(CYL,(50,12),RLSE)                                              
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,49,A),FORMAT=CH                                               
   INCLUDE COND=(226,3,CH,EQ,C'   ')                                            
//*---------------------------------------------------------------------        
//* MERGING FILES                                                               
//*------------------------------------------------------------------           
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F705.SOCLIST.BEBKUP,DISP=SHR                              
//        DD DSN=&&P13F705,DISP=(OLD,PASS)                                      
//SORTOUT DD DSN=&&P13FNEW,DISP=(NEW,PASS),                                     
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=500),                                             
//        SPACE=(CYL,(50,12),RLSE)                                              
//SYSIN   DD  *                                                                 
   SORT FIELDS=(1,49,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//*  DELETE AND DEFINE BP13K705 - SOCLIST FILE (RESERVE LIST MASTER)            
//*---------------------------------------------------------------------        
//STEP08    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT     DD DSN=&&P13FNEW,DISP=(OLD,PASS)                                    
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN    DD *                                                                 
         DEL 'BP13.K705.SOCLIST' CL PURGE                                       
         DEF CL (NAME(BP13.K705.SOCLIST)               -                        
                 CYL(50 20)                            -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K705.SOCLIST.DATA)         -                        
                 KEYS(49 0)                            -                        
                 RECSZ(500 500)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K705.SOCLIST)                                         
           DEF AIX (NAME(BP13.K705.SOCLIST.ALTX1)      -                        
               REL(BP13.K705.SOCLIST)                  -                        
               CYL(10 5)                               -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K705.SOCLIST.ALTX1.DATA)     -                        
               KEYS(8 122)                             -                        
               CISZ(4096)                              -                        
               RECSZ(63 954)                           -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K705.SOCLIST.PATH1)      -                        
               PENT(BP13.K705.SOCLIST.ALTX1))                                   
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K705.SOCLIST)                  -                        
               ODS(BP13.K705.SOCLIST.ALTX1)                                     
//*--------------------------------------------------------------------         
//* DELETE AND DEFINE BP13K573 - RESERVE LIST SUPPLY FILE                       
//*--------------------------------------------------------------------         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR400,DISP=SHR                                  
//SYSIN     DD *                                                                
       DEL (BP13.K573.SOCFLAT) CLUSTER PURGE                                    
       DEF CLUSTER                   -                                          
           (NAME(BP13.K573.SOCFLAT)  -                                          
           RECSZ(400 400)            -                                          
           TRK(12 6)                  -                                         
           KEYS(5 0)                 -                                          
           SHR(2 3)                  -                                          
           STORCLAS(PRODRLS)         -                                          
           LOG(NONE)                 -                                          
           UNIQUE                    -                                          
           CISZ(4096))                                                          
       REPRO                         -                                          
           INFILE(INPUT1)            -                                          
           ODS(BP13.K573.SOCFLAT)    -                                          
           REUSE                                                                
