//BP13AUNQ JOB (BP13P),'BP13AUNQ',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//        NOTIFY=CSD0071                                                        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//**************************************************************                
//* TO ASSIGN QUEUE NO TO UNSUCCESSFUL APPLICATION             *                
//* THIS JCL IS ONLY FOR BE. FOR BTO, USE BP13AUNT             *                
//*                                                            *                
//**************************************************************                
//* CHG REF   BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP132360 CKK  20030720 NEW JCL                                              
//* BP132463 SK   20031230 ADD REPORT TO BP13C521                               
//* BP132555 CKK  20040719 TO SORT IN 10TH BYTE RANDOM NO SEQUENCE              
//* BP132626 CKK  20041210 TO PRINT NEW REPORT FOR SERS CASES                   
//* BP133056 CKK  20070520 CHANGE UNSUCC CODE FROM 'U' TO 'W'                   
//* BP133142 LSB  20070925 SORT BU COHORT, RANDOM-NO 10-18TH BYTES              
//* BP134333 DW5  20111118 REMOVE BP13K520 FROM VERIFY                          
//* BP134483 SMR2 20120413 TO PRINT NEW REPORT FOR MGPS (CHILD)                 
//* BP135016 IL5  20130805 OMIT GRO APPLICATION                                 
//* BP135100 SMR2 20131031 ADD CONDITION TO GET REQUEST-STATUS = 'K'            
//*                        CHANGE SORT FROM NT/FT/COHORT/RANDOM TO              
//*                        NT/FT/REQUEST STATUS/COHORT/RANDOM                   
//* BP135170 IL5  20130106 CHANGE INPUT DATASET FOR BP13C52A                    
//*                        FROM BP13.F740.MATUREBA.MGP TO                       
//*                        BP13.F740.MATUREBA.MGP.RANDUPD                       
//* BP135708 SMR2 31032015 CHANGE CLASS=2 TO CLASS=J                            
//* BP137228 IL5  05032018 DETERMINE APPLICATIONS AFFECTED BY EIP               
//*                        (REPLACES BP13A633)                                  
//* BP137731 IL5  12032019 NEW STEP ADDED TO INCLUDE ONLY BTO APPL              
//*                        INTO EIP FILE                                        
//* BP138214 AM25 05032020 ADD STEP TO DEL/DEF BP13K010 FOR EIP                 
//* BP138301 AM25 14052020 HARDCOPY REPORTS CONVERSION                          
//* BP138600 AM25 15032021 ADD BP13CZ4G                                         
//* BP139852 AM25 18012024 ADD BP13CF7Q                                         
//* BP139908 AM25 25042024 APPLY EIP TO SBF AS WELL                             
//*=================================================================            
//*=====================================================================        
//*      VERIFY FILES BEFORE JOB RUN                                            
//*=====================================================================        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT2   DD DSN=BP13.K703.SOCDATE,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//**************************************************************                
//* SORT BY NT, FT, RANDOM NO                                                   
//* SORT OUT ONLY UNSUCCESSFUL CASES                                            
//**************************************************************                
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F740,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE),                               
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                   
//SYSIN    DD  *                                                                
   SORT FIELDS=(187,3,A,211,2,A,260,1,D,80,2,A,10,18,A),FORMAT=CH               
      INCLUDE COND=((260,1,CH,EQ,C'W',OR,                                       
                     260,1,CH,EQ,C'K'),AND,                                     
                     213,3,CH,NE,C'GRO',AND,                                    
                     420,3,CH,NE,C'CCC')                                        
//**************************************************************                
//* ASSIGN QUEUE NO TO UNSUCCESSFUL CASES                                       
//**************************************************************                
//STEP03  EXEC PGM=BP13C521,REGION=1500K                                        
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,DELETE)                                  
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L521 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT SERS ELIGIBLE CASES FOR PRINTING REPORT                            
//* SORT BY REGN NO                                                             
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740SERS,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(433,1,CH,EQ,C'P')                                              
//*--------------------------------------------------------------------         
//* PRINT REPORT ON SERS CASES FOR THE EXERCISE                                 
//*---------------------------------------------------------------------        
//STEP05   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13F740  DD DSN=&&F740SERS,DISP=(OLD,DELETE)                                 
//BP17K890  DD DSN=BP17.K890.UINACC,DISP=SHR                                    
//AB03F089  DD DSN=AB03.F089.PIDB,DISP=SHR                                      
//BP13L505  DD SYSOUT=8,DEST=IOM8                                               
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S505),DISP=SHR                            
//*                                                                             
//*-------------------------------------------------------------------*         
//* UPDATE THE QUEUE POSITIONS FOR MGPS (CHILD) APPLICATION                     
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=BP13C52A,COND=(0,NE)                                        
//BP13F740 DD DSN=BP13.F740.MATUREBA.MGP.RANDUPD,DISP=SHR                       
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K741 DD DSN=BP13.K740.MATUREBA.PATH1,DISP=SHR,                            
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L52A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* TO DELETE SEQ. DATASET CCA QUEUE UPDATE                                     
//*--------------------------------------------------------------------         
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.LZ4G.CCA.QUEUE.UPDATE')                                         
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT OUT ALL CCA JB APPLICATIONS                                            
//*--------------------------------------------------------------------         
//STEP08A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740JB,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(50,20),RLSE),DATACLAS=MULTIVOL                        
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   INCLUDE COND=(211,2,CH,EQ,C'1F',AND,177,1,CH,NE,C' ')                        
//*--------------------------------------------------------------------         
//* MATCH REGN TO GET ORIGINAL RANDOM NO                                        
//*--------------------------------------------------------------------         
//STEP08B  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&F740JB,DISP=(OLD,DELETE)                            00005003
//SORTJNF2 DD DSN=BP13.F740.MATUREBA.ACCA,DISP=SHR                      00006003
//MATCH    DD DSN=&&F740JBMM,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(50,20),RLSE),DATACLAS=MULTIVOL                        
//UNMATCH  DD DSN=&&F740JBNM,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(50,20),RLSE),DATACLAS=MULTIVOL                        
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                    00009403
   JOINKEYS FILE=F2,FIELDS=(123,8,A)                                    00009503
   JOIN UNPAIRED,F1,F2                                                  00009503
   REFORMAT FIELDS=(?,F1:123,8,1,28,F2:1,28,F1:235,5,177,8)             00009703
   OPTION COPY                                                          00009703
   OUTFILE FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B'),BUILD=(1:2,77,123X)    00009802
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),BUILD=(1:2,77,123X)  00009802
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*--------------------------------------------------------------------         
//* MATCH JB REGN TO GET JB ORIGINAL RANDOM NO                                  
//*--------------------------------------------------------------------         
//STEP08C  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&F740JBMM,DISP=(OLD,DELETE)                          00005003
//         DD DSN=&&F740JBNM,DISP=(OLD,DELETE)                          00005003
//SORTJNF2 DD DSN=BP13.F740.MATUREBA.ACCA,DISP=SHR                      00006003
//MATCH    DD DSN=&&F740JBMM,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(50,20),RLSE),DATACLAS=MULTIVOL                        
//UNMATCH  DD DSN=&&F740JBNM,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(50,20),RLSE),DATACLAS=MULTIVOL                        
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(70,8,A)                                     00009403
   JOINKEYS FILE=F2,FIELDS=(123,8,A)                                    00009503
   JOIN UNPAIRED,F1,F2                                                  00009503
   REFORMAT FIELDS=(?,F1:1,77,F2:1,28)                                  00009703
   OPTION COPY                                                          00009703
   OUTFILE FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B'),BUILD=(1:2,105,95X)    00009802
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),BUILD=(1:2,105,95X)  00009802
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*--------------------------------------------------------------------         
//* MATCH JB REGN TO GET JB QUEUE                                               
//*--------------------------------------------------------------------         
//STEP08D  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&F740JBMM,DISP=(OLD,DELETE)                          00005003
//         DD DSN=&&F740JBNM,DISP=(OLD,DELETE)                          00005003
//SORTJNF2 DD DSN=BP13.K740.MATUREBA,DISP=SHR                           00006003
//MATCH    DD DSN=&&F740JBMM,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(50,20),RLSE),DATACLAS=MULTIVOL                        
//UNMATCH  DD DSN=&&F740JBNM,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(50,20),RLSE),DATACLAS=MULTIVOL                        
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(70,8,A)                                     00009403
   JOINKEYS FILE=F2,FIELDS=(123,8,A)                                    00009503
   JOIN UNPAIRED,F1,F2                                                  00009503
   REFORMAT FIELDS=(?,F1:1,105,F2:235,5)                                00009703
   OPTION COPY                                                          00009703
   OUTFILE FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B'),BUILD=(1:2,110,90X)    00009802
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),BUILD=(1:2,110,90X)  00009802
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*--------------------------------------------------------------------         
//* SORT FORMATTED FILE BY RANDOM NO FOR BALLOT                                 
//*--------------------------------------------------------------------         
//STEP08E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740JBMM,DISP=(OLD,DELETE)                          00005003
//         DD DSN=&&F740JBNM,DISP=(OLD,DELETE)                          00005003
//SORTOUT  DD DSN=BP13.LZ4G.CCA.QUEUE.UPDATE,DISP=(NEW,CATLG),                  
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(50,20),RLSE),DATACLAS=MULTIVOL                        
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,28,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//* UPDATE OF QUEUE FOR PAIRED APPLICATIONS                                     
//*--------------------------------------------------------------------         
//STEP08F  EXEC PGM=BP13CZ4G,COND=(0,NE)                                        
//BP13INP1 DD DSN=BP13.LZ4G.CCA.QUEUE.UPDATE,DISP=SHR                           
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//BP13LZ4G DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* TO DELETE SEQ. DATASET                                                      
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.REPORT.MGPS.BP13AUNQ')                                          
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* GENERATE REPORT ON MGPS FOR RST VERIFICATION                                
//*-------------------------------------------------------------------*         
//STEP010  EXEC SAS,COND=(0,NE)                                                 
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                   
//BP13F740 DD DSN=BP13.F740.MATUREBA.MGP,DISP=SHR                               
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13F036A DD DSN=BP13.REPORT.MGPS.BP13AUNQ,DISP=(NEW,CATLG),                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(1,1),RLSE)                                            
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S036),DISP=SHR                             
//*--------------------------------------------------------------------         
//* DELETE DATASETS                                                             
//*--------------------------------------------------------------------         
//STEP11 EXEC  PGM=IDCAMS                                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
    DEL   ('BP13.F740.ETHNIC.A633')                                             
    DEL   ('BP13.F740.ETHNIC.A633.EMAIL')                                       
    DEL   ('BP13.F740.ETHNIC.A633.NOEMAIL')                                     
    DEL   ('BP13.L567.REPORT.A633')                                             
    DEL   ('BP13.F740.FIVERM.NOGEN3')                                           
         IF MAXCC < 12 THEN                                                     
            SET MAXCC = 0                                                       
//*---------------------------------------------------------------------        
//* SORT BY RANDOM NUMBER                                                       
//* OMIT GRO AND MGP PA RECORDS                                                 
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
    OMIT COND=(28,1,CH,EQ,C'M',OR,28,1,CH,EQ,C'G')                              
//*---------------------------------------------------------------------        
//* UPDATE ALLOC-SCH USING PRIOSCH, CAT = 4 TO 3, BAL-HH = T/F TO H AND         
//* BAL-HH = N TO G                                                             
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13C798,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//BP13F520 DD DSN=&&BP13F520,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(50,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY NT, FT, CATG, QUEUE                                                 
//*---------------------------------------------------------------------        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=&&BP13F520,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&BP13F740,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(50,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(187,3,A,211,2,A,225,1,A,235,5,A),FORMAT=CH                     
//*---------------------------------------------------------------------        
//* DELETE BP13K010 FOR EIP                                                     
//*---------------------------------------------------------------------        
//STEP15A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DEL 'BP13.K010.EIP' CLUSTER PURGE                                             
  IF MAXCC < 12 THEN                                                            
     SET MAXCC = 0                                                              
//*---------------------------------------------------------------------        
//* DEFINE BP13K010 FOR EIP                                                     
//*---------------------------------------------------------------------        
//STEP15B  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.F010.TENDER.PA,DISP=SHR                                  
//SYSIN    DD *                                                                 
  DEF CLUSTER                                          -                        
        (NAME(BP13.K010.EIP)                           -                        
        SHAREOPTIONS(2,3)                              -                        
        KEYS(5 0)                                      -                        
        CYL(1 1)                                       -                        
        RECSZ(600 600)                                 -                        
        FREESPACE(10 10)                               -                        
        CISZ(4096)                                     -                        
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K010.EIP.DATA))                     -                        
      INDEX                                            -                        
        (NAME(BP13.K010.EIP.INDEX))                                             
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K010.EIP)                                             
//*---------------------------------------------------------------------        
//* EXTRACT APPLICATIONS AFFECTED BY EIP                                        
//*---------------------------------------------------------------------        
//STEP16   EXEC PGM=BP13CB67,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,DELETE)                                  
//BP13K010 DD DSN=BP13.K010.EIP,DISP=SHR                                        
//P13F740A DD DSN=&&P13F740A,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* F1 : ORIGINAL RECORDS                                                       
//* F2 : CAT/ALLOC-SCH/BAL-HH WAS UPDATED BY BP13C798                           
//* MATCH BY RANDOM NUMBER, GET THE ORIGINAL RECORDS (F1)                       
//*--------------------------------------------------------------------         
//STEP17   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTJNF2 DD DSN=&&P13F740A,DISP=(OLD,DELETE)                                  
//MATCH    DD DSN=BP13.F740.ETHNIC.A633,DISP=(NEW,CATLG),                       
//            DCB=(LRECL=500,RECFM=FB,BLKSIZE=27500),                           
//            SPACE=(CYL,(5,2),RLSE)                                            
//SYSIN    DD *                                                                 
   JOINKEYS FILE=F1,FIELDS=(1,28,A)                                             
   JOINKEYS FILE=F2,FIELDS=(1,28,A)                                             
   REFORMAT FIELDS=(F1:1,500)                                                   
   OUTFILE FNAMES=MATCH                                                         
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* TO SEPERATE CASES WITH & WITHOUT EMAIL ADDRESS                  *           
//*-----------------------------------------------------------------*           
//STEP17B  EXEC PGM=BP13CF10,COND=(0,NE)                                        
//BP13F740 DD DSN=BP13.F740.ETHNIC.A633,DISP=SHR                                
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K825 DD DSN=BP13.K825.REQOCCP.PREV,DISP=SHR                               
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                 
//P13F740A DD DSN=BP13.F740.ETHNIC.A633.NOEMAIL,DISP=(NEW,CATLG),               
//            DCB=(LRECL=500,RECFM=FB,BLKSIZE=27500),                           
//            SPACE=(CYL,(5,2),RLSE)                                            
//P13F740B DD DSN=BP13.F740.ETHNIC.A633.EMAIL,DISP=(NEW,CATLG),                 
//            DCB=(LRECL=500,RECFM=FB,BLKSIZE=27500),                           
//            SPACE=(CYL,(5,2),RLSE)                                            
//P13LCF10 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY NEW TOWN, FLAT TYPE, ETHNIC GROUP, QUEUE POS, REG NO                
//*---------------------------------------------------------------------        
//STEP18A  EXEC SORT,COND=(0,NE)                                                
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.F740.ETHNIC.A633,DISP=SHR                                
//SORTOUT  DD DSN=&&BP13F74B,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(5,2),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(187,3,A,211,2,A,225,1,A,235,5,A,123,8,A),FORMAT=CH             
//*---------------------------------------------------------------------        
//* PRINT EIP RESULT REPORT                                                     
//*---------------------------------------------------------------------        
//STEP18B  EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(10,5))                                     
//BP13F74B DD DSN=&&BP13F74B,DISP=(SHR,PASS)                                    
//BP13S567 DD DSN=BP13.L567.REPORT.A633,DISP=(NEW,CATLG),                       
//            DCB=(LRECL=133,RECFM=FBA,BLKSIZE=27930),                          
//            SPACE=(CYL,(5,2),RLSE)                                            
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S567),DISP=SHR                             
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BY NEW TOWN, FLAT TYPE, DATE BALLOT, QUEUENO                           
//*---------------------------------------------------------------------        
//STEP19A  EXEC SORT,COND=(0,NE)                                                
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740CF7Q,DISP=(NEW,PASS),                                   
//            DCB=(LRECL=500,RECFM=FB,BLKSIZE=0),                               
//            SPACE=(CYL,(10,5),RLSE),DATACLAS=MULTIVOL                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(187,3,A,211,2,A,334,6,A,235,5,A),FORMAT=CH                     
    INCLUDE COND=(211,1,CH,EQ,C'5',AND,260,1,CH,EQ,C'S',AND,                    
                  246,1,CH,NE,C'Y')                                             
//*---------------------------------------------------------------------        
//* EXTRACT 5-ROOM SUCCESSFUL FLATS W/O GEN3 AFTER TAGGING                      
//*---------------------------------------------------------------------        
//STEP19B  EXEC PGM=BP13CF7Q,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CF7Q,DISP=(OLD,DELETE)                                  
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13F740A DD DSN=BP13.F740.FIVERM.NOGEN3,DISP=(NEW,CATLG),                     
//            DCB=(LRECL=500,RECFM=FB,BLKSIZE=0),                               
//            SPACE=(CYL,(10,5),RLSE),DATACLAS=MULTIVOL                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
