//BP13A643 JOB (BP13P),'BP13A643',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//**************************************************************                
//*-------------------------------------------------------------                
//* CHGE REQ  BY    DATE    DESCRIPTION                                         
//* -------- ---- -------- -------------------------------------                
//* BP134955 NST1 20130722  COPY BP13K740 TO BP13K442FOR USE IN                 
//*                         ONLINE PANEL                                        
//* BP135189 NST1 20130107  GENERATE THE RANDOM NUMBER REPORT                   
//*                         IN SOFTCOPY (STEP08)                                
//**************************************************************                
//*-----------------------------------------------------------------            
//*     VERIFY BP13.K442.CCBALLOT                                               
//*-----------------------------------------------------------------            
//STEP1A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K442.CCBALLOT,DISP=OLD                                   
//INPUT2   DD DSN=BP13.K442.CCBALLOT.ALTX1,DISP=OLD                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*---------------------------------------------------------------------        
//* DELETE BP13K442 (BALLOT FILE FOR ONLINE PANELS)                             
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL (BP13.K442.CCBALLOT) CL PURGE                                          
         IF MAXCC < 12 THEN                                                     
            SET MAXCC = 0                                                       
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT THE RANDOM FILE IN RANDOM NUMBER ORDER                                 
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.CCRMNY,DISP=SHR                                     
//*SORTOUT  DD DSN=BP13T.F740.TEST2,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F740,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3),SPACE=(CYL,(48,10),RLSE),                             
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   OUTREC FIELDS=(1,245,C'  ',248,219,C'         ',476,25)                      
/*                                                                              
//*---------------------------------------------------------------------        
//* TO CREATE THE BALLOT FILE & TO ENSURE THAT NO DUPLICATE RANDOM NO           
//* BY USINF DEFINE VSAM BALLOT FILE                                            
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//*INPUT    DD DSN=BP13T.F740.TEST2,DISP=SHR                                    
//INPUT    DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEF CL (NAME(BP13.K442.CCBALLOT)           -                           
                 CYL(36 5)                           -                          
                 UNIQUE                              -                          
                 SPEED                               -                          
                 STORCLAS(PRODRLS)                   -                          
                 LOG(NONE)                           -                          
                 SHR(2 3))                           -                          
                 DATA                                -                          
                 (NAME(BP13.K442.CCBALLOT.DATA)      -                          
                 KEYS(28 0)                          -                          
                 RECSZ(500 500)                      -                          
                 FSPC(10 10)                         -                          
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                          -                          
           REPRO IFILE(INPUT)                        -                          
                 ODS(BP13.K442.CCBALLOT)                                        
//*--------------------------------------------------------------------         
//*      TO CREATE PATH/ALTX FOR MATUREBA BALLOT FILE                           
//*--------------------------------------------------------------------         
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K442.CCBALLOT,DISP=SHR                                   
//SYSIN    DD  *                                                                
           DEF AIX (NAME(BP13.K442.CCBALLOT.ALTX1)   -                          
               REL(BP13.K442.CCBALLOT)               -                          
               REUSE                                 -                          
               KEYS(8 122)                           -                          
               SHR(2 3)                              -                          
               NUNQK)                                -                          
               DATA                                  -                          
               (NAME(BP13.K442.CCBALLOT.ALTX1.DATA)  -                          
               CYL(10 5)                             -                          
               RECSZ(31 354)                         -                          
               FSPC(10 10)                           -                          
               CISZ(4096))                           -                          
               INDEX                                 -                          
               (NAME(BP13.K442.CCBALLOT.ALTX1.INDEX) -                          
               CISZ(4096))                                                      
         IF MAXCC = 0 THEN                           -                          
           DEF PATH (NAME(BP13.K442.CCBALLOT.PATH1)   -                         
               PENT(BP13.K442.CCBALLOT.ALTX1))                                  
         IF MAXCC = 0 THEN                                                      
           BIX IDS(BP13.K442.CCBALLOT)               -                          
               ODS(BP13.K442.CCBALLOT.ALTX1)                                    
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT THE REQUEST BEFORE PIGEONHOLING - DATASET              
//*---------------------------------------------------------------------        
//STEP08   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                   
//BP13K520 DD  DSN=BP13.K442.CCBALLOT,DISP=SHR                                  
//BP13L509 DD  DSN=BP13.L509.CCRMNY,DISP=SHR                                    
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S509),DISP=SHR                            
/*                                                                              
