//BP13M220 JOB (BP13P),'BP13M220',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR CREATING INTERFACE FILE TO MAMS FOR NPL                     
//* JOB TO RUN ON 22ND OF THE MONTH                                             
//******************************************************************            
//*CHG REF  OIC   DATE    DESCRIPTION                                           
//*-------- ---- -------- -----------                                           
//*BP133725 DW5  20091021 NEW JCL FOR CREATING INTERFACE FILE                   
//*BP133924 ESA1 20100524 REMOVE READING OF BP13F205                            
//*BP135171 RJE1 20140211 TO CATER FOR DB2 UPGRADE                              
//*--------------------------------------------------------------------*        
//* SORT OUT NPL CASES IN BM06K110 USING THE CTRL REC                           
//*--------------------------------------------------------------------*        
//STEP01   EXEC PGM=BP13C23M,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM6F110A DD DSN=&&BM6F110A,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------*        
//*TO PROVIDE INTERFACE FILE FOR MAMS ON AVAILABLE FLATS FOR NPL (AMR)          
//*--------------------------------------------------------------------*        
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BM06F110 DD DSN=&&BM6F110A,DISP=(OLD,PASS)                                    
//BP13K270 DD DSN=BP13.K270.BOOKPGM,DISP=SHR                                    
//BP13K271 DD DSN=BP13.K270.BOOKPGM.PATH1,DISP=SHR                              
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR                                   
//BP13F472 DD DSN=BP13.F472.SOC,DISP=SHR                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C237) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*--------------------------------------------------------------------*        
//* END OF BP13A278                                                             
//*--------------------------------------------------------------------*        
