//BP13AELS JOB (BP13P),'BP13AELS',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* CHG REF   BY    DATE      DESCRIPTION                                       
//* --------  ----  --------  -----------------------------------------         
//* BP136360  SMR2  07102016  SPLIT SIMULATION (BP13AELS) AND ACTUAL            
//*                           (BP13AELD) ELDERLY SHORTLISTING                   
//* BP138301  AM25  14052020  HARDCOPY REPORTS CONVERSION                       
//**********************************************************************        
//* VERIFY FILE/S BEFORE JOB RUN                                                
//**********************************************************************        
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------------        
//* REPRO VSAM FILE TO SEQUENTIAL FILES                                         
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.ELD,DISP=OLD                                 
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.ELD,DISP=OLD                               
//INPUT3   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F740.MATUREBA.ELD,DISP=OLD                               
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* DEFINE BP13K010 - FOR SIMULATION                                            
//*---------------------------------------------------------------------        
//STEP02A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F010.TENDER.ELD,DISP=SHR                                 
//SORTOUT  DD DSN=&&TEMP1,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                               
//            SPACE=(TRK,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* TO DELETE & REDEFINE BP13K010 - FOR SIMULATION                              
//*---------------------------------------------------------------------        
//STEP02B  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&TEMP1,DISP=(OLD,DELETE)                                     
//SYSIN    DD *                                                                 
  DEL (BP13.K010.ELDERLY) CLUSTER PURGE                                         
  DEF CLUSTER                                          -                        
        (NAME(BP13.K010.ELDERLY)                       -                        
        SHAREOPTIONS(2,3)                              -                        
        KEYS(5 0)                                      -                        
        CYL(1 1)                                       -                        
        RECSZ(600 600)                                 -                        
        FREESPACE(10 10)                               -                        
        CISZ(4096)                                     -                        
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K010.ELDERLY.DATA))                 -                        
      INDEX                                            -                        
        (NAME(BP13.K010.ELDERLY.INDEX))                                         
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K010.ELDERLY)                                         
//*---------------------------------------------------------------------        
//* TO DELETE & REDEFINE BP13K712 - FOR SIMULATION                              
//*---------------------------------------------------------------------        
//STEP03    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F712.FLATNHUG.ELD,DISP=SHR                              
//SYSIN     DD  *                                                               
          DEL (BP13.K712.ELDERLY) CL PURGE                                      
          DEF CLUSTER                                -                          
              (NAME(BP13.K712.ELDERLY)               -                          
              CYL(1 1)                               -                          
              UNIQUE                                 -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K712.ELDERLY.DATA)          -                          
              KEYS(10 0)                             -                          
              RECSZ(350 350)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K712.ELDERLY.INDEX))                                   
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K712.ELDERLY)                                            
//*---------------------------------------------------------------------        
//* SORT BY NT, FT                                                              
//* INCLUDE APPLICATIONS UNDER 2-ROOM FLEXI                                     
//*---------------------------------------------------------------------        
//STEP04A EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F740SORT,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                              
//           DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                             
//SYSIN   DD *                                                                  
    SORT FIELDS=(187,3,A,211,2,A),FORMAT=CH                                     
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,211,2,CH,EQ,C'2F')                     
//*---------------------------------------------------------------------        
//* COMPUTE TOT-ELDER/TOT-NON-ELDER/TOT-ELDER-SPS/TOT-ELDER-NONSPS              
//*---------------------------------------------------------------------        
//STEP04B  EXEC PGM=BP13CF7C,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SORT,DISP=(OLD,DELETE)                                  
//BP13K010 DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* COMPUTE NO OF UNITS SET ASIDE FOR NHH/UPG/FTS FOR PRIORITY SCHEME           
//* COMPUTE FOR PA SCHEME                                                       
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13CF7D,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*---------------------------------------------------------------------        
//STEP06A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,211,2,CH,EQ,C'2F',AND,                  
                 210,1,CH,NE,C'N',AND,210,1,CH,NE,C' ')                         
//*---------------------------------------------------------------------        
//* PRINT REPORT ON TOTAL CUMULATIVE SUCC BY ALLOC-SCHEME                       
//*---------------------------------------------------------------------        
//STEP06B  EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=8,DEST=IOM8                                                
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
ELC                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*---------------------------------------------------------------------        
//STEP06C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,211,2,CH,EQ,C'2F',AND,                  
                 210,1,CH,NE,C'S',AND,210,1,CH,NE,C'F')                         
//*---------------------------------------------------------------------        
//* PRINT REPORT ON TOTAL CUMULATIVE SUCC BY ALLOC-SCHEME                       
//*---------------------------------------------------------------------        
//STEP06D  EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=8,DEST=IOM8                                                
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
NEC                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*---------------------------------------------------------------------        
//STEP06E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,211,2,CH,EQ,C'2F')                      
//*---------------------------------------------------------------------        
//* PRINT REPORT FOR ELDERLY APPLICANTS                                         
//*---------------------------------------------------------------------        
//STEP06F  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*---------------------------------------------------------------------        
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS UNDER ELDERLY (F/S)                                    
//*---------------------------------------------------------------------        
//STEP07  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=BP13.F740.MATUREBA.PAELD,DISP=OLD                              
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,211,2,CH,EQ,C'2F',AND,                 
                 (210,1,CH,EQ,C'F',OR,210,1,CH,EQ,C'S'))                        
//*---------------------------------------------------------------------        
//* SORT OUT 2F FLATS TO PRINT FLAT SUPPLY BEFORE SIMULATION                    
//*---------------------------------------------------------------------        
//STEP08A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//SORTOUT  DD DSN=&&K010RM2F,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'2F')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE SIMULATION                       
//*---------------------------------------------------------------------        
//STEP08B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010RM2F,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG/FTS BEFORE SIMULATION              
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C558,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//BP13K010 DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//BP13L558 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG/FTS BEFORE SIMULATION              
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//BP13L552 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS UNDER 2-ROOM FLEXI                                     
//*---------------------------------------------------------------------        
//STEP11A EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F740FT2F,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                              
//           DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                             
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,211,2,CH,EQ,C'2F')                     
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR ELDERLY (SIMULATION ONLY)                 
//*---------------------------------------------------------------------        
//STEP11B  EXEC PGM=BP13U545,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//BP13F740 DD DSN=&&F740FT2F,DISP=(OLD,DELETE)                                  
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L545 DD SYSOUT=8,DEST=IOM8                                                
//P13L545A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG/FTS AFTER SIMULATION               
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13C558,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//BP13K010 DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//BP13L558 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG/FTS AFTER SIMULATION               
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//BP13L552 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY NEW TOWN, FLAT TYPE                                                 
//*---------------------------------------------------------------------        
//STEP20A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F010,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,5,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* PREPARE ELDERLY FIELDS FOR SHORTLISTING (COHORT = 'E')                      
//*---------------------------------------------------------------------        
//STEP20B  EXEC PGM=BP13CF7E,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.ELDERLY,DISP=SHR                             
//BP13F010 DD DSN=&&BP13F010,DISP=(OLD,PASS)                                    
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG/FTS BEFORE SHORTLISTING            
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=BP13C558,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13L558 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 2F FLATS TO PRINT FLAT SUPPLY BEFORE SHORTLISTING                  
//*---------------------------------------------------------------------        
//STEP22A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010RM2F,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'2F')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE SHORTLISTING                     
//*---------------------------------------------------------------------        
//STEP22B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010RM2F,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//*                      END BP13AELS                                           
//*---------------------------------------------------------------------        
