//BP13D504 JOB (BP13P),'BP13D504',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//******************************************************************            
//* BP130757 20000127 SSS  40TH ANNIVERSARY LOGO                                
//******************************************************************            
//*  TO SEND DYNAMIC JDE ADHEAD OF THE PRINT DATASET                            
//*  PRT01 : COPIES=1                                                           
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALSS1A                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//******************************************************************            
//*  TO SEND DYNAMIC JDE ADHEAD OF THE PRINT DATASET                            
//*  PRT02 : COPIES=1                                                           
//*-----------------------------------------------------------------            
//PRT02    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1B CP-1',END;                                    
1$DJDE$ JDE=13C272,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALSS1B                                   
//SYSUT2   DD  SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* EXTRACT ALL CASES WHERE AMIS = 'Y'                                          
//*-----------------------------------------------------------------            
//STEP2    EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K838.OSCARS.LOG,                                        
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&TMP1,                                                      
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
      SORT FIELDS=(340,8,A),FORMAT=CH                                           
      INCLUDE COND=(348,1,CH,EQ,C'Y')                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* TO PRINT LETTERS FOR AMIS                                                   
//*-----------------------------------------------------------------            
//STEP3    EXEC  PGM=BP13C270,COND=(0,NE)                                       
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR                                                         
//BP13K821 DD  DSN=BP13.K820.OCCUP.PATH1,                                       
//             DISP=SHR                                                         
//BP13K838 DD  DSN=BP13.K838.OSCARS.LOG,                                        
//             DISP=SHR                                                         
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR                                                         
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR                                                         
//BP13F838 DD  DSN=&&TMP1,                                                      
//             DISP=(SHR,PASS)                                                  
//BP13P270 DD  SYSOUT=W,                                                        
//             OUTPUT=(*.PRT02.FORMID),DEST=IOMW                                
//BP13L270 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOM2                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* END OF JOB BP13D504                                                         
//*-----------------------------------------------------------------            
