//BP13M701  JOB (BP13P),'BP13M701',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//        NOTIFY=CSD0071                                                        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* RUN ON 7TH,14TH,25TH OF THE MONTH                                           
//*=================================================================            
//* UPDATE GIRO NEW & TERMINATION                                               
//*-----------------------------------------------------------------            
//* BP132772 030506 LSB  DBSS                                                   
//* BP133091 151207 LMS  EXPANSION OF BP13KD00 FROM 1200 TO 1600                
//* BP133305 060608 LSB  SORT SCH-ACC-NO GIRO COL 5                             
//*=================================================================            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                
//*-----------------------------------------------------------------            
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*-----------------------------------------------------------------            
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KD00.DBSMAST,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------            
//* SORT SHC-ACC-NO AND OMIT LOAN-BAL = ZEROS                                   
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FD00,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(11,11,A),FORMAT=CH                                             
//* INCLUDE COND=(33,1,CH,EQ,C'C',AND,298,9,CH,GT,C'000000000')                 
//*-----------------------------------------------------------------            
//* SORT GIRO FILE SHC-ACC-NO                                                   
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AC08.F200.NT.DBSS(0),DISP=SHR                                 
//SORTOUT  DD DSN=&&AC08F200,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(5,11,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* UPDATE NEW/TERMINATION OF GIRO INFOR                                        
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13CC08,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,DELETE)                                  
//AC08F200 DD DSN=&&AC08F200,DISP=(OLD,DELETE)                                  
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13LC08 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* BACKUP GIRO FILE                                                            
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AC08.F200.NT.DBSS(0),DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.AC08.F200.NEW.ACCUM,DISP=MOD                             
      REPRO INFILE(INPUT1)   OUTFILE(OUTPUT1)                                   
//*                                                                             
