//BP13A993 PROC                                                         00000010
//********************************************************************* 00000020
//* CHG-NO   BY   ON    - DESCRIPTION                                   00000030
//* ---------------------------------                                   00000040
//* BP132184 JAM 020813 - ITERATIVELY SPLIT BP13F230 INTO SMALL CHUNKS  00000050
//*                       OF FILE W/ 50 RECORDS                         00000060
//********************************************************************* 00000070
//*---------------------------------------------------------------------00000080
//* BP13C287 WILL RETURN CODE = 0 IF THERE ARE MORE RECORDS TO SPLIT.   00000090
//*               RETURN CODE = 99 IF RECORDS REMAIN ARE < 200.         00000100
//*---------------------------------------------------------------------00000110
//STEP01 EXEC    PGM=BP13C287,COND=(0,NE)                               00000120
//BP13F230 DD  DSN=BP13.F230.FLATLIST.START,                            00000130
//             DISP=SHR                                                 00000140
//BP13F23A DD  DSN=BP13.F230.FLATLIST.SEND,                             00000150
//             DISP=OLD                                                 00000160
//BP13F23B DD  DSN=BP13.F230.FLATLIST.SENDALL,                          00000170
//             DISP=MOD                                                 00000180
//BP13F23C DD  DSN=BP13.F230.FLATLIST.REMAIN,                           00000190
//             DISP=OLD                                                 00000200
//SYSPRINT DD  SYSOUT=*                                                 00000210
//SYSDBG   DD  SYSOUT=*                                                 00000220
//SYSDBOUT DD  SYSOUT=*                                                 00000230
//SYSOUT   DD  SYSOUT=*                                                 00000240
//*-------------------------------------------------------------------- 00000250
//*   SEND INTV FILE TO PRINTER PORT (MAIN LINE)                        00000260
//*-------------------------------------------------------------------- 00000270
//STEP02 EXEC    PGM=IEBGENER,COND=(0,NE)                               00000280
//SYSUT1   DD  DSN=BP13.F230.FLATLIST.SEND,                             00000290
//             DISP=SHR                                                 00000300
//SYSUT2   DD  SYSOUT=A,DEST=RMT183                                     00000310
//SYSPRINT DD  SYSOUT=*                                                 00000320
//SYSIN    DD  DUMMY                                                    00000330
//*-------------------------------------------------------------------- 00000340
//*   SEND INTV FILE TO PRINTER PORT (BACKUP LINE)                      00000350
//*-------------------------------------------------------------------- 00000360
//STEP03 EXEC    PGM=IEBGENER,COND=(0,NE)                               00000370
//SYSUT1   DD  DSN=BP13.F230.FLATLIST.SEND,                             00000380
//             DISP=SHR                                                 00000390
//SYSUT2   DD  SYSOUT=A,DEST=RMT184                                     00000310
//SYSPRINT DD  SYSOUT=*                                                 00000410
//SYSIN    DD  DUMMY                                                    00000420
//*-------------------------------------------------------------------- 00000430
//* THIS STEP WILL BACKUP THE REMAINING RECORDS FOR INPUT TO            00000440
//* NEXT ITERATION.                                                     00000450
//*-------------------------------------------------------------------- 00000460
//STEP04 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00000470
//INPUT1   DD  DSN=BP13.F230.FLATLIST.REMAIN,                           00000480
//             DISP=OLD                                                 00000490
//OUTPUT1  DD  DSN=BP13.F230.FLATLIST.START,                            00000500
//             DISP=OLD                                                 00000510
//SYSPRINT DD  SYSOUT=*                                                 00000520
//SYSIN    DD  DSN=BP13.BATCH.PARM(BP13P051),                           00000530
//             DISP=SHR                                                 00000540
//*---------------------------------------------------------------------00000550
//*  END OF BP13A993                                                    00000560
//*---------------------------------------------------------------------00000570
//       PEND                                                           00000580
