//BP13M406 JOB (BP13P),'BP13M406',MSGLEVEL=(1,1),CLASS=I,MSGCLASS=N,            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*                                                                             
//*=================================================================            
//* DESCRIPTION : PULL MND FILE FROM                                            
//*               IDEAL SERVER (FTP) INTO MAINFRAME                             
//*                                                                             
//*     IDEAL FILENAME: CSV FORMAT                                              
//*     MAINFRAME DSN  : BP13.F406.RECVMND                                      
//*                                                                             
//*=================================================================            
//* DATE MOD  BY      REF      DESCRIPTION                                      
//* --------  ----  -------    -----------                                      
//* 15/07/19  KTM3  BP137827   NEW JCL                                          
//*=================================================================    00011200
//******************************************************************            
//* RETRIEVE CSV FILE FROM FTP & PLACE IN BP13.F406.RECVMND                     
//******************************************************************            
//FTPPUT   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  /PROD/APPN/DATA/BP13/TO-HDB/MND                                           
  ASCII                                                                         
  GET 'HDBsample_randomised (without 2 projs).csv' +                            
      'BP13.F406.RECVMND' (REPLACE                                              
  QUIT                                                                          
//*                                                                             
//*------------------------------------------------------------*                
//******************************************************************            
//*  BACKUP THE MND RECV FILE INTO GDG AND ACCUM FILE                           
//*--------------------------------------------------------------------*        
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F406.RECVMND,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F406.RECVMND.ACCUM,DISP=MOD                              
//OUTPUT2  DD DSN=BP13.F406.RECVMND.BKUP(+1),DISP=(NEW,CATLG,DELETE),           
//            SPACE=(CYL,(5,1),RLSE),                                           
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB,DSORG=PS)              
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                       
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT2)                                       
//*                                                                             
//******************************************************************            
//* DELETE p7 FILE IN FTP                                                       
//******************************************************************            
//STEP03   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  /PROD/APPN/DATA/BP13/TO-HDB/MND                                           
  DIR                                                                           
  BINARY                                                                        
  MDEL 'HDBsample_randomised (without 2 projs).csv.p7'                          
  DIR                                                                           
  QUIT                                                                          
//*                                                                             
//*                                                                             
//******************************************************************            
//* DELETE CSV FILE IN FTP                                                      
//******************************************************************            
//STEP03   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  /PROD/APPN/DATA/BP13/TO-HDB/MND                                           
  DIR                                                                           
  BINARY                                                                        
  MDEL 'HDBsample_randomised (without 2 projs).csv'                             
  DIR                                                                           
  QUIT                                                                          
//*                                                                             
//*                                                                             
//*------------------------------------------------------------*                
//*                  END OF BP13M406                                            
//*------------------------------------------------------------*                
