//BP13D104  JOB (BP13P),'BP13D104',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),           
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*================================================================== *         
//* DAILY JOB DBSS FLAT                                                         
//*================================================================== *         
//* BP132772 020506 LSB DBSS JOB                                                
//* BP133051 090507 LSB LUMPSUM PAYMENT                                         
//* BP132936 110507 ED1 ADDED BP13KD00 READ IN BP13CC51                         
//* BP133051 120507 LSB DELETE GIRO FILE, MOVE TO BP13M700                      
//* BP133713 311007 LSB ADD P13F125A TO CC05                                    
//* BP133771 061107 LSB ADD BP13.F125.PAYDEVLP.ACCUM TO STEP 14                 
//* BP133175 271207 LSB RUN NEWLOAN BP13CC59 BF PAYMENT POSTING                 
//* BP133209 150208 LSB SORT DESCENDING ORDER FOR CC07, SO THAT NEW             
//*                     LOAN WILL COME BEFORE CPF PAYMENT                       
//* BP133209 150208 LSB BP13CC07 RUN 2 TIMES, ADD STEP4A, 4B                    
//* BP133480 261208 LSB EMPTY BP13.F140.DBSKIV                                  
//* BP133468 110209 LSB ADD BP13KD03 IN BP13CC05                                
//* BP133545 060309 LSB BP13.F125.DBSPAYMT- NO LS RECORD                        
//*                     BP13.F125.DBSLUMP - INCLUDE LS AND IT DUE TO LS         
//* BP133682 160909 JB8 REMOVE BP13CC59                                         
//* BP134154 190411 LSB ADD SORTING FOR BP13CC74                                
//* BP134029 150811 JB8 ADD BP13K482 TO BP13CC74                                
//* BP134040 181011 JB8 MOVE BP13CD89 TO BP13M712                               
//* BP134493 200312 IMC CHANGED MIN LUMPSUM PAYMENT FROM $500 TO $5000          
//* BP134515 050612 IMC ADD NEW EMAIL ALERT WHEN PP DUE DATE IS UPDATED         
//* BP134515 060612 IMC ADD NEW EMAIL ALERT FOR COMPLETED 2ND CONC LOAN         
//* BP134269 220612 LJL TO MOVE EMAIL ALERT TO BP13D108                         
//* BP135171 100214 RJE TO CATER FOR DB2 UPGRADE                                
//*-------------------------------------------------------------------*         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                          *         
//*-------------------------------------------------------------------*         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KD00.DBSMAST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.KD30.PPDUEDTE,DISP=OLD                                   
//INPUT3   DD DSN=BP13.KD40.APPLPAY,DISP=OLD                                    
//INPUT4   DD DSN=BP13.KD99.DBSMAST.LOG,DISP=OLD                                
//INPUT5   DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                    
//INPUT6   DD DSN=BP13.KD45.PPAYHIST,DISP=OLD                                   
//INPUT7   DD DSN=BP13.K600.CPFWDL,DISP=OLD                                     
//INPUT8   DD DSN=BP13.K130.SOCHIST,DISP=OLD                                    
//INPUT9   DD DSN=BP13.KD63.TXHIST,DISP=OLD                                     
//INPUT10  DD DSN=BP13.KD60.ACCHIST,DISP=OLD                                    
//INPUT11  DD DSN=BP13.KD65.PDATE,DISP=OLD                                      
//INPUT12  DD DSN=BP13.KD92.UPDLOAN,DISP=OLD                                    
//INPUT13  DD DSN=BP13.KD94.UPDLOAN.LOG,DISP=OLD                                
//INPUT14  DD DSN=BP13.K482.FLATSOLD.BFSL,DISP=OLD                              
//INPUT15  DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT16  DD DSN=BP13.K640.CA.ACTION,DISP=OLD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
          VFY FILE(INPUT10)                                                     
          VFY FILE(INPUT11)                                                     
          VFY FILE(INPUT12)                                                     
          VFY FILE(INPUT13)                                                     
          VFY FILE(INPUT14)                                                     
          VFY FILE(INPUT15)                                                     
          VFY FILE(INPUT16)                                                     
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                   *         
//* PRT01 : 1 COPY                           (MA&B)                   *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* LUMP SUM PAYMENT LETTER                                                     
//* PRT02 : 1 COPY                           (MA&B)                   *         
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1B CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13DT,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* LUMP SUM PAYMENT < $500 LETTER                                              
//* PRT03 : 1 COPY                           (MA&B)                   *         
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1C CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13DQ,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1C                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* LUMP SUM PAYMENT < $5000 LETTER                                             
//* PRT04 : 1 COPY                           (MA&B)                   *         
//*-----------------------------------------------------------------            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1D CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13DW,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1D                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//*  TO CHECK DATE BALANCE CLOSE AGAINST THE PREVIOUS MONTH.                    
//*  RETURNS '99' IF THE DATES ARE NOT EQUAL.                                   
//*-----------------------------------------------------------------            
//STEPAA EXEC  PGM=BP13CC25,COND=(0,NE)                                         
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD65 DD  DSN=BP13.KD65.PDATE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP DIALY POSTING FILE TO BP13.F125.DBSSPOST                             
//*-------------------------------------------------------------------*         
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F125.DBSPAYMT,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F125.DBSSPOST,DISP=OLD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* INCLUDE ONLY LUMP SUM PAYMENT FOR PP, CONVEY FEE, STAMP FEE       *         
//*-------------------------------------- ----------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DBSSPOST,DISP=SHR                                   
//SORTOUT  DD DSN=&&F125PPMT,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,2,A,5,19,A),FORMAT=CH                                         
   INCLUDE COND=(99,3,CH,EQ,C'PP ',OR,                                          
                 99,3,CH,EQ,C'OPT',OR,                                          
                 99,3,CH,EQ,C'DSP',OR,                                          
                 99,3,CH,EQ,C'DCV')                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE LUMP SUM PROGRESS PAYMENT/STAMP/CONVEY FEE                           
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=BP13CC11,COND=(0,NE)                                        
//BP13F120 DD DSN=&&F125PPMT,DISP=(OLD,PASS)                                    
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD30 DD DSN=BP13.KD30.PPDUEDTE,DISP=SHR                                   
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD99 DD DSN=BP13.KD99.DBSMAST.LOG,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LC11 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* INCLUDE ONLY INSTALMENT AFTER LOAN START                                    
//* TRANS-TYPE = 63 (PAYMENT TO DEVELOPER)                                      
//* TRANS-TYPE = 64 (GIRO PAYMENT) - IN M700                                    
//* PP - UPDATE KD00-AMT-PP-LUMPSUM, PP-PD-DEVLP-TOT                            
//* INS- UPDATE KD00-AMT-LOAN-BAL, AMT-LOAN-PAID, TOTL-PYMT-TODTE               
//*      UPDATE KD00-AMT-ARR-INSTAL, MTH-ARR-INSTAL                             
//* IT - UPDATE KD00-AMT-LOAN-BAL                                               
//*-------------------------------------- ----------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DBSSPOST,DISP=SHR                                   
//SORTOUT  DD DSN=&&F125INST,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
  INCLUDE COND=((99,3,CH,EQ,C'INS',OR,99,3,CH,EQ,C'IT ',OR,                     
                 99,3,CH,EQ,C'PP '),AND,                                        
                (1,2,CH,EQ,C'11',OR,1,2,CH,EQ,C'12',OR,                         
                 1,2,CH,EQ,C'13',OR,1,2,CH,EQ,C'14',OR,                         
                 1,2,CH,EQ,C'15',OR,1,2,CH,EQ,C'16',OR,                         
                 1,2,CH,EQ,C'63',OR,1,2,CH,EQ,C'64'))                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE INSTALMENT TO DBS MASTER AND OUTPUT TRANSCCTION FILE                 
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=BP13CC05,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F125 DD DSN=&&F125INST,DISP=(OLD,PASS)                                    
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD99 DD DSN=BP13.KD99.DBSMAST.LOG,DISP=OLD                                
//BP13KD65 DD DSN=BP13.KD65.PDATE,DISP=OLD                                      
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                    
//BP13LC05 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13F125A DD DSN=BP13.F125.DBSPAYMT,DISP=OLD                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------- ----------------------------*         
//STEP4A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DBSSPOST,DISP=SHR                                   
//SORTOUT  DD DSN=&&F125OTHR,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
  OMIT COND=(99,3,CH,EQ,C'INS',OR,99,3,CH,EQ,C'IT ',OR,                         
             99,3,CH,EQ,C'PP ',OR,99,3,CH,EQ,C'LS ')                            
/*                                                                              
//*-------------------------------------------------------------------*         
//* ACCUMULATE OTHER TRANSACTION BACK TO                                        
//*-------------------------------------------------------------------*         
//STEP4B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&F125OTHR,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=BP13.F125.DBSPAYMT,DISP=MOD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* DELETE BP13KD40, WRITE TO BP13KD45 (HISTORY)                                
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13CC24,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD40 DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD45 DD DSN=BP13.KD45.PPAYHIST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K600 DD DSN=BP13.K600.CPFWDL,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F600 DD DSN=BP13.F600.CPFWDL.DELETE,DISP=MOD                              
//BP13LC24 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*  WRITE FINANCIAL TRANS FOR DAY TO TRANS LOG FILE                  *         
//*  FOR ENQUIRY FIN HISTORY (OPTION 4)                               *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC PGM=BP13C107,COND=(0,NE)                                        
//BP13F125 DD DSN=&&F125PPMT,DISP=(OLD,PASS)                                    
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* INCLUDE LUMP SUM PAYMENT                                                    
//*-----------------------------------------------------------------            
//STEP7A EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.F125.DBSSPOST,DISP=SHR                                   
//SORTOUT  DD  DSN=&&F125LUMP,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(5,19,A,1,2,A),FORMAT=CH                                         
   INCLUDE COND=(99,3,CH,EQ,C'LS ')                                             
//*-----------------------------------------------------------------            
//* UPDATE LUMPSUM PAYMENT, COMPUTE INTEREST REBATE                             
//* DSN=BP13.F125.DBSLUMP - INCLUDE PAY-TY= LS, IT                              
//*-----------------------------------------------------------------            
//STEP7B EXEC  PGM=BP13CC74,COND=(0,NE)                                         
//BP13F125 DD  DSN=&&F125LUMP,DISP=(OLD,PASS)                                   
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD03 DD  DSN=BP13.KD03.DBSHIST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD99 DD  DSN=BP13.KD99.DBSMAST.LOG,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K482 DD  DSN=BP13.K482.FLATSOLD.BFSL,DISP=OLD,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD92 DD  DSN=BP13.KD92.UPDLOAN,DISP=SHR                                   
//BP13KD94 DD  DSN=BP13.KD94.UPDLOAN.LOG,DISP=SHR                               
//AB03K050 DD  DSN=AB03.K050.INTTABLE,DISP=SHR                                  
//BP13FD92 DD  DSN=BP13.FD92.UPDLOAN.LETTER,DISP=OLD                            
//P13F125A DD  DSN=BP13.F125.DBSLUMP,DISP=OLD                                   
//BP13LC74 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT LUMP SUM LETTERS                                                      
//* P13PC51A - LUMP SUM PAYMENT                                                 
//* P13PC51B - LUMP SUM PAYMENT < $500                                          
//* P13PC51C - LUMP SUM PAYMENT < $5000                                         
//*-----------------------------------------------------------------            
//STEP7C EXEC  PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                
//BP13FD92 DD  DSN=BP13.FD92.UPDLOAN.LETTER,DISP=OLD                            
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//            AMP=('BUFND=4','BUFNI=8')                                         
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//P13PC51A DD SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                        
//P13PC51B DD SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                        
//P13PC51C DD SYSOUT=W,OUTPUT=(*.PRT04.FORMID),DEST=IOMW                        
//BP13LC51 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CC51) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
     END                                                                        
//*-------------------------------------------------------------------*         
//* INCLUDE ONLY INSTALMENT AFTER LOAN START, LUMPSUM-INSTAL                    
//*-------------------------------------- ----------------------------*         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.PPDUE,DISP=SHR                                      
//SORTOUT  DD DSN=&&F125DUE,DISP=(,PASS),                                       
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE DAILY PAYMENT TO FINANCIAL TRANSACTION HIST                          
//* FOR ENQUIRY FIN HISTORY ON LOAN INFOR (OPTION 27)                           
//*---------------------------------------------------------------------        
//STEP8A   EXEC PGM=BP13CC07,COND=(0,NE)                                        
//BP13F125 DD DSN=&&F125DUE,DISP=(OLD,PASS)                                     
//BP13KD63 DD DSN=BP13.KD63.TXHIST,DISP=SHR                                     
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* INCLUDE ONLY INSTALMENT AFTER LOAN START, LUMPSUM-INSTAL                    
//*-------------------------------------- ----------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DBSPAYMT,DISP=SHR                                   
//SORTOUT  DD DSN=&&F125CC07,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
  INCLUDE COND=((99,3,CH,EQ,C'INS'),AND,                                        
          (1,2,CH,EQ,C'11',OR,1,2,CH,EQ,C'12',OR,                               
           1,2,CH,EQ,C'13',OR,1,2,CH,EQ,C'14',OR,                               
           1,2,CH,EQ,C'15',OR,1,2,CH,EQ,C'16',OR,                               
           1,2,CH,EQ,C'64'))                                                    
/*                                                                              
//*-------------------------------------------------------------------*         
//* INCLUDE NEW LOAN, INTEREST RAISE                                            
//* DSN=BP13.F125.INTEREST.NEWLOAN, FD IN F125.PPDUE                            
//* DSN=BP13.F125.INSTAL.NEWLOAN,FD IN F125.PPDUE                               
//* DSN=BP13.F125.INTEREST.MONTH, IN M713                                       
//* DSN=BP13.F125.INSTAL.MONTH,DISP=SHR, M713                                   
//*-------------------------------------- ----------------------------*         
//STEP9A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F125CC07,DISP=(OLD,PASS)                                    
//         DD DSN=BP13.F125.DBSLUMP,DISP=SHR                                    
//*        DD DSN=BP13.F125.INTEREST.MONTH,DISP=SHR                             
//*        DD DSN=BP13.F125.INSTAL.MONTH,DISP=SHR                               
//SORTOUT  DD DSN=&&F125ALL,DISP=(,PASS),                                       
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
//*---------------------------------------------------------------------        
//* UPDATE DAILY PAYMENT TO FINANCIAL TRANSACTION HIST                          
//* FOR ENQUIRY FIN HISTORY ON LOAN INFOR (OPTION 27)                           
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13CC07,COND=(0,NE)                                        
//BP13F125 DD DSN=&&F125ALL,DISP=(OLD,PASS)                                     
//BP13KD63 DD DSN=BP13.KD63.TXHIST,DISP=SHR                                     
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  SORT BY KEY = NUM-REGN,DATE-POST,COUNT-HIST                                
//*  INCLUDE LUMP SUM RECORDS ONLY                                              
//*-----------------------------------------------------------------            
//STEP11 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.F125.DBSPAYMT,DISP=SHR                                   
//SORTOUT  DD  DSN=&&F125ARRL,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(3,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(5,19,A),FORMAT=CH                                               
   INCLUDE COND=(75,5,CH,EQ,C'ARR-L')                                           
//*-----------------------------------------------------------------            
//*  TO DELETE INSTALMENT ARREAR PAYMENT (ADHOC)                                
//*-----------------------------------------------------------------            
//STEP12 EXEC    PGM=BP13CC75,COND=(0,NE)                                       
//BP13F125 DD  DSN=&&F125ARRL,DISP=(OLD,DELETE)                                 
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD92 DD  DSN=BP13.KD92.UPDLOAN,DISP=SHR                                   
//BP13KD94 DD  DSN=BP13.KD94.UPDLOAN.LOG,DISP=SHR                               
//BP13LC75 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUMULATE DAILY PAYMENT TRANS TO MTHLY PAYMENT TRANS             *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F125.DBSPAYMT,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUMULATE DAILY PAYMENT TRANS TO MTHLY PAYMENT TRANS             *         
//*-------------------------------------------------------------------*         
//STEP13A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F125.PPDUE,DISP=SHR                                      
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUMULATE DAILY PAYMENT TRANS TO MTHLY PAYMENT TRANS             *         
//*-------------------------------------------------------------------*         
//STEP13B  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F125.PAYDEVLP.ACCUM,DISP=SHR                             
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*-------------------------------------------------------------------*         
//* ACCUMULATE LUMPSUM INTEREST REBAYE TO MTHLY PAYMENT TRANS                   
//*-------------------------------------------------------------------*         
//STEP13C  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F125.DBSLUMP,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F125.ACCUM.DAILY - GDG(7)                             *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F125.DBSPAYMT,DISP=SHR                                   
//         DD DSN=BP13.F125.PAYDEVLP.ACCUM,DISP=SHR                             
//         DD DSN=BP13.F125.DBSLUMP,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F125.DBSPAYMT.DAILY(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=150,RECFM=FB)                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------- ----------------------------*         
//* ACCUM INTEREST ON NEW LOAN RAISED IN THE MONTH                              
//*-------------------------------------- ----------------------------*         
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.PPDUE,DISP=SHR                                      
//SORTOUT  DD DSN=BP13.F125.INTEREST.NEWLOAN.ACCUM,DISP=MOD                     
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
  INCLUDE COND=(99,3,CH,EQ,C'IT ')                                              
//*-------------------------------------- ----------------------------*         
//* ACCUM LOAN ON NEW LOAN RAISED IN THE MONTH                                  
//*-------------------------------------- ----------------------------*         
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.PPDUE,DISP=SHR                                      
//SORTOUT  DD DSN=BP13.F125.INSTAL.NEWLOAN.ACCUM,DISP=MOD                       
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
  INCLUDE COND=(99,3,CH,EQ,C'LON')                                              
//*-------------------------------------------------------------------*         
//* EMPTY FINANCIAL TRANSACTION FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP17   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR150,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F125.DBSPAYMT,DISP=OLD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY FINANCIAL TRANSACTION FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP18   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR150,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F125.DBSLUMP,DISP=OLD                                    
//OUTPUT2  DD DSN=BP13.F125.DBSCPF,DISP=OLD                                     
//OUTPUT3  DD DSN=BP13.F125.DBSCPF.FEE,DISP=OLD                                 
//OUTPUT4  DD DSN=BP13.F125.DBSCASH.PP,DISP=OLD                                 
//OUTPUT5  DD DSN=BP13.F125.DBSCASH.INS,DISP=OLD                                
//OUTPUT6  DD DSN=BP13.F125.DBSCASH.FEE,DISP=OLD                                
//OUTPUT7  DD DSN=BP13.F125.PPDUE,DISP=OLD                                      
//OUTPUT8  DD DSN=BP13.F125.INSTAL.MONTH,DISP=OLD                               
//OUTPUT9  DD DSN=BP13.F125.INTEREST.MONTH,DISP=OLD                             
//OUTPUT10 DD DSN=BP13.F125.PAYDEVLP.ACCUM,DISP=OLD                             
//OUTPUT11 DD DSN=BP13.F140.DBSKIV,DISP=OLD                                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT3)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT4)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT5)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT6)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT7)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT8)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT9)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT10)                                    
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT11)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//*          E N D      O F     J O B                                 *         
//*-------------------------------------------------------------------*         
