//BP13M732  JOB (BP13P),'BP13M732',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*==================================================================           
//* RUN ON 14TH OF THE MONTH                                                    
//* PRINT  LETTER TO INFORM BUYERS WHO HAVE NOT JOINED GIRO                     
//* OF THE INSUFFICIENT CPF AMT REMITTED FOR THE MTHLY INSTALMENT               
//*==================================================================           
//* BP133209 140208 ED1 DBSS JOB                                                
//* BP135171 110214 RJE TO CATER FOR DB2 UPGRADE                                
//*-----------------------------------------------------------------            
//*  PRT01 : 1 COPY (CONTROL REPORT)     ALLOCATION SECTION                     
//*-----------------------------------------------------------------            
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - MA&B UNIT                    
//*-----------------------------------------------------------------            
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                         
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------    00050004
//* GIRO LETTER  (MA&B)                                                 00060004
//*-----------------------------------------------------------------    00070004
//PRT02    EXEC PGM=IEBGENER                                            00080004
//SYSUT1   DD *                                                         00090004
$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13D1,END;                            00100004
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1B                           00110004
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00120004
//SYSPRINT DD SYSOUT=*                                                  00130004
//SYSIN    DD DUMMY                                                     00131004
//*                                                                     00132004
//*--------------------------------------------------------------------         
//* SORT OUT AMT-ARR-INSTAL > ZEROS                                             
//*--------------------------------------------------------------------         
//STEP01 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//SORTOUT   DD DSN=&&BP13FD00,DISP=(,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=1600),                                        
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(573,8,CH,GT,C'00000000')                                        
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT LETTER TO INFORM BUYERS WHO HAVE NOT JOINED GIRO                      
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00390002
//BP13FD00 DD  DSN=&&BP13FD00,DISP=(OLD,PASS)                                   
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LC93 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//BP13PC93 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSOUT   DD SYSOUT=*                                                  00570002
//SYSTSPRT DD SYSOUT=*                                                  00580002
//SYSPRINT DD SYSOUT=*                                                  00590002
//SYSDBG   DD SYSOUT=*                                                  00600002
//SYSDBOUT DD SYSOUT=*                                                  00610002
//SYSTSIN  DD *                                                         00620002
     DSN SYSTEM(DSN)                                                    00630002
     RUN PROGRAM(BP13CC93) PLAN(BP13PCC) -                              00640002
         LIB('BP13.BATCH.LOADCOB')                                      00650002
     END                                                                00660002
