//BP13M712  JOB (BP13P),'BP13M712',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//        NOTIFY=CSD0071                                                        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*====================================================================         
//* RUN ON 3RD OF THE MONTH                                                     
//* CREATE GL INTERFACE FILE                                                    
//*====================================================================         
//******************************************************************            
//* BP132772 140706   LSB  -NEW JOB ON DBSS GL INTERFACE                        
//* BP133040 200306   ED1  -ADD BP13CC98                                        
//* BP133345 20081008 ED1  -BP13CC98, ADD KD63, KD64                            
//* BP133489 20090319 JB8  -BP13CC98, ADD KD60, KD61                            
//* BP133588 20090506 LSB  -ADD BP13C105, C106                                  
//* BP133572 20090612 JB8  -REMOVE BP13CC01                                     
//* BP133682 20090928 JB8  -TO CATER FOR REPUDATE DATE IN BP13CC98              
//* BP133591 20091013 JB8  -NEW REPORT FOR BP13CC98                             
//* BP134034 20110211 ESD1 -CATER FOR INTERFACE FILE TO ERP                     
//* BP134040 20111018 JB8  -ADD BP13CD89 TO CONVERSE LOAN-SCHEME                
//* BP134749 20130113 RJE1 -ADD BP13.F130.DBSSDEV.M401 TO BP13CC21              
//* BP134707 20130527 IMC1 -ADD F136 CONVERSE TO HDB LOAN  BP13CD89             
//* BP135027 20130925 LSB1 -BP13C42B, C423, CANCEL SUB-TRF/REPUDIA              
//* BP135517 20141125 LSB1 -ADD BACKUP BP13K160                                 
//* BP137200 20180404 LSB1 -ADD F915, K820 TO BP13C42B                          
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - MA&B UNIT                    
//*-----------------------------------------------------------------            
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET - FINANCE                      
//*-----------------------------------------------------------------            
//PRT02   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-FI1A CP-1',END;                                        
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=FI1A                                       
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* VERIFY FILES BEFORE PRODUCTION RUN                                *         
//*-------------------------------------------------------------------*         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KD00.DBSMAST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.KD03.DBSHIST,DISP=OLD                                    
//INPUT3   DD DSN=BP13.KD64.TXHIST.HISTORY,DISP=OLD                             
//INPUT4   DD DSN=BP13.KD63.TXHIST,DISP=OLD                                     
//INPUT5   DD DSN=BP13.KD60.ACCHIST,DISP=OLD                                    
//INPUT6   DD DSN=BP13.KD61.ACCHIST,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
//*-------------------------------------------------------------------*         
//SORT01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&F136NT63,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,CH,A),FORMAT=CH                                          
      OMIT COND=(1,2,CH,EQ,C'63')                                               
//*-------------------------------------------------------------------*         
//SORT1A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F136NT63,DISP=(OLD,PASS)                                    
//         DD DSN=BP13.F130.DBSSDEV.M401,DISP=SHR                               
//SORTOUT  DD DSN=&&F136GL,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,CH,A),FORMAT=CH                                          
//*-----------------------------------------------------------------            
//*  MTHLY GL POSTING FOR ACCOUNTING BY ACTIVITY                                
//*-----------------------------------------------------------------            
//STEP1B   EXEC PGM=BP13CC21,COND=(0,NE)                                        
//BP13F136 DD DSN=&&F136GL,DISP=(OLD,PASS)                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F180 DD DSN=BP13.F180.DBSS,DISP=OLD                                       
//BP13LC21 DD DSN=&&BP13LC21,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(CYL,(20,5),RLSE),                                          
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  SEND BP13LC21 TO MA&B                                                      
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC21,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND BP13LC21 TO FINANCE                                                   
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC21,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT GL TRANS BY ACCOUNT CODE                                               
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE),CYL=20                                         
//SORTIN   DD DSN=BP13.F180.DBSS,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F182,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD   *                                                               
     SORT FIELDS=(15,24,A,58,40,A),FORMAT=CH                                    
//*-----------------------------------------------------------------            
//* SUM THE GL TRAN RECORD TO GL SYSTEM                                         
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=BP13CC48,COND=(0,NE)                                        
//BP13F180 DD DSN=&&BP13F182,DISP=(OLD,PASS)                                    
//AG20F900 DD DSN=&&BP13F190,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* CREATE GL INTERFACE FILE                                                    
//*-----------------------------------------------------------------            
//STEP06    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&BP13F190,DISP=(OLD,PASS)                                   
//OUTPUT1   DD DSN=BP13.F190.DBSS,DISP=OLD                                      
//SYSIN     DD  *                                                               
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
//*-----------------------------------------------------------------            
//* BACKUP BP13.F190.DBSS FILE FOR 3 GENERATIONS                                
//*-----------------------------------------------------------------            
//STEP07    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F190.DBSS,DISP=SHR                                      
//OUTPUT1   DD DSN=BP13.F190.DBSS.BACKUP(+1),DISP=(NEW,CATLG),                  
//          SPACE=(CYL,(2,1)),                                                  
//          DCB=(BP13.GDG,BLKSIZE=23400,LRECL=120,RECFM=FB)                     
//SYSIN     DD  *                                                               
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
//*---------------------------------------------------------------------        
//* SORT BY GL-ACCOUNT-NO, SCH-ACC-NO, DTE-POSTING                              
//*---------------------------------------------------------------------        
//STEP08   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F180.DBSS,DISP=SHR                                      
//SORTOUT  DD  DSN=&&F180POST,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                           
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(15,13,A,98,11,A,109,8,A),FORMAT=CH                              
//*---------------------------------------------------------------------        
//* PRINT GL RECONCILATION REPORT FOR DBSS POSTING                              
//*---------------------------------------------------------------------        
//STEP09   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                   
//BP13F180 DD DSN=&&F180POST,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13LC07 DD DSN=&&BP13LC07,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(CYL,(20,5),RLSE),                                          
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SC07),DISP=SHR                             
//*-----------------------------------------------------------------            
//*  SEND BP13LC07 TO MA&B                                                      
//*-----------------------------------------------------------------            
//STEP10   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC07,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND BP13LC07 TO FINANCE                                                   
//*-----------------------------------------------------------------            
//STEP11   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LC07,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                              *         
//*-------------------------------------------------------------------*         
//STEP34   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.F136.DBSS.MTHBKUP(+1),DISP=(NEW,CATLG),                  
//            SPACE=(CYL,(15,3)),                                               
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=150,RECFM=FB)                   
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* EMPTY MTHLY TRANS FILE                                                      
//*-----------------------------------------------------------------            
//STEP35   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.EMPTY.CHAR150,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=OLD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT CASES WITH DTE-REPUDIATE OR DTE-EFF-TRANSFER                           
//*-------------------------------------------------------------------*         
//STEP36   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13FD00,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(200,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=1600,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,CH,A),FORMAT=CH                                          
      INCLUDE COND=(1401,8,CH,NE,C'        ',OR,                                
                    1485,8,CH,NE,C'        ')                                   
//*-----------------------------------------------------------------            
//* CREATE DBSMAST HISTORY FOR REPUDIATION CASES WITH LN-BAL = 0                
//* DELETE REC FROM BP13KD00                                                    
//* DELETE BP13KD63, WRITE TO BP13KD64                                          
//*-----------------------------------------------------------------            
//STEP37   EXEC PGM=BP13CC98,COND=(0,NE)                                        
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13KD61 DD DSN=BP13.KD61.ACCHIST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13KD63 DD DSN=BP13.KD63.TXHIST,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//BP13KD64 DD DSN=BP13.KD64.TXHIST.HISTORY,DISP=SHR,                            
//            AMP=('BUFND=23')                                                  
//BP13F136 DD DSN=BP13.F136.REPUDIAT,DISP=OLD                                   
//BP13LC98 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* ACCUMULATE DAILY PAYMENT TRANS TO MTHLY PAYMENT TRANS             *         
//*-------------------------------------------------------------------*         
//STEP38   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F136.REPUDIAT,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* INCLUDE TRANS-TYPE=71                                                       
//*-------------------------------------- ----------------------------*         
//STEP39   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.REPUDIAT,DISP=SHR                                   
//SORTOUT  DD DSN=&&F136REPU,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,2,A,5,19,A),FORMAT=CH                                         
   INCLUDE COND=(1,2,CH,EQ,C'71')                                               
//*-------------------------------------------------------------------*         
//* UPDATE BALANCING FILE USING THE VALIDATE PAYMENT TRANS (PP, INS)  *         
//*-------------------------------------------------------------------*         
//STEP39   EXEC PGM=BP13C105,COND=(0,NE)                                        
//BP13F125 DD DSN=&&F136REPU,DISP=(OLD,PASS)                                    
//BP13K160 DD DSN=BP13.K160.BALANCE.DBSS,DISP=SHR                               
//BP13L105 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT OUT BUY 1ST CASES                                                      
//*-------------------------------------------------------------------*         
//STEP40   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&F800BUY,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=2000)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(4,1,CH,EQ,C'5',AND,                                           
                  1294,1,CH,EQ,C'B')                                            
//*-------------------------------------------------------------------*         
//* INCLUDE COND=(1294,1,CH,EQ,C'B')                                            
//* LOAN CONVERSION                                                             
//*-------------------------------------------------------------------*         
//STEP41   EXEC PGM=BP13CD89,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F800 DD DSN=&&F800BUY,DISP=(OLD,PASS)                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K482 DD DSN=BP13.K482.FLATSOLD.BFSL,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR,                                 
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F136 DD DSN=BP13.F136.LNCNVRSE,DISP=OLD                                   
//BP13LD89 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* MOD TRN-TY=73 LOAN FOR CONVERSE HDB LOAN TO BP13F136                        
//*-------------------------------------------------------------------*         
//STEP42   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F136.LNCNVRSE,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* SORT OUT REPUDIATION/SUB-TRANSFER CASES                                     
//*---------------------------------------------------------------------        
//STEP43   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&FD03REPU,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=1600),                                           
//         SPACE=(CYL,(8,5),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1401,8,CH,GT,C'00000000',OR,                                    
                1485,8,CH,GT,C'00000000')                                       
//*-------------------------------------------------------------------*         
//* CANCEL BP13K800 FOR EFF-SUB-TRANSFER/REPUDIATE > 2 MONTHS                   
//* OUTPUT BM06.F110.DELETE TO DELETE BM06K110, WRITE TO BM06K115     *         
//*-------------------------------------------------------------------*         
//STEP44   EXEC  PGM=BP13C42B,COND=(0,NE)                                       
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13FD03 DD DSN=&&FD03REPU,DISP=(OLD,PASS)                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06F110 DD DSN=BM06.F110.DELETE,DISP=MOD                                     
//BP13F915  DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                  
//BP13F410 DD DSN=&&F410C423,DISP=(,PASS),                                      
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(10,5),RLSE)                                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE THE HISTORY FILE AND DELETE RECORDS FROM BP13K800 AND      *         
//* BP13K820 FOR SUCCESSFUL TP CASE                                   *         
//* CLOSE FILE : BP13K800, BP13K820, BP13K840                         *         
//*-------------------------------------------------------------------*         
//STEP43   EXEC  PGM=BP13C423,COND=(0,NE)                                       
//BP13F410 DD DSN=&&F410C423,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=4','BUFND=8')                                         
//P13L423A DD SYSOUT=*                                                          
//P13L423B DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//*  BACKUP BP13K160                                                            
//*-------------------------------------------------------------------*         
//STEP44   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K160.BALANCE.DBSS,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F160.BALANCE.DBSS.MONTH(+1),DISP=(NEW,CATLG),            
//            SPACE=(CYL,(3,2)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-------------------------------------------------------------------*         
//*          E N D      O F     J O B                                 *         
//*-------------------------------------------------------------------*         
