//BP13D22F JOB (BP13P),'BP13D22F',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB01423
//         NOTIFY=CSD0071                                                       
/*JOBPARM SYSAFF=MVS2                                                           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-------------------------------------------------------------------*         
//* HARDLUCK FT2T JOB BP13D22E - BP13D22H                                       
//* CHECK RESALE/SOC/EC/SMS, 300% REQUEST STATUS=S                              
//* OUTPUT FILE = BP13.F595.SOCNOTFD.AFQUE.AY0J                                 
//*=================================================================            
//*-CHG-NO   BY   ON    DESCRIPTION                                             
//*------------------------------------                                         
//*-BP134205 LSB 110555 ADD BP13K813 FOR BP13CB91                               
//*-BP134247 LSB 110610 ADD PPOS/EC CHECK,CY82 CHK MATURE-TAG                   
//*-BP134255 LSB 110615 CHG BP13CY64 TO BP13CY82 BYPASS MATURE EST              
//*-BP134255 LSB 110711 CHG BP13CB71, DELETE CB90, ICNLUDE REQUEST-S            
//*                     IN BP13CB91, ADD FN/NE/HARDLUCK COUNT                   
//*                     BP13CY89,BYAPSS STATUS=S, BTO COUNT>00                  
//*-BP134598 LSB 250712 CHG COL 470 COL 467 ON UNSUCC COUNT                     
//*-BP134598 LSB 310712 IMPLT CY74 UPDATE HHTY=H FOR PARENT CHILD               
//*-BP134598 LSB 010812 TAKE OUT SY02F001                                       
//*-BP134598 LSB 110812 CHG UNSUCC ATTEMP TO 3 COUNT                            
//* BP134780 IMC 270113 - REPLACE CB78 WITH CY49                                
//* BP135237 LSB 290214 - REFER K595.BP13D220 INSTEAD K595.BALLOT.LOG           
//* BP134604 231213 NST1   TO PRINT BP13LB03 TO RST TEAM FOR FOLLOWUP *         
//* BP135171 100214 RJE1   TO CATER FOR DB2 UPGRADE                             
//* BP135921 LSB 01102015 - ADD BP13K730 TO BP13CD86                            
//* BP137734 LSB 10104019 - DELETE BP13CB91                                     
//* BP137734 LSB 120419 - STILL RUN BP13CB91 TO COUNT-STATUS-S, BUT             
//*                       NO UPDATE TO BTO-CNT                                  
//* BP137958 KV6 310719 DELETE BP13CB91                                         
//*-------------------------------------------------------------------*         
//* 1) DETERMINE APPLICATION WITH COMBINATION OF FIRST TIMER AND                
//* SECOND TIMER, HUSBAND + SPOUSE OR FS CASES                                  
//* 2) >= 6 UNSUCC ATTEMPTS                                                     
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y1                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K20H.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YJ')                                               
//*-----------------------------------------------------------------            
//*==================================================================           
//* CONTINUE TO CHECK SMS/RSL.SOC (BP13K595)                                    
//*==================================================================           
//*--------------------------------------------------------------------         
//* CHECK UNSUCC REQUEST BUY RESALE FLATS                                       
//*--------------------------------------------------------------------         
//STEP02   EXEC  PGM=BP13C994,COND=(0,NE)                                       
//BP13F595 DD  DSN=BP13.F595.AY0J,DISP=SHR                                      
//BB24K020 DD DSN=BB24.K020.OCCUPIER.INET,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//BB24K021 DD DSN=BB24.K020.OCCUPIER.INET.PATH1,DISP=SHR,                       
//         AMP=('BUFND=4','BUFNI=8')                                            
//BB24K010 DD DSN=BB24.K010.MASTER.INET,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595F DD DSN=BP13.F595.AY0J.FDRSL,DISP=OLD,                                
//            SPACE=(CYL,(80,10),RLSE),                                         
//            DCB=(LRECL=500,RECFM=FB)                                          
//P13F595N DD DSN=&&F595RESL,DISP=(,PASS),                                      
//            SPACE=(CYL,(180,50),RLSE),                                        
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* CHECK UNSUCC REQUEST BOOKED SOC FLAT                                00000280
//*---------------------------------------------------------------------00000290
//STEP03   EXEC PGM=BP13CY49,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595RESL,DISP=(OLD,DELETE)                                  
//BP13K803 DD DSN=BP13.K803.BKNRIC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K801 DD DSN=BP13.K803.BKNRIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F595F DD DSN=&&F595FSOC,DISP=(,PASS),                              00000310
//            SPACE=(CYL,(180,50),RLSE),                                        
//            DCB=(LRECL=500,RECFM=FB)                                          
//P13F595N DD DSN=BP13.F595.AY0J.NOTBK,DISP=OLD                         00000310
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------00031706
//* CHECK FOUND BOUGHT EC                                               00031706
//*---------------------------------------------------------------------00031706
//STEP04    EXEC PGM=BP13CD87,COND=(0,NE)                               00031806
//BP13F595 DD  DSN=BP13.F595.AY0J.NOTBK,DISP=SHR                        00000310
//BP18K310  DD DSN=BP18.K310.OCCUPIER.INET,DISP=SHR,                    00032006
//             AMP=('BUFND=4','BUFNI=8')                                00032106
//BP18K311  DD DSN=BP18.K310.OCCUPIER.INET.PATH1,DISP=SHR,              00032206
//             AMP=('BUFND=4','BUFNI=8')                                00032306
//BP18K300  DD DSN=BP18.K300.MASTER.INET,DISP=SHR,                      00032406
//             AMP=('BUFND=4','BUFNI=8')                                00032506
//BP18K440  DD DSN=BP18.K440.APLCTN.HIST.TP,DISP=SHR,                   00032406
//             AMP=('BUFND=4','BUFNI=8')                                00032506
//BP18K450  DD DSN=BP18.K450.OCPR.HIST.TP,DISP=SHR,                     00032006
//             AMP=('BUFND=4','BUFNI=8')                                00032106
//BP18K451  DD DSN=BP18.K450.OCPR.HIST.TP.PATH1,DISP=SHR,               00032206
//             AMP=('BUFND=4','BUFNI=8')                                00032306
//P13F595F  DD DSN=&&F595ECFD,DISP=(,PASS),                             00032606
//             UNIT=SYSDA,                                              00034406
//             SPACE=(CYL,(50,10),RLSE),                                00032706
//             DCB=(RECFM=FB,LRECL=500)                                 00032806
//P13F595N  DD DSN=&&F595ECNO,DISP=(,PASS),                             00032906
//             UNIT=SYSDA,                                              00034406
//             SPACE=(CYL,(180,50),RLSE),                               00033006
//             DCB=(RECFM=FB,LRECL=500)                                 00033106
//SYSPRINT  DD SYSOUT=*                                                 00033206
//SYSDBG    DD SYSOUT=*                                                 00033306
//SYSDBOUT  DD SYSOUT=*                                                 00033406
//SYSOUT    DD SYSOUT=*                                                 00033506
//*-------------------------------------------------------------------* 00033606
//* MATCH PPOS BYPASS PPOS CODE                                         00033606
//*-------------------------------------------------------------------* 00033606
//*STEP05   EXEC PGM=BP13CD86,COND=(0,NE)                               00033706
//*BP13F595  DD DSN=&&F595ECNO,DISP=(OLD,PASS)                          00033806
//*BR10K010 DD DSN=BR10.K010.PTEPPTY.INET,DISP=SHR,                     00033906
//*            AMP=('BUFND=4','BUFNI=8')                                00034006
//*BR10K080 DD DSN=BR10.K080.PTEPPTY.HIST.INET,DISP=SHR,                00034106
//*            AMP=('BUFND=4','BUFNI=8')                                00034206
//*BP13K730 DD DUMMY                                                    00034306
//*P13F595F DD DSN=&&F595PPOF,DISP=(,PASS),                             00034306
//*            UNIT=SYSDA,                                              00034406
//*            DCB=(RECFM=FB,LRECL=500),                                00034406
//*            SPACE=(CYL,(20,10),RLSE)                                 00034506
//*P13F595N DD DSN=&&F595NOPO,DISP=(,PASS),                             00034306
//*            UNIT=SYSDA,                                              00034406
//*            DCB=(RECFM=FB,LRECL=500),                                00034406
//*            SPACE=(CYL,(180,50),RLSE)                                00034506
//*SYSOUT   DD SYSOUT=*                                                 00034906
//*SYSTSPRT DD SYSOUT=*                                                 00035006
//*SYSPRINT DD SYSOUT=*                                                 00035106
//*SYSDBG   DD SYSOUT=*                                                 00035206
//*SYSDBOUT DD SYSOUT=*                                                 00035306
//*--------------------------------------------------------------------         
//* CHECK SMS ON BUYING FLAT AFTER NEW BE/BTO APPLICATION                       
//*--------------------------------------------------------------------         
//STEP05   EXEC  PGM=BP13C993,COND=(0,NE)                                       
//BP13F595 DD DSN=&&F595ECNO,DISP=(OLD,PASS)                            00000310
//AB03K080 DD DSN=AB03.K080.UINACC.INET,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST.INET,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595F DD DSN=BP13.F595.SMSFD.AY0J,DISP=OLD,                        00000310
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(150,30),RLSE)                                            
//P13F595N DD DSN=BP13.F595.SMSNOTFD.AY0J,DISP=OLD,                     00000310
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(180,50),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT BY BK CNT/BK TAG/BE CNT/BTO CNT                                        
//* INCLUDE BK_TAG = 'N' AFTER BP13K595 CHECK                                   
//* BYPASS SA FLAT                                                              
//*------------------------------------------------------------------           
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.SMSNOTFD.AY0J,DISP=SHR                               
//SORTOUT DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0J,DISP=OLD,                        
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=500),                                             
//        SPACE=(CYL,(180,30),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(467,2,A,469,1,A,465,2,A,467,1,A),FORMAT=CH                      
   INCLUDE COND=(469,1,CH,EQ,C'N',AND,                                          
                 211,2,CH,NE,C'1A',AND,                                         
                 211,2,CH,NE,C'SP')                                             
