//BP13A213 JOB (BP13P),'BP13A213',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM      LINECT=0                                                         
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR PRINTING OF 1. APPOINTMENT LETTER                           
//*                             2. MCPS LETTER (FOR MCP CASES ONLY)             
//*                             3. INTERNET APPLICATION FORM                    
//*                             4. PENDING DOC                                  
//* FOR BE AND BTO ONLY                                                         
//******************************************************************            
//* BP133135 20070830 LMS  NEW JCL                                              
//* BP133147 20070927 LMS  INCL BP13K062                                        
//* BP133610 20090602 ESA1 TO REPLACE BP13K767 WITH BP13K816                    
//* BP133770 20091215 ESA1 TO ADD BP13K246 IN BP13C230                          
//*                        TO ADD BP13K246 & BP13K740 IN BP13C89D               
//* BP134043 20101103 ESA1 TO REPLACE BP13K816 WITH BP13K813 IN BP13C89D        
//* BP134320 20110729 ESA1 TO ADD BP13K76D IN BP13C89D & BP13C231               
//* BP134320 20110804 ESA1 TO DEL PROGRAM BP13C89C                              
//* BP136275 20160714 ESA1 TO ADD READING OF BP13K820 IN BP13C230               
//*=================================================================            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST11                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST12                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST13                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST14                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//* PRT05 :   1 COPY  SIMPLEX                 : ALLOCATION SECTION              
//*-----------------------------------------------------------------            
//PRT05  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
$DJDE$ JDE=13C230,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALST15                                   
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
/*                                                                              
//*=================================================================            
//* PRE-E CHECK AND CHECKLIST DETAILS - SUCCESSFUL                              
//*-----------------------------------------------------------------            
//PRT06    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C89E,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST16                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* INVITATION LETTER, MCPS, DOCUMENT, NON-DEL, APPLN LETTER (ORIG)             
//*-----------------------------------------------------------------            
//PRT0A    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* INVITATION LETTER,  DOCUMENT,  APPLN LETTER (FILE COPY)                     
//*-----------------------------------------------------------------            
//PRT0B    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* INVITATION LETTER, MCPS, DOCUMENT, NON-DEL, APPLN LETTER (ORIG)             
//*-----------------------------------------------------------------            
//PRT0C    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1C                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* INVITATION LETTER,  DOCUMENT,  APPLN LETTER (FILE COPY)                     
//*-----------------------------------------------------------------            
//PRT0D    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1D                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* INVITATION LETTER, MCPS, DOCUMENT, NON-DEL, APPLN LETTER (ORIG)             
//*-----------------------------------------------------------------            
//PRT0E    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1E                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* INVITATION LETTER,  DOCUMENT,  APPLN LETTER (FILE COPY)                     
//*-----------------------------------------------------------------            
//PRT0F    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1F                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* INVITATION LETTER, MCPS, DOCUMENT, NON-DEL, APPLN LETTER (ORIG)             
//*-----------------------------------------------------------------            
//PRT0G    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1G                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* INVITATION LETTER,  DOCUMENT,  APPLN LETTER (FILE COPY)                     
//*-----------------------------------------------------------------            
//PRT0H    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1H                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* INVITATION LETTER,  DOCUMENT,  APPLN LETTER (SOFTCOPY BROCHURE)             
//*-----------------------------------------------------------------            
//PRT0I    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1I                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//* INVITATION LETTER,  DOCUMENT,  APPLN LETTER (SOFTCOPY BROCHURE)             
//*-----------------------------------------------------------------            
//PRT0J    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C24X,COPIES=1,JDL=BP13,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1J                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* SORT THE CONTROL REC FOR THIS OPTION                                        
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(BLKSIZE=23440,LRECL=80,RECFM=FB)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=((14,2,CH,EQ,C'PA',AND,                                         
                 (60,3,CH,EQ,C'BE ',OR,                                         
                  60,3,CH,EQ,C'BTO'))                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT F200 BY ADTE/NT/FT/DTE-APPT/TIME/REGN                                  
//*-----------------------------------------------------------------            
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,5,A,50,6,A,14,8,A),FORMAT=CH                                  
/*                                                                              
//*-----------------------------------------------------------------            
//* CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE                 
//* CASES WITH SHORTLIST-QTR NOT THE SAME AS BALLOT-QTR.                        
//*-----------------------------------------------------------------            
//STEP03 EXEC    PGM=BP13C273,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L273 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT03.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* CHECK SOC MASTER FILE FOR CASES ALREADY ACCEPTED A FLAT.                    
//*-----------------------------------------------------------------            
//STEP04 EXEC    PGM=BP13C285,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L285 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT03.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE                 
//* CASES WITH DIFFERENT ZONE/NT/FT.                                            
//*-----------------------------------------------------------------            
//STEP05 EXEC    PGM=BP13C27A,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200C,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L27A DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT03.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT F200 BY ADTE/NT/FT/DTE-APPT/TIME/REGN                                  
//*-----------------------------------------------------------------            
//STEP06 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F200D,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F200E,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,13,A,38,12,A,57,5,A),FORMAT=CH                                
/*                                                                              
//*------------------------------------------------------------------*          
//* TO EXTRACT OUT SUCCESSFUL INTERNET CASES FOR BE                             
//*------------------------------------------------------------------*          
//STEP07 EXEC    PGM=BP13C797,COND=(0,NE)                                       
//BP13K740 DD  DSN=BP13.K740.BOOK,DISP=SHR                              00002980
//BP13K741 DD  DSN=BP13.K740.BOOK.PATH1,                                00003000
//             DISP=SHR                                                         
//BP13F200 DD  DSN=&&P13F200E,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F740 DD  DSN=&&BP13F740,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(21,12),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=500)                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//*  SORT BY REGISTRATION NUMBER AND SUCCESSFUL CASES                           
//*-----------------------------------------------------------------            
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F740,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F740A,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(80,30),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(260,1,CH,EQ,C'S',OR,                                            
                260,1,CH,EQ,C'R')                                               
//*-----------------------------------------------------------------            
//*  PRINT INVITATION LETTERS & APPLICATION FORMS (SUCCESSFUL)                  
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=BP13C89D,COND=(0,NE)                                        
//BP13F200 DD DUMMY                                                             
//BP13F740 DD DSN=&&P13F740A,DISP=(OLD,PASS)                                    
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                    
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                              
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13K062 DD DSN=BP13.K062.CODETBL,DISP=SHR                                    
//BP13K757 DD DSN=BP13.K757.BOOK,DISP=SHR                                       
//BP13K734 DD DSN=BP13.K734.INCOME,DISP=SHR                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                 
//BP13K246 DD DSN=BP13.K246.SBF.LOOKUP,DISP=SHR                                 
//BP13K740 DD DSN=BP13.K740.BOOK,DISP=SHR                                       
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                            
//BP13FP00 DD DSN=BP13.FP00.DOC,DISP=MOD                                        
//BP13FQ10 DD DSN=BP13.FQ10.DOC.TBL,DISP=MOD                                    
//P13P89DA DD SYSOUT=2,OUTPUT=(*.PRT0A.FORMID)                                  
//P13P89D1 DD SYSOUT=2,OUTPUT=(*.PRT0I.FORMID)                                  
//P13P89DB DD SYSOUT=2,OUTPUT=(*.PRT0B.FORMID)                                  
//P13P89DC DD SYSOUT=2,OUTPUT=(*.PRT0A.FORMID)                                  
//P13P89D2 DD SYSOUT=2,OUTPUT=(*.PRT0J.FORMID)                                  
//P13P89DD DD SYSOUT=2,OUTPUT=(*.PRT0B.FORMID)                                  
//P13L89DA DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L89DB DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  SORT BY REGISTRATION NUMBER AND SUCCESSFUL CASES                           
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F740,DISP=(SHR,DELETE)                                  
//SORTOUT  DD DSN=&&P13F740B,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(80,30),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(260,1,CH,EQ,C'S')                                               
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT THE REQUEST, SORTING IN ESTATE, FT, REGN NO            
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13C082,COND=(0,NE)                                        
//BP13F740 DD DSN=&&P13F740B,DISP=(OLD,DELETE)                                  
//BP13K825 DD DSN=BP13.K825.BOOK,DISP=SHR                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L082 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* PRINT THE APPENDIX B FOR THE SELECTION                                      
//*---------------------------------------------------------------------        
//STEP13 EXEC    PGM=BP13C230,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13F200 DD  DSN=&&P13F200E,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K246 DD  DSN=BP13.K246.SBF.LOOKUP,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13L230 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT05.FORMID)                                          
//BP13L23A DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT05.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//* PRINT ATTENDANCE LIST                                                       
//*--------------------------------------------------------------------         
//STEP14 EXEC    PGM=BP13C231,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F200 DD  DSN=&&P13F200E,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,                                    
//             DISP=SHR,                                                00002190
//             AMP=('BUFNI=8','BUFND=4')                                00002200
//BP13K246 DD DSN=BP13.K246.SBF.LOOKUP,                                         
//             DISP=SHR,                                                00002190
//             AMP=('BUFNI=8','BUFND=4')                                00002200
//BP13L231 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT05.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*--------------------------------------------------------------------         
//STEP15 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A212                                                                
//*---------------------------------------------------------------------        
