//BP13D801 JOB (BP13P),'BP13D801',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*================================================================*            
//* RUN AT 1430 AND 1830HRS DAILY                                  *            
//*================================================================*            
//*  DO NOT CHANGE STEP NUMBER !!!                                 *            
//*                                                                *            
//*  THIS JOB                                                      *            
//*  1) EMAIL BO TO ALLOW VIEWING OF RP AND ST FLATS               *            
//*                                                                *            
//*=================================================================            
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP135171 RJE1 20140211 TO CATER FOR DB2 UPGRADE                             
//*-------------------------------------------------------------------          
//* SORT BP13F310 FOR 'AI' AND 'AS' TRANS CODES                                 
//*-----------------------------------------------------------------            
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&F310C515,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(TRK,(30,15),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=((9,2,CH,EQ,C'AI',OR,                                          
                  9,2,CH,EQ,C'AS'),AND,                                         
                  (17,11,CH,NE,C'           '))                                 
/*                                                                              
//*-----------------------------------------------------------------            
//* GENERATE EMAIL DATASET ON VIEWING OF RP AND ST FLATS                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&F310C515,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13MAIL DD DSN=BP13.MAILOUT.C515,DISP=OLD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C515) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL TO BO                                                 
//*-----------------------------------------------------------------            
//STEP03   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.C515,DISP=SHR                                    
/*                                                                              
//*=================================================================            
//* END JOB BP13D801                                                            
//*=================================================================            
