//BP13D808 JOB (BP13P),'BP13D808',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB08605
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*====================================================================         
//*  SEND SMS AND EMAIL NOTIFICATION FOR SELF BOOKING CASES                     
//*====================================================================         
//* CHG REF  BY   ON        DESCRIPTION                                         
//* -------- ---  ------    -----------                                         
//* BP136580 KSJ3 20170109  NEW JCL                                             
//* BP137207 EL27 20180326  ADD RPT FOR SERS EINV, TO BE REMOVED LATER          
//* BP137234 ESA1 20180420  ADD BP13C27N TO SEND EMAIL BP13.L290.SERSRPT        
//* BP137255 ESA1 20180504  TO SEND BP13.L290.SERSRPTAS A ZIP FILE              
//* BP138198 PP11 20200213  TO INCREASE THE SPILITING BY 33%                    
//* BP138330 PP11 20200605  TO INCLUDE THE STEP TO SEND SMS FOR APPL TYP        
//*                         W2 W3 W4                                            
//* BP138201 KR13 20200703  IOMS CHANGES.                                       
//* BP138926 PP11 20220928  CONVERT AUTOMATED SMS INTO XML FORMAT               
//*====================================================================         
//*--------------------------------------------------------------------         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                            
//*  PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGM TEAM)                        
//*--------------------------------------------------------------------         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* DELETE THE TEMP DATA SETS                                                   
//*-------------------------------------------------------------------*         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL (BP13.F203.ASMS.W1.XML01)                                              
     DEL (BP13.F203.ASMS.W1.XML02)                                              
     DEL (BP13.F203.ASMS.W1.XML03)                                              
     DEL (BP13.F203.ASMS.W1.XML04)                                              
     DEL (BP13.F203.ASMS.W1.XML05)                                              
     DEL (BP13.BULKSMS.FILEIN.W1)                                               
     DEL (BP13.BULKSMS.FILEIN.W1.FTP)                                           
     DEL (BP13.F203.W1.FTP)                                                     
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* DEFINE TEMP DATA SETS                                                       
//*-------------------------------------------------------------------*         
//STEP00A  EXEC PGM=IEFBR14,COND=(0,NE)                                         
//F203001   DD  DSN=BP13.F203.ASMS.W1.XML01,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203002   DD  DSN=BP13.F203.ASMS.W1.XML02,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203003   DD  DSN=BP13.F203.ASMS.W1.XML03,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203004   DD  DSN=BP13.F203.ASMS.W1.XML04,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203005   DD  DSN=BP13.F203.ASMS.W1.XML05,                                    
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                              
/*                                                                              
//F203006   DD  DSN=BP13.BULKSMS.FILEIN.W1,                                     
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
/*                                                                              
//F203007   DD  DSN=BP13.BULKSMS.FILEIN.W1.FTP,                                 
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
/*                                                                              
//F203008   DD  DSN=BP13.F203.W1.FTP,                                           
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                              
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT QUEUE BY DATE AND TIME CREATED                                         
//*--------------------------------------------------------------------         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KC25.SELFLIST.QUEUE,DISP=SHR                             
//SORTOUT  DD DSN=&&BP13FC25,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                               
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
/*                                                                              
//*--------------------------------------------------------------------         
//* EXTRACT SUCCESSFUL REGNS TO BE NOTIFIED OF SELF BOOKING                     
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IKJEFT01,COND=(0,NE),REGION=4096K,                          
//            DYNAMNBR=20                                                       
//BP13FC25 DD DSN=&&BP13FC25,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K435 DD DSN=BP13.K435.KEY.BORROW,DISP=SHR                                 
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13F203 DD DSN=BP13.F203.SMS.SBK,DISP=OLD                                    
//BP13F23B DD DSN=BP13.F23B.EMAIL.SBK,DISP=OLD                                  
//BP13FC2A DD DSN=BP13.FC25.SELFLIST.Q.SENT,DISP=OLD                            
//BP13L45E DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C45E) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT SMS FILE                                                               
//*--------------------------------------------------------------------         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F203.SMS.SBK,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F203,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(TRK,(15,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(12,8,A),FORMAT=CH                                               
   INCLUDE COND=(9,2,CH,EQ,C'W1')                                               
/*                                                                              
//*-------------------------------------------------------------------*         
//* RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND AUTOMATED SMS            
//* APPT TYPE = (W1)                                                            
//*--------------------------------------------------------------------         
//*=====================================================================        
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                            
//*=====================================================================        
//STEP04    EXEC PGM=BP13CFB6,COND=(0,NE)                                       
//BP13F203  DD DSN=&&BP13F203,DISP=(SHR,PASS)                                   
//BP13K209  DD DSN=BP13.K209.SMS.MSG,DISP=SHR                                   
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                                   
//B13F203A  DD DSN=BP13.F203.ASMS.W1.XML01,DISP=SHR                             
//B13F203B  DD DSN=BP13.F203.ASMS.W1.XML02,DISP=SHR                             
//B13F203C  DD DSN=BP13.F203.ASMS.W1.XML03,DISP=SHR                             
//B13F203D  DD DSN=BP13.F203.ASMS.W1.XML04,DISP=SHR                             
//B13F203E  DD DSN=BP13.F203.ASMS.W1.XML05,DISP=SHR                             
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
/*                                                                              
//**********************************************************************        
//* FTP FILE(S) THAT ARE NOT EMPTY                                              
//**********************************************************************        
//STEP04A EXEC PGM=IDCAMS,COND=(0,NE,STEP04)                                    
//SYSPRINT DD SYSOUT=*                                                          
//FILE1 DD DSN=BP13.F203.ASMS.W1.XML01,DISP=SHR                                 
//SYSUDUMP DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  PRINT INFILE(FILE1) -                                                         
  DUMP COUNT(1)                                                                 
  IF LASTCC EQ 4 THEN SET MAXCC=1                                               
/*                                                                              
//STARTIF IF (STEP04A.RC = 0) THEN                                              
//**********************************************************************        
//*          GENERATE THE FILELIST DATASET                                      
//**********************************************************************        
//STEP04B   EXEC SAS,COND=(0,NE,STEP04A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FILELST   DD  DSN=BP13.BULKSMS.FILEIN.W1,DISP=SHR                             
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FILELST;                                                                   
TDAY=DATE();                                                                    
   PUT @001 "BP13A20"                                                           
       @008 TDAY   YYMMDD6.                                                     
       @014 '0800000001.xml';                                                   
//**********************************************************************        
//*          GENERATE THE CURRENT FTP DATE FILE                                 
//**********************************************************************        
//STEP04C   EXEC SAS,COND=(0,NE,STEP04A)                                        
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.F203.W1.FTP,DISP=OLD                                   
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "PUT 'BP13.F203.ASMS.W1.XML01' BP13A20"                             
       @041 TDAY   YYMMDD6.                                                     
       @047 '0800000001.xml';                                                   
   PUT @001 'quit';                                                             
//FTP001   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.F203.W1.FTP,DISP=OLD                                     
/*                                                                              
//STOPIF   ENDIF                                                                
/*                                                                              
//*--------------------------------------------------------------------         
//*          FTP TO BulkSMS-File-List.txt                                       
//*--------------------------------------------------------------------         
//STEP05    EXEC SAS,COND=(0,NE,STEP04)                                         
//WORK      DD  UNIT=SYSDA,SPACE=(CYL,(150,10))                                 
//FTPDATE   DD  DSN=BP13.BULKSMS.FILEIN.W1.FTP,DISP=OLD                         
//SYSPRINT  DD  SYSOUT=*                                                        
//SYSIN     DD  *                                                               
DATA _NULLS_;                                                                   
FILE FTPDATE;                                                                   
TDAY=DATE();                                                                    
   PUT @001 'cd /prod/appn/data/BP13/from-hdb/BULKSMS';                         
   PUT @001 "PUT 'BP13.BULKSMS.FILEIN.W1' BULKSMS-FILE-LIST.TXT";               
   PUT @001 'QUIT';                                                             
//FTP013   EXEC FTP,PARM='LANSFTPP01   (EXIT'                                   
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.BULKSMS.FILEIN.W1.FTP,DISP=OLD                           
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT EMAIL FILE                                                             
//*--------------------------------------------------------------------         
//STEP06   EXEC SORT,COND=(0,NE,STEP04)                                         
//SORTIN   DD DSN=BP13.F23B.EMAIL.SBK,DISP=SHR                                  
//SORTOUT  DD DSN=&&BP13F23B,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(TRK,(15,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(9,2,CH,EQ,C'W1')                                               
/*                                                                              
//*--------------------------------------------------------------------         
//* RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND TO THE MESSAGE           
//* QUEUE (BY EMAIL) APPT TYPE = (W1)                                           
//*--------------------------------------------------------------------         
//STEP07   EXEC MQBATCH,NAME=BP13CS12,COND=(0,NE,STEP04)                        
//STEPLIB  DD                                                                   
//         DD                                                                   
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//BP13F23B DD DSN=&&BP13F23B,DISP=(OLD,DELETE)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                                  
/*                                                                              
//*--------------------------------------------------------------------         
//* BACKUP FILES                                                                
//*--------------------------------------------------------------------         
//STEP99   EXEC PGM=IDCAMS,COND=(0,NE,STEP04)                                   
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FC25.SELFLIST.Q.SENT,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.FC25.SELFLIST.Q.ACCUM,DISP=MOD                           
//*                                                                             
//INPUT2   DD DSN=BP13.FC25.SELFLIST.Q.SENT,DISP=SHR                            
//OUTPUT2  DD DSN=BP13.FC25.SELFLIST.Q.DAILY(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(1,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                       
//*                                                                             
//INPUT3   DD DSN=BP13.KC25.SELFLIST.QUEUE,DISP=SHR,                            
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.FC25.SELFLIST.QUEUE.DAILY(+1),DISP=(NEW,CATLG),          
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                        
   REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                        
   REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                        
/*                                                                              
//*====================================================================         
//*                        E N D   O F   J O B                                  
//*====================================================================         
