//BP13A979 JOB (BP13P),'BP13A979',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//*=====================================================================00000050
//* TO PREPARE FILE FOR COMPUTER BALLOTING (BALLOTING EXERCISE)         00000060
//*=====================================================================00000110
//*-------------------------------------------------------------        00000120
//* CHGE REQ  BY     DATE    DESCRIPTION                                00000130
//* -------- ---- -------- -------------------------------------        00000140
//* BP132360  LMS  20030603 TO PREPARE FILE FOR COMPUTER BALLOT         00000150
//* BP132360  CKK  20031030 TO INCREASE TEMP SPACE                      00000150
//* BP133438  IL5  20080913 ADD STEP TO READ FROM F100.NEWFLAT                  
//* BP133438  IL5  20080913 ADD STEP TO READ FROM F100.NEWFLAT                  
//* BP133718  IL5  20090922 TO SORT OUT 'SBF' INSTEAD OF 'BE' (STEP 1)          
//* BP134076  IL5  20101110 TO OUTREC NEWFIELDS (STEP 7)                        
//* BP135171  RJE1 20140210 TO CATER FOR DB2 UPGRADE                            
//*-------------------------------------------------------------        00000160
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                   00000170
//*---------------------------------------------------------------------00000180
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                               00000190
//SYSUT1   DD  *                                                        00000200
$DJDE$ JDE=BP13D,COPIES=1,JDL=BP13,END;                                         
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                           00000210
//SYSUT2   DD  SYSOUT=2,                                                00000220
//             OUTPUT=(*.FORMID)                                        00000230
//SYSPRINT DD  SYSOUT=*                                                 00000240
//SYSIN    DD  DUMMY                                                    00000250
/*                                                                      00000260
//*---------------------------------------------------------------------00000990
//* SORT ON THE BASIS OF NUM-SELECTION                                  00000280
//* FILTER NUM-ALLOCN-QTR > 0 & NUM-SELECTION NOT = SPACES              00000290
//*---------------------------------------------------------------------00000990
//STEP01 EXEC    SORT,COND=(0,NE)                                       00000310
//SORTIN   DD  DSN=BM06.K110.FLATINV,                                   00000320
//             DISP=SHR                                                 00000330
//SORTOUT  DD  DSN=&&BM06F110,                                          00000340
//             DISP=(,PASS),                                            00000350
//             UNIT=SYSDA,                                              00000360
//             SPACE=(CYL,(40,20),RLSE),                                00000370
//             DCB=(RECFM=FB,LRECL=500)                                 00000380
//SYSIN    DD  *                                                        00000390
      SORT FIELDS=(356,3,A),FORMAT=CH                                           
      INCLUDE COND=(356,3,CH,EQ,C'SBF')                                         
//*   INCLUDE COND=(356,3,CH,EQ,C'BE ')                                         
//*---------------------------------------------------------------------00000990
//* TO EXTRACT UNITS FROM FIS FILE                                      00000410
//*---------------------------------------------------------------------00000990
//STEP02 EXEC    PGM=IKJEFT01,COND=(0,NE),                              00000430
//             REGION=4096K,                                            00000440
//             DYNAMNBR=20                                              00000450
//BP13K703 DD  DSN=BP13.K703.SOCDATE,                                   00000460
//             DISP=SHR                                                 00000470
//BM06F110 DD  DSN=&&BM06F110,                                          00000480
//             DISP=(SHR,PASS)                                          00000490
//M06F110A DD  DSN=&&M06F110A,                                          00000500
//             DISP=(,PASS),                                            00000510
//             UNIT=SYSDA,                                              00000520
//             SPACE=(CYL,(40,20),RLSE),                                00000530
//             DCB=(RECFM=FB,LRECL=500)                                 00000540
//SYSTSPRT DD  SYSOUT=*                                                 00000550
//SYSPRINT DD  SYSOUT=*                                                 00000560
//SYSUDUMP DD  SYSOUT=*                                                 00000570
//SYSOUT   DD  SYSOUT=*                                                 00000580
//SYSDBOUT DD  SYSOUT=*                                                 00000590
//SYSABOUT DD  SYSOUT=*                                                 00000600
//SYSTSIN  DD  *                                                        00000610
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C962) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                      00000620
//*---------------------------------------------------------------------00000990
//* TO SORT RECORDS BY HDB-REF                                          00000640
//*---------------------------------------------------------------------00000990
//STEP03 EXEC    SORT,COND=(0,NE)                                       00000660
//SORTIN   DD  DSN=&&M06F110A,                                          00000670
//             DISP=(SHR,PASS)                                          00000680
//SORTOUT  DD  DSN=&&M06F110B,                                          00000690
//             DISP=(,PASS),                                            00000700
//             UNIT=SYSDA,                                              00000710
//             SPACE=(CYL,(40,20),RLSE),                                00000720
//             DCB=(RECFM=FB,LRECL=500)                                 00000730
//SYSIN    DD  *                                                        00000740
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
//*---------------------------------------------------------------------00000990
//* TO SORT RECORDS BY HDB-REF                                          00000760
//*---------------------------------------------------------------------00000990
//STEP04 EXEC    SORT,COND=(0,NE)                                       00000780
//SORTIN   DD  DSN=BM06.F120.FLATINV.PIDB,                              00000790
//             DISP=SHR                                                 00000800
//SORTOUT  DD  DSN=&&BM06F120,                                          00000810
//             DISP=(,PASS),                                            00000820
//             UNIT=SYSDA,                                              00000830
//             SPACE=(CYL,(80,45),RLSE),                                00000840
//             DCB=(RECFM=FB,LRECL=700)                                 00000850
//SYSIN    DD  *                                                        00000860
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
//*---------------------------------------------------------------------00000990
//* TO PRINT REPORT ON DETAILS OF FLATS FOR APPORTIONMENT               00000880
//*---------------------------------------------------------------------00000990
//STEP05 EXEC    PGM=BP13C963,COND=(0,NE)                               00000900
//BM06F110 DD  DSN=&&M06F110B,                                          00000910
//             DISP=(SHR,PASS)                                          00000920
//BM06F120 DD  DSN=&&BM06F120,                                          00000930
//             DISP=(SHR,PASS)                                          00000940
//BP13F100 DD  DSN=&&P13F100A,                                          00000930
//             DISP=(,PASS),                                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(80,45),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800)                                         
//SYSOUT   DD  SYSOUT=*                                                 00000970
//SYSPRINT DD  SYSOUT=*                                                 00000980
//*---------------------------------------------------------------------        
//* TO SORT RECORDS BY HDB-REF. CONTAIN ONLY EXISTING FLATS                     
//*---------------------------------------------------------------------        
//STEP06 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F100A,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F100B,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(80,45),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800)                                         
//SYSIN    DD  *                                                                
       SORT FIELDS=(67,5,A,108,6,A),FORMAT=CH                                   
       OUTREC FIELDS=(108,6,67,5,12,788)                                        
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//* TO SORT RECORDS BY HDB-REF. OUTREC UNIT NO + BLK AS HDB-REF                 
//* BP133288 - OLD SORT (1,5,A,6,2,A,8,4,A)                                     
//*---------------------------------------------------------------------        
//STEP07 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F100.NEWFLAT,DISP=SHR                                   
//SORTOUT  DD  DSN=&&P13F100C,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(80,45),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800)                                         
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     OUTREC FIELDS=(6,2,8,4,1,5,44X,                                            
                    12,3,15,4,19,4,1,5,23,2,34X,                                
                    6,2,8,4,3X,                                                 
                    25,3,28,3,31,3,34,6,669X)                                   
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//* TO SORT RECORDS BY HDB-REF. CONTAIN BOTH NEW AND EXISTING FLATS             
//*---------------------------------------------------------------------        
//STEP08 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F100B,DISP=(SHR,PASS)                                   
//         DD  DSN=&&P13F100C,DISP=(SHR,PASS)                                   
//SORTOUT  DD  DSN=&&P13F100D,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(80,45),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800)                                         
//SYSIN    DD  *                                                                
        SORT FIELDS=(1,11,A),FORMAT=CH                                          
//*--------------------------------------------------------------------         
//* TO SORT RECORDS BY HDB-REF AND TO WRITE TO FLAT LIST                        
//*--------------------------------------------------------------------         
//STEP09 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F100D,DISP=(SHR,PASS)                                   
//SORTOUT  DD  DSN=BP13.F100.FLATLIST,DISP=SHR                                  
//SYSIN    DD  *                                                                
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     SUM FIELDS=NONE                                                            
//*---------------------------------------------------------------------00001350
//* TO PRINT REPORT ON DETAILS OF FLATS FOR APPORTIONMENT               00001360
//*---------------------------------------------------------------------00001370
//STEP10 EXEC    SAS,COND=(0,NE)                                        00001380
//WORK     DD  UNIT=SYSDA,                                              00001390
//             SPACE=(CYL,(10,5))                                       00001400
//FT42F001 DD  SYSOUT=2,                                                00001410
//             OUTPUT=(*.PRT01.FORMID)                                          
//P13F100A DD  DSN=BP13.F100.FLATLIST,                                  00001430
//             DISP=SHR                                                 00001440
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S903),                            00001450
//             DISP=SHR                                                 00001460
//*---------------------------------------------------------------------00000990
//* END OF JOB BP13A979                                                 00001000
//*---------------------------------------------------------------------00001010
