//BP13A568 JOB (BP13P),'BP13A568',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*                                                                             
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K752.OTBUIN,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K225.QUEUE,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13K752                                                   *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K752.OTBUIN,DISP=SHR                             00512000
//OUTPUT1  DD DSN=BP13.F752.BTOUIN,DISP=SHR                                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1) REPLACE                              
//*                                                                             
//*--------------------------------------------------------------------*        
//* UPDATE BP13K752                                                    *        
//*--------------------------------------------------------------------*        
//STEP02  EXEC PGM=BP13C838,COND=(0,NE)                                         
//BP13F200 DD DSN=BP13.F200.APPOINT.WIS,DISP=SHR                                
//BP13K752 DD DSN=BP13.K752.OTBUIN,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* TO SORT OUT DETAIL RECORDS                                                  
//*---------------------------------------------------------------------        
//STEP03 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F225.BP13A562,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F225F,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=150,RECFM=FB)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,5,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* TO ADD/REPLACE RECORDS IN BP13.K225.QUEUE                                   
//*---------------------------------------------------------------------        
//STEP04 EXEC    PGM=BP13C22F,COND=(0,NE)                                       
//BP13F225  DD DSN=&&P13F225F,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13K225  DD DSN=BP13.K225.QUEUE,DISP=OLD                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------00001630
//* BACKUP FILES BEFORE DELETE                                          00001640
//*---------------------------------------------------------------------00001670
//STEP05  EXEC    SORT,COND=(0,NE)                                      00001680
//SORTIN   DD  DSN=BP13.F225.BP13A562,                                  00001690
//             DISP=SHR                                                 00001700
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001710
//             DISP=MOD                                                 00001720
//SYSIN    DD  *                                                        00001760
    SORT FIELDS=(1,150,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F225',C'UPDATE',1,150,C'BP13A562',28X)                 
/*                                                                      00001770
