//BP13A268  JOB (BP13P),'BP13A268',CLASS=I,MSGCLASS=N,                          
//      MSGLEVEL=(1,1),NOTIFY=CSD0071                                           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* CREATE ADDITIONAL QUEUE NUMBERS IN BP13K225                                 
//*=================================================================            
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K225.QUEUE,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------            
//* SORT OUT BP13K205 RECORD                                                    
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13F205,DISP=(NEW,PASS),                                    
//            SPACE=(TRK,(1,1),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
    SORT FIELDS=COPY                                                            
    INCLUDE COND=(14,2,CH,EQ,C'QN')                                             
//*-----------------------------------------------------------------            
//* SORT OUT BP13K223 RECORDS                                                   
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C23I,COND=(0,NE)                                        
//BP13K223 DD DSN=BP13.K223.APPMT,DISP=SHR                                      
//BP13F205 DD DSN=&&P13F205,DISP=(SHR,DELETE)                                   
//BP13F223 DD DSN=&&P13F223,DISP=(NEW,PASS),                                    
//            SPACE=(CYL,(5,5),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* CREATE BP13K225 QUEUE NOS FROM BP13F223 APPMT SCHEDULES                     
//*-----------------------------------------------------------------            
//STEP03  EXEC PGM=BP13C21M                                                     
//BP13F223  DD DSN=&&P13F223,DISP=(SHR,DELETE)                                  
//BP13K225  DD DSN=BP13.K225.QUEUE,DISP=SHR                                     
//BP13K221  DD DSN=BP13.K225.QUEUE.PATH1,DISP=SHR                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
