//BP13A592 JOB (BP13P),'BP13A592',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* ASSIGN REGN-NO FOR REN CASES                                                
//* NEW JCL SIMILAR TO BP13A593,                                                
//* BP13A592 - SORT BY ZONE/FT/BO-CODE/RANDOM-NO, FOR EXERCISE WHERE            
//*     A FEW ESTATES BALLOT AT THE SAME TIME BUT BOOKING SEPARATELY            
//* BP13A593 - SORT BY ZONE/FT/RANDOM-NO                                        
//******************************************************************            
//* CHG REF  BY  DATE     DESCRIPTION                                           
//* -------- ------------------------                                           
//* BP130949 LSB 001113 - NEW JCL                                               
//* BP132317 JF4 030324 - BTO CHANGES FOR BP13C512 AND BP13C514                 
//* BP132412 MJ16031015 - INCLUDE FILE BP13K703 IN PGM BP13C514                 
//* BP132818 BA3 060126 - TO CHANGE SORTING OF REF NO FROM 6 BYTES              
//*                       TO 8 BYTES.                                           
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET                                                                    
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT02 : COPIES = 1  SIMPLEX   FOR ALLOCATION SECTION                       
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13S,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL1                                      
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT03 : COPIES = 1  SIMPLEX   FOR RENTAL HOUSING ALLOCATION                
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13S,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WS1,GROUPID=HARHRA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K830.ADDR,DISP=OLD                                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//*---------------------------------------------------------------------        
//*-  REPRO REGN NO FILE TO SEQ FILE                                            
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=SHR,                                   
//            AMP=('BUFND=12')                                                  
//OUTPUT1  DD DSN=BP13.F530.ISSUENO,DISP=OLD                                    
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*-  REPRO BALLOT FILE TO SEQ FILE                                             
//*---------------------------------------------------------------------        
//STEP03 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F740.MATUREBA.DAILY(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(30,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* SORT BY NT/FT/RANKING/REGN-NO, ONLY WITH RANKING                            
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(50,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,256,2,A,10,19,A),FORMAT=CH                    
     INCLUDE COND=(123,1,CH,EQ,C'Q',AND,253,1,CH,NE,C' ')                       
//*---------------------------------------------------------------------        
//* SORT BY NT/FT/RANKING/REGN-NO, WITHOUT RANKING                              
//*---------------------------------------------------------------------        
//STEP4A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740SUCC,DISP=(MOD,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(50,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,256,2,A,10,19,A),FORMAT=CH                    
     INCLUDE COND=(123,1,CH,EQ,C'Q',AND,253,1,CH,EQ,C' ')                       
//*---------------------------------------------------------------------        
//* TO ASSIGN REGN NUMBER TO SUCCESSFUL CASES AFTER BALLOTING                   
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13C512,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K530 DD DSN=BP13.K530.ISSUENO,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L512 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT IN SUCC NEW TOWN,FLAT TYPE AND REGISTRATION NUMBER                     
//* INCLUDE WITH RANKING CASES                                                  
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,256,2,A,10,19,A),FORMAT=CH                    
     INCLUDE COND=(33,1,CH,EQ,C'Q',AND,253,1,CH,NE,C' ')                        
//*---------------------------------------------------------------------        
//* SORT IN SUCC NEW TOWN,FLAT TYPE AND REGISTRATION NUMBER                     
//* INCLUDE WITHOUT RANKING CASES                                               
//*---------------------------------------------------------------------        
//STEP6A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740REGN,DISP=(MOD,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(16,5),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,256,2,A,10,19,A),FORMAT=CH                    
     INCLUDE COND=(33,1,CH,EQ,C'Q',AND,253,1,CH,EQ,C' ')                        
//*---------------------------------------------------------------------        
//*  TO PRINT SUCESSFUL REQUEST ASSIGNED WITH REGISTRATION NO.                  
//*  TO ASSIGN QUEUE NO BASED ON NT,FT,REG NO.                                  
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C514,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740REGN,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L514 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//STEP08   EXEC SAS,COND=(0,NE)                                                 
//BP13K520 DD DSN=&&F740REGN,DISP=(OLD,PASS)                                    
//BP13L536 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S536),DISP=SHR                             
//*---------------------------------------------------------------------        
//STEP09   EXEC SAS,COND=(0,NE)                                                 
//BP13K520 DD DSN=&&F740REGN,DISP=(OLD,PASS)                                    
//BP13L535 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S535),DISP=SHR                             
//*                                                                             
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F800REN,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(10,2),RLSE)                                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(57,3,CH,EQ,C'REA',OR,                                           
                57,3,CH,EQ,C'RED',OR,                                           
                57,3,CH,EQ,C'REE',OR,                                           
                57,3,CH,EQ,C'REN',OR,                                           
                57,3,CH,EQ,C'RES')                                              
//*-----------------------------------------------------------------            
//STEP11   EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(600,100),,,ROUND)                          
//BP13F800 DD DSN=&&F800REN,DISP=(OLD,PASS)                                     
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//FT18F001 DD DSN=&&BP13L810,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//P13L810A DD DSN=&&P13L810A,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,15),RLSE),                              
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S810),DISP=SHR                             
//*---------------------------------------------------------------------        
//* REPORT TO ALLOCATION SECTION (SALES UNIT)                                   
//*---------------------------------------------------------------------        
//STEP11A EXEC   PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L810,DISP=(OLD,PASS)                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//STEP11B EXEC   PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&P13L810A,DISP=(OLD,PASS)                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* REPORT TO RENTAL HOUSING ALLOCATION UNIT                                    
//*---------------------------------------------------------------------        
//STEP11C EXEC   PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&BP13L810,DISP=(OLD,PASS)                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.PRT03.FORMID)                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//STEP11D EXEC   PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=&&P13L810A,DISP=(OLD,PASS)                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.PRT03.FORMID)                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* END BP13A593                                                                
//*---------------------------------------------------------------------        
