//BP13D605 JOB (BP13P),'BP13D605',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* PROCESS BP27F340                                                            
//*=================================================================            
//* CHG REF  DATE     BY    DESCRIPTION                                         
//* -------- ----     ---   -----------                                         
//* BP135420 29102014 ESD1  NEW JCL                                             
//* BP135619 23012015 LJL1  TO ADD VERIFY STATEMENTS                            
//*                         BP13K800                                            
//*                         BP13K640                                            
//*                         BP13K820                                            
//*                         BP13K848                                            
//* BP136161 19042016 KSJ3  TO ADD BP13K410 AND BP13L3A2 TO BP13C3A2            
//* BP138014 03032020 LJL1  TO CATER FOR DA = Y CASES                           
//*=================================================================            
//*********************************************************************         
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                          
//*    PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGREEMENT TEAM)                
//*********************************************************************         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------                           
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------                           
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1    DD DSN=BP13.K800.APPLN,DISP=OLD                                     
//INPUT2    DD DSN=BP13.K820.OCCUP,DISP=OLD                                     
//INPUT3    DD DSN=BP13.K640.CA.ACTION,DISP=OLD                                 
//INPUT4    DD DSN=BP13.K848.BKIMAGE,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//*-----------------------------------------------------------------*           
//*SORT COPY BP27F340 TO ACCUM FILE                                             
//*-----------------------------------------------------------------*           
//STEP01   EXEC SORT                                                            
//SORTIN   DD DSN=BP27.F340.TRANS.CA2ND,DISP=SHR                                
//SORTOUT  DD DSN=BP13.BP27.F340.ACCUM,DISP=MOD                                 
//SYSIN    DD *                                                                 
      SORT FIELDS=COPY                                                          
//*-----------------------------------------------------------------            
//*  UPDATE SOC FILES FOR CANCELLED/REJECTED/NOLOAN CASES.                      
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C3A2,COND=(0,NE)                                        
//BP27F340 DD DSN=BP27.F340.TRANS.CA2ND,DISP=SHR                                
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR                                  
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L3A2 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*EMPTY BP27.F340.TRANS.CA2ND                                                  
//*--------------------------------------------------------------------         
//STEP03  EXEC    PGM=IDCAMS,COND=(0,NE)                                        
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DUMMY                                                            
//OUTPUT1  DD  DSN=BP27.F340.TRANS.CA2ND,DISP=SHR                               
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K130.SOCHIST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K800.APPLN,DISP=OLD                              00002710
//INPUT3   DD DSN=BP13.K491.EMAIL.PCD,DISP=OLD                          00002710
//INPUT4   DD DSN=BP13.K493.EMAIL.PCD,DISP=OLD                          00002710
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//*===================================================================          
//**********************************************************************        
//*INTERFACE FILE TO LEAS FOR DEFER ASSESSMENT CASES                   *        
//**********************************************************************        
//STEP03   EXEC PGM=BP13C49I,COND=(0,NE)                                        
//BP27F386 DD DSN=BP27.BP13.F386.SOC.DA,DISP=SHR                                
//BP13K491 DD DSN=BP13.K491.EMAIL.PCD,DISP=SHR                                  
//BP13K493 DD DSN=BP13.K493.EMAIL.PCD,DISP=SHR                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* ****************************************************************//  00281002
//STEP04  EXEC PGM=SORT                                                 00282002
//SYSPRINT DD  SYSOUT=*                                                 00283002
//SYSOUT   DD  SYSOUT=*                                                 00284002
//SORTIN   DD  DSN=BP27.BP13.F386.SOC.DA,DISP=SHR                       00285002
//SORTOUT  DD  DSN=BP13.BP27.BP13.F386.SOC.DA,DISP=MOD                  00286002
//SYSIN    DD *                                                         00287002
     SORT FIELDS=COPY                                                   00288002
//*                                                                     00289002
//*-------------------------------------------------------------------- 00290002
//* EMPTY LEAS RETURN FILE FOR DA = Y                                 *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.EMPTY.CHAR300,DISP=OLD                                   
//OUTPUT2  DD DSN=BP27.BP13.F386.SOC.DA,DISP=OLD                                
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                  
//*                                                                             
