//BP13REVH JOB (BP13P),'BP13REVH',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//* JCL TO REVERT BALLOT FILE BP13K740 TO STATUS BEFORE BP13ACC6                
//*-------------------------------------------------------------                
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -----------------------------------------            
//* BP134413  IL5 20111208 NEW                                                  
//* BP134861 EAA1 20130430 EXPAND BP13K010 TO 600                               
//* BP135625 SMR2 20150122 CATER FOR 3P FLAT TYPE                               
//* BP135847 SMR2 20150625 DELETE DEFINE BP13K740 INSTEAD OF REPRO              
//* BP136296 IL5  20160728 UPDATE STEP RUNNING BP13C525                         
//* BP138301 AM25 20200604 HARDCOPY REPORTS CONVERSION                          
//*-----------------------------------------------------------------            
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K030.BALFLAT,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F010.TENDER.CC1,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT3   DD DSN=BP13.F765.WARDSRV.CC2,DISP=SHR                                
//OUTPUT3  DD DSN=BP13.K765.WARDSRV,DISP=OLD                                    
//INPUT4   DD DSN=BP13.F030.BALFLAT.CC1,DISP=SHR                                
//OUTPUT4  DD DSN=BP13.K030.BALFLAT,DISP=OLD                                    
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3) REPLACE                               
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4) REPLACE                               
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//*-----------------------------------------------------------------            
//STEP00A  EXEC SORT,COND=(0,NE)                                        00036100
//SORTIN   DD DSN=BP13.F740.PIGEON,DISP=SHR                             00036200
//SORTOUT  DD DSN=&&BP13F740,DISP=(,PASS),                              00036300
//            SPACE=(CYL,(50,20),RLSE),                                 00036400
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                    00036500
//SYSIN    DD *                                                         00036600
    SORT FIELDS=(1,28,A),FORMAT=CH                                      00036700
//*---------------------------------------------------------------------00041600
//* TO CREATE THE BALLOT FILE & TO ENSURE THAT NO DUPLICATE RANDOM NO   00041700
//* BY USING DEFINE VSAM BALLOT FILE                                    00041800
//*---------------------------------------------------------------------00041900
//STEP00B  EXEC PGM=IDCAMS,COND=(0,NE)                                  00042000
//SYSPRINT DD SYSOUT=*                                                  00042100
//INPUT    DD DSN=&&BP13F740,DISP=(OLD,DELETE)                          00042204
//SYSIN    DD *                                                         00042300
         DEL 'BP13.K740.MATUREBA' CL PURGE                                      
         DEF CL (NAME(BP13.K740.MATUREBA)        -                      00042400
                 CYL(36 5)                       -                      00042500
                 UNIQUE                          -                      00042600
                 SPEED                           -                      00042700
                 STORCLAS(PRODRLS)               -                      00042800
                 LOG(NONE)                       -                      00042900
                 SHR(2 3))                       -                      00043000
                 DATA                            -                      00043100
                 (NAME(BP13.K740.MATUREBA.DATA)  -                      00043200
                 KEYS(28 0)                      -                      00043300
                 RECSZ(500 500)                  -                      00043400
                 FSPC(10 10)                     -                      00043500
                 CISZ(4096))                                            00043600
         IF LASTCC = 0 THEN                      -                      00043700
           REPRO IFILE(INPUT)                    -                      00043800
                 ODS(BP13.K740.MATUREBA)                                00043900
//*-------------------------------------------------------------------- 00044000
//* TO CREATE PATH/ALTX FOR MATUREBA BALLOT FILE                        00045000
//*-------------------------------------------------------------------- 00046000
//STEP00C  EXEC PGM=IDCAMS,COND=(0,NE)                                  00047000
//SYSPRINT DD SYSOUT=*                                                  00048000
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR                           00049000
//SYSIN    DD *                                                         00050000
           DEF AIX (NAME(BP13.K740.MATUREBA.ALTX1)   -                  00060000
               REL(BP13.K740.MATUREBA)               -                  00070000
               REUSE                                 -                  00080000
               KEYS(8 122)                            -                 00090000
               SHR(2 3)                              -                  00100000
               NUNQK)                                -                  00110000
               DATA                                  -                  00120000
               (NAME(BP13.K740.MATUREBA.ALTX1.DATA) -                   00130000
               CYL(10 5)                              -                 00140000
               RECSZ(31 354)                         -                  00150000
               FSPC(10 10)                           -                  00160000
               CISZ(4096))                           -                  00170000
               INDEX                                 -                  00180000
               (NAME(BP13.K740.MATUREBA.ALTX1.INDEX) -                  00190000
               CISZ(4096))                                              00200000
         IF MAXCC = 0 THEN                           -                  00210000
           DEF PATH (NAME(BP13.K740.MATUREBA.PATH1) -                   00220000
               PENT(BP13.K740.MATUREBA.ALTX1))                          00230000
         IF MAXCC = 0 THEN                                              00240000
           BIX IDS(BP13.K740.MATUREBA)               -                  00250000
               ODS(BP13.K740.MATUREBA.ALTX1)                            00260000
//**************************************************************                
//* REPORT RUN BEFORE OR DURING SHORTLISTING                                    
//*-----------------------------------------------------------------            
//* SORT OUT 4,5,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010N,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP02    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010N,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 4,5,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010M,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1 ',OR,                                             
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'1A',OR,                                                      
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP04    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010M,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT OUT 3P FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING                  
//*-----------------------------------------------------------------            
//STEP05    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT   DD DSN=&&P13K010L,DISP=(,PASS),                                     
//             UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                           
//             DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                               
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3P')                                               
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP06    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010L,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*------------------------------------------------------------------           
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION FORM FOR COUNTER AND MAIL CASES                           
//* 3 DIFFERENT LETTERS DEPENDING ON MCPS OPTION                                
//*------------------------------------------------------------------           
//STEP09   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=8,DEST=IOM8                                                
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
                                                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
