//BP13M405 JOB (BP13P),'BP13M405',MSGLEVEL=(1,1),CLASS=I,MSGCLASS=N,            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*                                                                             
//*=================================================================            
//* DESCRIPTION : PUT MND FILE FROM MAINFRAME INTO                              
//*               IDEAL SERVER (FTP)                                            
//*                                                                             
//*     IDEAL FILENAME: TXT FORMAT                                              
//*     MAINFRAME DSN  : BP13.F405.SENTMND                                      
//*                                                                             
//*=================================================================            
//* DATE MOD  BY      REF      DESCRIPTION                                      
//* --------  ----  -------    -----------                                      
//* 15/07/19  KTM3  BP137827   NEW JCL                                          
//*=================================================================    00011200
//*--------------------------------------------------------------------*        
//*--------------------------------------------------------------------*        
//*  BACKUP THE SENTMND FILE INTO GDG AND ACCUM FILE                            
//*--------------------------------------------------------------------*        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F405.SENTMND,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F405.SENTMND.ACCUM,DISP=MOD                              
//OUTPUT2  DD DSN=BP13.F405.SENTMND.BKUP(+1),                                   
//            DISP=(NEW,CATLG,DELETE),DATACLAS=MULTIVOL,                        
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=500,RECFM=FB,DSORG=PS)              
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                       
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT2)                                       
//*--------------------------------------------------------------------*        
//******************************************************************            
//* RUN FTP STATEMENT TO PUT FILE FROM MAINFRAME                                
//* INTO IDEAL SERVER                                                           
//******************************************************************            
//FTPPUT   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  /PROD/APPN/DATA/BP13/FROM-HDB/MND                                         
  ASCII                                                                         
  PUT 'BP13.M405.SENTMND' MND_HDB_KI_LETTER.TXT                                 
  QUIT                                                                          
//*                                                                             
//*                                                                             
//*----------------------------------------------------------------*            
