//BP13D908 JOB (BP13P),'BP13D908',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//         NOTIFY=CSD0071                                               00020000
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030000
//*-----------------------------------------------------------------    00040000
//* DBSS WALK-IN-SELECTION UPDATE ACCEPTANCE                            00050000
//* DAILY JOB TO UPDATE BOOKING BASED ON DEVELOPER FILES                00060000
//*-------------------------------------------------------------------- 00070000
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                       00080000
//*-------------------------------------------------------------------- 00090000
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                   00100000
//INPUT1   DD DSN=BP13.KA20.BLOCK,DISP=OLD                              00110000
//INPUT2   DD DSN=BP13.KA30.UNIT,DISP=OLD                               00120000
//INPUT3   DD DSN=BP13.KA40.TRANS,DISP=OLD                              00130000
//INPUT4   DD DSN=BP13.KB78.DBSREQ,DISP=OLD                             00140000
//INPUT5   DD DSN=BP13.KB20.DBSBK,DISP=OLD                              00150000
//INPUT6   DD DSN=BP13.KB85.ISSUENO,DISP=OLD                            00160000
//SYSPRINT DD SYSOUT=*                                                  00170000
//SYSIN   DD *                                                          00180000
          VFY FILE(INPUT1)                                              00190000
          VFY FILE(INPUT2)                                              00200000
          VFY FILE(INPUT3)                                              00210000
          VFY FILE(INPUT4)                                              00220000
          VFY FILE(INPUT5)                                              00230000
          VFY FILE(INPUT6)                                              00240000
//*-----------------------------------------------------------------    00241001
//* SORT BP13FB62                                                       00242001
//*-----------------------------------------------------------------    00243001
//STEP0B   EXEC SORT,COND=(0,NE)                                        00244001
//SORTIN   DD DSN=BP13.FB62.FTPUNIT.FROMDEV,DISP=SHR                    00245001
//SORTOUT  DD DSN=&&BP13FB62,DISP=(NEW,PASS),                           00246001
//            DCB=(RECFM=FB,LRECL=180),                                 00247001
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE)                        00248001
//SYSIN    DD *                                                         00249001
      SORT FIELDS=(1,3,A,64,8,A),FORMAT=CH                              00249104
/*                                                                      00249201
//*-----------------------------------------------------------------    00249301
//* SORT BP13FB60                                                       00249401
//*-----------------------------------------------------------------    00249501
//STEP0C   EXEC SORT,COND=(0,NE)                                        00249601
//SORTIN   DD DSN=BP13.FB60.FTPREQ.FROMDEV,DISP=SHR                     00249701
//SORTOUT  DD DSN=&&BP13FB60,DISP=(NEW,PASS),                           00249801
//            DCB=(RECFM=FB,LRECL=2843),                                00249901
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE)                        00250001
//SYSIN    DD *                                                         00250101
      SORT FIELDS=(1,3,A,5,8,A),FORMAT=CH                               00250204
/*                                                                      00250301
//*-----------------------------------------------------------------    00251000
//* BACKUP FILES                                                        00260000
//*-----------------------------------------------------------------    00270000
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                  00280000
//SYSPRINT DD SYSOUT=*                                                  00290000
//INPUT1   DD DSN=BP13.FB60.FTPREQ.FROMDEV,DISP=SHR                     00300000
//OUTPUT1  DD DSN=BP13.FB60.FTPREQ.ACCUM,DISP=MOD                       00310000
//*                                                                     00320000
//INPUT2   DD DSN=BP13.FB61.FTPBLK.FROMDEV,DISP=SHR                     00330000
//OUTPUT2  DD DSN=BP13.FB61.FTPBLK.ACCUM,DISP=MOD                       00340000
//*                                                                     00350000
//INPUT3   DD DSN=BP13.FB62.FTPUNIT.FROMDEV,DISP=SHR                    00360000
//OUTPUT3  DD DSN=BP13.FB62.FTPUNIT.ACCUM,DISP=MOD                      00370000
//SYSIN    DD *                                                         00380000
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                             00390000
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                             00400000
     REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                             00410000
//*=================================================================    00420000
//* VALIDATE DEVELOPER BOOKING DATA, UPDATE BLOCK, OUTPUT VALID         00430000
//* BP13FA30 RECORD                                                     00440000
//*-----------------------------------------------------------------    00450000
//STEP01   EXEC PGM=BP13C024,COND=(0,NE)                                00460000
//BP13FB62 DD DSN=&&BP13FB62,DISP=(OLD,DELETE)                          00470001
//BP13FB60 DD DSN=&&BP13FB60,DISP=(OLD,DELETE)                          00471001
//BP13KA20 DD DSN=BP13.KA20.BLOCK,DISP=SHR,                             00480000
//         AMP=('BUFND=4','BUFNI=8')                                    00490000
//BP13KA30 DD DSN=BP13.KA30.UNIT,DISP=SHR                               00500000
//BP13KB85 DD DSN=BP13.KB85.ISSUENO,DISP=SHR                            00510000
//BP13FA30 DD DSN=BP13.FA30.UNIT.FTP,DISP=OLD                           00520000
//P13FB62A DD DSN=BP13.FB62.FTPUNIT.ERROR,DISP=MOD                      00530000
//P13FB60A DD DSN=&&P13FB60A,DISP=(,PASS),                              00531000
//            UNIT=(SYSDA,2),SPACE=(CYL,(20,20),RLSE),                  00531100
//            DCB=(RECFM=FB,LRECL=2843,BLKSIZE=25587)                   00531200
//MAILFB60 DD DSN=&&MAILFB60,DISP=(,PASS),                              00532000
//            UNIT=(SYSDA,2),SPACE=(CYL,(20,20),RLSE),                  00533000
//            DCB=(RECFM=FB,LRECL=47,BLKSIZE=27965)                     00534003
//SYSPRINT DD SYSOUT=*                                                  00540000
//SYSOUT   DD SYSOUT=*                                                  00550000
//SYSDBG   DD SYSOUT=*                                                  00560000
//SYSDBOUT DD SYSOUT=*                                                  00570000
//SYSABOUT DD SYSOUT=*                                                  00580000
/*                                                                      00590000
//*-----------------------------------------------------------------    00591000
//* PROCESS REOCRD FOR EMAIL FORMAT                                     00593000
//*-----------------------------------------------------------------    00594000
//STEP1A   EXEC PGM=BP13C02U,COND=(0,NE)                                00595000
//MAILFB60 DD DSN=&&MAILFB60,DISP=(OLD,DELETE)                          00596000
//BP13MAIL DD DSN=&&BP13MAIL,DISP=(,PASS),                              00597000
//         DCB=(LRECL=80,RECFM=FB,BLKSIZE=27920),                       00598000
//         SPACE=(CYL,(5,5),RLSE)                                       00599000
//SYSPRINT DD SYSOUT=*                                                  00599100
//SYSOUT   DD SYSOUT=*                                                  00599200
//SYSDBG   DD SYSOUT=*                                                  00599300
//SYSDBOUT DD SYSOUT=*                                                  00599400
//SYSABOUT DD SYSOUT=*                                                  00599500
//*-----------------------------------------------------------------    00600000
//* UPDATE BOOKED TO UNIT FILE                                          00610000
//* CREATE BOOKED TRANS FOR BP13D90B JOB TO UPDATE ACCEPTANCE           00620000
//*-----------------------------------------------------------------    00630000
//STEP02   EXEC PGM=BP13C026,COND=(0,NE)                                00640000
//BP13FA30 DD DSN=BP13.FA30.UNIT.FTP,DISP=SHR                           00650000
//BP13KA30 DD DSN=BP13.KA30.UNIT,DISP=SHR,                              00660000
//         AMP=('BUFND=4','BUFNI=8')                                    00670000
//BP13KA40 DD DSN=BP13.KA40.TRANS,DISP=SHR                              00680000
//SYSPRINT DD SYSOUT=*                                                  00690000
//SYSOUT   DD SYSOUT=*                                                  00700000
//SYSDBG   DD SYSOUT=*                                                  00710000
//SYSDBOUT DD SYSOUT=*                                                  00720000
//SYSABOUT DD SYSOUT=*                                                  00730000
/*                                                                      00740000
//*-----------------------------------------------------------------    00750000
//* SORT BP13FA30 BY FA30-NUM-DVLP-CASENO                               00760000
//*-----------------------------------------------------------------    00770000
//STEP03   EXEC SORT,COND=(0,NE)                                        00780000
//SORTIN   DD DSN=BP13.FA30.UNIT.FTP,DISP=SHR                           00790000
//SORTOUT  DD DSN=&&BP13FA30,DISP=(NEW,PASS),                           00800000
//            DCB=(RECFM=FB,LRECL=200),                                 00810000
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE)                        00820000
//SYSIN    DD *                                                         00830000
      SORT FIELDS=(116,8,A),FORMAT=CH                                   00840000
/*                                                                      00850000
//*-----------------------------------------------------------------    00860000
//* SORT BP13FB60 BY DEVELOPER CASE-NUMBER                              00870000
//*-----------------------------------------------------------------    00880000
//STEP04   EXEC SORT,COND=(0,NE)                                        00890000
//SORTIN   DD DSN=&&P13FB60A,DISP=(OLD,DELETE)                          00900000
//SORTOUT  DD DSN=&&BP13FB60,DISP=(NEW,PASS),                           00910000
//            DCB=(RECFM=FB,LRECL=2843),                                00920000
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE)                        00930000
//SYSIN    DD *                                                         00940000
      SORT FIELDS=(5,8,A),FORMAT=CH                                     00950000
/*                                                                      00960000
//*-----------------------------------------------------------------    00970000
//* CREATE BP13KB78 DBS REQUEST                                         00980000
//* CREATE BP13KB20 DBS BOOKED RECORD                                   00990000
//*-----------------------------------------------------------------    01000000
//STEP05   EXEC PGM=BP13C028,COND=(0,NE)                                01010000
//BP13FB60 DD DSN=&&BP13FB60,DISP=(OLD,DELETE)                          01020000
//BP13FA30 DD DSN=&&BP13FA30,DISP=(OLD,DELETE)                          01030000
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                            01040000
//         AMP=('BUFND=4','BUFNI=8')                                    01050000
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR,                             01060000
//         AMP=('BUFND=4','BUFNI=8')                                    01070000
//SYSPRINT DD SYSOUT=*                                                  01080000
//SYSOUT   DD SYSOUT=*                                                  01090000
//SYSDBG   DD SYSOUT=*                                                  01100000
//SYSDBOUT DD SYSOUT=*                                                  01110000
//SYSABOUT DD SYSOUT=*                                                  01120000
/*                                                                      01130000
//*-------------------------------------------------------------------* 01140000
//* EMPTY DEVELOPER SFTP FILES                                          01150000
//*-------------------------------------------------------------------* 01160000
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                  01170000
//SYSPRINT DD SYSOUT=*                                                  01180000
//INPUT1   DD DUMMY                                                     01190000
//OUTPUT1  DD DSN=BP13.FB60.FTPREQ.FROMDEV,DISP=OLD                     01200000
//OUTPUT2  DD DSN=BP13.FB61.FTPBLK.FROMDEV,DISP=OLD                     01210000
//OUTPUT3  DD DSN=BP13.FB62.FTPUNIT.FROMDEV,DISP=OLD                    01220000
//SYSIN    DD *                                                         01230000
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                          01240000
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                          01250000
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT3)                          01260000
//*                                                                     01270000
//*-----------------------------------------------------------------    01280000
//*  SEND MAINFRAME EMAIL                                               01290000
//*  COND CODE = 04 IF FILE IS EMPTY                                    01300000
//*-----------------------------------------------------------------    01310000
//PS999    EXEC SENDMAIL,COND=(0,NE)                                    01320000
//INPUT    DD DSN=&&BP13MAIL,DISP=(OLD,DELETE)                          01330000
