//BP13D302 JOB (BP13P),'BP13D302',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//*=================================================================*           
//*                  S O C A       J O B                            *           
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP130696  16/08/1999  CLT1 REMOVE STAMPING RELATED STEPS TO     *           
//*                            BP13D407                             *           
//* BP130565  01/03/1999  CLT1 PRINT 3 COPIES FOR BP13C314.         *           
//*                            JDE=BP13S IS USED.                   *           
//* BP130418  31/08/1998  LJL1 Y2K COMPLIANCE CHANGES               *           
//* BP130728  14/01/2000  LLW1 TO CATER FOR "SA" CASES.             *           
//* BP130850  07/11/2001  LSB  INCLUDE FILE BP13F915( CDB TRANS)    *           
//* BP132387  14/11/2003  SSS  STOP PRINT P13L305A                  *           
//* BP132487  03/03/2004  MJ16 TO BLANK DPD (PGM - BP13C305)        *           
//* BP132577  20/08/2004  SK   INCLUDE BP13F915 IN BP13C305         *           
//* BP132795  01/12/2005  CG7  ADD VERIFY STEP                      *           
//* BP132742  04/04/2006  CLT1 ADD B05F005 TO BP13C304              *           
//* BP132842  16/08/2006  CLT1 UPDATE AHG USED IN BP13C301          *           
//* BP133026  19/03/2007  CLT1 INCLUDE R4/R5 IN REJECTION           *           
//* BP133400  11/11/2009  LSB  INCLUDE R6    IN REJECTION           *           
//* BP134919  14/05/2013  ESD1 PROCESS OP IN K310 TO CREATE DAILY   *           
//*                            OUTRIGHT PURCHASE LETTER REPORT      *           
//* BP134919  16/05/2013  ESD1 ADDED BP13K410 ON STEP15             *           
//* BP135418  16/10/2014  LSB1 ADDED BP13K800 TO BP13C304           *           
//* BP135621  10/02/2015  ESD1 ADDED STEP16 AND STEP17 CREATE AFL   *           
//*                            NOT FILED REPORT                     *           
//* BP135638  17/02/2015  ESD1 ADDED STEP18 STEP19 AND STEP20 TO    *           
//*                            CREATE  EMAIL FOR AFL DOC NOT FILED. *           
//* BP135791  19/05/2015  RJB1 TO INCLUDE BP13CI01 AND BP13CI02 TO  *           
//*                            PRINT THE RESPONSE OF E-APPOINTMENT. *           
//* BP135710  03/06/2015  RJB1 ADDED PROGRAM BP13CLA7 TO FILTER THE *           
//*                            INPUT OF BP13CL07                    *           
//* BP135710  11/06/2015  RJB1 ADDED BM06K110 ON BP13CLA7           *           
//* BP135825  11/11/2015  ZDD1 ADDED SENDING OF EMAIL FOR UPD ON FF *           
//* BP135986  13/11/2015  ZDD1 ADDED BP13FH50 AS BACKUP             *           
//* BP135986  13/11/2015  ZDD1 ADDED BP1CH55 TO UPDATE BP13K859     *           
//* BP134867  11/03/2016  PCL4 TO READ BP13K480 FOR MGL CASES       *           
//* BP135833  03/05/2016  KSJ3 RUN BP13C3A5 TO GET SERS CONTRA RECS *           
//*                            AND WRITE TO BP13.F300.SUCCESS.SERS  *           
//* BP136176  05/05/2016  KSJ3 TO PLACE BP13C3A5 BEFORE STEP01      *           
//* BP135824  26/05/2016  KSJ3 TO INCLUDE CHECK TO TRANS CODE SA    *           
//*                            IN STEP00A SORT CONDITION            *           
//* BP136183  06/06/2016  KSJ3 REMOVE BP13C3A5 (TO BE RUN IN D301)  *           
//* BP136431  07/11/2016  KSJ3 ADD BP13CH60 AND BP13CH61            *           
//* BP136508  14/10/2016  KVL1 ADD STEPS 29 AND 30 FOR CREATION OF  *           
//*                            IN TRAY REMINDER TO OIC TO COMPLETE  *           
//*                            CANCELLATION                         *           
//* BP137205  04/06/2018  LJL1 TO FIX THE COND=4 FOR SENDMAIL TO    *           
//*                            FACILITATE PCD SMS FILE.             *           
//* BP139395  14/11/2022  LJL1 TO INCREASE SPACE FOR STEP16C        *           
//* BP139477  21/02/2023  LJL1 TO INCREASE SPACE FOR STEP16A        *           
//* BP139632  20/06/2023  ZAR7 ADD BP13C14E FOR SUBTR EX-SOL        *           
//* BP139632  07/07/2023  ZAR7 ADD BP13C14F FOR VOLUNTARY REFUND    *           
//* BP139710  14/09/2023  ZAR7 ADD BP13CL15 FOR IO TRANS CODE       *           
//* BP139710  25/09/2023  ZAR7 TO SEND DAILY ALERT ONLY FOR INCLUDE *           
//*                            OCCUPIER.                            *           
//*=================================================================*           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*-----------------------------------------------------------------*           
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS              *           
//*    PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGREEMENT TEAM)    *           
//*-----------------------------------------------------------------*           
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//*     VERIFY BEFORE SALES AGREEMENT CASES                                     
//*-----------------------------------------------------------------            
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BB14.K580.UNTLEASE,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*                                                                             
//*---------------------------------------------------------------              
//*     EXTRACT ACCEPTED CASES FROM FLAT INVENTORY MASTER.                      
//*---------------------------------------------------------------              
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K300.AGRORDER,DISP=SHR                                   
//SORTOUT  DD DSN=&&F2010,DISP=(NEW,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                              
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                
      INCLUDE COND=(679,2,CH,EQ,C'SA')                                          
//*                                                                             
//*---------------------------------------------------------------              
//*   UPDATE RFF MASTER AND CREATE HISTORY FILE (BEFORE SA)                     
//*---------------------------------------------------------------              
//STEP02  EXEC PGM=BP13C301,COND=(0,NE)                                         
//BP13F300 DD DSN=&&F2010,DISP=(OLD,DELETE)                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=4')                                                   
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR,                                  
//            AMP=('BUFNI=4')                                                   
//BP13K480 DD DSN=BP13.K480.CONTRA,DISP=SHR,                                    
//            AMP=('BUFNI=4')                                                   
//BP13F915 DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                   
//BP13OUT  DD DSN=BP13.F300.SUCCESS,DISP=OLD                                    
//BP13KIV  DD DSN=BP13.F300.KIVAGR,DISP=MOD                                     
//BP13L301 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------              
//*     EXTRACT ACCEPTED CASES FROM FLAT INVENTORY MASTER.                      
//*---------------------------------------------------------------              
//STEP03  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K300.AGRORDER,DISP=SHR                                   
//SORTOUT  DD DSN=&&F2030,DISP=(NEW,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000)                              
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                 
     INCLUDE COND=(679,2,CH,EQ,C'AA')                                           
//*                                                                             
//*---------------------------------------------------------------              
//*   UPDATE RFF MASTER AND CREATE HISTORY FILE                                 
//*---------------------------------------------------------------              
//STEP04 EXEC PGM=BP13C302,COND=(0,NE)                                          
//BP13F300 DD DSN=&&F2030,DISP=(OLD,DELETE)                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13K150 DD DSN=BP13.K150.EXAPPL,DISP=SHR                                     
//BP13F915 DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                   
//BP13OUT  DD DSN=BP13.F300.SUCCESS.AFTERSA,DISP=OLD                            
//BP13KIV  DD DSN=BP13.F300.KIVAGR,DISP=MOD                                     
//BP13L302 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------              
//*   UPDATE OCCUPIER FILE                                                      
//*---------------------------------------------------------------              
//STEP05  EXEC PGM=BP13C303,COND=(0,NE)                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13F300 DD DSN=BP13.F300.SUCCESS,DISP=SHR                                    
//BP13F915 DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                   
//BP13OUT  DD DSN=BP13.F300.OUT,DISP=OLD                                        
//BP13L303 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*----------------------------------------------------------------             
//*   UPDATE OCCUPIER FILE                                                      
//*----------------------------------------------------------------             
//STEP06  EXEC PGM=BP13C303,COND=(0,NE)                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13F300 DD DSN=BP13.F300.SUCCESS.AFTERSA,DISP=SHR                            
//BP13F915 DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                   
//BP13OUT  DD DSN=BP13.F300.OUT,DISP=OLD                                        
//BP13L303 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*----------------------------------------------------------------             
//*   CREATE TRANX FOR GENERATING GL TRANX & FINANCIAL HISTORY                  
//*----------------------------------------------------------------             
//STEP07  EXEC  PGM=BP13C304,COND=(0,NE)                                        
//BP13F300 DD DSN=BP13.F300.SUCCESS,DISP=OLD                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13F120 DD DSN=BP13.F120.SATRAN,DISP=MOD                                     
//BP13F130 DD DSN=BP13.F130.SATRAN,DISP=MOD                                     
//B05F005  DD DSN=BP13.F128.STPFEE,DISP=MOD                                     
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*----------------------------------------------------------------             
//*   CREATE TRANX FOR GENERATING GL TRANX & FINANCIAL HISTORY                  
//*----------------------------------------------------------------             
//STEP08  EXEC  PGM=BP13C304,COND=(0,NE)                                        
//BP13F300 DD DSN=BP13.F300.SUCCESS.AFTERSA,DISP=OLD                            
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13F120 DD DSN=BP13.F120.SATRAN,DISP=MOD                                     
//BP13F130 DD DSN=BP13.F130.SATRAN,DISP=MOD                                     
//B05F005  DD DSN=BP13.F128.STPFEE,DISP=MOD                                     
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*     EXTRACT REJECTED CASES                                                  
//*-----------------------------------------------------------------            
//STEP09  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&F2080,DISP=(NEW,PASS),UNIT=SYSDA,                           
//        DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400),                               
//        SPACE=(TRK,(30,10),RLSE)                                              
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(9,2,CH,EQ,C'RG',OR,                                           
                  9,2,CH,EQ,C'RX',OR,                                           
                  9,2,CH,EQ,C'RY',OR,                                           
                  9,2,CH,EQ,C'RZ',OR,                                           
                  9,2,CH,EQ,C'R4',OR,                                           
                  9,2,CH,EQ,C'R5',OR,                                           
                  9,2,CH,EQ,C'R6')                                              
//*                                                                             
//*----------------------------------------------------------------             
//*     REJECTION OF FLAT                                                       
//*----------------------------------------------------------------             
//STEP10  EXEC  PGM=BP13C305,COND=(0,NE)                                        
//BP13F310 DD DSN=&&F2080,DISP=(OLD,PASS)                                       
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4')                                                   
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=4')                                                   
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4')                                                   
//BB14K580 DD DSN=BB14.K580.UNTLEASE,DISP=SHR,                                  
//            AMP=('BUFNI=4')                                                   
//BP13OUT  DD DSN=BP13.F310.SUCCESS.REJ,DISP=OLD                                
//BP13K150 DD DSN=BP13.K150.EXAPPL,DISP=OLD                                     
//BP13K350 DD DSN=BP13.K350.STDAPT,DISP=SHR                                     
//BP13F380 DD DSN=BP13.F380.CDREFUND,DISP=MOD                                   
//BP13F915 DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                   
//P13L305A DD SYSOUT=*                                                          
//P13L305B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L305C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L305D DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------          
//*  CLEAR THE LEASE STAMP FEE AND COMVEY FEE FOR CANCELLATION CASES            
//*-------------------------------------------------------------------          
//STEP11  EXEC PGM=BP13C321,COND=(0,NE)                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8')                                                   
//BP13F120 DD DSN=BP13.F120.SATRAN,DISP=MOD                                     
//BP13F130 DD DSN=BP13.F130.SATRAN,DISP=MOD                                     
//P13L321  DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT OUT THE DEMISED CASE FROM TRANSACTION FILE                             
//*-----------------------------------------------------------------            
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP12,DISP=(NEW,PASS),                                     
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                               
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,8,A),FORMAT=CH                                             
    INCLUDE COND=(9,2,CH,EQ,C'DE')                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* 1. TO REVERT TO CPF AMOUNT OF DEMISED TO CASH.                              
//* 2. TO CREATE AN AUDIT TRAIL FOR THE TRANSFER OF CPF TO CASH.                
//*-----------------------------------------------------------------            
//STEP13   EXEC PGM=BP13C138,COND=(0,NE)                                        
//BP13F310 DD DSN=&&STEP12,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L138 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//BP13F130 DD DSN=BP13.F130.SATRAN.DEMISE,DISP=SHR                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT THE SUBTR CASE (EXTERNAL SOLICITOR)                                
//*-----------------------------------------------------------------            
//STEP13A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP13,DISP=(NEW,PASS),                                     
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                               
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,8,A),FORMAT=CH                                             
    INCLUDE COND=(9,2,CH,EQ,C'ES')                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* 1. TO REVERT TO CPF AMOUNT OFEX SOL   TO CASH.                              
//* 2. TO CREATE AN AUDIT TRAIL FOR THE TRANSFER OF CPF TO CASH.                
//*-----------------------------------------------------------------            
//STEP13B  EXEC PGM=BP13C14E,COND=(0,NE)                                        
//BP13F310 DD DSN=&&STEP13,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L14E DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//BP13F130 DD DSN=BP13.F130.SATRAN.EXSOL,DISP=SHR                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* 1. TO SEND GENERATE EMAIL FOR THE CASES FOR STEP 13B                        
//*-----------------------------------------------------------------            
//STEP13C  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&STEP13,DISP=(OLD,PASS)                                      
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13MAIL DD DSN=&&BP13CL11,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=132),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CL11) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//SYSIN    DD *                                                                 
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT THE SUBTR CASE (VOLUNTARY REFUND)                                  
//*-----------------------------------------------------------------            
//STEP13D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP1E,DISP=(NEW,PASS),                                     
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                               
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,8,A),FORMAT=CH                                             
    INCLUDE COND=(9,2,CH,EQ,C'VU')                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* 1. TO REVERT TO CPF AMOUNT VOLUNTARY  TO CASH.                              
//* 2. TO CREATE AN AUDIT TRAIL FOR THE TRANSFER OF CPF TO CASH.                
//*-----------------------------------------------------------------            
//STEP13E  EXEC PGM=BP13C14F,COND=(0,NE)                                        
//BP13F310 DD DSN=&&STEP1E,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L14F DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//BP13F130 DD DSN=BP13.F130.SATRAN.VOLCPF,DISP=SHR                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* 1. TO SEND GENERATE EMAIL FOR THE CASES FOR STEP 13B                        
//*-----------------------------------------------------------------            
//STEP13F  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&STEP1E,DISP=(OLD,PASS)                                      
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13MAIL DD DSN=&&BP13CL12,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=132),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CL12) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//SYSIN    DD *                                                                 
/*                                                                              
//*---------------------------------------------------------------------        
//* TO UPDATE BP13K859 (WRITE REC THAT ARE NOT EXISTING)                        
//*---------------------------------------------------------------------        
//STEP13I   EXEC PGM=BP13CH55,COND=(0,NE)                                       
//BP13F859  DD DSN=BP13.F859.PCD.EMAIL,DISP=SHR                                 
//BP13K859  DD DSN=BP13.K859.PCD.EMAIL,DISP=SHR                                 
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT OUT THE OUTRIGHT PURCHASE LETTER PRINTED                               
//*-----------------------------------------------------------------            
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP14,DISP=(NEW,PASS),                                     
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                               
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,8,A),FORMAT=CH                                             
    INCLUDE COND=(9,2,CH,EQ,C'OP')                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* 1. TO CREATE LISTING OF ALL OUTRIGHT PURCHASED LETTER PRINTED               
//*-----------------------------------------------------------------            
//STEP15   EXEC PGM=BP13C017,COND=(0,NE)                                        
//BP13F310 DD DSN=&&STEP14,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L017 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//STEP15A  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KL00.LETTER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.FL00.LETTER,DISP=SHR                                     
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*--------------------------------------------------------------------         
//STEP15B  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KL05.LETTER.HISTORY,DISP=SHR                             
//OUTPUT1  DD DSN=BP13.FL05.LETTER.HISTORY,DISP=SHR                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-----------------------------------------------------------------            
//* TO FILTER THE SERS CASES                                                    
//*-----------------------------------------------------------------            
//STEP15C EXEC PGM=BP13CLA7,COND=(0,NE)                                         
//BP13F300 DD DSN=BP13.F300.SUCCESS,DISP=SHR                                    
//         DD DSN=BP13.F300.NOTFILED.INPUT,DISP=SHR                             
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//             AMP=('BUFND=4','BUFNI=8')                                        
//OUTF300A DD DSN=BP13.F300.SUCCESS.NOSER,DISP=SHR                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* CREATE REPORT OF AFL NOT FILED                                              
//*-----------------------------------------------------------------            
//STEP16  EXEC PGM=BP13CL07,COND=(0,NE)                                         
//BP13F300 DD DSN=BP13.F300.SUCCESS.NOSER,DISP=SHR                              
//BP13KL00 DD DSN=BP13.KL00.LETTER,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//OUTF300  DD DSN=BP13.F300.AFL.NOTFILED,DISP=SHR                               
//BP13LL07 DD DSN=&&STEP16,DISP=(NEW,PASS),                                     
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=132,BLKSIZE=0)                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BP13KL05                                                               
//*-----------------------------------------------------------------            
//STEP16A  EXEC SORT,CYL=30                                                     
//SORTIN   DD DSN=BP13.FL05.LETTER.HISTORY,DISP=SHR                             
//         DD DSN=BP13.FL05.LETTER.HISTORY.INET,DISP=SHR                        
//SORTOUT  DD DSN=&&P13FL05A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=250),                              
//            SPACE=(CYL,(80,20),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,18,A),FORMAT=CH                                                
  INCLUDE COND=(115,8,CH,NE,C'        ')                                        
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* TO UPDATE THE FIELDS KL00-DTE-READ-EMAIL-MYHDBPAGE AND                      
//* KL00-TME-READ-EMAIL-MYHDBPAGE                                               
//*-----------------------------------------------------------------            
//STEP16B EXEC PGM=BP13CI01,COND=(0,NE)                                         
//BP13KL05 DD DSN=&&P13FL05A,DISP=(OLD,DELETE)                                  
//BP13KL00 DD DSN=BP13.KL00.LETTER,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BP13KL00                                                               
//*-----------------------------------------------------------------            
//STEP16C  EXEC SORT,CYL=30                                                     
//SORTIN   DD DSN=BP13.KL00.LETTER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13FL00A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                              
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(116,08,A),FORMAT=CH                                              
  INCLUDE COND=(116,8,CH,NE,C'        ')                                        
//*-----------------------------------------------------------------            
//* TO CREATE A REPORT TO KEEP TRACK OF NUMBER OF CASES WHERE                   
//* APPLICANTS CLICK OPEN THE E-APPOINTMENT LETTER IN MYHDBPAGE                 
//*-----------------------------------------------------------------            
//STEP16D EXEC PGM=BP13CI02,COND=(0,NE)                                         
//BP13KL00 DD DSN=&&P13FL00A,DISP=(OLD,DELETE)                                  
//BP13LI02 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT COPY NOT FILED CASES                                                   
//*-----------------------------------------------------------------            
//STEP17   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F300.AFL.NOTFILED,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F300.NOTFILED.INPUT,DISP=SHR                             
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
//*-----------------------------------------------------------------            
//* SORT FIELDS THE REPORT                                                      
//*-----------------------------------------------------------------            
//STEP18   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&STEP16,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&STEP18,DISP=(NEW,PASS),                                     
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=132,BLKSIZE=0)                                   
//SYSIN    DD *                                                                 
  SORT FIELDS=(85,8,CH,A,71,8,CH,A,13,8,CH,A)                                   
//*-----------------------------------------------------------------            
//* CREATE MAIL  OF AFL NOT FILED                                               
//*-----------------------------------------------------------------            
//STEP19  EXEC PGM=BP13CL08,COND=(0,NE)                                         
//BP13LL07 DD DSN=&&STEP18,DISP=(OLD,PASS)                                      
//BP13MAIL DD DSN=&&STEP19,DISP=(NEW,PASS),                                     
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=132,BLKSIZE=0)                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* BACKUP  ALL BP13KH50 RECORDS BEFORE SEND EMAIL                              
//*------------------------------------------------------------------           
//STEP21A  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KH50.UPD.FP,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.FH50.UPD.FP,DISP=SHR                                     
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*------------------------------------------------------------------           
//* SORT ALL BP13KH50 RECORDS TO SEND EMAIL                                     
//*------------------------------------------------------------------           
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KH50.UPD.FP,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13FH50,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=3000),                             
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
   INCLUDE COND=(39,1,CH,EQ,C'Y',AND,                                           
                 40,1,CH,NE,C'Y')                                               
//*------------------------------------------------------------------           
//* GENERATE EMAIL                                                              
//*------------------------------------------------------------------           
//STEP22  EXEC PGM=IKJEFT01,COND=(0,NE),                                        
//             DYNAMNBR=20                                                      
//BP13FH50 DD DSN=&&BP13FH50,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13KH50 DD DSN=BP13.KH50.UPD.FP,DISP=SHR                                     
//BP13LH53 DD DSN=&&BP13LH53,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=132),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSPRINT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13CH53) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*------------------------------------------------------------------           
//* SORT BP13KH55 TO GET NEW INFO TO SEND SMS                                   
//*------------------------------------------------------------------           
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KH55.PCD.SMS,DISP=SHR                                    
//SORTOUT  DD DSN=&&FH55,                                                       
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(163,01,CH,NE,C'Y',AND,                                          
                164,01,CH,EQ,C'Y')                                              
//*                                                                             
//*------------------------------------------------------------------           
//* MOVE BP13KH55 RECORD TO ONLINE FILE FOR UPDATE                              
//*------------------------------------------------------------------           
//STEP25   EXEC PGM=BP13CH60,COND=(0,NE)                                        
//BP13FH55 DD DSN=&&FH55,DISP=(OLD,DELETE)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13KH55 DD DSN=BP13.KH55.PCD.SMS,DISP=SHR                                    
//BP13KC50 DD DSN=BP13.KC50.PCDSMS,DISP=OLD                                     
//P13LH60A DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*------------------------------------------------------------------           
//* GET ALL RECORDS FROM ONLINE FILE APPROVED TO SEND SMS                       
//*------------------------------------------------------------------           
//STEP26   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KC50.PCDSMS,DISP=SHR                                     
//SORTOUT  DD DSN=&&FC50,                                                       
//            DISP=(NEW,PASS,DELETE),                                           
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(17,08,CH,NE,C'        ',AND,                                    
                52,01,CH,EQ,C'Y',AND,                                           
               (61,08,CH,EQ,C'00000000',OR,                                     
                61,08,CH,EQ,C'        '))                                       
//*                                                                             
//*------------------------------------------------------------------           
//* MOVE ALL APPROVED SMS TO SMS FILE                                           
//*------------------------------------------------------------------           
//STEP27   EXEC PGM=BP13CH61,COND=(0,NE)                                        
//BP13FC50 DD DSN=&&FC50,DISP=(OLD,DELETE)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13F203 DD DSN=BP13.F203.SMS.PCD,DISP=OLD                                    
//BP13KC50 DD DSN=BP13.KC50.PCDSMS,DISP=OLD                                     
//P13LH61A DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*------------------------------------------------------------------           
//* COPY BP13.F203.SMS.PCD TO BACK-UP                                           
//*------------------------------------------------------------------           
//STEP28   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.PCD,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F203.SMS.PCD.DAILY(+1),                                  
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,RECFM=FB,LRECL=200,BLKSIZE=0)                       
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* CREATION OF IN TRAY REMINDER TO OIC TO COMPLETE CANCELLATION      *         
//* EXTRACT FROM BP13.K62A.STAMPREF                                   *         
//*(K62A-DTE-FINAL-LTR-PRINTED  + 18 DAYS = CURRENT DATE    AND       *         
//* K62A-TYP-LTR = '2' OR '4' AND                                     *         
//* K62A-DTE-CANCELLATION = SPACES)                                   *         
//*-------------------------------------------------------------------*         
//STEP29   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(0,NE)                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K62A.STAMPREF,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F62A,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=1200),                                        
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(30,08,A),FORMAT=CH                                               
  INCLUDE COND=((152,01,CH,EQ,C'2',OR,                                          
                 152,01,CH,EQ,C'4'),AND,                                        
                 136,08,CH,NE,C'       ',AND,                                   
                 136,08,ZD,EQ,DATE1P-18,AND,                                    
                  70,08,CH,EQ,C'       ')                                       
/*                                                                              
//*-------------------------------------------------------------------*         
//* CREATE INTRAY RECORD FOR OIC ACTION                               *         
//*-------------------------------------------------------------------*         
//STEP30   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F62A DD DSN=&&BP13F62A,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C990) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP20   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&STEP19,DISP=(OLD,DELETE)                                    
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP23   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13LH53,DISP=(OLD,DELETE)                                  
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP24   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13CL11,DISP=(OLD,DELETE)                                  
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP25   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13CL12,DISP=(OLD,DELETE)                                  
/*                                                                              
//*-------------------------------------------------------------------*         
//*   END OF BP13D302                                                 *         
//*-------------------------------------------------------------------*         
