//BP13A558 JOB (BP13P),'BP13A558',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//*--------------------------------------------------------------------         
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.KB02.ROUTE.HIST,DISP=SHR                                 
//SORTOUT  DD DSN=&&BP13FB02,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(15,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(12,8,A),FORMAT=CH                                                
  INCLUDE COND=(20,8,CH,GE,C'20191112',AND,9,3,CH,EQ,C'PEN',AND,                
                12,1,CH,GE,C'3',AND,78,1,CH,NE,C'A')                            
//*--------------------------------------------------------------------         
//* SORT BP18K310 BY REGN NO (NOT E08 WITH INCOME BET 10K TO 12K)               
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB00.BEBTO,DISP=SHR                                      
//SORTOUT  DD DSN=&&FB00BTO,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(15,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(15,8,A),FORMAT=CH                                                
  INCLUDE COND=(1,3,CH,EQ,C'BTO',AND,4,3,CH,EQ,C'KIV',AND,                      
                7,8,CH,GE,C'20191112')                                          
//*---------------------------------------------------------------------        
//* SORT BP18K310 BY REGN NO (NOT E08 WITH INCOME BET 10K TO 12K)               
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB00.BEBTO,DISP=SHR                                      
//SORTOUT  DD DSN=&&FB00SBF,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(15,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(15,8,A),FORMAT=CH                                                
  INCLUDE COND=(1,3,CH,EQ,C'SBF',AND,4,3,CH,EQ,C'KIV',AND,                      
                7,8,CH,GE,C'20191112')                                          
//*---------------------------------------------------------------------        
//*=================================================================            
//* MATCH CASE AND GENERATE REPORT FOR BTO                                      
//*-----------------------------------------------------------------            
//STEP04 EXEC PGM=BP13CG02,COND=(0,NE)                                          
//BP13FB00 DD DSN=&&FB00BTO,DISP=(OLD,DELETE)                                   
//BP13FB02 DD DSN=&&BP13FB02,DISP=(OLD,PASS)                                    
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//P13LRPT1 DD DSN=BP13.FB00.BTOSBF.REPORT,DISP=SHR                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*=================================================================            
//* MATCH CASE AND GENERATE REPORT FOR SBF                                      
//*-----------------------------------------------------------------            
//STEP05 EXEC PGM=BP13CG02,COND=(0,NE)                                          
//BP13FB00 DD DSN=&&FB00SBF,DISP=(OLD,DELETE)                                   
//BP13FB02 DD DSN=&&BP13FB02,DISP=(OLD,PASS)                                    
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//P13LRPT1 DD DSN=BP13.FB00.BTOSBF.REPORT,DISP=MOD                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
