//BP13M506 JOB (BP13P),'BP13M506',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//*---------------------------------------------------------------------        
//*    SORT BP13K820                                                            
//*---------------------------------------------------------------------        
//STEP1    EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&TEMP1,                                                     
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(50,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=20,BLKSIZE=23400)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   OMIT COND=(9,1,CH,EQ,C' ',OR,9,1,CH,EQ,C'/',OR,9,1,CH,EQ,C'#',OR,            
              10,1,CH,EQ,C' ',OR,11,1,CH,EQ,C' ',OR,12,1,CH,EQ,C' ',OR,         
              13,1,CH,EQ,C' ',OR,14,1,CH,EQ,C' ')                               
   OUTREC FIELDS=(9,9,11X)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//*    SORT BP13K825                                                            
//*---------------------------------------------------------------------        
//STEP2    EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K825.REQOCCP,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&TEMP1,                                                     
//             DISP=(MOD,PASS)                                                  
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   OMIT COND=(9,1,CH,EQ,C' ',OR,9,1,CH,EQ,C'/',OR,9,1,CH,EQ,C'#',OR,            
              10,1,CH,EQ,C' ',OR,11,1,CH,EQ,C' ',OR,12,1,CH,EQ,C' ',OR,         
              13,1,CH,EQ,C' ',OR,14,1,CH,EQ,C' ')                               
   OUTREC FIELDS=(9,9,11X)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//*    SORT BP13K943                                                            
//*---------------------------------------------------------------------        
//STEP4    EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K943.OCPR.BO,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&TEMP1,                                                     
//             DISP=(MOD,PASS)                                                  
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   OMIT COND=(9,1,CH,EQ,C' ',OR,9,1,CH,EQ,C'/',OR,9,1,CH,EQ,C'#',OR,            
              10,1,CH,EQ,C' ',OR,11,1,CH,EQ,C' ',OR,12,1,CH,EQ,C' ',OR,         
              13,1,CH,EQ,C' ',OR,14,1,CH,EQ,C' ')                               
   OUTREC FIELDS=(9,9,11X)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//*    SORT BP13F000                                                            
//*---------------------------------------------------------------------        
//STEP6    EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&TEMP1,                                                     
//             DISP=(OLD,DELETE)                                                
//SORTOUT  DD  DSN=BP13.F000.HDBUIN,                                            
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,9,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
/*                                                                              
