//BP13A550 JOB (BP13P),'BP13A550',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* CHG REF  BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -----------------------------------------            
//* BP132200 CKK7 20021025 TO SORT OUT BE CASES FOR DEBARMENT                   
//*=================================================================            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT01     EXEC PGM=IEBGENER                                                   
//SYSUT1    DD *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID    OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                  
//SYSUT2    DD SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD DUMMY                                                            
//*---------------------------------------------------------------------        
//* SORT K853.MCPS DATASET IN DTE-BALLOT, NT, FT                                
//*---------------------------------------------------------------------        
//STEP02    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K853.MCPS,DISP=SHR                                      
//SORTOUT   DD DSN=&&BP13F853,DISP=(NEW,PASS),                                  
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=250,RECFM=FB),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN     DD *                                                                
   SORT FIELDS=(165,6,A,160,3,A,163,2,A),FORMAT=CH                              
//*---------------------------------------------------------------------        
//* SORT K703.SOCLIST DATASET IN DTE-BALLOT-NEW, NT, FT                         
//*---------------------------------------------------------------------        
//STEP03    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K703.SOCDATE,DISP=SHR                                   
//SORTOUT   DD DSN=&&BP13F703,DISP=(NEW,PASS),                                  
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=100,RECFM=FB),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN     DD *                                                                
   INCLUDE COND=(1,8,CH,EQ,C'LIFMAREC')                                         
   SORT FIELDS=(20,6,A,9,3,A,12,2,A),FORMAT=CH                                  
//*---------------------------------------------------------------------        
//* UPDATE INELIGIBLE STATUS FOR RESERVE LIST                                   
//*---------------------------------------------------------------------        
//STEP04    EXEC PGM=BP13C011,COND=(0,NE)                                       
//BP13F853  DD DSN=&&BP13F853,DISP=(OLD,PASS)                                   
//BP13F703  DD DSN=&&BP13F703,DISP=(OLD,PASS)                                   
//BP13K410  DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                   
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR                                     
//P04K010   DD DSN=BP04.K010.DEBAR,DISP=SHR                                     
//BP13011A  DD DSN=&&FD400,DISP=(NEW,PASS),                                     
//             UNIT=SYSDA,                                                      
//             DCB=(LRECL=300,RECFM=FB),                                        
//             SPACE=(CYL,(10,10),RLSE)                                         
//BP13011B  DD DSN=&&NTFND,DISP=(NEW,PASS),                                     
//             UNIT=SYSDA,                                                      
//             DCB=(LRECL=300,RECFM=FB),                                        
//             SPACE=(CYL,(10,10),RLSE)                                         
//BP13011C  DD DSN=&&CANCEL,DISP=(NEW,PASS),                                    
//             UNIT=SYSDA,                                                      
//             DCB=(LRECL=300,RECFM=FB),                                        
//             SPACE=(CYL,(10,10),RLSE)                                         
//BP13011D  DD DSN=BP13.F010.MCPS.KEEP,DISP=OLD                                 
//P13L011A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L011B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L011C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L011D DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L011E DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT ALL MA CASES TO BE DELETED TO ONE FILE                                 
//*---------------------------------------------------------------------        
//STEP05    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=&&FD400,DISP=(OLD,PASS)                                      
//          DD DSN=&&NTFND,DISP=(OLD,PASS)                                      
//          DD DSN=&&CANCEL,DISP=(OLD,PASS)                                     
//SORTOUT   DD DSN=BP13.F010.MCPS.PASS,DISP=OLD                                 
//SYSIN     DD *                                                                
   SORT FIELDS=(1,44,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SORT MA CASES NOT TO BE DELETED BY KEY FIELD                                
//*---------------------------------------------------------------------        
//STEP06    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.F010.MCPS.KEEP,DISP=SHR                                 
//SORTOUT   DD DSN=&&BP13F010,DISP=(NEW,PASS),                                  
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=300,RECFM=FB),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN     DD *                                                                
   SORT FIELDS=(1,44,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* MATCH AND OUTPUT THE FINAL FILE TO PASS TO DEBARMENT                        
//*---------------------------------------------------------------------        
//STEP07    EXEC PGM=BP13C009,COND=(0,NE)                                       
//BP13F010  DD DSN=BP13.F010.MCPS.PASS,DISP=SHR                                 
//BP13K010  DD DSN=&&BP13F010,DISP=(OLD,PASS)                                   
//P13F010A  DD DSN=&&P13F010A,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             DCB=(LRECL=300,RECFM=FB),                                        
//             SPACE=(CYL,(10,10),RLSE)                                         
//P13F010B  DD DSN=&&P13F01B,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,                                                      
//             DCB=(LRECL=300,RECFM=FB),                                        
//             SPACE=(CYL,(10,10),RLSE)                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* REMOVE DUPLICATE RECORD FROM FILE TO BE PASSED TO BP04                      
//*---------------------------------------------------------------------        
//STEP08    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=&&P13F010A,DISP=(OLD,PASS)                                   
//SORTOUT   DD DSN=BP13.F010.MCPS.DEBAR,DISP=OLD                                
//SYSIN     DD *                                                                
   SORT FIELDS=(1,44,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
