//BP13DP14 JOB (BP13P),'BP13DP14',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,USER=BP13SURP,SCHENV=HICPU                            
//JOBLIB DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                     
//*====================================================================         
//*  UPDATE SELF BOOKING FILES AFTER SMS NOTIFICATION (BP13D808)                
//*====================================================================         
//* CHG REF  BY   ON        DESCRIPTION                                         
//* -------- ---  ------    -----------                                         
//* BP136430 KSJ3 20170109  NEW JCL                                             
//* BP136561 KSJ3 20170117  REMOVE BACKUP STEPS DUE TO INSUFF ACCESS            
//*====================================================================         
//*--------------------------------------------------------------------         
//* FOR REGNS NOTIFIED OF SELF BOOKING, CREATE BP13KC20 AND REMOVE              
//* FROM BP13KC25                                                               
//*--------------------------------------------------------------------         
//STEP01   EXEC PGM=BP13C9CK,COND=(0,NE),PARM='CI1TORP,BP13SURP'                
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//         DD DSN=CICS.ALIAS.SDFHEXCI,DISP=SHR                                  
//BP13FC25 DD DSN=BP13.FC25.SELFLIST.Q.SENT,DISP=SHR                            
//BP13L9CK DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*====================================================================         
//*                        E N D   O F   J O B                                  
//*====================================================================         
