//BP13A652 JOB (BP13P),'BP13A652',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*====================================================================         
//* DAILY REPORT TO MATCH FLAT APPLICATION VS HFE APPLICATION DETAILS           
//*--------------------------------------------------------------------         
//*  REQ-NO   OIC  DDMMCCYY  DESCRIPTION                                        
//* --------  ---- --------  ------------------------------------------         
//* BP139746  AM25 02102023  NEW JOB STREAM                                     
//* BP139280  YCH2 21112023  EXPAND BP13K757 FROM 3000 TO 4000                  
//*====================================================================         
//*--------------------------------------------------------------------         
//* DELETE SEQUENTIAL FILE                                                      
//*--------------------------------------------------------------------         
//STEP000  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL (BP13.REPORT.BP13A652)                                                 
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*--------------------------------------------------------------------         
//* SORT OUT F730 FILE                                                          
//*--------------------------------------------------------------------         
//STEP010  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730,DISP=(NEW,PASS),                                       
//            DCB=(LRECL=500,RECFM=FB,BLKSIZE=0),                               
//            SPACE=(CYL,(50,50),RLSE),DATACLAS=MULTIVOL                        
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(123,1,CH,EQ,C'8',AND,261,8,CH,GE,C'20231004')                   
//*--------------------------------------------------------------------         
//* SORT JOINKEYS TO GET F757 RECORDS                                           
//*--------------------------------------------------------------------         
//STEP020A EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F730,DISP=(OLD,PASS)                                        
//SORTJNF2 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//MATCH    DD DSN=&&F757,DISP=(NEW,PASS),                                       
//            DCB=(LRECL=4000,RECFM=FB,BLKSIZE=0),                              
//            SPACE=(CYL,(50,50),RLSE),DATACLAS=MULTIVOL                        
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   REFORMAT FIELDS=(F2:1,4000)                                                  
   OPTION COPY                                                                  
   OUTFILE FNAMES=MATCH                                                         
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* EXTRACT FLAT_ELGBTY_CASE                                                    
//*--------------------------------------------------------------------         
//STEP020B EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F757 DD DSN=&&F757,DISP=(OLD,DELETE)                                      
//BP13FECA DD DSN=&&FECA,DISP=(NEW,PASS),                                       
//            DCB=(LRECL=500,RECFM=FB,BLKSIZE=0),                               
//            SPACE=(CYL,(50,50),RLSE),DATACLAS=MULTIVOL                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
 DSN SYSTEM(DSN)                                                                
 RUN PROGRAM(BP13C51E) PLAN(BP13PCC) -                                          
     LIB('BP13.BATCH.LOADCOB')                                                  
 END                                                                            
//*--------------------------------------------------------------------         
//* GENERATE DAILY REPORT HFE VS SALES                                          
//*--------------------------------------------------------------------         
//STEP030  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//BP13F730 DD DSN=&&F730,DISP=(OLD,DELETE)                                      
//BP13FECA DD DSN=&&FECA,DISP=(OLD,DELETE)                                      
//BP13K023 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13L51E DD DSN=BP13.REPORT.BP13A652,DISP=(NEW,CATLG),                        
//            DCB=(LRECL=500,RECFM=FB,BLKSIZE=0),                               
//            SPACE=(CYL,(50,50),RLSE),DATACLAS=MULTIVOL                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S51E),DISP=SHR                             
//*--------------------------------------------------------------------         
//* STORE DATA INTO HDBWINFS1                                                   
//*--------------------------------------------------------------------         
//PS0900   EXEC FTP,PARM='HDBWINFS1 (EXIT',COND=(0,NE)                          
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
    CD /GROUP/EAPG/APPS/BP13/PREEREPORTS                                        
    ASCII                                                                       
    PUT 'BP13.REPORT.BP13A652' HFE_VS_SALES_REPORT.TXT                          
    QUIT                                                                        
