//BP13H200 JOB (BP13P),'BP13H200',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*--------------------------------------------------------------------         
//* FILE TO ELECTION DEPARTMENT                                                 
//* JOB RUN = ON 10/01, 10/07 FOR PAST 6 MONTH BOOKED UNITS AND                 
//*                                            KEY-ISUED UNITS                  
//*===================================================================*         
//* CHG-NO   BY   ON    - DESCRIPTION                                 *         
//* ---------------------------------                                 *         
//* BP135352 IL5 13012015 - FOR PGM BP13C93D, REMOVE DDNAME BP13KB86  *         
//*                         ADD DDNAME BP13KA10                                 
//* BP136156 LSB 25072016 - INCLUDE UNSOLD FLAT                                 
//* BP136800 LSB 17052017 - OUTPUT ALL BOOKED CASES,                            
//*                         NOT-BOOK, OUTPUT 5-YEAR WITHIN HANDOVER-D           
//*--------------------------------------------------------------------         
//* OMIT BOOKED OR KEY-ISUED BEFORE YEAR 2008                                   
//*--------------------------------------------------------------------         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F120,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=700,BLKSIZE=27300),                              
//         SPACE=(CYL,(150,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
  OMIT COND=((299,8,CH,NE,C'00000000',AND,299,8,CH,LT,C'20100101'),OR,          
          (323,8,CH,NE,C'00000000',AND,323,8,CH,LT,C'20160101'))                
//*--------------------------------------------------------------------         
//* INCLUDE HDB WITH DTE-ACCEPT(COL 299) AND                                    
//*                  DTE-KEY-ISSUED(COL 323)                                    
//*--------------------------------------------------------------------         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BM06F120,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F120BOOK,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=700,BLKSIZE=27300),                              
//         SPACE=(CYL,(150,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
  INCLUDE COND=(180,1,CH,NE,C'5')                                               
//*-----------------------------------------------------------------            
//* OUTPUT HDB BOOKED UNIT FOR THE PAST 6 MONTHS                                
//* OUTPUT HDB KEY-ISSUED UNIT FOR THE PAST 6 MONTHS                            
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13C93C,COND=(0,NE)                                        
//BM06F120 DD DSN=&&F120BOOK,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//AB03F089 DD DSN=AB03.F089.PIDB,DISP=SHR                                       
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//             AMP=('BUFNI=8','BUFND=4')                                        
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13F213A DD DSN=BP13.F213.HDB.BOOK,DISP=OLD                                   
//P13F213B DD DSN=BP13.F213.HDB.TP,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* INCLUDE DBSS WITH DTE-ACCEPT(COL 299) AND                                   
//*              DTE-KEY-ISSUED(COL 323)                                        
//*--------------------------------------------------------------------         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BM06F120,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F120DBSS,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=700,BLKSIZE=27300),                              
//         SPACE=(CYL,(100,50),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
  INCLUDE COND=(180,1,CH,EQ,C'5')                                               
//*-----------------------------------------------------------------            
//* OUTPUT DBSS BOOKED UNIT                                                     
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13C93C,COND=(0,NE)                                        
//BM06F120 DD DSN=&&F120DBSS,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//AB03F089 DD DSN=AB03.F089.PIDB,DISP=SHR                                       
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//             AMP=('BUFNI=8','BUFND=4')                                        
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13F213A DD DSN=BP13.F213.DBS.BOOK,DISP=OLD                                   
//P13F213B DD DSN=BP13.F213.DBS.TP,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* INCLUDE WITH DTE-ACCEPT(COL 29)                                             
//*--------------------------------------------------------------------         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KA30.UNIT,DISP=SHR                                       
//SORTOUT  DD DSN=&&FA30BOOK,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800),                              
//         SPACE=(CYL,(50,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(1,1,CH,EQ,C'E')                                                 
//*-----------------------------------------------------------------            
//* OUTPUT DBSS BOOKED     FILE                                                 
//* OUTPUT DBSS KEY-ISSUED FILE                                                 
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=BP13C93D,COND=(0,NE)                                        
//BP13FA30 DD DSN=&&FA30BOOK,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KA20 DD DSN=BP13.KA20.BLOCK,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KD15 DD DSN=BP13.KD15.DBSSTP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13F213A DD DSN=BP13.F213.EC.BOOK,DISP=OLD                                    
//P13F213B DD DSN=BP13.F213.EC.TP,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*====================================================================         
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - HDB BOOK FILE                                         
//*--------------------------------------------------------------------         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F213.HDB.BOOK,DISP=SHR                                   
//SORTOUT  DD DSN=&&F213HNOB,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(53,9,A,29,8,D),FORMAT=CH                                         
  INCLUDE COND=(53,9,CH,EQ,C'         ')                                        
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - HDB BOOK FILE                                         
//*--------------------------------------------------------------------         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F213.HDB.BOOK,DISP=SHR                                   
//SORTOUT  DD DSN=&&F213HBK,DISP=(,PASS),                                       
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(53,9,A,29,8,D),FORMAT=CH                                         
  INCLUDE COND=(53,9,CH,NE,C'         ')                                        
//*-----------------------------------------------------------------            
//* CHECK MULTIPLE RECORDS FOR HDB BOOKED FILE                                  
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=BP13CB39,COND=(0,NE)                                        
//BP13F213 DD DSN=&&F213HBK,DISP=(OLD,PASS)                                     
//P13F213A DD DSN=&&F213HDUP,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - HDB BOOK FILE                                         
//*--------------------------------------------------------------------         
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F213HNOB,DISP=(OLD,PASS)                                    
//         DD DSN=&&F213HDUP,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F213.HDB.BOOK,DISP=OLD                                   
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,26,A),FORMAT=CH                                                
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - HDB TP FILE                                           
//*--------------------------------------------------------------------         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F213.HDB.TP,DISP=SHR                                     
//SORTOUT  DD DSN=&&F213HTP,DISP=(,PASS),                                       
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(53,9,A,29,8,D),FORMAT=CH                                         
  OMIT COND=(53,9,CH,EQ,C'         ')                                           
//*-----------------------------------------------------------------            
//* CHECK MULTIPLE RECORDS FOR HDB TP FILE                                      
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=BP13CB39,COND=(0,NE)                                        
//BP13F213 DD DSN=&&F213HTP,DISP=(OLD,PASS)                                     
//P13F213A DD DSN=BP13.F213.HDB.TP,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - DBS BOOK FILE                                         
//*--------------------------------------------------------------------         
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F213.DBS.BOOK,DISP=SHR                                   
//SORTOUT  DD DSN=&&F213DBNO,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(53,9,A,29,8,D),FORMAT=CH                                         
  INCLUDE COND=(53,9,CH,EQ,C'         ')                                        
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - DBS BOOK FILE                                         
//*--------------------------------------------------------------------         
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F213.DBS.BOOK,DISP=SHR                                   
//SORTOUT  DD DSN=&&F213DBBK,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(53,9,A,29,8,D),FORMAT=CH                                         
  INCLUDE COND=(53,9,CH,NE,C'         ')                                        
//*-----------------------------------------------------------------            
//* CHECK MULTIPLE RECORDS FOR DBS BOOKED FILE                                  
//*-----------------------------------------------------------------            
//STEP15   EXEC PGM=BP13CB39,COND=(0,NE)                                        
//BP13F213 DD DSN=&&F213DBBK,DISP=(OLD,PASS)                                    
//P13F213A DD DSN=&&F213DBDU,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - DBS BOOK FILE                                         
//*--------------------------------------------------------------------         
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F213DBNO,DISP=(OLD,PASS)                                    
//         DD DSN=&&F213DBDU,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F213.DBS.BOOK,DISP=OLD                                   
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,26,A),FORMAT=CH                                                
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - DBS TP FILE                                           
//*--------------------------------------------------------------------         
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F213.DBS.TP,DISP=SHR                                     
//SORTOUT  DD DSN=&&F213DBTP,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(53,9,A,29,8,D),FORMAT=CH                                         
  OMIT COND=(53,9,CH,EQ,C'         ')                                           
//*-----------------------------------------------------------------            
//* CHECK MULTIPLE RECORDS FOR DBS TP FILE                                      
//*-----------------------------------------------------------------            
//STEP18   EXEC PGM=BP13CB39,COND=(0,NE)                                        
//BP13F213 DD DSN=&&F213DBTP,DISP=(OLD,PASS)                                    
//P13F213A DD DSN=BP13.F213.DBS.TP,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - EC BOOK FILE                                          
//*--------------------------------------------------------------------         
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F213.EC.BOOK,DISP=SHR                                    
//SORTOUT  DD DSN=&&F213ECNO,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(53,9,A,29,8,D),FORMAT=CH                                         
  INCLUDE COND=(53,9,CH,EQ,C'         ')                                        
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - EC BOOK FILE                                          
//*--------------------------------------------------------------------         
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F213.EC.BOOK,DISP=SHR                                    
//SORTOUT  DD DSN=&&F213ECBK,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(53,9,A,29,8,D),FORMAT=CH                                         
  INCLUDE COND=(53,9,CH,NE,C'         ')                                        
//*-----------------------------------------------------------------            
//* CHECK MULTIPLE RECORDS FOR EC BOOKED FILE                                   
//*-----------------------------------------------------------------            
//STEP21   EXEC PGM=BP13CB39,COND=(0,NE)                                        
//BP13F213 DD DSN=&&F213ECBK,DISP=(OLD,PASS)                                    
//P13F213A DD DSN=&&F213ECDU,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - EC BOOK FILE                                          
//*--------------------------------------------------------------------         
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F213ECNO,DISP=(OLD,PASS)                                    
//         DD DSN=&&F213ECDU,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F213.EC.BOOK,DISP=OLD                                    
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,26,A),FORMAT=CH                                                
//*--------------------------------------------------------------------         
//* DROP DUPLICATE NRIC - EC TP FILE                                            
//*--------------------------------------------------------------------         
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F213.EC.TP,DISP=SHR                                      
//SORTOUT  DD DSN=&&F213ECTP,DISP=(,PASS),                                      
//         UNIT=(SYSDA,2),                                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=27900),                              
//         SPACE=(CYL,(50,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(53,9,A,29,8,D),FORMAT=CH                                         
  OMIT COND=(53,9,CH,EQ,C'         ')                                           
//*-----------------------------------------------------------------            
//* CHECK MULTIPLE RECORDS FOR EC TP FILE                                       
//*-----------------------------------------------------------------            
//STEP24   EXEC PGM=BP13CB39,COND=(0,NE)                                        
//BP13F213 DD DSN=&&F213ECTP,DISP=(OLD,PASS)                                    
//P13F213A DD DSN=BP13.F213.EC.TP,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
