//BP13M020  JOB (BP13P),'BP13M020',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* CHG-NO   BY   ON        DESCRIPTION                                         
//* -------- ---  -------   -----------                                         
//* BP130777 CLT 07012000   CONSOLIDATE MONTH-END UPDATE JOBS                   
//* BP130799 CLT 03042000   EXPAND BP13E640 TO 500 CHAR                         
//* BP130821 CLT 11042000   BP13K625 KEY LENGTH CHANGED                         
//* BP130871 SSS 09062000   LISTING FOR EAALSS                                  
//* BP130848 LSB 16082000   ADD REPORT FOR BP13C498, CHG TO > 6 MTHS            
//* BP130998 CLT 21042001   CHANGE LENGTH FOR BP13E350                          
//* BP130998 CLT 01062001   CHANGE INPUT LEN OF BP13E350 TO CHAR600             
//* BP131022 SSS 02072001   REMOVE P13L498C                                     
//* BP132168 CLT 28082002   REMOVE CREATION OF CALENDAR                         
//* BP132546 YCH 11062004 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)               
//* BP132613 LMS 13122004 - ADD BP13E900                                        
//* BP132627 LSB 19042005 - ADD PRI SPACE FROM 90 TO 120 FOR K130               
//* BP132627 GAN 10112004 - CHG F800.APPLN.KEYISSUE TO BP13K893                 
//*                         CHG F820.OCCUP.KEYISSUE TO BP13K895                 
//* BP13XXXX CCC 06092016 - INCLUDE VERIFY STEP                                 
//* BP137924 CCC 01082019 - CATER FOR LARGER SPACE &&BP13F130 (STEP13A)         
//* BP138647 LSB 01042021 - EXPAND SAPCE DEFINE BP13K130                        
//* BP138865 KR1328102021 - REMOVED REPORT BP13L499.                            
//*=================================================================            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : CLASS = 2                                                          
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2A CP-1',END;                                    
1$DJDE$ JDE=13C510,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALAG2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT02 : CLASS = 2                                                          
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                            
//*  PRT03 : CLASS = 2                                                          
//*-----------------------------------------------------------------            
//PRT03  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1B CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=1,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1B                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CREATE WORKPLAN FOR SCHEDULING OF APPT FOR COLLECTION OF RD       *        
//*--------------------------------------------------------------------*        
//STEP05   EXEC PGM=BP13C663,COND=(0,NE)                                        
//CP27K090  DD  DSN=CP27.K090.HOLIDAY,DISP=SHR                                  
//BP13K388  DD  DSN=BP13.K388.TIMESLOT,DISP=SHR                                 
//BP13K382  DD  DSN=BP13.F382.WORKPLAN,DISP=SHR                                 
//BP13F382  DD  DSN=BP13.F382.WORKPLAN,DISP=SHR                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CREATE TEMP FILE OF BP13K382 - WORKPLAN    FILE (1)               *        
//*--------------------------------------------------------------------*        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K382.WORKPLAN,DISP=SHR                                   
//SORTOUT  DD DSN=&&STEP74A,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=450,BLKSIZE=22500),                             
//          SPACE=(CYL,(5,1),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CREATE TEMP FILE OF BP13K382 - WORKPLAN    FILE (2)               *        
//*--------------------------------------------------------------------*        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&STEP74A,DISP=(OLD,PASS)                                     
//         DD DSN=BP13.F382.WORKPLAN,DISP=SHR                                   
//SORTOUT  DD DSN=&&STEP74B,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=450,BLKSIZE=22500),                             
//          SPACE=(CYL,(5,1),RLSE)                                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E50000                                   
   SUM FIELDS=NONE                                                              
//*                                                                             
//*===================================================================          
//* VERIFY FILES BEFORE RE-DEFINE                                               
//*-----------------------------------------------------------------            
//STEP07A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K382.WORKPLAN,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*                                                                             
//*--------------------------------------------------------------------*        
//*  DEFINE WORKPLAN TABLE VSAM FILE BP13K382                          *        
//*--------------------------------------------------------------------*        
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&STEP74B,DISP=(OLD,PASS)                                     
//SYSIN    DD *                                                                 
         DEL 'BP13.K382.WORKPLAN' CLUSTER PURGE                                 
         DEF CL (NAME(BP13.K382.WORKPLAN) -                                     
                 TRK(5 3)                 -                                     
                 SHR(2 3)                 -                                     
                 KEYS(8 0)               -                                      
                 RECSZ(450 450)           -                                     
                 CISZ(4096)               -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 IXD                      -                                     
                 UNQ)                     -                                     
              DATA                        -                                     
              (NAME(BP13.K382.WORKPLAN.DATA)) -                                 
              INDEX                           -                                 
              (NAME (BP13.K382.WORKPLAN.INDEX))                                 
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K382.WORKPLAN)                                             
/*                                                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//*  SORT BY REGN-NO  INCLUDE REGN-DEPOSIT PAID BY CASH                *        
//*  BP13.F136.MTHTRAN IS USED INSTEAD OF BP13.F136.BACKUP(0)          *        
//*--------------------------------------------------------------------*        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&F136RDEP,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,3),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=150,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,D),FORMAT=CH                                                
   INCLUDE COND=(1,2,CH,EQ,C'11',AND,                                           
                84,4,CH,EQ,C'5000',AND,                                         
                99,3,CH,EQ,C'RDE')                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//*  UPDATE FS-TAG=1 IF PAID REGN-DEPOSIT BY CASH                      *        
//*--------------------------------------------------------------------*        
//STEP10   EXEC PGM=BP13C122,COND=(0,NE)                                        
//BP13F136 DD   DSN=&&F136RDEP,DISP=(OLD,PASS)                                  
//BP13K800 DD   DSN=BP13.K800.APPLN,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//BP13L122 DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID),DEST=IOM2                        
//*                                                                             
//*--------------------------------------------------------------------*        
//*  BACKUP SOCHIST FILE TO CARTRIDGE - 12 GDG                         *        
//*--------------------------------------------------------------------*        
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F130.SOCHIST.MONTH(+1),DISP=(,PASS),                     
//            UNIT=CART,LABEL=(,SL),                                            
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=150,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CATALOG GDG                                                       *        
//*--------------------------------------------------------------------*        
//STEP12    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT2    DD DSN=BP13.F130.SOCHIST.MONTH(+1),DISP=(OLD,CATLG),                
//             UNIT=(,,DEFER)                                                   
//*                                                                             
//*--------------------------------------------------------------------*        
//*  SORT IN BP13K130 KEY-FLD                                          *        
//*--------------------------------------------------------------------*        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F130,DISP=(NEW,PASS),                                   
//          UNIT=(SYSDA,20),                                                    
//          DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400),                             
//          SPACE=(CYL,(200,20),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN     DD  *                                                               
   SORT FIELDS=(5,19,A),FORMAT=CH                                               
/*                                                                              
//*                                                                             
//*===================================================================          
//* VERIFY FILES BEFORE RE-DEFINE                                               
//*-----------------------------------------------------------------            
//STEP13A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT2   DD DSN=BP13.K130.SOCHIST,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT2)                                                      
//*                                                                             
//*--------------------------------------------------------------------*        
//* DELETE & DEFINE BP13K130                                           *        
//*--------------------------------------------------------------------*        
//STEP14    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&BP13F130,DISP=(OLD,PASS)                                   
//SYSIN     DD  *                                                               
          DEL (BP13.K130.SOCHIST) CL PURGE                                      
          DEF CLUSTER                                -                          
             (NAME(BP13.K130.SOCHIST)          -                                
             CYL(190 30)                            -                           
             DATACLAS(MULTIVOL)                     -                           
             UNIQUE                                 -                           
             STORCLAS(PRODRLS)                      -                           
             LOG(NONE)                              -                           
             SHR(2 3))                              -                           
             DATA                                   -                           
            (NAME(BP13.K130.SOCHIST.DATA)     -                                 
             KEYS(19 4)                             -                           
             RECSZ(150 150)                         -                           
             CISZ(4096)                             -                           
             FSPC(10 10))                           -                           
             INDEX                                  -                           
             (NAME(BP13.K130.SOCHIST.INDEX)    -                                
             CISZ(4096))                                                        
     IF MAXCC = 0  THEN                             -                           
     REPRO IFILE(INPUT1)                            -                           
           ODS(BP13.K130.SOCHIST)                                               
//*                                                                             
//*--------------------------------------------------------------------*        
//* DELETE CANCELLED CASES > 6 MONTHS                                  *        
//*--------------------------------------------------------------------*        
//STEP15   EXEC PGM=BP13C498,COND=(0,NE)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13L498 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L498A DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L498B DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSADBG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------*        
//* PURGE HISTORY RECORDS FOR KEY ISSUED CASES > 1 YEAR                *        
//*                       AND CANCELLED  CASES > 3 YEARS               *        
//*--------------------------------------------------------------------*        
//STEP16   EXEC PGM=BP13C499,COND=(0,NE)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=20')                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSADBG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------*        
//* SORT THE ACCUMSO BY REGN ORDER                                     *        
//*--------------------------------------------------------------------*        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.F410.MTHSO,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP05,DISP=(NEW,PASS),                                     
//            DCB=*.SORTIN,SPACE=(TRK,(50,20),RLSE)                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,CH,A)                                                        
/*                                                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//* SORT THE ADDR BY REGN ORDER                                        *        
//*--------------------------------------------------------------------*        
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K835.ADDR.LOG,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F835,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,20),RLSE),                              
//            DCB=(LRECL=250,RECFM=FB),DSORG=PS                                 
//SYSIN    DD *                                                                 
  SORT FIELDS=(227,8,CH,A)                                                      
/*                                                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//* TO DELETE HISTORICAL ADDR LOG FOR KEY-ISSUED CASES.                *        
//*--------------------------------------------------------------------*        
//STEP19   EXEC  PGM=BP13C828,COND=(0,NE)                                       
//SYSOUT   DD  SYSOUT=*                                                         
//BP13F410 DD  DSN=&&STEP05,DISP=(OLD,PASS)                                     
//BP13F835 DD  DSN=&&BP13F835,DISP=(OLD,PASS)                                   
//BP13K835 DD  DSN=BP13.K835.ADDR.LOG,DISP=SHR                                  
//*                                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP STAMPING FILE BEFORE RUN                                  *         
//*-------------------------------------------------------------------*         
//STEP20 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT     DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                  
//OUTPUT    DD DSN=BP13.F625.STAMPFEE.BKUP(+1),DISP=(NEW,CATLG),                
//          SPACE=(CYL,(10,5)),                                                 
//          DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                     
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                         
//*                                                                             
//*--------------------------------------------------------------------*        
//* TO SORT RECORDS IN ASCENDING ORDER OF DTE-IRAS-PROCESSED           *        
//*--------------------------------------------------------------------*        
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F625,DISP=(NEW,PASS),UNIT=SYSDA,                        
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(200,50),RLSE)                                         
//SYSIN DD *                                                                    
    SORT FIELDS=(262,8,A),FORMAT=CH                                             
//*                                                                             
//*--------------------------------------------------------------------*        
//* RUN BP13C434 TO PURGE RECS > 90 DAYS                               *        
//*--------------------------------------------------------------------*        
//STEP22   EXEC PGM=BP13C434,COND=(0,NE)                                        
//BP13F625 DD DSN=&&BP13F625,DISP=(OLD,DELETE)                                  
//P13F625A DD DSN=&&P13F625A,DISP=(NEW,PASS),UNIT=SYSDA,                        
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(200,50),RLSE)                                         
//P13F625B DD DSN=&&P13F625B,DISP=(NEW,PASS),UNIT=SYSDA,                        
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(200,50),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRIN  DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*                                                                             
//*--------------------------------------------------------------------*        
//* TO SORT ACCORDING TO PRIMARY KEY SEQUENCE OF BP13K625              *        
//*--------------------------------------------------------------------*        
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F625B,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&P13F625C,DISP=(NEW,PASS),UNIT=SYSDA,                        
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(200,50),RLSE)                                         
//SYSIN DD *                                                                    
    SORT FIELDS=(1,16,A),FORMAT=CH                                              
//*                                                                             
//*===================================================================          
//* VERIFY FILES BEFORE RE-DEFINE                                               
//*-----------------------------------------------------------------            
//STEP23A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT3   DD DSN=BP13.K625.STAMPFEE,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT3)                                                      
//*                                                                             
//*--------------------------------------------------------------------*        
//* DELETE/DEFINE STAMPING MASTER FILE                                 *        
//*--------------------------------------------------------------------*        
//STEP24   EXEC PGM=IDCAMS,COND=(0,NE),REGION=2000K                             
//INPUT    DD DSN=&&P13F625C,DISP=(OLD,DELETE)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL 'BP13.K625.STAMPFEE' CL PURGE                                      
         DEF CL (NAME(BP13.K625.STAMPFEE) -                                     
                 CYL(200 100)             -                                     
                 SHR(2 3)                 -                                     
                 UNIQUE                   -                                     
                 STORCLAS(PRODRLS)        -                                     
                 LOG(NONE)                -                                     
                 SPEED                    -                                     
                 KEYS(16 0)               -                                     
                 CISZ(4096)               -                                     
                 RECSZ(500 500))                                                
         IF LASTCC = 0 THEN               -                                     
         REPRO IFILE(INPUT)               -                                     
               ODS(BP13.K625.STAMPFEE)    -                                     
              REUSE                                                             
         IF MAXCC = 0 THEN                -                                     
           DEF AIX (NAME(BP13.K625.STAMPFEE.ALTX1) -                            
               REL(BP13.K625.STAMPFEE)    -                                     
               CYL(50 20)                 -                                     
               SHR(2 3)                   -                                     
               UNIQUE                     -                                     
               KEYS(11 16)                -                                     
               CISZ(4096)                 -                                     
               RECSZ(2000 9000)           -                                     
               NUNQK)                                                           
         IF LASTCC = 0 THEN               -                                     
           DEF PATH(NAME(BP13.K625.STAMPFEE.PATH1) -                            
               PENT(BP13.K625.STAMPFEE.ALTX1))                                  
         IF LASTCC = 0 THEN               -                                     
           BIX IDS(BP13.K625.STAMPFEE)    -                                     
               ODS(BP13.K625.STAMPFEE.ALTX1)                                    
         IF MAXCC = 0 THEN                -                                     
           DEF AIX (NAME(BP13.K625.STAMPFEE.ALTX2) -                            
                REL(BP13.K625.STAMPFEE)    -                                    
                CYL(50 20)                 -                                    
                UNIQUE                     -                                    
                SHR(2 3)                   -                                    
                KEYS(13 27)                -                                    
                CISZ(4096)                 -                                    
                RECSZ(2000 9000)           -                                    
                NUNQK)                                                          
          IF LASTCC = 0 THEN               -                                    
            DEF PATH(NAME(BP13.K625.STAMPFEE.PATH2) -                           
                PENT(BP13.K625.STAMPFEE.ALTX2))                                 
          IF LASTCC = 0 THEN               -                                    
            BIX IDS(BP13.K625.STAMPFEE)    -                                    
                ODS(BP13.K625.STAMPFEE.ALTX2)                                   
//*                                                                             
//*--------------------------------------------------------------------*        
//* BACKUP STAMPING FILE FOR 2 YEARS                                   *        
//*--------------------------------------------------------------------*        
//STEP25 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT     DD DSN=&&P13F625A,DISP=(OLD,DELETE)                                 
//OUTPUT    DD DSN=BP13.F625.STAMPFEE.MBKUP(+1),DISP=(NEW,CATLG),               
//          SPACE=(CYL,(30,10)),                                                
//          DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                     
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                         
//*                                                                             
//*--------------------------------------------------------------------*        
//* SORT OUT LOG FILE                                                           
//*--------------------------------------------------------------------*        
//STEP25A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.E900.LOG,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13E900,DISP=(NEW,PASS),UNIT=SYSDA,                        
//            DCB=(BLKSIZE=0,LRECL=800,RECFM=FB),                               
//            SPACE=(CYL,(20,20),RLSE)                                          
//SYSIN DD *                                                                    
    SORT FIELDS=(1,43,A),FORMAT=CH                                              
//*                                                                             
//*--------------------------------------------------------------------*        
//* BACKUP (1)  BP13.E350.STDAPT.LOG                                   *        
//*        (2)  BP13.E640.CA.ACTION                                    *        
//*--------------------------------------------------------------------*        
//STEP26 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD  DSN=BP13.E350.STDAPT.LOG,DISP=SHR                                
//OUTPUT1  DD  DSN=BP13.E350.STDAPT.LOG.MONTH(+1),                              
//             DISP=(,PASS),                                                    
//             UNIT=CART,                                                       
//             LABEL=(,SL),                                                     
//             DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)                  
//INPUT2   DD  DSN=BP13.E640.CA.ACTION.LOG,DISP=SHR                             
//OUTPUT2  DD  DSN=BP13.E640.CA.ACTION.LOG.MONTH(+1),                           
//             DISP=(,PASS),                                                    
//             UNIT=CART,                                                       
//             LABEL=(2,SL),                                                    
//             VOL=REF=*.OUTPUT1,                                               
//             DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                  
//INPUT3   DD  DSN=&&BP13E900,DISP=(OLD,PASS)                                   
//         DD  DSN=BP13.BLANK.CHAR800,DISP=SHR                                  
//OUTPUT3  DD  DSN=BP13.E900.LOG.MONTH(+1),                                     
//             DISP=(,PASS),                                                    
//             UNIT=CART,                                                       
//             LABEL=(3,SL),                                                    
//             VOL=REF=*.OUTPUT1,                                               
//             DCB=(BP13.GDG,BLKSIZE=27200,LRECL=800,RECFM=FB)                  
//*                                                                             
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
     REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                      
     REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                      
//*                                                                             
//*--------------------------------------------------------------------*        
//* CATALOG GDG                                                        *        
//*--------------------------------------------------------------------*        
//STEP27 EXEC    PGM=IEFBR14,COND=(0,NE)                                        
//INPUT01  DD  DSN=BP13.E350.STDAPT.LOG.MONTH(+1),                              
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//INPUT02  DD  DSN=BP13.E640.CA.ACTION.LOG.MONTH(+1),                           
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//INPUT03  DD  DSN=BP13.E900.LOG.MONTH(+1),                                     
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//*                                                                             
//*--------------------------------------------------------------------*        
//* TO DELETE & DEFINE BP13.E350.STDAPT.LOG                            *        
//*--------------------------------------------------------------------*        
//STEP28    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR600,DISP=SHR                                  
//SYSIN    DD *                                                                 
         DEL (BP13.E350.STDAPT.LOG) CLUSTER PURGE                               
         DEF CL (NAME(BP13.E350.STDAPT.LOG)     -                               
                 CYL(10 5)                      -                               
                 SHR(2 3)                       -                               
                 RECSZ(600 600)                 -                               
                 CISZ(4096)                     -                               
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 NIXD)                          -                               
              DATA                              -                               
              (NAME(BP13.E350.STDAPT.LOG.DATA))                                 
         IF MAXCC = 0  THEN                     -                               
            REPRO IFILE(INPUT1)                 -                               
                 ODS(BP13.E350.STDAPT.LOG)                                      
//*                                                                             
//*-----------------------------------------------------------------*           
//* TO DELETE & DEFINE BP13.E640.CA.ACTION.LOG                      *           
//*-----------------------------------------------------------------*           
//STEP29    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR500,DISP=SHR                                  
//SYSIN     DD *                                                                
         DEL (BP13.E640.CA.ACTION.LOG) CLUSTER PURGE                            
         DEF CL (NAME(BP13.E640.CA.ACTION.LOG)     -                            
                 CYL(20 10)                        -                            
                 SHR(2 3)                          -                            
                 RECSZ(500 500)                    -                            
                 CISZ(4096)                        -                            
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 NIXD)                             -                            
              DATA                                 -                            
              (NAME(BP13.E640.CA.ACTION.LOG.DATA))                              
         IF MAXCC = 0  THEN                        -                            
            REPRO IFILE(INPUT1)                    -                            
                 ODS(BP13.E640.CA.ACTION.LOG)                                   
//*                                                                             
//*---------------------------------------------------------------------        
//* TO DELETE & DEFINE BP13.E900.LOG                                            
//*---------------------------------------------------------------------        
//STEP30    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR800,DISP=SHR                                  
//SYSIN    DD *                                                                 
         DEL 'BP13.E900.LOG' CLUSTER PURGE                                      
         DEF CL (NAME(BP13.E900.LOG) -                                          
                 CYL(10 5)                -                                     
                 SHR(2 3)                 -                                     
                 RECSZ(800 800)           -                                     
                 CISZ(4096)               -                                     
                 NIXD)                    -                                     
              DATA                        -                                     
              (NAME(BP13.E900.LOG.DATA))                                        
//*-----------------------------------------------------------------            
//*            END OF JOB                                          *            
//*-----------------------------------------------------------------            
