//BP13A26A JOB (BP13P),'BP13A26A',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//*1) TAG CASES IN BP13K200 WITH T IF MATCHED WITH INPUT FILE                   
//*-----------------------------------------------------------------    00130010
//* VERIFY THE FILES ARE CLOSED                                         00130010
//*-----------------------------------------------------------------    00130010
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K200.BKAPPMT,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
       VFY FILE(INPUT1)                                                         
//*---------------------------------------------------------------------        
//* SORT INPUT FILE BY REGN NUMBER                                              
//*---------------------------------------------------------------------        
//SORT02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.BP13C92N.BI,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13INP,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=10),                               
//            SPACE=(CYL,(1,1),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* MATCH INPUT FILE REGN NO TO K200                                            
//*-----------------------------------------------------------------            
//STEP03 EXEC PGM=BP13C92N,COND=(0,NE)                                          
//BP13INP  DD DSN=&&BP13INP,DISP=(OLD,PASS)                                     
//BP13F200 DD DSN=BP13.F200.BKAPPMT,DISP=SHR                                    
//BP13K200 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                    
//BP13K201 DD DSN=BP13.K200.BKAPPMT.PATH1,DISP=SHR                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
