//BP13DBK4  JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                
//      NOTIFY=CSD0071                                                          
//*--------------------------------------------------------------------         
//* BP130487 SSS 980507 - CHG UNIT=3480 TO UNIT=CART                            
//* BP130418 SIA 980923 - Y2K COMPLIANCE CHANGES                                
//* BP130778 LSB 991221 - MOVE BACK BP13K848 TO BP13DBK2                        
//*--------------------------------------------------------------------         
//* BACKUP BACKUP IMAGE VSAM FILE TO SEQUENTIAL FILE FOR THE DAY                
//*--------------------------------------------------------------------         
//*--------------------------------------------------------------------         
//* BACKUP SOCHIST FILE TO CARTRIDGE - 7 GDG                                    
//*--------------------------------------------------------------------         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=33')                                                  
//OUTPUT1  DD DSN=BP13.F130.SOCHIST.DAILY(+1),DISP=(,PASS),                     
//            UNIT=CART,LABEL=(,SL),                                            
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=150,RECFM=FB)                   
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
//*                                                                             
//*---------------------------------------------------------------------00040200
//*  CATALOG GDG                                                        03280004
//*---------------------------------------------------------------------00040200
//STEP02   EXEC PGM=IEFBR14,COND=(0,NE)                                 03300004
//INPUT2   DD DSN=BP13.F130.SOCHIST.DAILY(+1),DISP=(OLD,CATLG),         03351100
//            UNIT=(,,DEFER)                                            03351200
