//BP13DBK2  JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                
//      NOTIFY=CSD0071                                                          
//*********************************************************************         
//* BP130487 SSS 980507 - CHG UNIT=3480 TO UNIT=CART                            
//* BP130418 CLT 980924 - Y2K COMPLIANCE CHANEGS                                
//* BP130778 LSB 991221 - MOVE BACKUP BP13K848 FROM BP13DBK4 TO HERE            
//* BP132500 LMS 040423 - BACKUP FOR BP13F223 AND BP13F225                      
//* BP132546 YCH 040611 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//* BP132541 LMS 041029 - BACKUP SOCG FILES                                     
//* BP132772 LSB 060610 - BACKUP DBSS FILE                                      
//* BP133091 LMS 071215 - EXPANSION OF BP13KD00 FROM 1200 TO 1600               
//* BP134164 JB8 110304 - BACKUP BP13KB00                                       
//* BP134029 LJL 110811 - BACKUP BP13K482 AND BP13K486                          
//* BP134387 DW5 301111 - BACKUP BP13KP00 AND BP13KQ10                          
//* BP134587 DW5 020712 - BACKUP BP13KP00 TO TAPE                               
//*--------------------------------------------------------------------         
//*  VERIFY FILES BEFORE DAILY BACKUP RUN                                       
//*--------------------------------------------------------------------         
//STEP1    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT2   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*--------------------------------------------------------------------         
//*-  REPRO VSAM FILE TO SEQUENTIAL FILES                                       
//*--------------------------------------------------------------------         
//STEP2     EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=13')                                                 
//OUTPUT1   DD DSN=BP13.F800.APPLN,DISP=OLD                                     
//*                                                                             
//INPUT2    DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                   
//OUTPUT2   DD DSN=BP13.F140.KIVTRAN,DISP=OLD                                   
//*                                                                             
//INPUT3    DD DSN=BP13.K150.EXAPPL,DISP=OLD                                    
//OUTPUT3   DD DSN=BP13.F150.EXAPPL,DISP=OLD                                    
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------00040200
//*  BACKUP BP13 APPLN AND OCCUP FILE BEFORE PRODUCTION JOBS            00250000
//*  - 14 GDG                                                           00250000
//*---------------------------------------------------------------------00040200
//STEP3    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=SHR,                             00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT1  DD DSN=BP13.F800.APPLN.BFDAILY(+1),DISP=(,PASS),             00513000
//            UNIT=CART,LABEL=(1,SL),                                   00513100
//            DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)          00514200
//INPUT2   DD DSN=BP13.K820.OCCUP,DISP=SHR,                             00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT2  DD DSN=BP13.F820.OCCUP.BFDAILY(+1),DISP=(,PASS),             00513000
//            UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)           00514200
//INPUT3   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                           00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT3  DD DSN=BP13.FD00.DBSMAST.BFDAILY(+1),DISP=(,PASS),           00513000
//            UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=27200,LRECL=1600,RECFM=FB)          00514200
//INPUT4   DD DSN=BP13.KD38.PPTRANS,DISP=SHR,                           00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT4  DD DSN=BP13.FD38.PPTRANS.BFDAILY(+1),DISP=(,PASS),           00513000
//            UNIT=CART,LABEL=(4,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)           00514200
//INPUT5   DD DSN=BP13.KD35.APPSCHDL,DISP=SHR,                          00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT5  DD DSN=BP13.FD35.APPSCHDL.BFDAILY(+1),DISP=(,PASS),          00513000
//            UNIT=CART,LABEL=(5,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=17500,LRECL=3500,RECFM=FB)          00514200
//INPUT6   DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                           00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT6  DD DSN=BP13.FD40.APPLPAY.BFDAILY(+1),DISP=(,PASS),           00513000
//            UNIT=CART,LABEL=(6,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=27000,LRECL=1500,RECFM=FB)          00514200
//INPUT7   DD DSN=BP13.KD60.ACCHIST,DISP=SHR,                           00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT7  DD DSN=BP13.FD60.ACCHIST.BFDAILY(+1),DISP=(,PASS),           00513000
//            UNIT=CART,LABEL=(7,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=27750,LRECL=250,RECFM=FB)           00514200
//INPUT8   DD DSN=BP13.KB00.BEBTO,DISP=SHR,                             00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT8  DD DSN=BP13.FB00.BEBTO.BFDAILY(+1),DISP=(,PASS),             00513000
//            UNIT=CART,LABEL=(8,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=27800,LRECL=200,RECFM=FB)           00514200
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
     REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                      
     REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                      
     REPRO INFILE(INPUT4) OUTFILE(OUTPUT4)                                      
     REPRO INFILE(INPUT5) OUTFILE(OUTPUT5)                                      
     REPRO INFILE(INPUT6) OUTFILE(OUTPUT6)                                      
     REPRO INFILE(INPUT7) OUTFILE(OUTPUT7)                                      
     REPRO INFILE(INPUT8) OUTFILE(OUTPUT8)                                      
//*---------------------------------------------------------------------00040200
//*  CATALOG GDG                                                        03280004
//*---------------------------------------------------------------------00040200
//STEP4     EXEC PGM=IEFBR14,COND=(0,NE)                                03300004
//INPUT1    DD DSN=BP13.F800.APPLN.BFDAILY(+1),DISP=(OLD,CATLG),        03351101
//             UNIT=(,,DEFER)                                           03351201
//INPUT2    DD DSN=BP13.F820.OCCUP.BFDAILY(+1),DISP=(OLD,CATLG),        03351101
//             UNIT=(,,DEFER)                                           03351201
//INPUT3   DD DSN=BP13.FD00.DBSMAST.BFDAILY(+1),DISP=(OLD,CATLG),       00513000
//             UNIT=(,,DEFER)                                           03351201
//INPUT4   DD DSN=BP13.FD38.PPTRANS.BFDAILY(+1),DISP=(OLD,CATLG),       00513000
//             UNIT=(,,DEFER)                                           03351201
//INPUT5   DD DSN=BP13.FD35.APPSCHDL.BFDAILY(+1),DISP=(OLD,CATLG),      00513000
//             UNIT=(,,DEFER)                                           03351201
//INPUT6   DD DSN=BP13.FD40.APPLPAY.BFDAILY(+1),DISP=(OLD,CATLG),       00513000
//             UNIT=(,,DEFER)                                           03351201
//INPUT7   DD DSN=BP13.FD60.ACCHIST.BFDAILY(+1),DISP=(OLD,CATLG),       00513000
//             UNIT=(,,DEFER)                                           03351201
//INPUT8   DD DSN=BP13.FB00.BEBTO.BFDAILY(+1),DISP=(OLD,CATLG),         00513000
//             UNIT=(,,DEFER)                                           03351201
//*---------------------------------------------------------------------00040200
//*-  REPRO VSAM FILE TO SEQUENTIAL FILES                                       
//*--------------------------------------------------------------------         
//STEP5     EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K200.BKAPPMT,DISP=SHR                                   
//OUTPUT1   DD DSN=BP13.F200.BKAPPMT.BKUP,DISP=OLD                              
//INPUT2    DD DSN=BP13.K210.BKWKPLAN,DISP=SHR                                  
//OUTPUT2   DD DSN=BP13.F210.BKWKPLAN,DISP=OLD                                  
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*---------------------------------------------------------------------00040200
//*-  REPRO VSAM FILE TO SEQUENTIAL FILES                                       
//*--------------------------------------------------------------------         
//STEP6     EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K530.ISSUENO,DISP=SHR                                   
//OUTPUT1   DD DSN=BP13.F530.ISSUENO,DISP=OLD                                   
//INPUT2    DD DSN=BP13.K532.RESEREGN,DISP=SHR                                  
//OUTPUT2   DD DSN=BP13.F532.RESEREGN,DISP=OLD                                  
//INPUT3    DD DSN=BP13.K960.REGNRIC,DISP=SHR                                   
//OUTPUT3   DD DSN=BP13.F960.REGNRIC,DISP=OLD                                   
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*--------------------------------------------------------------------         
//* BACKUP BACKUP IMAGE VSAM FILE TO SEQUENTIAL FILE FOR THE DAY                
//*--------------------------------------------------------------------         
//STEP7    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K848.BKIMAGE,DISP=SHR,                                   
//            AMP=('BUFND=33')                                                  
//OUTPUT1  DD DSN=BP13.F848.BKIMAGE,DISP=MOD                                    
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
//*                                                                             
//*--------------------------------------------------------------------         
//* SORT THE BACKUP IMAGE RECORD FOR THE DAY AND PREVIOUS DAYS                  
//* IN REGN-NO ORDER TO CARTRIDGE - 3 GDG                                       
//*---------------------------------------------------------------------        
//STEP8    EXEC SORT,COND=(0,NE)                                        00010000
//SORTIN   DD DSN=BP13.F848.BKIMAGE,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F848.BKIMAGE.DAILY(+1),DISP=(NEW,CATLG),                 
//            UNIT=CART,LABEL=(,SL),                                            
//            DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)                  
//SYSIN    DD *                                                         00150000
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*      SOC MASTER BKIMAGE FILE                                   *            
//*--------------------------------------------------------------------         
//STEP9    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.BLANK.CHAR2000,DISP=SHR                                  
//SYSIN    DD  *                                                                
          DEL (BP13.K848.BKIMAGE) CL PURGE                                      
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K848.BKIMAGE)               -                  00810000
              CYL(5 3)                               -                  00830000
              UNIQUE                                 -                  00840000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K848.BKIMAGE.DATA)          -                  00870000
              KEYS(24 1976)                         -                   00880000
              RECSZ(2000 2000)                       -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K848.BKIMAGE.INDEX)         -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K848.BKIMAGE)                                    00720000
//*---------------------------------------------------------------------00040200
//*-  REPRO VSAM FILE TO SEQUENTIAL FILES                                       
//*--------------------------------------------------------------------         
//STEP10    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K223.APPMT,DISP=SHR                                     
//OUTPUT1   DD DSN=BP13.F223.APPMT,DISP=OLD                                     
//INPUT2    DD DSN=BP13.K225.QUEUE,DISP=SHR                                     
//OUTPUT2   DD DSN=BP13.F225.QUEUE,DISP=OLD                                     
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*---------------------------------------------------------------------00040200
//*-  REPRO VSAM FILE TO SEQUENTIAL FILES                                       
//*--------------------------------------------------------------------         
//STEP11    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K940.APLCTN.BO,DISP=SHR                                 
//OUTPUT1   DD DSN=BP13.F940.APLCTN.BO,DISP=OLD                                 
//INPUT2    DD DSN=BP13.K943.OCPR.BO,DISP=SHR                                   
//OUTPUT2   DD DSN=BP13.F943.OCPR.BO,DISP=OLD                                   
//INPUT3    DD DSN=BP13.K970.MRTG.HIST,DISP=SHR                                 
//OUTPUT3   DD DSN=BP13.F970.MRTG.HIST,DISP=OLD                                 
//INPUT4    DD DSN=BP13.K975.OCPR.MRTG,DISP=SHR                                 
//OUTPUT4   DD DSN=BP13.F975.OCPR.MRTG.HIST,DISP=OLD                            
//INPUT5    DD DSN=BP13.K980.TRNSFR.HIST,DISP=SHR                               
//OUTPUT5   DD DSN=BP13.F980.TRNSFR.HIST,DISP=OLD                               
//INPUT6    DD DSN=BP13.K985.OCPR.TRNSFR,DISP=SHR                               
//OUTPUT6   DD DSN=BP13.F985.OCPR.TRNSFR.HIST,DISP=OLD                          
//INPUT7    DD DSN=BP13.K990.SUBLET.HIST,DISP=SHR                               
//OUTPUT7   DD DSN=BP13.F990.SUBLET.HIST,DISP=OLD                               
//INPUT8    DD DSN=BP13.K995.OCPR.SUBLET.HIST,DISP=SHR                          
//OUTPUT8   DD DSN=BP13.F995.OCPR.SUBLET.HIST,DISP=OLD                          
//INPUT9    DD DSN=BP13.K945.DEBREF,DISP=SHR                                    
//OUTPUT9   DD DSN=BP13.F945.DEBREF,DISP=OLD                                    
//INPUT10   DD DSN=BP13.K900.SRNDR.HIST,DISP=SHR                                
//OUTPUT10  DD DSN=BP13.F900.SRNDR.HIST,DISP=OLD                                
//INPUT11   DD DSN=BP13.K905.OCPR.SRNDR,DISP=SHR                                
//OUTPUT11  DD DSN=BP13.F905.OCPR.SRNDR.HIST,DISP=SHR                           
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
   REPRO INFILE(INPUT7)  OUTFILE(OUTPUT7)                                       
   REPRO INFILE(INPUT8)  OUTFILE(OUTPUT8)                                       
   REPRO INFILE(INPUT9)  OUTFILE(OUTPUT9)                                       
   REPRO INFILE(INPUT10) OUTFILE(OUTPUT10)                                      
   REPRO INFILE(INPUT11) OUTFILE(OUTPUT11)                                      
//*---------------------------------------------------------------------00040200
//*-  REPRO VSAM FILE TO SEQUENTIAL FILES                                       
//*--------------------------------------------------------------------         
//STEP12    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K920.APPEAL.HIST,DISP=SHR                               
//OUTPUT1   DD DSN=BP13.F920.APPEAL.HIST,DISP=OLD                               
//INPUT2    DD DSN=BP13.K922.SUBLET,DISP=SHR                                    
//OUTPUT2   DD DSN=BP13.F922.SUBLET,DISP=OLD                                    
//INPUT3    DD DSN=BP13.K924.MORTGAGE,DISP=SHR                                  
//OUTPUT3   DD DSN=BP13.F924.MORTGAGE,DISP=OLD                                  
//INPUT4    DD DSN=BP13.K925.OCPR.APPEAL,DISP=SHR                               
//OUTPUT4   DD DSN=BP13.F925.OCPR.APPEAL.HIST,DISP=OLD                          
//INPUT5    DD DSN=BP13.K926.APPEAL,DISP=SHR                                    
//OUTPUT5   DD DSN=BP13.F926.APPEAL,DISP=OLD                                    
//INPUT6    DD DSN=BP13.K928.TRANSFER,DISP=SHR                                  
//OUTPUT6   DD DSN=BP13.F928.TRANSFER,DISP=OLD                                  
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
//*---------------------------------------------------------------------00040200
//*-  REPRO VSAM FILE TO SEQUENTIAL FILES                                       
//*--------------------------------------------------------------------         
//STEP13    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K482.FLATSOLD.BFSL,DISP=SHR                             
//OUTPUT1   DD DSN=BP13.F482.FLATSOLD.BFSL,DISP=OLD                             
//INPUT2    DD DSN=BP13.K486.SELLER.BFSL,DISP=SHR                               
//OUTPUT2   DD DSN=BP13.F486.SELLER.BFSL,DISP=OLD                               
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*--------------------------------------------------------------------*        
//* BACKUP BP13KP00 AND BP13KQ10                                                
//*--------------------------------------------------------------------         
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD  DSN=BP13.KP00.DOC,                                       00000250
//             DISP=SHR,                                                00000260
//             AMP=('BUFND=13')                                         00000270
//OUTPUT1  DD  DSN=BP13.FP00.DOC.DAILY(+1),                             00000280
//             DISP=(NEW,CATLG),                                        00000290
//             UNIT=CART,                                               00000300
//             LABEL=(,SL),                                             00000310
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=3800,RECFM=FB)             00000330
//INPUT2   DD DSN=BP13.KQ10.DOC.TBL,DISP=SHR                                    
//OUTPUT2  DD DSN=BP13.FQ10.DOC.TBL.BKUP,DISP=OLD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*-------------------------------------------------------------------*         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                              *         
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.AB02.F930.DAILY,DISP=SHR                                 
//OUTPUT5  DD DSN=BP13.AB02.F930.DAILY.BKUP(+1),DISP=(NEW,CATLG),               
//            SPACE=(CYL,(50,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=27900,LRECL=150,RECFM=FB)                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
