//BP13M200 JOB (BP13P),'BP13',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//******************************************************************            
//* CHG-NO   BY   ON        DESCRIPTION                                         
//* -------- --- --------   -----------                                         
//* BP130857 SSS 20000513   ADD GROUPID                                         
//* BP130848 LSB 20000816   EXPNAD TEMP FILE BM06F120                           
//* BP135171 RJE 20140211   TO CATER FOR DB2 UPGRADE                            
//* BP135171 NST 20140227   REMOVE THE CALLING OF BM06286F AND                  
//*                         USE BM06.F120.FLATINV.PIDB DIRECTLY                 
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : CLASS = 2, COPIES = 1    (SALES - AGM TEAM)                        
//*-----------------------------------------------------------------    00201005
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1                                      
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------    00201005
//* BACKUP BM06K100 TO A SEQUENTIAL FILE (BM06.F100.BLOCK)                      
//*-----------------------------------------------------------------    00201005
//STEP01   EXEC  PGM=IDCAMS                                                     
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//OUTPUT1  DD DSN=BM06.F100.BLOCK,DISP=SHR                                      
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*-----------------------------------------------------------------    00201005
//* TO SORT INPUT FILE BM06K211 BY EST/N/C/BLK                                  
//*-----------------------------------------------------------------    00201005
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BM6F120A,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA),                                                     
//            SPACE=(CYL,(180,20),RLSE),                                        
//            DCB=(BLKSIZE=0,LRECL=700,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(12,16,A),FORMAT=CH                                              
   INCLUDE COND=(323,8,CH,GE,C'19930101',OR,                                    
                 323,8,CH,EQ,C'00000000')                                       
/*                                                                              
//*-----------------------------------------------------------------    00201005
//* PROGRAM TO SUM ETHNIC PROPORTION IN FIS BY BLOCK THEN VERIFY THE            
//*            DATA IN BLOCK SUMMARY FILE, IF DID NOT TALLY, UPDATE             
//*            BLOCK SUMMARY WITH THE COMPUTATION FROM FIS.  PRINT              
//*            REPORT ON THE UPDATING.                                          
//*-----------------------------------------------------------------    00201005
//STEP03   EXEC  PGM=BP13C235,COND=(0,NE)                                       
//BM06F120 DD DSN=&&BM6F120A,DISP=(OLD,PASS)                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L235 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          00270002
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* BACKUP BP13.BB14.F580.UNTLEASE.ACCUM                                        
//*-----------------------------------------------------------------            
//STEP04   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.BB14.F580.UNTLEASE.ACCUM,DISP=SHR                        
//OUTPUT1  DD DSN=BP13.BB14.F580.UNTLEASE.MONTH(+1),                            
//            DISP=(NEW,CATLG),                                                 
//            UNIT=DISK,                                                        
//            SPACE=(TRK,(15,10),RLSE),                                         
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=300,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* TO CLEAR UP FILE                                                            
//*---------------------------------------------------------------------        
//STEP05 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DUMMY                                                            
//OUTPUT1  DD  DSN=BP13.BB14.F580.UNTLEASE.ACCUM,                               
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*-----------------------------------------------------------------            
//* BACKUP BP13.F432.KEY.LOG.ACCUM                                              
//*-----------------------------------------------------------------            
//STEP06   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F432.KEY.LOG.ACCUM,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.F432.KEY.LOG.MONTH(+1),                                  
//            DISP=(NEW,CATLG),                                                 
//            UNIT=DISK,                                                        
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* TO CLEAR UP FILE                                                            
//*---------------------------------------------------------------------        
//STEP07 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DUMMY                                                            
//OUTPUT1  DD  DSN=BP13.F432.KEY.LOG.ACCUM,                                     
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*----------------------------------------------------------------*            
//*      END OF BATCH JOB BP13M200                                 *            
//*----------------------------------------------------------------*            
