//BP13APA7 JOB (BP13P),'BP13APA7',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*    3RD ROUND PIGEONHOLING OF BTO                           *                
//*                                       UNSUCC MTF/SFF/REN/RH*                
//*                                       AND PUBLIC SCHEME    *                
//*                                                            *                
//*        THE DIFFERENCE                                      *                
//*    - TENDER PROGRAM ONLY HAVE NEW + BALANCE FLATS          *                
//*    - INCLUDE  ONLY MATURE NT CASES WHICH ARE UNSUCC        *                
//*    - NO HHTY AND NO RESIDENT CHECK                         *                
//**************************************************************                
//* STEP 00 - 01 = LASER PRINTER JCL                           *                
//* STEP 02 - 03 = BACKUP TENDER AND BALLOT FILE               *                
//* STEP 04 - 05 = PRINT FLAT SYPPLY REPORT BF PIGEONHOLING    *                
//* STEP 06 - 08 = PROCESS PIGEONHOLING(BP13U531 PRIORITY ONLY)*                
//* STEP 09      = MATCH RELEVANT REQUEST TO GET SUCC & UNSUCC *                
//*                BALLOT RESULT FOR PRINT REPORT              *                
//* STEP 10 & 11 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING    *                
//* STEP 12      = PRINT SUCC/UNSUCC REPORT BP13L522           *                
//* STEP 13      = BACKUP TENDER FILE                          *                
//* STEP 16      = DELETE UNSUCCESSFUL GROPA CASES             *                
//*                                                            *                
//**************************************************************                
//* CHG REF   BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP132412 SK   20030912 NEW JCL FOR BE'03. 4TH ROUND PA                      
//* BP132412 CKK  20031009 ADD BP13C149                                         
//* BP132412 SK   20031030 ADD BP13K595 FOR BP13C149                            
//* BP132596 PGS 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E            
//* BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                               
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K520.BALLOT,DISP=OLD                                     
//INPUT3   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//**************************************************************                
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//**************************************************************                
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, WITH DUPLICATE COPIES                                             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.APA6,DISP=OLD                                
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.APA6,DISP=OLD                              
//INPUT3   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F520.BALLOT.APA6,DISP=OLD                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010N,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
                4,2,CH,EQ,C'4 ',OR,                                             
                4,2,CH,EQ,C'5 ')                                                
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*-----------------------------------------------------------------            
//STEP05    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010N,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT SUCC REQUEST CASES                                                 
//* SET CDE-REQUEST-STATUS TO 'S' FOR 1ST 100% CASES                            
//*---------------------------------------------------------------------        
//STEP5A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520SUCC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,NE,C'   ')                                            
   OUTREC FIELDS=(1,259,C'S',261,240)                                           
//*--------------------------------------------------------------------         
//* REPRO THE UPDATED BALLOT FILE BACK                                          
//*---------------------------------------------------------------------        
//STEP5B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&F520SUCC,DISP=(OLD,DELETE)                                  
//OUTPUT1  DD DSN=BP13.K520.BALLOT,DISP=SHR                                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*---------------------------------------------------------------------        
//* SORT OUT UNSUCC REQUEST CASES                                               
//* SORT BY NT, FT, RANDOM NO                                                   
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(187,3,A,211,2,A,1,28,A),FORMAT=CH                               
   INCLUDE COND=(226,3,CH,EQ,C'   ')                                            
//*--------------------------------------------------------------------         
//* TO PROCESS THE PIGEON-HOLDING FOR PUBLIC   CASES, THE PROGRAM WILL          
//* ONLY ALLOCATE THE PUBLIC QUOTA AND PRIORITY QUOTA ON CCC, SFF, MTF          
//* WITH EFF FR 199910 USE U734 BYPASS UPG                                      
//*--------------------------------------------------------------------         
//STEP08   EXEC PGM=BP13U734,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                  
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13F520 DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L734 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L734A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT SUCC REQUEST CASES                                                 
//* SET CDE-REQUEST-STATUS TO 'R' FOR 101% TO 200% CASES                        
//*---------------------------------------------------------------------        
//STEP9A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520SUC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,NE,C'   ',AND,                                        
                 260,1,CH,NE,C'S')                                              
   OUTREC FIELDS=(1,259,C'R',261,240)                                           
//*--------------------------------------------------------------------         
//* REPRO THE UPDATED BALLOT FILE BACK                                          
//*---------------------------------------------------------------------        
//STEP9B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&F520SUC,DISP=(OLD,DELETE)                                   
//OUTPUT1  DD DSN=BP13.K520.BALLOT,DISP=SHR                                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*---------------------------------------------------------------------        
//* SORT OUT UNSUCC REQUEST CASES                                               
//* SET CDE-REQUEST-STATUS TO 'U' FOR UNSUCCESSFUL CASES                        
//*---------------------------------------------------------------------        
//STEP9C   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520UNS,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ')                                            
   OUTREC FIELDS=(1,259,C'U',261,240)                                           
//*--------------------------------------------------------------------         
//* REPRO THE UPDATED BALLOT FILE BACK                                          
//*---------------------------------------------------------------------        
//STEP9D   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&F520UNS,DISP=(OLD,DELETE)                                   
//OUTPUT1  DD DSN=BP13.K520.BALLOT,DISP=SHR                                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*-------------------------------------------------------------------          
//*------------------------------------------------------------------           
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG AFTER PIGEONHOLING                 
//*-------------------------------------------------------------------          
//STEP10   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                  
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13L552 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------          
//*  REPRO VSAM FILE TO SEQUENTIAL FILES FOR MATCHING BP13C817                  
//*------------------------------------------------------------------           
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT5  DD DSN=&&F520BALT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
//*-------------------------------------------------------------------          
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520SORT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520PA3,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,20),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------          
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*-------------------------------------------------------------------          
//STEP13   EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520PA3,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,PASS)                                    
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------          
//* PRINT SUMMARY BALLOT RESULT BY ZONE/FT/CAT                                  
//* ON SUCC/UNSUCC REPORT FOR BP13APA3 ONLY                                     
//*-------------------------------------------------------------------          
//STEP14   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//P13FSUCC DD DSN=&&P13SUCC,DISP=(OLD,PASS)                                     
//P13FUNSC DD DSN=&&P13UNSUC,DISP=(OLD,PASS)                                    
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//FT42F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                             
//*-------------------------------------------------------------------          
//* SORT BY REGN-NO                                                             
//*-------------------------------------------------------------------          
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520ALL,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(80,20),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------          
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING FOR ALL                  
//*-------------------------------------------------------------------          
//STEP16   EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520ALL,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,PASS)                                    
//P13UNSUC DD DSN=&&F52UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//P13SUCC  DD DSN=&&F52SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------          
//* PRINT SUMMARY BALLOT RESULT BY ZONE/FT/CAT                                  
//* ON SUCC/UNSUCC REPORT FOR THE WHOLE BALLOTING                               
//*-------------------------------------------------------------------          
//STEP17   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//P13FSUCC DD DSN=&&F52SUCC,DISP=(OLD,PASS)                                     
//P13FUNSC DD DSN=&&F52UNSUC,DISP=(OLD,PASS)                                    
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//FT42F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                             
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP19    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010AFN,DISP=(OLD,PASS)                                    
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP20   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER(+1),DISP=(NEW,CATLG),                        
//            SPACE=(TRK,(5,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*--------------------------------------------------------------------         
//STEP21  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F525.APPL,DISP=SHR                                      
//OUTPUT1   DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*------------------------------------------------------------------           
//* SORT LAST SUCC REGN-NO IN NT/FT ORDER                                       
//*------------------------------------------------------------------           
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F525,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=20000)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,4,2,A,53,3,A,11,1,A),FORMAT=CH                            
//*------------------------------------------------------------------           
//* PRINT REPORT TO SHOW THE LAST SUCC REGN-NO HIT MAX ZONE/ALLOC/CAT           
//*------------------------------------------------------------------           
//STEP23   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13K525 DD DSN=&&BP13F525,DISP=(OLD,PASS)                                    
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S502),DISP=SHR                             
//*-------------------------------------------------------------------*         
//* SORT BY NT1/FT, INCLUDE UNSUCCESSFUL GROPA APPLICATIONS                     
//*-------------------------------------------------------------------*         
//*STEP24   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                   
//*         AMP=('BUFND=23')                                                    
//*SORTOUT  DD DSN=&&F520,DISP=(NEW,PASS),                                      
//*         UNIT=SYSDA,DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                      
//*         SPACE=(CYL,(100,25),RLSE)                                           
//*SYSIN    DD *                                                                
//*    SORT FIELDS=(187,3,A,211,2,A),FORMAT=CH                                  
//*    INCLUDE COND=(129,2,CH,EQ,C'GR',AND,226,3,CH,EQ,C'   ')                  
/*                                                                              
//*-------------------------------------------------------------------*         
//* RUN BP13C124 - DELETE UNSUCCESSFUL GROPA CASES                              
//*-------------------------------------------------------------------*         
//*STEP25   EXEC PGM=BP13C124,COND=(0,NE)                                       
//*BP13F740 DD DSN=&&F520,DISP=(OLD,DELETE)                                     
//*BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//*         AMP=('BUFND=23')                                                    
//*BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                   
//*         AMP=('BUFND=23')                                                    
//*P13F740B DD DSN=BP13.F520.GROPA.UNSUCC,DISP=OLD                              
//*SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//*SYSUDUMP DD SYSOUT=*                                                         
//*SYSABEND DD SYSOUT=*                                                         
//*SYSDBUG  DD SYSOUT=*                                                         
//*SYSABOUT DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* SORT OUT SUCCESSFUL PRIORITY CASES THAT TAKE PA QUOTA                       
//*-------------------------------------------------------------------*         
//STEP26   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520PRIO,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(8,5),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,NE,C'   ',AND,                                        
                 420,3,CH,NE,C'   ')                                            
//*-------------------------------------------------------------------*         
//* REPLACE SUCCESSFUL PRIORITY CASES WITH PA ALLOC SCH                         
//*-------------------------------------------------------------------*         
//STEP27   EXEC PGM=BP13C149,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F520PRIO,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR                                     
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                                 
//BP13L149 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//****************************************************************              
//*            END OF BP13APA7                                                  
//****************************************************************              
