//BP13M003 JOB (BP13P),'PARENT-CHILD',CLASS=I,MSGCLASS=N,                       
//     MSGLEVEL=(1,1),NOTIFY=CSD0071                                            
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//*  GENERATE A MONTHLY REPORT ON CASES WHERE PARENT AND                        
//*  SINGLE CHILD APPLICATION FOUND IN RESALE WITH                              
//*  2 DP FLATS OR 1 RESALE FLAT 1 SMS DP FLAT                                  
//*-----------------------------------------------------------------            
//* CHG REF  OIC  DATE     DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP132833 YCH2 20060303 NEW JOB FOR KIM HUAT                                 
//* BP133    SSS2 20070903 INCREASE TEMP FILE SIZE                              
//* FMS      IL5  20101101 ADD PARAMETER DATACLAS=MULTIVOL                      
//* BP134070 PCL3 20101124 ADD BP13CD37                                         
//* BP134364 JB8  20111007 ADD BP13K730 & BP18K300 TO BP13CD37                  
//* BP134641 MDT2 20120803 EXPAND LRECL OF BP13KD07 FROM 500 TO 700             
//* BP135171 RJE1 20140211 TO CATER FOR DB2 UPGRADE                             
//* BP135404 ESA1 20140312 TO REMOVE BP13S812                                   
//* BP135406 ESA1 20140820 TO REMOVE BP13S813                                   
//* BP136492 MRN1 20161102 CONVERT BP13CD37 TO DB2, REMOVE KD07                 
//* BP137823 PP11 20190508 BP13LD37 REPORT ROUTED TO DATA SET                   
//*=================================================================            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                               
//*  PRT01 : CLASS = 2                                                          
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=13C813,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*=================================================================            
//* SORT OCCUPIER RECORDS AND TAKE IN ONLY ESSENTIAL FAMILY MEMBERS             
//*-----------------------------------------------------------------            
//STEP010  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F820,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=400,BLKSIZE=27600),                   
//         SPACE=(CYL,(30,10),RLSE),DATACLAS=MULTIVOL                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(131,1,CH,EQ,C'Y')                                              
//*=================================================================            
//* EXTRACT ON PARENT WITH SINGLE SON ON REQUEST FILE                           
//*-----------------------------------------------------------------            
//STEP011  EXEC PGM=BP13CK00,COND=(0,NE)                                        
//BP13F820 DD DSN=&&BP13F820,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F820A DD DSN=BP13.F820.SINGCHLD,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*=================================================================            
//* REFORMAT TO BP13F558 AND OUTPUT ONLY REGNO AND NRIC                         
//*-----------------------------------------------------------------            
//STEP020  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F820.SINGCHLD,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F558,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   OUTREC FIELDS=(1,17,583X)                                                    
//*=================================================================            
//* DETERMINE RESALE (JCLU702) WITH RESALE STATUS 2                             
//*-----------------------------------------------------------------            
//STEP030  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F558 DD DSN=&&BP13F558,DISP=(OLD,DELETE)                                  
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=&&P13RSLDP,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
    DSN SYSTEM(DSN)                                                             
    RUN  PROGRAM(BP13CK01) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
    END                                                                         
//*=================================================================            
//* SORT AND DROP DUPLICATES OF UIN AND HDB-REF RESALE                          
//*-----------------------------------------------------------------            
//STEP040  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13RSLDP,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13RSL1,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                
//            SPACE=(CYL,(20,10),RLSE),DATACLAS=MULTIVOL                        
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A,71,11,A),FORMAT=CH                                        
   SUM FIELDS=NONE                                                              
//*=================================================================            
//* SEPARATE RESALE 1 DP AND 2 DP FLATS                                         
//*-----------------------------------------------------------------            
//STEP050  EXEC PGM=BP13CK02,COND=(0,NE)                                        
//BP13F558 DD DSN=&&BP13RSL1,DISP=(OLD,DELETE)                                  
//P13F558A DD DSN=BP13.F558.RSL1DP,DISP=OLD                                     
//P13F558B DD DSN=BP13.F558.RSL2DP,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*=================================================================            
//* MATCH RESALE 1 DP FLAT WITH SMS                                             
//*-----------------------------------------------------------------            
//STEP060  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F558 DD DSN=BP13.F558.RSL1DP,DISP=SHR                                     
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=BP13.F558.SMS1DP,DISP=OLD                                     
//BP13F559 DD DSN=BP13.F559.SMSMULT,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
    DSN SYSTEM(DSN)                                                             
    RUN  PROGRAM(BP13CK03) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
    END                                                                         
//*-------------------------------------------------------------------*         
//*  PRINT REPORT FOR EC CASES WITH GRANT REQUEST DATE                *         
//*-------------------------------------------------------------------*         
//STEP010  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KA30 DD DSN=BP13.KA30.UNIT,DISP=SHR,                                      
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13KA31 DD DSN=BP13.KA30.UNIT.PATH1,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP18K300 DD DSN=BP18.K300.MASTER,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13LD37 DD DSN=BP13.EC.REPORT,DISP=SHR                                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CD37) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
     END                                                                        
/*                                                                              
