//BP13D53B JOB (BP13P),'BP13D53B',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//        SCHENV=PKZIP,NOTIFY=CSD0071                                           
//*JOBPARM SYSAFF=MVS1 - CONTROL VIA SCHENV IN JOBCARD (19/02/09)               
//*====================================================================*        
//*                      JCL PROFILE                                            
//*====================================================================*        
//* APPLICATION        : SOC                                                    
//* JCL                : BP13                                                   
//* PROGRAMMER         : IL5                                                    
//* CREATION DATE      : SEP 2008                                               
//* CHANGE REF. NO.    : BP13                                                   
//*--------------------------------------------------------------------*        
//* MODIFICATION LOG                                                            
//* ----------------                                                            
//* MODIFY DATE      CHGE REQ  DESCRIPTION OF CHANGE                            
//* ------ ------    --------  ---------------------                            
//* IL5    SEP 2008  BP13      JCL INTRODUCED                                   
//*====================================================================*        
//*--------------------------------------------------------------------*        
//* STEP 0A : DELETE SEQ. FILE                                                  
//*--------------------------------------------------------------------*        
//D53BS00A EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL (BP13.FTPUNIT.ZIP)                                                     
     DEL (BP13.FTPREQ.ZIP)                                                      
     DEL (BP13.FTPBLK.ZIP)                                                      
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*                                                                             
//*--------------------------------------------------------------------*        
//* STEP 0C: DEFINE ZIP DATASET                                                 
//*--------------------------------------------------------------------*        
//D53BS00C EXEC PGM=IEFBR14,COND=(0,NE)                                         
//OUTPUT1  DD DSN=BP13.FTPUNIT.ZIP,                                             
//         DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                                  
//         SPACE=(1,(200,50),RLSE),AVGREC=M,DSORG=PS,                           
//         RECFM=U,LRECL=0,BLKSIZE=27998                                        
//*                                                                             
//OUTPUT2  DD DSN=BP13.FTPREQ.ZIP,                                              
//         DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                                  
//         SPACE=(1,(200,50),RLSE),AVGREC=M,DSORG=PS,                           
//         RECFM=U,LRECL=0,BLKSIZE=27998                                        
//*                                                                             
//OUTPUT3  DD DSN=BP13.FTPBLK.ZIP,                                              
//         DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                                  
//         SPACE=(1,(200,50),RLSE),AVGREC=M,DSORG=PS,                           
//         RECFM=U,LRECL=0,BLKSIZE=27998                                        
//*                                                                             
//*--------------------------------------------------------------------*        
//* STEP 1 : GET FILE FROM IDEAL SERVER                                         
//*--------------------------------------------------------------------*        
//D53BS001 EXEC FTP,PARM='IDEAL (EXIT',COND=(0,NE)                              
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
    CD \PROD\APPN\DATA\BP13\TO-HDB\DBSS\GE                                      
    BINARY                                                                      
    GET APPLD.zip 'BP13.FTPREQ.ZIP' (REPLACE                                    
    QUIT                                                                        
//*                                                                             
//*--------------------------------------------------------------------*        
//* STEP 2 : GET FILE FROM IDEAL SERVER                                         
//*--------------------------------------------------------------------*        
//D53BS002 EXEC FTP,PARM='IDEAL (EXIT',COND=(0,NE)                              
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
    CD \PROD\APPN\DATA\BP13\TO-HDB\DBSS-ETHNIC\GE                               
    BINARY                                                                      
    GET ETHND.ZIP 'BP13.FTPBLK.ZIP' (REPLACE                                    
    QUIT                                                                        
//*                                                                             
//*--------------------------------------------------------------------*        
//* STEP 3 : GET FILE FROM IDEAL SERVER                                         
//*--------------------------------------------------------------------*        
//D53BS003 EXEC FTP,PARM='IDEAL (EXIT',COND=(0,NE)                              
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
    CD \PROD\APPN\DATA\BP13\TO-HDB\DBSS-UNIT\GE                                 
    BINARY                                                                      
    GET UNITD.ZIP 'BP13.FTPUNIT.ZIP' (REPLACE                                   
    QUIT                                                                        
//*                                                                             
//*--------------------------------------------------------------------*        
//* STEP 4 : UNZIP DATASET                                                      
//*--------------------------------------------------------------------*        
//D53BS004 EXEC PKUNZIP,COND=(0,NE)                                             
-ARCHIVE(BP13.FTPUNIT.ZIP)                                                      
-UNZIPPED_DSN(**,BP13.FB62.FTPUNIT.FROMDEV)                                     
-OUTFILE_LRECL(148)                                                             
-TEXT                                                                           
-OVERWRITE                                                                      
//*                                                                             
//*--------------------------------------------------------------------*        
//* STEP 5 : UNZIP DATASET                                                      
//*--------------------------------------------------------------------*        
//D53BS005 EXEC PKUNZIP,COND=(0,NE)                                             
-ARCHIVE(BP13.FTPBLK.ZIP)                                                       
-UNZIPPED_DSN(**,BP13.FB61.FTPBLK.FROMDEV)                                      
-OUTFILE_LRECL(42)                                                              
-TEXT                                                                           
-OVERWRITE                                                                      
//*                                                                             
//*--------------------------------------------------------------------*        
//* STEP 6 : UNZIP DATASET                                                      
//*--------------------------------------------------------------------*        
//D53BS006 EXEC PKUNZIP,COND=(0,NE)                                             
-ARCHIVE(BP13.FTPREQ.ZIP)                                                       
-UNZIPPED_DSN(**,BP13.FB60.FTPREQ.FROMDEV)                                      
-OUTFILE_LRECL(2843)                                                            
-TEXT                                                                           
-OVERWRITE                                                                      
//*                                                                             
