//BP13M723  JOB (BP13P),'BP13M723',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* RUN ON 23/MTH, GIRO WILL RUN ON 25/MTH                                      
//*=================================================================            
//* CHG-NO   BY   ON     - DESC                                                 
//*--------------------------------------------                                 
//* BP133902 LSB  180308 - ADD KD63 IN CC71, DO NOT CREATE GIRO FILE            
//* BP133902 LSB  180327 - ADD BP13CD17                                         
//* BP133360 ED1  080408 - ADD BP13KD38 IN BP13CD17                             
//* BP133973 CCC5 100921 - UPDATE B004 TO AB02 DATASETS                         
//* BP134093 120214 LSB1 CHG B004 TO AB02,F056-F556,F003-F503,F041-F541         
//* BP137485 KR13 240419 - IOMS CHANGES                                         
//*=================================================================            
//* VERIFY FILES BEFORE PRODUCTION RUN                                *         
//*-------------------------------------------------------------------*         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KD00.DBSMAST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.KD35.APPSCHDL,DISP=OLD                                   
//INPUT3   DD DSN=BP13.KD38.PPTRANS,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*-----------------------------------------------------------------            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY                           (MA&B TEAM)                        
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* MONTHLY OUTPUT FILE TO GIRO SYSTEM FOR GIRO DEDUCTION                       
//*-----------------------------------------------------------------            
//STEP01    EXEC PGM=BP13CC71,COND=(0,NE)                                       
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD00  DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13KD63  DD DSN=BP13.KD63.TXHIST,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13LC71  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BY SCH-ACC                                                             
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13FD00,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=1600),                                        
//            SPACE=(CYL,(120,10),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(11,11,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* SORT BY SCH-ACC (CPFB  FILE)                                                
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AB02.F541.MICEASE.BP13,DISP=SHR                               
//SORTOUT  DD DSN=&&AB02F541,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(120,10),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,11,A),FORMAT=CH                                               
//*----------------------------------------------------------------             
//* FOR AUTO-CEASED CPF PAYMENTS BY CPFB                                        
//* UPDATE CPF/CASH INSTAL IN BP13KD00 AND CPF RATE IN BP13KD35                 
//*----------------------------------------------------------------             
//STEP04   EXEC PGM=BP13CD17,COND=(0,NE)                                        
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                                    
//AB02F541 DD DSN=&&AB02F541,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD35 DD DSN=BP13.KD35.APPSCHDL,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD38 DD DSN=BP13.KD38.PPTRANS,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LD17  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
