//BP13D526 JOB (BP13P),'BP13D526',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//        SCHENV=PKZIP,NOTIFY=CSD0071                                           
//*================================================================             
//*                      JCL PROFILE                                            
//*================================================================             
//* APPLICATION        : SOC                                                    
//* JCL                : BP13D526                                               
//* PROGRAMMER         : IL5                                                    
//* CREATION DATE      : 14-04-2009                                             
//* CHANGE REF. NO.    : BP133533                                               
//*----------------------------------------------------------------             
//* JOB DESCRITION     :                                                        
//* --------------------                                                        
//* CREATE DAILT DBSS REPORT FILES                                              
//*----------------------------------------------------------------             
//* JOB STEP   DESCRIPTION                                                      
//* --------   -----------                                                      
//* D526S001   SORT BP13HHTM - COPY HTML                                        
//* D526S002   SORT BP13THTM - COPY HTML                                        
//* D526S003   MERGE BP13L02M AND HTML                                          
//* D526S004   MERGE BP13L02P AND HTML                                          
//* D526S005   MERGE BP13L02Q AND HTML                                          
//*----------------------------------------------------------------             
//* ACTION IF ABEND                                                             
//* ---------------                                                             
//* 1) RERUN JOB                                                                
//* 2) IF ABEND INFORM OIC NEXT DAY                                             
//*----------------------------------------------------------------             
//* MODIFICATION LOG                                                            
//* ----------------                                                            
//* MODIFY DATE       CHGE REQ  DESCRIPTION OF CHANGE                           
//* ------ ---------- --------  ----------------------------------              
//*================================================================             
//*                     RELATED DOCUMENTS                                       
//*================================================================             
//* PHYSICAL FLOW   :                                                           
//*================================================================             
//*-------------------------------------------------------------------*         
//* STEP1  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//D526S00A EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.MFMAIL.DBS.ZIP')                                                
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* STEP01 - SORT  BP13HHTM - HTML COPY                                         
//*-----------------------------------------------------------------            
//D526S001  EXEC PGM=SORT,COND=(0,NE)                                           
//SYSOUT    DD SYSOUT=*                                                         
//SORTIN    DD DSN=BP13.BATCH.COPYCOB(BP13HHTM),DISP=SHR                        
//SORTOUT   DD DSN=&&BP13HHTM,                                                  
//           DISP=(NEW,PASS),                                                   
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                             
//SYSIN     DD *                                                                
      SORT FIELDS=COPY                                                          
      OUTREC FIELDS=(1X,1,80,52X)                                               
//*                                                                             
//*-----------------------------------------------------------------            
//* STEP02 - SORT BP13THTM - HTML COPY                                          
//*-----------------------------------------------------------------            
//D526S002  EXEC PGM=SORT,COND=(0,NE)                                           
//SYSOUT    DD SYSOUT=*                                                         
//SORTIN    DD DSN=BP13.BATCH.COPYCOB(BP13THTM),DISP=SHR                        
//SORTOUT   DD DSN=&&BP13THTM,                                                  
//           DISP=(NEW,PASS),                                                   
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                             
//SYSIN     DD *                                                                
      SORT FIELDS=COPY                                                          
      OUTREC FIELDS=(1X,1,80,52X)                                               
//*                                                                             
//*-----------------------------------------------------------------            
//* STEP03 - SORT BP13L02M - REMOVE PRINTING CHR.                               
//*-----------------------------------------------------------------            
//D526S003  EXEC PGM=SORT,COND=(0,NE)                                           
//SYSOUT    DD SYSOUT=*                                                         
//SORTIN    DD DSN=BP13.MFMAIL.L02M,DISP=SHR                                    
//SORTOUT   DD DSN=&&BP13L02M,                                                  
//           DISP=(NEW,PASS),                                                   
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(5,5),RLSE),AVGREC=M,DSORG=PS                             
//SYSIN     DD *                                                                
      SORT FIELDS=COPY                                                          
      OUTREC FIELDS=(1X,2,132)                                                  
//*                                                                             
//*-----------------------------------------------------------------            
//* STEP04 - SORT BP13.MFMAIL.L02M                                              
//*-----------------------------------------------------------------            
//D526S004  EXEC PGM=SORT,COND=(0,NE)                                           
//SYSOUT    DD SYSOUT=*                                                         
//SORTIN    DD DSN=&&BP13HHTM,DISP=(SHR,PASS)                                   
//          DD DSN=&&BP13L02M,DISP=(OLD,DELETE)                                 
//          DD DSN=&&BP13THTM,DISP=(SHR,PASS)                                   
//SORTOUT   DD DSN=BP13.MFMAIL.L02M,DISP=OLD                                    
//SYSIN     DD *                                                                
      SORT FIELDS=COPY                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* STEP05 - SORT BP13L02P - REMOVE PRINTING CHR.                               
//*-----------------------------------------------------------------            
//D526S005  EXEC PGM=SORT,COND=(0,NE)                                           
//SYSOUT    DD SYSOUT=*                                                         
//SORTIN    DD DSN=BP13.MFMAIL.L02P,DISP=SHR                                    
//SORTOUT   DD DSN=&&BP13L02P,                                                  
//           DISP=(NEW,PASS),                                                   
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(5,5),RLSE),AVGREC=M,DSORG=PS                             
//SYSIN     DD *                                                                
      SORT FIELDS=COPY                                                          
      OUTREC FIELDS=(1X,2,132)                                                  
//*                                                                             
//*-----------------------------------------------------------------            
//* STEP06 - SORT BP13.MFMAIL.L02P                                              
//*-----------------------------------------------------------------            
//D526S006  EXEC PGM=SORT,COND=(0,NE)                                           
//SYSOUT    DD SYSOUT=*                                                         
//SORTIN    DD DSN=&&BP13HHTM,DISP=(SHR,PASS)                                   
//          DD DSN=&&BP13L02P,DISP=(OLD,DELETE)                                 
//          DD DSN=&&BP13THTM,DISP=(SHR,PASS)                                   
//SORTOUT   DD DSN=BP13.MFMAIL.L02P,DISP=OLD                                    
//SYSIN     DD *                                                                
      SORT FIELDS=COPY                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* STEP07 - SORT BP13L02Q - REMOVE PRINTING CHR.                               
//*-----------------------------------------------------------------            
//D526S007  EXEC PGM=SORT,COND=(0,NE)                                           
//SYSOUT    DD SYSOUT=*                                                         
//SORTIN    DD DSN=BP13.MFMAIL.L02Q,DISP=SHR                                    
//SORTOUT   DD DSN=&&BP13L02Q,                                                  
//           DISP=(NEW,PASS),                                                   
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(5,5),RLSE),AVGREC=M,DSORG=PS                             
//SYSIN     DD *                                                                
      SORT FIELDS=COPY                                                          
      OUTREC FIELDS=(1X,2,132)                                                  
//*                                                                             
//*-----------------------------------------------------------------            
//* STEP08 - SORT BP13.MFMAIL.L02Q                                              
//*-----------------------------------------------------------------            
//D526S008  EXEC PGM=SORT,COND=(0,NE)                                           
//SYSOUT    DD SYSOUT=*                                                         
//SORTIN    DD DSN=&&BP13HHTM,DISP=(SHR,PASS)                                   
//          DD DSN=&&BP13L02Q,DISP=(OLD,DELETE)                                 
//          DD DSN=&&BP13THTM,DISP=(SHR,PASS)                                   
//SORTOUT   DD DSN=BP13.MFMAIL.L02Q,DISP=OLD                                    
//SYSIN     DD *                                                                
      SORT FIELDS=COPY                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* STEP09 - SORT BP13L02T - REMOVE PRINTING CHR.                               
//*-----------------------------------------------------------------            
//D526S009  EXEC PGM=SORT,COND=(0,NE)                                           
//SYSOUT    DD SYSOUT=*                                                         
//SORTIN    DD DSN=BP13.MFMAIL.L02T,DISP=SHR                                    
//SORTOUT   DD DSN=&&BP13L02T,                                                  
//           DISP=(NEW,PASS),                                                   
//           LRECL=133,RECFM=FBA,BLKSIZE=0,DATACLAS=MULTIVOL,                   
//           SPACE=(1,(5,5),RLSE),AVGREC=M,DSORG=PS                             
//SYSIN     DD *                                                                
      SORT FIELDS=COPY                                                          
      OUTREC FIELDS=(1X,2,132)                                                  
//*                                                                             
//*-----------------------------------------------------------------            
//* STEP10 - SORT BP13.MFMAIL.L02T                                              
//*-----------------------------------------------------------------            
//D526S010  EXEC PGM=SORT,COND=(0,NE)                                           
//SYSOUT    DD SYSOUT=*                                                         
//SORTIN    DD DSN=&&BP13HHTM,DISP=(SHR,PASS)                                   
//          DD DSN=&&BP13L02T,DISP=(OLD,DELETE)                                 
//          DD DSN=&&BP13THTM,DISP=(SHR,PASS)                                   
//SORTOUT   DD DSN=BP13.MFMAIL.L02T,DISP=OLD                                    
//SYSIN     DD *                                                                
      SORT FIELDS=COPY                                                          
//*                                                                             
//*****************************************************************             
//* STEP00: AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*****************************************************************             
//D526S000 EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD  DSN=&&TEMP1,DISP=(NEW,PASS),                                     
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=259,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*                                                                             
//*--------------------------------------------------------------------*        
//*  STEP09:        *  ZIP THE REPORT FILE    *                                 
//*--------------------------------------------------------------------*        
//D526S009  EXEC PKZIP,COND=(0,NE)                                              
-ARCHIVE(BP13.MFMAIL.DBS.ZIP)                                                   
-ARCHVOL(DUMMY)                                                                 
-METHOD(FAST)                                                                   
-ZIPPED_DSN(BP13.MFMAIL.L02M,BP13L02M.HTML)                                     
-ZIPPED_DSN(BP13.MFMAIL.L02P,BP13L02P.HTML)                                     
-ZIPPED_DSN(BP13.MFMAIL.L02Q,BP13L02Q.HTML)                                     
-ZIPPED_DSN(BP13.MFMAIL.L02T,BP13L02T.HTML)                                     
-FILE_TERMINATOR()                                                              
 BP13.MFMAIL.L02M                                                               
 BP13.MFMAIL.L02P                                                               
 BP13.MFMAIL.L02Q                                                               
 BP13.MFMAIL.L02T                                                               
//*------------------------------------------------------------------*          
//* STEP10:-      CREATE MAIL INFO USING SAS                                    
//*        IF ACJOB MAIL FROM = 'ACJOB@SGPHDB1'                                 
//*        IF MVS1  MAIL FROM = 'OPCP@SGPHDB1'                                  
//*        IF MVS2  MAIL FROM = 'OPC2@SGPHDB1'                                  
//*        IF MVS3  MAIL FROM = 'CS91151@SGPHDB3' (EXAMPLE)                     
//*------------------------------------------------------------------*          
//D526S010  EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                
//WORK     DD UNIT=SYSDA,SPACE=(1,(50,50)),AVGREC=M                             
//SYSOUT   DD SYSOUT=*                                                          
//BP13MAIL DD DSN=&&BP13MAIL,DISP=(NEW,PASS),                                   
//         LRECL=259,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.MFMAIL.RCPT,DISP=SHR                                     
//         DD *                                                                 
      PUT @01 'SUBJECT:APPLICATION FOR DBSS FLATS- MCPS REPORTS';               
//*------------------------------------------------------------------*          
//* STEP11:-      CREATE ZIP HEADER FORMAT                                      
//*------------------------------------------------------------------*          
//D526S011  EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                
//WORK     DD UNIT=SYSDA,SPACE=(1,(50,50)),AVGREC=M                             
//SYSOUT   DD SYSOUT=*                                                          
//BP13ZIPH DD DSN=&&BP13ZIPH,DISP=(NEW,PASS),                                   
//         LRECL=259,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
      FILE BP13ZIPH;                                                            
      PUT @01 '               NAME="BP13.MFMAIL.DBS.ZIP"';                      
      PUT @01 '                                   ';                            
/*                                                                              
//*****************************************************************             
//* STEP12: ENCODE A ZIP DATASET INTO BASE64 FORMAT                             
//*****************************************************************             
//D526S012 EXEC ENCODE,COND=(0,NE)                                              
//ENCODOUT DD DSN=&&BASE64,DISP=(,PASS),                                        
//            SPACE=(5,(10,10),RLSE),AVGREC=M                                   
//ENCODIN  DD DSN=BP13.MFMAIL.DBS.ZIP,DISP=SHR                                  
/*                                                                              
//*****************************************************************             
//* STEP13: CONVERT OUTPUT TO VARIABLE-BLOCKED (VB)                             
//*****************************************************************             
//D526S013 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BASE64,DISP=(SHR,DELETE)                                    
//FBVB     DD DSN=&&VB64,DISP=(,PASS),                                          
//           SPACE=(TRK,(10,5),RLSE),                                           
//           DCB=(DSORG=PS,LRECL=259,RECFM=VB)                                  
//SYSIN    DD *                                                                 
 MERGE FIELDS=COPY                                                              
 OUTFIL FNAMES=FBVB,FTOV,VLTRIM=X'40'                                           
/*                                                                              
//*****************************************************************             
//* STEP14: OUTPUT SMTP MAIL WITH CONTENT & ATTACHMENT TO A DATASET             
//*****************************************************************             
//D526S014 EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=*.D526S000.SMTPHDR,DISP=(SHR,PASS)                            
//         DD DSN=&&BP13MAIL,DISP=(SHR,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(APPLHDR),DISP=SHR                        
//         DD DSN=&&BP13ZIPH,DISP=(SHR,DELETE)                                  
//         DD DSN=&&VB64,DISP=(SHR,DELETE)                                      
//SYSUT2   DD DSN=&&BP13DEMO,DISP=(NEW,PASS),                                   
//         LRECL=259,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(2,(5,5),RLSE),AVGREC=M,DSORG=PS                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*****************************************************************             
//* STEP15: SEND THE HTML FORMATTED SMTP MAIL                                   
//*****************************************************************             
//D526S015 EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=&&BP13DEMO,DISP=(SHR,DELETE)                                  
/*                                                                              
