//BP13A253 JOB (BP13P),'BP13A253',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* CHG-NO   BY   DATE    DESCRIPTION                                           
//* -------- ---- ------ -------------------------------------------            
//* BP132763 GAN  141005 JCL FOR PRINTING OF APPOINTMENT DETAILS                
//* BP135404 EL27 20140711 CHANGE PRINTER FROM L03Z TO X6AI                     
//* BP135404 NST1 20140719 CHANGE PRINTER FROM X6AI TO X6AU(LANDSCAPE)          
//* BP135561 ESA1 20150115 OUTPUT TO DATASET BEFORE SENDING TO PRINTER          
//*********************************************************************         
//*-----------------------------------------------------------------            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                             00000280
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*------------------------------------------------------------------           
//* SORT OUT OPTION = 'WD' (APPOINTMENT DETAILS)                                
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F205,DISP=(NEW,PASS),                                  
//         UNIT=SYSDA,SPACE=(TRK,(5,1),RLSE),                                   
//         DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                    
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'WD')                                              
/*                                                                              
//*-------------------------------------------------------------------- 00001370
//* PRINT WIS APPOINTMENT DETAILS                                       00001380
//*-------------------------------------------------------------------- 00001390
//STEP02 EXEC  PGM=BP13C25B,COND=(0,NE)                                 00001400
//BP13F205 DD  DSN=&&BP13F205,DISP=(SHR,PASS)                           00001410
//BP13K225 DD  DSN=BP13.K225.QUEUE,                                             
//             DISP=SHR                                                         
//BP13K221 DD  DSN=BP13.K225.QUEUE.PATH1,                                       
//             DISP=SHR                                                         
//BP13L25B DD DSN=BP13.L253.RPT,                                                
//            DISP=SHR                                                          
//SYSPRINT DD  SYSOUT=*                                                 00001760
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//SYSOUT   DD  SYSOUT=*                                                 00001780
/*                                                                      00001790
//*--------------------------------------------------------------------         
//*   SEND REPORT OUT FROM STEP04 IN X6AU PRINTER                               
//*--------------------------------------------------------------------         
//STEP2A EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  DSN=BP13.L253.RPT,                                               
//             DISP=SHR                                                         
//SYSUT2   DD SYSOUT=A,DEST=X6AU                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* ACCUM CONTROL REC                                                           
//*-----------------------------------------------------------------            
//STEP03 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*-----------------------------------------------------------------            
//* END OF BP13A253                                                             
//*-----------------------------------------------------------------            
