//BP13DUMU JOB (BP13P),'BP13DUMU',CLASS=I,MSGLEVEL=(1,1),                       
//         MSGCLASS=N,NOTIFY=CSD0071                                            
//*                                                                             
//*===============================================================              
//*                      JCL PROFILE                                            
//*===============================================================              
//* JOB DESCRIPTION    :                                                        
//* ---------------                                                             
//*   DUMMY JOB TO RUN AFTER BP13 LAST DB2 UPDATE JOB                           
//*   DBA AFTER IMAGE COPY JOB WILL RUN AFTER THIS JOB                          
//*                                                                             
//*----------------------------------------------------------------             
//* MODIFICATION LOG                                                            
//* ----------------                                                            
//*  PHASE/                                                                     
//*  CHG REF#  EFF DATE    AUTH  DESCRIPTION OF CHANGE                          
//*  --------  ----------  ----  ---------------------------------              
//*  XXXXXXXX  DD/MM/CCYY  XXXX                                                 
//*                                                                             
//*===============================================================              
//DUMMY    EXEC PGM=IEFBR14                                                     
/*                                                                              
