//BP13APHL JOB (BP13P),'BP13APHL',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*********************************************************************         
//* CHG REF   BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP134301 IL5  20110715 NEW (FOR SHORTLISTING OF HARDLUCK APPLICANTS)        
//* BP134688 IL5  25102012 OMIT UNSHORTLISTED GRO RECORDS FROM                  
//*                        PUBLIC ROUND                                         
//* BP134718 SMR2 04122012 EXCLUDE UNSUCCESSFUL MGP RECORD FROM                 
//*                        PUBLIC ROUND SHORTLISTING                            
//* BP134782 SMR2 04022013 INCLUDE NEW PROGRAMS, BP13CF81 & BP13S569            
//*                        BACKUP SHORTLISTED SAS ELIGIBLE FOR SAS              
//* BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                               
//* BP134914 SMR2 13062013 CATER FOR DIVORCED/WIDOWED PRIORITY SCHEME           
//* BP134982 IL5  29072013 ADD VERIFY STEP                                      
//* BP135255 SMR2 06032014 SORT APPLNS BY NEW FIELD NUM-HARDLUCK-COUNT          
//*                        FOR SHORTLISTING                                     
//* BP135255 IL5  12042014 SORT APPS BY HL TAG, HL COUNT AND RANDOM NO          
//* BP135392 SMR2 19062014 CATER FOR 3P FLAT TYPE                               
//* BP135492 SMR2 29102014 REMOVE BP13CF89                                      
//* BP135636 SMR2 09022015 INCLUDE NEW FTS CODE = 4                             
//* BP135708 SMR2 31032015 CHANGE CLASS=2 TO CLASS=J                            
//* BP136096 IL5  07012015 CHANGE PROGRAM FROM U538 TO U532                     
//*                        TO SHORTLIST HARDLUCK USING PA FLAT SUPPLY           
//*                        AND EIP                                              
//*                        REMOVE PROGRAM BP13CF90 AND BP13CF81                 
//* BP136107 SMR2 18022016 ACCEPT PARAMETER FROM JCL IN BP13C525                
//* BP138214 IL5  02032020 OMIT MGPS AND GRO RECORDS WHEN GENERATING            
//*                        BP13L525A/B/C                                        
//* BP138301 AM25 14052020 HARDCOPY REPORTS CONVERSION                          
//* BP139411 AM25 07122022 ADD SYSIN FOR BP13CF78                               
//**********************************************************************        
//*      VERIFY FILES BEFORE JOB RUN                                            
//**********************************************************************        
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.SAS,DISP=OLD                                 
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F740.MATUREBA.SAS,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS UNDER SPECIAL ASSISTANCE SCHEME ONLY                   
//* FT AND FTST                                                                 
//*-----------------------------------------------------------------            
//STEP02A EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F520PUB,DISP=(,PASS),                                        
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(345,2,D,1,28,A),FORMAT=CH                                      
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,(466,1,CH,EQ,C'1',OR,                  
                  466,1,CH,EQ,C'2'))                                            
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS UNDER SPECIAL ASSISTANCE SCHEME ONLY                   
//* ST                                                                          
//*-----------------------------------------------------------------            
//STEP02B EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F520PUB,DISP=(MOD,PASS),                                     
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(345,2,D,1,28,A),FORMAT=CH                                      
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,466,1,CH,EQ,C'3')                      
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//* INCLUDE APPLICATIONS UNDER SPECIAL ASSISTANCE SCHEME ONLY                   
//* FTS                                                                         
//*-----------------------------------------------------------------            
//STEP02C EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F520PUB,DISP=(MOD,PASS),                                     
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(345,2,D,1,28,A),FORMAT=CH                                      
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,466,1,CH,EQ,C'4')                      
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR PPS & NON-PPS APPLICANTS                                   
//*-----------------------------------------------------------------            
//STEP02D  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F520PUB,DISP=(OLD,PASS)                                     
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR MATURE PA CASES, THE PROGRAM WI           
//* ONLY ALLOCATE THE PRIORITY SUPPLY QUOTA FOR ALL SCHEME                      
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13U532,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F740 DD DSN=&&F520PUB,DISP=(OLD,DELETE)                                   
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L532 DD SYSOUT=8,DEST=IOM8                                                
//P13L532A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 4,5,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP04A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'4P',OR,                                                      
       4,2,CH,EQ,C'5P',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP04B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010AFN,DISP=(OLD,PASS)                                    
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT 1,2 FLATS TO PRINT FLAT SUPPLY BEFORE ADJUST PA FLAT               
//*-----------------------------------------------------------------            
//STEP04C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K0104RM1,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE ADJUST PA FLAT SUPPLY            
//*-----------------------------------------------------------------            
//STEP04D   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K0104RM1,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3P FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                   
//*---------------------------------------------------------------------        
//STEP04E   EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT   DD DSN=&&K0103PRM,DISP=(,PASS),                                     
//          UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                              
//          DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                  
//SYSIN     DD *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3P')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP04F   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K0103PRM,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                           
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT BY REGN                                                                
//* INCLUDE ONLY APPLICATIONS UNDER SPECIAL ASSISTANCE SCHEME                   
//*-----------------------------------------------------------------            
//STEP06  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                 
//SORTOUT DD DSN=&&F520REGN,DISP=(,PASS),                                       
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(226,3,CH,EQ,C'   ',AND,(466,1,CH,EQ,C'1',OR,                  
                  466,1,CH,EQ,C'2',OR,466,1,CH,EQ,C'3',OR,                      
                  466,1,CH,EQ,C'4'))                                            
//*-----------------------------------------------------------------            
//* SORT BY REGN ON BALLOT FILE TO GET RESULT                                   
//*-----------------------------------------------------------------            
//STEP07  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                   
//        AMP=('BUFND=23')                                                      
//SORTOUT DD DSN=&&F520BALT,DISP=(,PASS),                                       
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(213,3,CH,NE,C'GRO',AND,                                       
                  245,1,CH,EQ,C' ')                                             
//*---------------------------------------------------------------------        
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------------        
//STEP08   EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520REGN,DISP=(OLD,PASS)                                    
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,PASS)                                    
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13SUCC,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT REPORT ON SUCC FOR THIS ROUND BY ALLOC-SCHEME                         
//*------------------------------------------------------------------           
//STEP10   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=*                                                          
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
HLR                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT REPORT ON SUCC PPS & NON-PPS APPLICANTS                               
//*-----------------------------------------------------------------            
//STEP10A  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*------------------------------------------------------------------           
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=((466,1,CH,EQ,C'1',OR,466,1,CH,EQ,C'2',OR,                      
                 466,1,CH,EQ,C'3',OR,466,1,CH,EQ,C'4'),AND,                     
                 213,3,CH,NE,C'GRO',AND,245,1,CH,EQ,C' ')                       
//*------------------------------------------------------------------           
//* PRINT REPORT ON TOTAL CUMULATIVE SUCC BY ALLOC-SCHEME                       
//*------------------------------------------------------------------           
//STEP12   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=8,DEST=IOM8                                                
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
ALH                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* FOR MATURE NT                                                               
//* SORT UNSUCC PRIORITY,SAS AND PUBLIC CASES FOR PA PIGEONHOLONG               
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.PA,DISP=OLD                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,213,3,CH,NE,C'GRO',AND,                 
                 245,1,CH,EQ,C' ')                                              
//*--------------------------------------------------------------------         
//* END BP13APHL                                                                
//*--------------------------------------------------------------------         
//*---------------------------------------------------------------------        
//* CREATE/DEFINE BP13K712 FLAT NHH/UPG FILE                                    
//*---------------------------------------------------------------------        
//STEP15    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR350,DISP=SHR                                  
//SYSIN     DD  *                                                               
          DEL (BP13.K712.FLATNHUG) CL PURGE                                     
          DEF CLUSTER                                -                          
              (NAME(BP13.K712.FLATNHUG)              -                          
              CYL(1 1)                               -                          
              UNIQUE                                 -                          
              STORCLAS(PRODRLS)               -                                 
              LOG(NONE)                       -                                 
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K712.FLATNHUG.DATA)         -                          
              KEYS(10 0)                             -                          
              RECSZ(350 350)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K712.FLATNHUG.INDEX))                                  
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K712.FLATNHUG)                                           
//*---------------------------------------------------------------------        
//* SORT THE BALLOT FILE FOR PA SCHEME (NEW TOWN, FLAT TYPE, ALLOC SCH)         
//* SORT OUT FLAT TYPE '2' NON-ELDERLY APPLICATIONS                             
//*---------------------------------------------------------------------        
//STEP16A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                
//SORTOUT  DD DSN=&&F520NHUG,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(187,3,A,211,2,A,213,3,A),FORMAT=CH                            
     INCLUDE COND=(211,1,CH,EQ,C'2',AND,                                        
                  (210,1,CH,EQ,C'N',OR,210,1,CH,EQ,C' '))                       
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT THE BALLOT FILE FOR PA SCHEME (NEW TOWN, FLAT TYPE, ALLOC SCH)         
//* SORT OUT OTHER FLAT TYPES                                                   
//*---------------------------------------------------------------------        
//STEP16B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                
//SORTOUT  DD DSN=&&F520NHUG,DISP=(MOD,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(187,3,A,211,2,A,213,3,A),FORMAT=CH                            
     INCLUDE COND=(211,1,CH,NE,C'2')                                            
//*                                                                             
//*---------------------------------------------------------------------        
//* COMPUTE NO OF TOTAL REQUESTS FOR NHH/UPG FOR PA ONLY                        
//*---------------------------------------------------------------------        
//STEP17   EXEC PGM=BP13C54A,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13F520 DD DSN=&&F520NHUG,DISP=(OLD,PASS)                                    
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* COMPUTE NO OF UNITS SET ASIDE FOR NHH/UPG FOR PRIORITY SCHEME               
//* COMPUTE FOR PA SCHEME                                                       
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=BP13CF78,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG FOR EACH COHORT                    
//* (WILL ONLY HAVE PA COHORT)                                                  
//*---------------------------------------------------------------------        
//STEP19   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13L552 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
