//BP13D604  JOB (BP13P),'BP13D604',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//*=================================================================*           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* --------  ----        ---  -----------                          *           
//* BP133172  15/08/2008  JB8  DELETE BP13K650 BASED ON RETURN FILES*           
//*           18/05/2009  JB8  BACKUP RETURN FILES FROM AG07        *           
//* BP133601  17/06/2009  JB8  REMOVE BACKUP OF AG07F630            *           
//* BP134810  07/06/2013  JGO1 ADD NEW FILES FOR STAMPFEE           *           
//* BP135290  17/04/2014  JGO1 CHANGE SU TO SS                      *           
//* BP135832  29/06/2015  JGO1 CHANGE F235 LENGTH                   *           
//*********************************************************************         
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                          
//*    PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGREEMENT TEAM)                
//*********************************************************************         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K650.PREPVRCH,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------*         
//* SORT BY REGN                                                                
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F235.EGPVR.RETURN.SOC,DISP=SHR                           
//SORTOUT  DD DSN=&&AG07F235,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=700)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(14,8,A),FORMAT=CH                                               
   INCLUDE COND=(1,3,CH,EQ,C'SS ',AND,                                          
                 12,2,CH,NE,C'00',AND,                                          
                 12,2,CH,NE,C'99')                                              
//*-------------------------------------------------------------------*         
//* SORT BY REGN , OUTREC TO AG07F235                                           
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F237.EGPVRTX.RETURN.SOC,DISP=SHR                         
//SORTOUT  DD DSN=&&AG07F235,DISP=(MOD,PASS)                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=(14,8,A),FORMAT=CH                                               
   INCLUDE COND=(1,3,CH,EQ,C'SS ')                                              
   OUTREC FIELDS=(1,24,576X)                                                    
//*-------------------------------------------------------------------*         
//* SORT BY REGN , OUTREC TO AG07F235                                           
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//*SORTIN   DD DSN=AG07.F630.SOC,DISP=SHR                                       
//SORTIN   DD DSN=BP13.F102.VOUCHER,DISP=SHR                                    
//SORTOUT  DD DSN=&&AG07F235,DISP=(MOD,PASS)                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=(14,8,A),FORMAT=CH                                               
   INCLUDE COND=(20,4,CH,EQ,C'BKPS')                                            
   OUTREC FIELDS=(35,11,2X,1,11,576X)                                           
//*-------------------------------------------------------------------*         
//* SORT BY REGN                                                                
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&AG07F235,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F235,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=700)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(14,8,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*-------------------------------------------------------------------*         
//* DELETE BP13K650                                                             
//*-------------------------------------------------------------------*         
//STEP05 EXEC PGM=BP13C65A,COND=(0,NE)                                          
//AG07F235 DD DSN=&&F235,DISP=(OLD,PASS)                                        
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F650 DD DSN=BP13.F650.VOUCHER.MTH,DISP=MOD                                
//BP13L65A DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BY VOUCHER-NO AND SERIAL-NO                                            
//*-----------------------------------------------------------------            
//STEP06   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=AG07.F235.EGPVR.RETURN.SOC,DISP=SHR                           
//SORTOUT  DD  DSN=&&F235RJCT,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=700,BLKSIZE=4200)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,13,A),FORMAT=CH                                               
   INCLUDE COND=(1,3,CH,EQ,C'SS ')                                              
//*-----------------------------------------------------------------            
//* PRINT GROUP VOUCHER REJECTED BY EWPC                                        
//*-----------------------------------------------------------------            
//STEP07   EXEC  PGM=BP13C694,COND=(0,NE)                                       
//AG07F235 DD  DSN=&&F235RJCT,DISP=(OLD,DELETE)                                 
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13L694 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* BACKUP FILE                                                                 
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AG07.F235.EGPVR.RETURN.SOC,DISP=SHR                           
//OUTPUT1  DD DSN=BP13.AG07.F235.EGPVR.RETURN.MONTH,DISP=MOD                    
//INPUT2   DD DSN=AG07.F237.EGPVRTX.RETURN.SOC,DISP=SHR                         
//OUTPUT2  DD DSN=BP13.AG07.F237.EGPVRTX.RETURN.MONTH,DISP=MOD                  
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-------------------------------------------------------------------*         
//* EMPTY VOUCHER TRANSACTION FILE                                    *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AG07.F235.EGPVR.RETURN.SOC,DISP=OLD                           
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*-------------------------------------------------------------------*         
//* EMPTY VOUCHER TRANSACTION FILE                                    *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DUMMY                                                             
//OUTPUT2  DD DSN=AG07.F237.EGPVRTX.RETURN.SOC,DISP=OLD                         
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                  
//*                                                                             
