//BP13REV4  JOB (BP13P),'BP13REV4',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071,TYPRUN=HOLD                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*********************************************************************         
//* CHG-NO   BY   ON      - DESCRIPTION                                         
//* ---------------------------------                                           
//* BP130418 CLT 19981016 - Y2K IMPLEMENTATION                                  
//* BP132546 YCH 11062004 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)               
//*--------------------------------------------------------------------         
//* REPRO SOC OCCUPIER FROM THE CARTRIDGE (BEFORE BATCH JOB)                    
//*---------------------------------------------------------------------        
//STEP01 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=BP13.F820.OCCUP.AFDAILY(0),DISP=SHR                           
//OUTPUT1  DD DSN=&&BP13F820,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3),SPACE=(CYL,(160,100),RLSE),                           
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*--------------------------------------------------------------------         
//*      TO CREATE SOC OCCUPIER FILE  ( BP13.K820.OCCUP )                       
//*--------------------------------------------------------------------         
//STEP09    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=&&BP13F820,DISP=(OLD,PASS)                                    
//SYSIN     DD  *                                                               
          DEL (BP13.K820.OCCUP) CL PURGE                                        
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K820.OCCUP)                 -                  00810000
              CYL(350 100)                           -                  00830000
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K820.OCCUP.DATA)            -                  00870000
              KEYS(17 0)                             -                  00880000
              RECSZ(400 400)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K820.OCCUP.INDEX)           -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K820.OCCUP)                                      00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.K820.OCCUP.ALTX1)      -                  00980000
               REL(BP13.K820.OCCUP)                  -                  00990000
               REUSE                                 -                  01010000
               KEYS(9 8)                             -                  01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.K820.OCCUP.ALTX1.DATA)     -                  01070000
               CYL(100 50)                          -                   01080000
               RECSZ(31 354)                         -                  01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.K820.OCCUP.ALTX1.INDEX)    -                  01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.K820.OCCUP.PATH1)     -                  01160000
               PENT(BP13.K820.OCCUP.ALTX1))                             01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.K820.OCCUP)                  -                  01190000
               ODS(BP13.K820.OCCUP.ALTX1)                               01200000
