//BP13RP01 JOB (BP13P),'PRECHK',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),              
//      NOTIFY=CSD0071,USER=BP13SURP,SCHENV=HICPU                               
//*=====================================================================        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=====================================================================        
//*  BATCH JOB TO INSERT SERS TRANSFERRED CASES                                 
//*  BP13K730, BP13K825, BP13K830                                               
//*=====================================================================        
//*-------------------------------------------------------------                
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP137208 YCH2 20180212   TO INCLUDE FILE NAME FOR BP13F857                  
//*                                                                             
//*-------------------------------------------------------------                
//*--------------------------------------------------------------------         
//PS0100   EXEC PGM=BP13C9CA,COND=(0,NE),PARM='CI1TORP,BP13SURP'                
//* SORT SERS REQUEST INTO BP13K730 TO DETERMINE HHOLD TYPE                     
//*---------------------------------------------------------------------        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//         DD DSN=CICS.ALIAS.SDFHEXCI,DISP=SHR                                  
//BP13F730 DD DSN=BP13.F730.SERSREQ,DISP=SHR                                    
//BP13F825 DD DSN=BP13.F825.SERSOCCP,DISP=OLD                                   
//BP13F830 DD DSN=BP13.F830.SERSADDR,DISP=OLD                                   
//BP13F853 DD DUMMY                                                             
//BP13F857 DD DSN=BP13.F857.SRSEMAIL,DISP=OLD                                   
//BP13L9CA DD DSN=BP13.L9CA.SERSERR,DISP=OLD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
