//BP13D527 JOB (BP13P),'BP13D527',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB04683
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//*                     D A I L Y   J O B                                       
//*==================================================================           
//* GENERATE AN EXCEPTION REPORT (BASED ON NRIC) USING THE FOLLOWING            
//* CONDITIONS :                                                                
//* 1. SINGLE, WIDOWED, SEPARATED PERSONS WITH MARRIAGE RECORD/S                
//* 2. DIVORCEE WITH LATEST MARRIAGE DATE FROM SOURCE "EXTERNAL                 
//*    AGENT" IS AFTER DIVORCED DATE DECLARED IN SALES APPLICATION              
//*    FORM                                                                     
//*==================================================================           
//* CHG-NO    BY    ON        DESCRIPTION                                       
//*---------  ----  --------  --------------------------------------            
//* BP135605  SMR2  20150402  NEW JCL                                           
//*==================================================================           
//* BACKUP BP13F82Z                                                             
//*-----------------------------------------------------------------*           
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F82Z.MARRSCRN.BE01,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.F82Z.MARRSCRN.BE01.BKUP(+1),DISP=(NEW,CATLG),            
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(BP13.GDG,BLKSIZE=27900,LRECL=150,RECFM=FB)                   
//SYSIN    DD *                                                                 
    REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                      
//*-----------------------------------------------------------------*           
//* SORT BY ALLO CAT, DTE BALLOT, NT, FT, REGN, NRIC                            
//*-----------------------------------------------------------------*           
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F82Z.MARRSCRN.BE01,DISP=SHR                              
//SORTOUT  DD DSN=&&BP13F82Z,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(85,14,A,1,17,A),FORMAT=CH                                      
//*-----------------------------------------------------------------*           
//* READ CDB SUBROUTINE (BE01) & WRITE RECORDS IN EXCEPTION REPORT              
//*-----------------------------------------------------------------*           
//STEP03   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F82Z DD DSN=&&BP13F82Z,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K734 DD DSN=BP13.K734.INCOME,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BE01F371 DD DSN=BE01.F371.MRGENQRY.PRCS.BP13,DISP=OLD,                        
//            SPACE=(1,(30,5)),AVGREC=M,DSORG=PS,                               
//            RECFM=FB,LRECL=3550,BLKSIZE=0                                     
//BE01F372 DD DSN=BE01.F372.MRGENQRY.INV.BP13,DISP=OLD,                         
//            SPACE=(1,(30,5)),AVGREC=M,DSORG=PS,                               
//            RECFM=FB,LRECL=3550,BLKSIZE=0                                     
//BE01F373 DD DSN=BE01.F373.MRGENQRY.LOG.BP13,DISP=OLD,                         
//            SPACE=(1,(60,10)),AVGREC=M,DSORG=PS,                              
//            RECFM=FB,LRECL=3800,BLKSIZE=0                                     
//BP13LD61 DD DSN=BP13.LD61.MARRSCRN,DISP=OLD                           00240003
//P13F82ZA DD DSN=BP13.F82Z.MARRSCRN.BE01,DISP=OLD                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13CD61) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
