//BP13D22H JOB (BP13P),'BP13D22H',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB01423
//         NOTIFY=CSD0071                                                       
/*JOBPARM SYSAFF=MVS2                                                           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*================================================================== *         
//* JCL TO DETERMINE FT2T HARDLUCK BP13.F585.FT2T                               
//* FT HARDLUCK = BP13.F595.SOCNOTFD.AFQUE.AY0H, OUTPUT IN JOB BP13D22D         
//* FT/2T HARDLUCK = BP13.F595.AY0J.RDBCHK, OUTPUT IN JOB BP13D22H              
//*                  JOB BP13D22E - BP13D22H                                    
//* 2T HARDLUCK FILE = BP13.F595.AY0J.PURE2T, OUTPUT IN JOB BP13D221            
//*-------------------------------------------------------------------*         
//*- THIS JOB IS SIMILAR TO BP13AY0F                                            
//*- BP13AY0A - GIVE PRIOROTY TO FIRST TIMER (FT) >=2 UNSUCC ATTEMPT            
//*- BP13AY0H - GIVE PRIOROTY TO FIRST TIMER (FT) >=2 UNSUCC ATTEMPT            
//*- BP13AY0F - GIVE PRIOROTY TO FT/2T COMBINATION>=2 UNSUCC ATTEMPT            
//*- BP13AY0J - GIVE PRIOROTY TO FT/2T COMBINATION>=2 UNSUCC ATTEMPT            
//*=================================================================            
//*-CHG-NO   BY   ON    DESCRIPTION                                             
//*------------------------------------                                         
//*-BP134205 LSB 110555 ADD BP13K813 FOR BP13CB91                               
//*-BP134247 LSB 110610 ADD PPOS/EC CHECK,CY82 CHK MATURE-TAG                   
//*-BP134255 LSB 110615 CHG BP13CY64 TO BP13CY82 BYPASS MATURE EST              
//*-BP134255 LSB 110711 CHG BP13CB71, DELETE CB90, ICNLUDE REQUEST-S            
//*                     IN BP13CB91, ADD FN/NE/HARDLUCK COUNT                   
//*                     BP13CY89,BYAPSS STATUS=S, BTO COUNT>00                  
//*-BP134598 LSB 250712 CHG COL 470 COL 467 ON UNSUCC COUNT                     
//*-BP134598 LSB 310712 IMPLT CY74 UPDATE HHTY=H FOR PARENT CHILD               
//*-BP134598 LSB 010812 TAKE OUT SY02F001                                       
//*-BP134996 LSB 300713 DELETE K716.PATH1, FT27=COL 475                         
//*-BP135171 RJE 110214 TO CATER FOR DB2 UPGRADE                                
//*-BP135237 LSB 290214 REFER K595.BP13D220 INSTEAD K595.BALLOT.LOG             
//*-BP137734 LSB 030419 READ BALLOT-HOUSEHOLD=F                                 
//*-BP137734 LSB 160419 DEFINE BP13K750 FROM BP13F716-BP13Q749                  
//*-BP137958 KV6 310719 DELETE INLCUDE COND (COL 487) IN STEP02/03/10           
//*-------------------------------------------------------------------*         
//* 1) DETERMINE APPLICATION WITH COMBINATION OF FIRST TIMER AND                
//* SECOND TIMER, HUSBAND + SPOUSE OR FS CASES                                  
//* 2) >= 6 UNSUCC ATTEMPTS                                                     
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y1                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K20H.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YJ')                                               
//*-----------------------------------------------------------------            
//* IF FT2T CASES CHECK BALLOT-HH= F                                            
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0J,DISP=SHR                        
//SORTOUT  DD DSN=BP13.F595.FT2T.D22H,DISP=OLD,                                 
//         UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                                
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(461,1,CH,EQ,C'F',AND,                                          
                 467,2,CH,GE,C'01')                                             
//*---------------------------------------------------------------------        
//* CASE BEFORE 200309, DETERMINE FT2T                                          
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0J,DISP=SHR                        
//SORTOUT  DD DSN=&&F595AT04,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                                
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(334,6,CH,LT,C'201309',AND,                                     
                 461,1,CH,NE,C'F',AND,                                          
                 467,2,CH,GE,C'01')                                             
//*---------------------------------------------------------------------        
//* CHECK FOR CASES WITH FT/2T - TAG IN COL 475,CHANGE IN 08/04/2019            
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13CD82,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595AT04,DISP=(OLD,PASS)                                    
//BP13K558 DD DSN=BP13.K558.UPGOCCP,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K716 DD DSN=BP13.K716.BP13AY0J,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595A DD DSN=BP13.F595.CHKFT2T.AY0J,DISP=SHR                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* DETERMINE FT-2T CASES                                                       
//*-------------------------------------------------------------------*         
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.CHKFT2T.AY0J,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F595.FT2T.AY0J,DISP=OLD,                                 
//            SPACE=(CYL,(150,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
  INCLUDE COND=(116,1,CH,EQ,C'G',AND,                                           
                475,1,CH,EQ,C'Y')                                               
//*--------------------------------------------------------------------*        
//* BYPASS NON-CITIZEN SPOUSE CODE 00                                           
//*--------------------------------------------------------------------*        
//STEP07   EXEC PGM=BP13CY83,COND=(0,NE)                                        
//BP13F595 DD DSN=BP13.F595.FT2T.AY0J,DISP=SHR                                  
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LY83 DD DSN=BP13.LY83.BP13CY83.AY0J,DISP=SHR                              
//P13F595A DD DSN=&&F595NONC,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* BYPASS SPOUSE FOUND AS OCCUPIER IN THE DP FLAT                              
//* RDB ROLE 023(LESSEE), 024(CO-LESSEE) 025(OCCUPIER)                          
//*--------------------------------------------------------------------*        
//STEP08   EXEC PGM=BP13CY84,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595NONC,DISP=(OLD,PASS)                                    
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K716 DD DSN=BP13.K716.BP13AY0J,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LY84 DD DSN=BP13.LY83.BP13CY83.AY0J,DISP=MOD                              
//P13F595A DD DSN=BP13.F595.AY0J.RDBCHK,DISP=OLD                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT BP13.F595.SOCNOTFD.AFQUE BY NRIC1                                      
//* INCLUDE BTO COUNT > 00                                                      
//* BYPASS REQUEST-STATUS = S (COL 487)                                         
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.FT2T.D22H,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F595.AY0J.RDBCHK,DISP=MOD                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* SORT BP13.F595.SOCNOTFD.AFQUE BY NRIC1                                      
//* INCLUDE BTO COUNT > 00                                                      
//* BYPASS REQUEST-STATUS = S (COL 487)                                         
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.AY0J.RDBCHK,DISP=SHR                                
//SORTOUT  DD DSN=&&F595F585,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(180,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A),FORMAT=CH                                                
   INCLUDE COND=(467,2,CH,GE,C'01')                                             
//*---------------------------------------------------------------------        
//* SORT BP13.F500.AY0H BY NRIC1/DTE-BALLOT/DTE-REQUEST                         
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.AY0J.CY46,DISP=SHR                          00120000
//SORTOUT  DD DSN=&&F595QTR,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(200,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                                
//*---------------------------------------------------------------------        
//* CREATE HARDLUCK FILE, TRANS-TYPE = 1                                        
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13CY89,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595F585,DISP=(OLD,PASS)                                    
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13F730 DD DSN=&&F595QTR,DISP=(OLD,PASS)                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BP13D220,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F585 DD DSN=BP13.F585.FT2T,DISP=SHR                                       
//BP13LY89 DD DSN=BP13.LY89.BP13CY89.AY0J,DISP=SHR                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
