//BP13D420  JOB (BP13P),'BP13D420',CLASS=I,MSGCLASS=N,                  00010005
//        MSGLEVEL=(1,1),NOTIFY=CSD0071,SCHENV=PKZIP                    00020001
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030001
//* ============================================================== *    00040001
//*                                                                *    00050001
//*     T A K E     P O S S E S S I O N     J O B                  *    00060001
//*                                                                *    00070001
//* ============================================================== *    00080001
//* CHGE REQ  DATE        BY   DESCRIPTION                              00090001
//* --------  ----        ---  -----------                              00100001
//* BP138123  10/12/2019  LSB1 TAG DEBARMENT                            00900202
//*-------------------------------------------------------------------* 00900301
//*-------------------------------------------------------------------* 00906004
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                         * 00907004
//*-------------------------------------------------------------------* 00908004
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                  00909004
//INPUT1   DD DSN=BP13.K936.DEBARLOG,DISP=OLD                           00909104
//INPUT2   DD DSN=BP13.K937.DEBARRPT,DISP=OLD                           00910004
//INPUT3   DD DSN=BP13.K42B.VERIFY.ACCUM,DISP=OLD                       00960004
//SYSPRINT DD SYSOUT=*                                                  00970004
//SYSIN   DD *                                                          00980004
          VFY FILE(INPUT1)                                              00990004
          VFY FILE(INPUT2)                                              01000004
          VFY FILE(INPUT3)                                              01010004
//*-------------------------------------------------------------------* 01020004
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                         * 01030004
//*-------------------------------------------------------------------* 01040004
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                  01050004
//INPUT1   DD DSN=BP13.K936.DEBARLOG,DISP=OLD                           01060004
//INPUT2   DD DSN=BP13.K937.DEBARRPT,DISP=OLD                           01070004
//INPUT3   DD DSN=BP13.K42B.VERIFY.ACCUM,DISP=OLD                       01080004
//SYSPRINT DD SYSOUT=*                                                  01090004
//SYSIN   DD *                                                          01100004
          VFY FILE(INPUT1)                                              01110004
          VFY FILE(INPUT2)                                              01120004
          VFY FILE(INPUT3)                                              01130004
//*-------------------------------------------------------------------* 04420001
//* SORT BP13K936 BY KEY                                              * 04430001
//* DELETION BP13K936 IS IN BP13D412                                  * 04440001
//*-------------------------------------------------------------------* 04450001
//STEP01   EXEC SORT,COND=(0,NE)                                        04460006
//SORTIN   DD DSN=BP13.K936.DEBARLOG,DISP=SHR                           04470001
//SORTOUT  DD DSN=&&BP13F936,DISP=(NEW,PASS),                           04480001
//         UNIT=SYSDA,SPACE=(CYL,(2,5),RLSE),                           04490001
//         DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                          04500001
//SYSIN   DD  *                                                         04510001
  SORT FIELDS=(1,13,A),FORMAT=CH                                        04520001
  SUM FIELDS=NONE                                                       04530001
  INCLUDE COND=(1,8,CH,NE,C'        ')                                  04540001
//*-------------------------------------------------------------------* 04550001
//* REPORT ON CASES TO DEBARRED DETERMINE IN EAPG PORATL BUT            04560001
//* RECORD NOT FOUND IN DEBARMENT SYSTEM                                04570001
//*-------------------------------------------------------------------* 04580001
//STEP02   EXEC PGM=BP13C26C,COND=(0,NE)                                04590006
//BP13F936 DD DSN=&&BP13F936,DISP=(SHR,PASS)                            04600001
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR,                             04610001
//         AMP=('BUFND=4','BUFNI=8')                                    04620001
//BP13K42B DD DSN=BP13.K42B.VERIFY.ACCUM,DISP=SHR,                      04630001
//         AMP=('BUFND=4','BUFNI=8')                                    04640001
//BP13K937 DD DSN=BP13.K937.DEBARRPT,DISP=SHR,                          04650001
//         AMP=('BUFND=4','BUFNI=8')                                    04660001
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             04670001
//            AMP=('BUFND=4','BUFNI=8')                                 04680001
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                           04690001
//         AMP=('BUFND=4','BUFNI=8')                                    04700001
//BP13K936 DD DSN=BP13.K936.DEBARLOG,DISP=SHR,                          04710001
//         AMP=('BUFND=4','BUFNI=8')                                    04720001
//BP13L26C DD DSN=BP13.L26C.DEBAR,DISP=OLD                              04730001
//SYSDBG   DD SYSOUT=*                                                  04740001
//SYSDBOUT DD SYSOUT=*                                                  04750001
//SYSOUT   DD SYSOUT=*                                                  04760001
/*                                                                      04770001
//*-------------------------------------------------------------------* 05060001
//* BACKUP DEBARMENT RECORD                                             05070001
//*-------------------------------------------------------------------* 05080001
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                  05090006
//SYSPRINT DD SYSOUT=*                                                  05100001
//INPUT5   DD DSN=BP13.L26C.DEBAR,DISP=SHR                              05230001
//OUTPUT5  DD DSN=BP13.L26C.DEBAR.ACCUM,DISP=MOD                        05240001
//*                                                                     05250001
//SYSIN    DD  *                                                        05260001
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                               05310001
//*                                                                     05320001
//*-----------------------------------------------------------------    05330001
//*  ACCUMULATE DEBAR LOG INTO DEBAR LOG ACCUM                          05340001
//*-----------------------------------------------------------------    05350001
//STEP04   EXEC SORT,COND=(0,NE)                                        05360006
//SORTIN   DD DSN=BP13.K936.DEBARLOG,DISP=SHR                           05370001
//SORTOUT  DD DSN=BP13.F936.DEBARLOG.ACCUM,DISP=MOD                     05380001
//SYSIN    DD  *                                                        05390001
  SORT FIELDS=(1,11,A),FORMAT=CH                                        05400001
  OMIT COND=(1,8,CH,EQ,C'        ')                                     05410001
//*-------------------------------------------------------------------* 05420001
//* TO DEL/DEFINE  SOC DEBAR LOG FILE(BP13.K936.DEBARLOG)             * 05430001
//*-------------------------------------------------------------------* 05440001
//STEP05    EXEC PGM=IDCAMS,COND=(0,NE)                                 05450006
//INPUT1    DD DSN=BP13.BLANK.CHAR2000,DISP=SHR                         05460001
//SYSPRINT  DD SYSOUT=*                                                 05470001
//SYSIN     DD  *                                                       05480001
          DEL (BP13.K936.DEBARLOG) CL PURGE                             05490001
          DEF CLUSTER                                -                  05500001
              (NAME(BP13.K936.DEBARLOG)               -                 05510001
              CYL(50 10)                            -                   05520001
              DATACLAS(MULTIVOL)                     -                  05530001
              STORCLAS(PRODRLS)                      -                  05540001
              LOG(NONE)                              -                  05550001
              SPEED                                  -                  05560001
              UNIQUE                                 -                  05570001
              SHR(2 3))                              -                  05580001
              DATA                                   -                  05590001
              (NAME(BP13.K936.DEBARLOG.DATA)          -                 05600001
              KEYS(13 0)                             -                  05610001
              RECSZ(2000 2000)                       -                  05620001
              CISZ(4096)                             -                  05630001
              FSPC(10 10))                           -                  05640001
              INDEX                                  -                  05650001
              (NAME(BP13.K936.DEBARLOG.INDEX)         -                 05660001
              CISZ(4096))                                               05670001
      IF MAXCC = 0  THEN                             -                  05680001
         REPRO IFILE(INPUT1)                         -                  05690001
              ODS(BP13.K936.DEBARLOG)                                   05700001
//*                                                                     05710001
//*-----------------------------------------------------------------    23740004
//*   DELETE ZIP FILE BEFORE PROCESSING                                 23750004
//*-----------------------------------------------------------------    23760004
//STEP95    EXEC  PGM=IDCAMS                                            23770004
//SYSPRINT  DD  SYSOUT=*                                                23780004
//SYSIN     DD *                                                        23790004
     DEL (BP13.BP13L26C.ZIP)                                            23800004
     IF MAXCC < 12 THEN                                                 23810004
        SET MAXCC = 0                                                   23820004
/*                                                                      23830004
//*-----------------------------------------------------------------    23840004
//*         AUTO-GENERATE MAIL HEADER PART I                            23850004
//*         HELO SGPHDBX                                                23860004
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                23870004
//*-----------------------------------------------------------------    23880004
//STEP96   EXEC PGM=IRXJCL,PARM='SMTPHDR'                               23890004
//SYSTSPRT DD  SYSOUT=*                                                 23900004
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                           23910004
//SMTPHDR  DD  DSN=&&P13HDG1,DISP=(NEW,PASS),                           23920004
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=400,RECFM=VB)          23930004
//SYSTSIN  DD  DUMMY                                                    23940004
//*                                                                     23950004
//*--------------------------------------------------------------------*23960004
//*          ZIP THE REPORT FILE                                        23970004
//*--------------------------------------------------------------------*23980004
//STEP97    EXEC PKZIP                                                  23990004
-ARCHIVE(BP13.BP13L26C.ZIP)                                             24000004
-UPDATE                                                                 24010004
-ARCHVOL(DUMMY)                                                         24020004
-METHOD(FAST)                                                           24030004
-ZIPPED_DSN(BP13.L26C.DEBAR,BP13L26C.TXT)                               24040004
-FILE_TERMINATOR()                                                      24050004
 BP13.L26C.DEBAR                                                        24060004
//*-----------------------------------------------------------------    24070004
//*          CREATE EMAIL RECIPIENT AND SUBJECT                         24080004
//*-----------------------------------------------------------------    24090004
//STEP98    EXEC SAS,OPTIONS='MACRO'                                    24100004
//WORK     DD UNIT=SYSDA,SPACE=(1,(50,50)),AVGREC=M                     24110004
//SYSOUT   DD SYSOUT=*                                                  24120004
//BP13RCPT DD DSN=&&BP13RCPT,DISP=(NEW,PASS),                           24130004
//         LRECL=400,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,              24140004
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                       24150004
//SYSPRINT DD SYSOUT=*                                                  24160004
//SYSIN    DD *                                                         24170004
    DATA _NULL_;                                                        24180004
        CURRENT =DATE();                                                24190004
        FILE BP13RCPT;                                                  24200004
        PUT @01 'RCPT TO:<LOW_SOO_CHIEW@HDB.GOV.SG>';                   24210004
        PUT @01 'DATA                                    ';             24220004
        PUT @01 'FROM:SOC SYSTEM-EMAIL ALERT             ';             24230004
        PUT @01 'TO:LOW_SOO_CHIEW@HDB.GOV.SG             ';             24240004
        PUT @01 'SUBJECT:EXCEPTION REPORT FOR MULTIPLE DEBARMENT AT'    24250004
            @52 'KEYS COLLECTION - '                                    24260004
            @70 CURRENT DDMMYY10.;                                      24270004
//*-----------------------------------------------------------------    24280004
//* STEP 12: SPECIFY ATTACHMENT FILE NAME                               24290004
//*-----------------------------------------------------------------    24300004
//STEP99    EXEC SAS,OPTIONS='MACRO'                                    24310004
//SYSOUT   DD SYSOUT=*                                                  24320004
//BP13NAME DD DSN=&&BP13NAME,DISP=(NEW,PASS),                           24330004
//         LRECL=400,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,              24340004
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                       24350004
//SYSPRINT DD SYSOUT=*                                                  24360004
//SYSIN    DD *                                                         24370004
    DATA _NULL_;                                                        24380004
        FILE BP13NAME;                                                  24390004
        PUT @01 '           NAME="BP13.BP13L26C.ZIP"';                  24400004
//*****************************************************************     24410004
//*          ENCODE A ZIP DATASET INTO BASE64 FORMAT                    24420004
//*****************************************************************     24430004
//STEP100  EXEC ENCODE                                                  24440004
//ENCODOUT DD DSN=&&BASE64,DISP=(,PASS),                                24450004
//            SPACE=(5,(10,10),RLSE),AVGREC=M                           24460004
//ENCODIN  DD DSN=BP13.BP13L26C.ZIP,DISP=SHR                            24470004
/*                                                                      24480004
//*****************************************************************     24490004
//*          CONVERT OUTPUT TO VARIABLE-BLOCKED (VB)                    24500004
//*****************************************************************     24510004
//STEP101  EXEC SORT                                                    24520004
//SORTIN   DD DSN=&&BASE64,DISP=(SHR,DELETE)                            24530004
//FBVB     DD DSN=&&VB64,DISP=(,PASS),                                  24540004
//           SPACE=(TRK,(10,5),RLSE),                                   24550004
//           DCB=(DSORG=PS,LRECL=400,RECFM=VB)                          24560004
//SYSIN    DD *                                                         24570004
 MERGE FIELDS=COPY                                                      24580004
 OUTFIL FNAMES=FBVB,FTOV,VLTRIM=X'40'                                   24590004
/*                                                                      24600004
//*-----------------------------------------------------------------    24610004
//*          CREATE EMAIL FOR FIRST ATTACHMENT                          24620004
//*-----------------------------------------------------------------    24630004
//STEP102  EXEC PGM=IEBGENER                                            24640004
//SYSUT1   DD DSN=*.STEP96.SMTPHDR,DISP=(SHR,PASS)                      24650004
//         DD DSN=&&BP13RCPT,DISP=(OLD,PASS)                            24660004
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                24670004
//         DD DSN=AV05.MIME.HEADERS.VB(APPLHDR),DISP=SHR                24680004
//         DD DSN=&&BP13NAME,DISP=(SHR,DELETE)                          24690004
//         DD DSN=&&VB64,DISP=(SHR,DELETE)                              24700004
//SYSUT2   DD DSN=BP13.MAILOUT.BP13L26C,DISP=SHR,                       24710004
//         LRECL=400,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,              24720004
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                       24730004
//SYSPRINT DD SYSOUT=*                                                  24740004
//SYSIN    DD DUMMY                                                     24750004
//*------------------------------------------------------------------*  24760004
//* STEP 103: SEND THE SMTP MAIL                                        24770004
//*------------------------------------------------------------------*  24780004
//STEP103  EXEC SENDMAIL                                                24790004
//INPUT    DD DSN=BP13.MAILOUT.BP13L26C,DISP=SHR                        24800004
/*                                                                      24810004
