//BP13A645 JOB (BP13P),'BP13A645',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*==================================================================           
//*BP135189 070114 ZDD1 PRINT SURVEY LETTER & FAQ FOR COMPLETION CRMNY          
//*BP135247 070114 ZDD1 PRINT SURVEY LETTER & FAQ FOR COMPLETION CRMNY          
//*BP135756 210415 NST1 UPDATE PRINTING FROM SYSOUT=2 TO SYSOUT=J               
//*BP135963 180915 NST1 PRINT LETTERS FOR GOLDEN KISMIS                         
//*BP135983 191015 NST1 PRINT LETTERS FOR TEBAN VIEW'136N4  C16   55 '          
//*BP136370 270716 NST1 PRINT LETTERS TENTERAM PEAK '714N6  C28B 117A'          
//*BP136419 290816 NST1 PRINT LETTERS KEAT HONG '208N8  C910 817C'              
//*==================================================================           
//******************************************************************            
//*                   FOR CONTROL LIST                                          
//******************************************************************            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//******************************************************************            
//*            PRINTING OF PCD NOTIFICATION                                     
//******************************************************************            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1B CP-1',END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1B                                   
//SYSUT2   DD SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*==================================================================           
//*-----------------------------------------------------------------            
//*   SORT F120 ACCORDING TO BLOCKS                                             
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                              
//SORTOUT  DD DSN=&&M06F120,                                                    
//         DISP=(NEW,PASS),                                                     
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=700,BLKSIZE=27300)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(23,5,A,180,8,A),FORMAT=CH                                      
    INCLUDE COND=(12,16,CH,EQ,C'208N8  C910 817C',AND,                          
                  180,2,CH,NE,C'##',AND,                                        
                  180,2,CH,NE,C'  ')                                            
//*---------------------------------------------------------------              
//* PRINT OUT THE SURVEY LETTERS                                                
//*--------------------------------------------------------------------*        
//STEP04   EXEC PGM=BP13CF12,COND=(0,NE)                                        
//BM06F120 DD DSN=&&M06F120,DISP=(OLD,DELETE)                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13GEY  DD SYSOUT=J,OUTPUT=(*.PRT02.FORMID),DEST=IOMJ                        
//BP13LGEY DD SYSOUT=J,OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                        
//P13LGEYA DD SYSOUT=J,OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
