//BP13D418 JOB (BP13P),'BP13D418',MSGLEVEL=(1,1),CLASS=I,MSGCLASS=N,            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*                                                                             
//*=================================================================    00011200
//* DATE MOD  BY      REF      DESCRIPTION                                      
//* --------  ----  -------    -----------                                      
//* 17/04/17  KVL1  BP136729   NEW JCL                                          
//* 16/08/17  KVL1  BP136925   ADDED BACKUP STEP FOR BB24 INTERFACE             
//*                            FILE (STEP09A)                                   
//* 12/10/17  KVL1  BP136986   ADDED BP13K893 IN STEP02                         
//* 03/07/18  LJL1  BP137040   TO CATER FOR BLANK SCHEME ACCT IN                
//*                            FILE (BB24F007).                                 
//* 03/08/18  LJL1  BP137385   TO UPDATE BLANK SCHEME ACCT IN                   
//*                            FILE (BB24F007).                                 
//* 16/08/18  LJL1  BP137385   TO CATER FOR CANCELLED CASES IE                  
//*                            REGN = BLANK IN FIS.                             
//* 18/10/18  LJL1  BP137465   TO CATER FOR BLANK SCHEME ACCT IN                
//*                            FILE (BB24F007).                                 
//* 19/11/18  DN8   BP137465   TO CATER FOR RECORDS NOT PRESENT IN K110         
//*                            IN A NEW WORK FILE.                              
//* 27/03/19  DN8   BP137558   TO INCLUDE BP13K480 DD STAMENT FOR               
//*                            PROGRAM BP13C94E.                                
//*=================================================================    00011200
//*****************************************************************             
//*  DAILY BACKUP OF BB24 INTERFACE FILE INTO ACCUM FILE                        
//*****************************************************************             
//STEP01   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BB24.F007.TLOAN.BP13,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F007.TLOAN.BB24.ACCUM,DISP=MOD                           
//SYSIN    DD  *                                                                
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                       
//*                                                                             
//*****************************************************************             
//*  SORTOUT NO SCHEME ACCT FROM RESALE SYSTEM                                  
//*****************************************************************             
//STEP0A   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BB24.F007.TLOAN.BP13,DISP=SHR                                 
//SORTOUT  DD DSN=BP13.F007.TLOAN.BB24.NOFIS,DISP=MOD                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(112,11,A),FORMAT=CH                                              
   INCLUDE COND=(112,11,CH,LT,C'00000000000')                                   
//*******************************************************************           
//*  TO UPDATE SCHEME ACCOUNT INT F007.                                         
//*******************************************************************           
//STEP1A     EXEC PGM=BP13C94J,COND=(0,NE)                                      
//BB24F007   DD DSN=BP13.F007.TLOAN.BB24.NOFIS,DISP=SHR                         
//BP13K820   DD DSN=BP13.K820.OCCUP,DISP=SHR                                    
//BP13K821   DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR                              
//BP13K800   DD DSN=BP13.K800.APPLN,DISP=SHR                                    
//BP13K895   DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR                            
//BP13K891   DD DSN=BP13.K895.OCCUP.HISTORY.PATH1,DISP=SHR                      
//BP13K893   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                            
//SYSPRINT   DD SYSOUT=*                                                        
//SYSOUT     DD SYSOUT=*                                                        
//*                                                                             
//*****************************************************************             
//*  SORTOUT CASES WITH SCHEME ACCT FROM RESALE SYSTEM AFTER C94J               
//*****************************************************************             
//*---------------------------------------------------------------------        
//STEP0B   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BB24.F007.TLOAN.BP13,DISP=SHR                                 
//         DD DSN=BP13.F007.TLOAN.BB24.NOFIS,DISP=SHR                           
//SORTOUT  DD DSN=&&F007A,DISP=(NEW,PASS),                                      
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(112,11,A),FORMAT=CH                                              
   INCLUDE COND=(112,11,CH,GT,C'00000000000')                                   
//*---------------------------------------------------------------------        
//*****************************************************************             
//*  SORTOUT NO SCHEME ACCT FROM RESALE SYSTEM                                  
//*****************************************************************             
//STEP0C   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F007.TLOAN.BB24.NOFIS,DISP=SHR                           
//SORTOUT  DD DSN=BP13.F007.TLOAN.BB24.NOFIS,DISP=SHR                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(112,11,A),FORMAT=CH                                              
   INCLUDE COND=(112,11,CH,LT,C'00000000000')                                   
//*****************************************************************             
//*  UPDATE BP13K48K WITH BB24 INTERFACING FILE AND TAG AS STATS                
//*  ACCORDING TO LATEST STAGE WITH DATE                                        
//*****************************************************************             
//STEP02   EXEC PGM=BP13C94A,COND=(0,NE)                                        
//BB24F007 DD DSN=&&F007A,DISP=(OLD,PASS)                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                              
//BP13K48K DD DSN=BP13.K48K.TLCONTRA.REQ,DISP=SHR                               
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13F94A DD DSN=BP13.F94A.UPDSTATA,DISP=OLD                                   
//BP13F007 DD DSN=BP13.F007.TLOAN.BB24.CANCEL,DISP=MOD                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*******************************************************************           
//*  TO UPDATE SCHEME ACCOUNT INT F007 ROUND 2                                  
//*******************************************************************           
//STEP1B     EXEC PGM=BP13C94K,COND=(0,NE)                                      
//BB24F007   DD DSN=BP13.F007.TLOAN.BB24.NOFIS,DISP=SHR                         
//BP13K48K   DD DSN=BP13.K48K.TLCONTRA.REQ,DISP=SHR                             
//BP13K481   DD DSN=BP13.K48K.TLCONTRA.REQ.PATH1,DISP=SHR                       
//SYSPRINT   DD SYSOUT=*                                                        
//SYSOUT     DD SYSOUT=*                                                        
//*                                                                             
//*****************************************************************             
//*  SORTOUT CASES WITH SCHEME ACCT FROM RESALE SYSTEM AFTER C94K               
//*****************************************************************             
//*---------------------------------------------------------------------        
//STEP0D   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F007.TLOAN.BB24.NOFIS,DISP=SHR                           
//SORTOUT  DD DSN=&&F007D,DISP=(NEW,PASS),                                      
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(112,11,A),FORMAT=CH                                              
   INCLUDE COND=(112,11,CH,GT,C'00000000000')                                   
//*---------------------------------------------------------------------        
//*****************************************************************             
//*  SORTOUT NO SCHEME ACCT FROM RESALE SYSTEM  AFTER C94K                      
//*****************************************************************             
//STEP0E   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F007.TLOAN.BB24.NOFIS,DISP=SHR                           
//SORTOUT  DD DSN=BP13.F007.TLOAN.BB24.NOFIS,DISP=SHR                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(112,11,A),FORMAT=CH                                              
   INCLUDE COND=(112,11,CH,LT,C'00000000000')                                   
//*****************************************************************             
//*  UPDATE BP13K48K WITH BB24 INTERFACING FILE AND TAG AS STATS                
//*  ACCORDING TO LATEST STAGE WITH DATE                                        
//*****************************************************************             
//STEP02A  EXEC PGM=BP13C94A,COND=(0,NE)                                        
//BB24F007 DD DSN=&&F007D,DISP=(OLD,PASS)                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                              
//BP13K48K DD DSN=BP13.K48K.TLCONTRA.REQ,DISP=SHR                               
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13F94A DD DSN=BP13.F94A.UPDSTATA,DISP=MOD                                   
//BP13F007 DD DSN=BP13.F007.TLOAN.BB24.CANCEL,DISP=MOD                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*****************************************************************             
//*  GROUP AND SEPARATE REC WITH THE SAME STAT:                                 
//*  STAT A = NEW REQUEST                                                       
//*  STAT B = FOR CPF REFUNDED                                                  
//*  STAT C = FOR RESALE COMPLETION                                             
//*  STAT D = FOR FINANCL PLAN CONF                                             
//*  STAT E = FOR 1ST APPT CHANGE                                               
//*  STAT F = REC WITH SOC CANCELLED APPLN                                      
//*  STAT G = REC WITH MISMATCH NRIC                                            
//*  STAT H = DUPLICATE REC                                                     
//*  STAT I = MISSING INFO                                                      
//*  SORT BY CASE-TYP THEN REGN NUMBER                                          
//*****************************************************************             
//STEP03   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(0,NE)                         
//SORTIN   DD DSN=BP13.F94A.UPDSTATA,DISP=SHR                                   
//SORTOF01 DD DSN=&&STATB,DISP=(,PASS),                                         
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=130,BLKSIZE=27950)                            
//SORTOF02 DD DSN=&&STATC,DISP=(,PASS),                                         
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=130,BLKSIZE=27950)                            
//SORTOF03 DD DSN=&&STATF,DISP=(,PASS),                                         
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=130,BLKSIZE=27950)                            
//SYSIN    DD *                                                                 
  SORT   FIELDS=(123,1,A,115,8,A),FORMAT=CH                                     
  OUTFIL FILES=01,                                                              
   INCLUDE=(123,01,CH,EQ,C'B')                                                  
  OUTFIL FILES=02,                                                              
   INCLUDE=(123,01,CH,EQ,C'C',OR,                                               
            124,01,CH,EQ,C'C')                                                  
  OUTFIL FILES=03,                                                              
   INCLUDE=(123,01,CH,EQ,C'F',OR,                                               
            123,01,CH,EQ,C'G',OR,                                               
            123,01,CH,EQ,C'H',OR,                                               
            123,01,CH,EQ,C'I')                                                  
/*                                                                              
//*****************************************************************             
//*  CREATE EMAIL ALERT FOR CPF REFUNDED CASES (ALL STAT=B)                     
//*****************************************************************             
//STEP04   EXEC PGM=BP13C94B,COND=(0,NE)                                        
//BP13F94A DD DSN=&&STATB,DISP=(OLD,DELETE)                                     
//BP13L94B DD DSN=BP13.L94B.UPDSTATB,DISP=OLD                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*****************************************************************             
//*  CREATE EMAIL ALERT FOR CPF RESALE COMPLETED CASES (ALL STAT=C)             
//*****************************************************************             
//STEP05   EXEC PGM=BP13C94C,COND=(0,NE)                                        
//BP13F94A DD DSN=&&STATC,DISP=(OLD,DELETE)                                     
//BP13L94C DD DSN=BP13.L94C.UPDSTATC,DISP=OLD                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*****************************************************************             
//* UPDATE ALL TEMP LOAN AND CONTRA CASES THAT ARE KEY ISSUED                   
//* AND SAVE THE CASH PROCEED TO BP13K48K FILE                                  
//*****************************************************************             
//STEP06   EXEC PGM=BP13C94G,COND=(0,NE)                                        
//BP13F410 DD DSN=BP13.F410.DAILYSO,DISP=SHR                                    
//BP13K48K DD DSN=BP13.K48K.TLCONTRA.REQ,DISP=SHR                               
//BP13K480 DD DSN=BP13.K480.CONTRA,DISP=SHR                                     
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*****************************************************************             
//* EXTRACT FROM BP13.K48K.TLCONTRA.REQ ALL ACCEPTED CASES FOR TODAY            
//* TO BE SENT AS ALERT EMAIL IN STEP08                                         
//* STAT=D:                                                                     
//*    K48K-USR-CRM-UPDATED = CURRENT DATE AND                                  
//*    K48K-APPN-DECISION   = 'A'          AND                                  
//*    K48K-BB24-PROMPT     = SPACES                                            
//* EXTRACT FROM BP13.K48K.TLCONTRA.REQ ALL ACCEPTED/REJECTED CASES,            
//* CONTRA TAG WAS CHANGED AND KEY ISSUED REQUESTS THAT CAME FROM               
//* RESALE AND TRANSACTED TODAY TO BE SENT TO BB24 ON STEP09                    
//* STAT=E:                                                                     
//*    K48K-USR-CRM-UPDATED = CURRENT DATE   AND                                
//*    K48K-SOURCE          = 'RESL'         AND                                
//*   (K48K-APPN-DECISION   = 'A'            OR                                 
//*    K48K-APPN-DECISION   = 'R')           AND                                
//*    K48K-BB24-PROMPT     = SPACES                                            
//*              OR                                                             
//*    K48K-DTE-UPDATE-CONTRA = CURRENT DATE AND                                
//*    K48K-CONTRA-STATUS     = 'U'          AND                                
//*    K48K-APPN-DECISION     = 'A'                                             
//*              OR                                                             
//*    K48K-DTE-KEY-ISSUE     = CURRENT DATE                                    
//* SORT BY CASE ELIGIBILTY THEN REGN NUMBER                                    
//*****************************************************************             
//STEP07   EXEC SORT,PARM='DYNALLOC=(,255)',COND=(0,NE)                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K48K.TLCONTRA.REQ,DISP=SHR                               
//SORTOF01 DD DSN=&&STATD,DISP=(,PASS),                                         
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=1200,BLKSIZE=27600)                           
//SORTOF02 DD DSN=&&STATE,DISP=(,PASS),                                         
//            SPACE=(CYL,(10,10),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=1200,BLKSIZE=27600)                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(01,08,A),FORMAT=CH                                               
  OUTFIL FILES=01,                                                              
   INCLUDE=(164,06,ZD,EQ,DATE2P,AND,                                            
            180,01,CH,EQ,C'A',AND,                                              
            196,01,CH,EQ,C' ')                                                  
  OUTFIL FILES=02,                                                              
   INCLUDE=((164,06,ZD,EQ,DATE2P,AND,                                           
            (180,01,CH,EQ,C'A',OR,                                              
             180,01,CH,EQ,C'R'),AND,                                            
             196,01,CH,EQ,C' '),OR,                                             
            (197,06,ZD,EQ,DATE2P,AND,                                           
             206,01,CH,EQ,C'U',AND,                                             
             180,01,CH,EQ,C'A'),OR,                                             
             553,06,ZD,EQ,DATE2P)                                               
/*                                                                              
//*****************************************************************             
//*  CREATE EMAIL ALERT FOR ACCEPTED CASES                                      
//*****************************************************************             
//STEP08   EXEC PGM=BP13C94D,COND=(0,NE)                                        
//BP13F48K DD DSN=&&STATD,DISP=(OLD,DELETE)                                     
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13L94D DD DSN=BP13.L94D.UPDSTATD,DISP=OLD                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*****************************************************************             
//*  CREATE INTERFACING FILE TO BB24                                            
//*****************************************************************             
//STEP09   EXEC PGM=BP13C94E,COND=(0,NE)                                        
//BP13F48K DD DSN=&&STATE,DISP=(OLD,DELETE)                                     
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K480 DD DSN=BP13.K480.CONTRA,DISP=SHR                                     
//BP13F94E DD DSN=BP13.F94E.INTERFC.BB24,DISP=MOD                               
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*****************************************************************             
//*  DAILY BACKUP OF BB24 INTERFACE FILE INTO ACCUM FILE                        
//*****************************************************************             
//STEP09A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F94E.INTERFC.BB24,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.F94E.INTERFC.BB24.ACCUM,DISP=MOD                         
//SYSIN    DD  *                                                                
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                       
//*                                                                             
//*****************************************************************             
//*  CREATE EMAIL ALERT FOR EXCEPTION CASES SENT VIA BB24 INTERFACE             
//*  FILE (ALL STAT = F,G,H,I)                                                  
//*****************************************************************             
//STEP10   EXEC PGM=BP13C94F,COND=(0,NE)                                        
//BP13F94A DD DSN=&&STATF,DISP=(OLD,DELETE)                                     
//BP13L94F DD DSN=BP13.L94F.UPDSTATF,DISP=OLD                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL FOR STEP03                                            
//*-----------------------------------------------------------------            
//STEP11   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L94B.UPDSTATB,DISP=SHR                                   
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL FOR STEP04                                            
//*-----------------------------------------------------------------            
//STEP12   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L94C.UPDSTATC,DISP=SHR                                   
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL FOR STEP07                                            
//*-----------------------------------------------------------------            
//STEP13   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L94D.UPDSTATD,DISP=SHR                                   
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL FOR STEP09                                            
//*-----------------------------------------------------------------            
//STEP14   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L94F.UPDSTATF,DISP=SHR                                   
//*                                                                             
//*****************************************************************             
//*  INITIALIZE BB24 INTERFACE FILE                                             
//*****************************************************************             
//STEP15   EXEC PGM=IDCAMS,COND=(4,LT)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BB24.F007.TLOAN.BP13,DISP=SHR                                 
//SYSIN    DD  *                                                                
    REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                       
//*                                                                             
//*------------------------------------------------------------*                
//*                  END OF BP13D418                                            
//*------------------------------------------------------------*                
