//BP13A560 JOB (BP13P),'BP13A560',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*  1ST JOB FOR 3R, WIS SHORTLISTING PROCEDURE                       *         
//*  OBJECTIVE : TO SORT OUT ALL THE CASES FROM BP13K757 AT MN AND    *         
//*              UPDATE BP13K764 WITH THE TOTAL NO OF APPL +          *         
//*              LAST QUEUE.                                          *         
//*              TO RUN THIS JOB AFTER THE CLOSING OF THE 3R/WIS      *         
//*              TO RUN AT 4.30AM DUE TO UPDATE OF BP13K764           *         
//*              NEXT JOB TO RUN IS BP13A561 - PREPARE FILE FOR S/L   *         
//*===================================================================*         
//* CHG REF  BY  ON       DESCRIPTION                                 *         
//* -------- --- -------- -----------                                 *         
//* BP133030 CKK 260307   FOR 3 ROOM AND WIS                          *         
//* BP139280 YCH2 21112023 EXPAND BP13K757 FROM 3000 TO 4000          *         
//*===================================================================*         
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD  DSN=BP13.K764.SALES,DISP=OLD                                     
//INPUT2   DD  DSN=BP13.K225.QUEUE,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*-------------------------------------------------------------------* 00001330
//* SORT OUT BP13K757 REC THAT ARE UNDER BTO EXERCISE                 * 00001340
//*-------------------------------------------------------------------* 00001350
//STEP01 EXEC SORT,COND=(0,NE)                                          00000150
//SORTIN   DD DSN=BP13.K757.BTO,DISP=SHR                                00000160
//SORTOUT  DD DSN=&&BP13F757,DISP=(,PASS),                              00000180
//         UNIT=SYSDA,DCB=(LRECL=4000,RECFM=FB),                                
//         SPACE=(CYL,(100,50),RLSE)                                            
//SYSIN    DD  *                                                        00000200
   SORT FIELDS=(2918,3,A,1,18,A),FORMAT=CH                                      
//*                                                                             
//*-------------------------------------------------------------------* 00001330
//* SORT OUT BP13K764 REC THAT IS SELECTED FOR SHORTLISTING           * 00001340
//*-------------------------------------------------------------------* 00001350
//STEP02 EXEC SORT,COND=(0,NE)                                          00000150
//SORTIN   DD DSN=BP13.K764.SALES,DISP=SHR                              00000160
//SORTOUT  DD DSN=&&BP13F764,DISP=(,PASS),                              00000180
//         UNIT=SYSDA,DCB=(LRECL=2000,RECFM=FB),                                
//         SPACE=(CYL,(100,50),RLSE)                                            
//SYSIN    DD  *                                                        00000200
   SORT FIELDS=(1,3,A),FORMAT=CH                                                
   INCLUDE COND=(1826,1,CH,EQ,C'Y')                                             
//*                                                                             
//*--------------------------------------------------------------------*00000820
//* TO UPDATE TOTAL APPLICATION AND LAST QUEUE TO BP13K764             *00000830
//*--------------------------------------------------------------------*00000850
//STEP03 EXEC  PGM=BP13C718,COND=(0,NE)                                 00000860
//BP13F757 DD  DSN=&&BP13F757,DISP=(SHR,DELETE)                         00000890
//BP13F764 DD  DSN=&&BP13F764,DISP=(SHR,PASS)                           00000890
//BP13K764 DD  DSN=BP13.K764.SALES,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSDBG   DD  SYSOUT=*                                                 00001000
//SYSDBOUT DD  SYSOUT=*                                                 00001010
//SYSOUT   DD  SYSOUT=*                                                 00001020
//SYSPRINT DD  SYSOUT=*                                                 00001020
//*                                                                             
//*-------------------------------------------------------------------* 00001330
//* SORT OUT BP13K764 REC THAT IS SELECTED FOR SHORTLISTING           * 00001340
//*-------------------------------------------------------------------* 00001350
//STEP04 EXEC SORT,COND=(0,NE)                                          00000150
//SORTIN   DD DSN=BP13.K764.SALES,DISP=SHR                              00000160
//SORTOUT  DD DSN=&&P13F764A,DISP=(,PASS),                              00000180
//         UNIT=SYSDA,DCB=(LRECL=2000,RECFM=FB),                                
//         SPACE=(CYL,(100,50),RLSE)                                            
//SYSIN    DD  *                                                        00000200
   SORT FIELDS=(1,3,A),FORMAT=CH                                                
   INCLUDE COND=(1826,1,CH,EQ,C'Y')                                             
//*                                                                             
//*--------------------------------------------------------------------         
//* DEFINE BP13.K764.TEMP                                                       
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&P13F764A,DISP=(SHR,PASS)                                    
//SYSIN    DD *                                                                 
         DEL 'BP13.K764.TEMP' CLUSTER PURGE                                     
         DEF CL (NAME(BP13.K764.TEMP)      -                                    
                 TRK(3 2)                        -                              
                 UNIQUE                          -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K764.TEMP.DATA) -                                   
                 KEYS(3 0)                       -                              
                 RECSZ(2000 2000)                  -                            
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K764.TEMP)                                            
//*--------------------------------------------------------------------*00000820
//* TO CREATE BP13K225 - BOOKING APPOINTMENT FILE                      *00000830
//*--------------------------------------------------------------------*00000850
//STEP06  EXEC PGM=BP13C509,COND=(0,NE)                                         
//BP13K223  DD DSN=BP13.K223.APPMT,DISP=SHR                                     
//BP13K764  DD DSN=BP13.K764.TEMP,DISP=SHR                                      
//BP13K225  DD DSN=BP13.K225.QUEUE,DISP=OLD                                     
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC WTOG,COND=(0,NE)                                                
   ----> ############################################                           
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13A560                             
   ---->    PLEASE OPEN BP13K764.                                               
   ----> ############################################                           
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
