//BP13D124 JOB (BP13P),'BP13D124',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* FETCH DATA FROM GRANT TABLE                                                 
//*=================================================================            
//* BP138048 SRG1 28112019 - NEW JOB                                            
//* BP13XXXX SRG1 23122019 - CATER FOR FTP THE ZIP FILE.                        
//*=================================================================            
//*                                                                             
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13GRNT DD  DSN=BP13.GRANT.DTLS,DISP=OLD                                     
//BP13GERR DD  DSN=BP13.GRANT.ERR.DTLS,DISP=OLD                                 
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CB3J) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*--------------------------------------------------------------------*        
//* STEP 02 : DEL ZIP FILE                                                      
//*--------------------------------------------------------------------*        
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL BP13.GRANT.DTLS.ZIP                                                    
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*--------------------------------------------------------------------*        
//*                                                                             
//STEP03 EXEC SAS,COND=(0,NE)                                                   
//BP13FTP DD DSN=BP13.FTPPUT.GRANT.DTLS,DISP=(NEW,CATLG),                       
//      AVGREC=K,SPACE=(1,(5,50),RLSE),                                         
//      LRECL=100,BLKSIZE=0,RECFM=FB,DSORG=PS                                   
//BP13ZIP DD DSN=BP13.ZIPINP.GRANT.DTLS,DISP=(NEW,CATLG),                       
//      AVGREC=K,SPACE=(1,(5,50),RLSE),                                         
//      LRECL=102,BLKSIZE=0,RECFM=FB,DSORG=PS                                   
//SYSOUT DD SYSOUT=*                                                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  %GLOBAL CCYYMMDD;                                                             
                                                                                
  DATA _NULL_;                                                                  
    LENGTH ODD $2.;                                                             
    LENGTH OMM $2.;                                                             
    LENGTH OYY $4.;                                                             
    LENGTH OHH $2.;                                                             
    LENGTH ONN $2.;                                                             
    LENGTH OSS $2.;                                                             
    CUT_DTE = TODAY();                                                          
    CUR_TME = TIME();                                                           
    ODD = DAY(CUT_DTE);                                                         
    OMM = MONTH(CUT_DATE);                                                      
    OYY = YEAR(CUT_DATE);                                                       
    OHH = HOUR(CUR_TME);                                                        
    ONN = MINUTE(CUR_TME);                                                      
    OSS = SECOND(CUR_TME);                                                      
    DTE_CURR = OYY¦¦OMM¦¦ODD¦¦OHH¦¦ONN¦¦OSS;                                    
    DTE_CURR = TRANSLATE(DTE_CUR,'0',' ');                                      
                                                                                
    STDZIP00 = "-ARCHIVE(BP13.GRANT.DTLS.ZIP)";                                 
    STDZIP01 = "-ARCHVOL(DUMMY)";                                               
    STDZIP02 = "-METHOD(FAST)";                                                 
  STDZIP03 = "ZIPPED_DSN(BP13.GRANT.DTLS,hdb_grant_details_report.dat)";        
    STDZIP06 = "-FILE_TERMINATOR()";                                            
    STDZIP07 = "   BP13.GRANT.DTLS";                                            
                                                                                
    STDPUT00 = "CD /PROD/APPN/DATA/BP13/FROM-HDB/DOS/GRANT";                    
    STDPUT01 = "DIR";                                                           
    STDPUT02 = "BINARY";                                                        
    STDPUT03 = "PUT 'BP13.GRANT.DTLS.ZIP' + ";                                  
    STDPUT04 = "hdb_grant_details_report_";                                     
    STDPUT06 = ".txt";                                                          
    STDPUT07 = ".zip";                                                          
                                                                                
    STDPUT05 = STDPUT04¦¦DTE_CURR¦¦STDPUT06¦¦STDPUT07;                          
    STDZIP04 = STDZIP03¦¦STDPUT04¦¦'-';                                         
    STDZIP05 = DTE_CURR¦¦STDPUT06¦¦')';                                         
    STDPUT08 = "LS";                                                            
    STDPUT09 = "QUIT";                                                          
                                                                                
    FILE BP13ZIP;                                                               
         PUT STDZIP00;                                                          
         PUT STDZIP01;                                                          
         PUT STDZIP02;                                                          
         PUT STDZIP04;                                                          
         PUT STDZIP05;                                                          
         PUT STDZIP06;                                                          
         PUT STDZIP07;                                                          
                                                                                
    FILE BP13FTP;                                                               
         PUT STDPUT00;                                                          
         PUT STDPUT01;                                                          
         PUT STDPUT02;                                                          
         PUT STDPUT03;                                                          
         PUT STDPUT05;                                                          
         PUT STDPUT08;                                                          
         PUT STDPUT09;                                                          
//*--------------------------------------------------------------------*        
//* STEP 03 : COMPRESS FILE                                                     
//*--------------------------------------------------------------------*        
//STEP04   EXEC PKZIP,COND=(0,NE)                                               
//SYSIN DD DSN=BP13.ZIPINP.GRANT.DTLS,DISP=SHR                                  
//*--------------------------------------------------------------------*        
//* STEP 05 : FTP COMPRESSED FILE TO SGNETSTAGE SERVER                          
//*           PATH --> E:\FTP\PROD\APPN\DATA\BP13\FROM-HDB\DOS\GRANT            
//*--------------------------------------------------------------------*        
//STEP05   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.FTPPUT.GRANT.DTLS,DISP=SHR                               
//*                                                                             
