//BP13A504 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*---------------------------------------------------------------------        
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* -------------------------------------------------------------------         
//* BP133017 LSB 100407 - SIMILAR TO BP13A507 FOR WIS BACKUP                    
//* BP133056 CKK 040607 - INCLUDE BP13C192                                      
//* BP133561 IL5 060509 - INCLUDE STEPS TO BACKUP AND CLEAR                     
//*                       BP13.F740.MATUREBA.ATTEMPT                            
//* BP133648 IL5 200709 - TO CHANGE BACKUP PROCEDURE TO BP13K828                
//* BP133643 IL5 170909 - TO KEEP ALL OCCUPIERS IN BP13K828                     
//*---------------------------------------------------------------------        
//*  UPDATE BALLOT INFORMATION TO BALLOT HISTORY FILE,                          
//*  BACKUP BALLOT FILES TO CARTRIDGE                                           
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K595.BALLOT.LOG,DISP=OLD                                 
//INPUT2   DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K828.HISTOCCP,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//*---------------------------------------------------------------------        
//*  REPRO QUARTERLY BALLOT FILE TO CARTRIDGE - 40 GDG                          
//*  NOTE : OCCUPER RECORD WAS BACKUP TO                                        
//*         BP13.F558.SOCOCCP.ADHOC - BEFORE JAN 95, LREC = 150                 
//*         BP13.F825.REQOCCP.ADHOC - AFTER  JAN 95, LREC = 200                 
//*  -----:                                                                     
//*  NOTE : HISTORY OCCUPER RECORD WAS BACKUP TO                                
//*         BP13.F552.HISTOCCP.ADHOC - BEFORE JAN 95, LREC = 150                
//*         (INCLUDE 4 HA'S + OOCUPIERS FOR THE PREVIOUS QTR)                   
//*         BP13.F828.HISTOCCP.ADHOC - AFTER  JAN 95, LREC = 200                
//*         (INCLUDE ONLY 4 HA'S , NO OCCUPIER)                                 
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F520.BALLOT.ADHOC(+1),DISP=(NEW,PASS),                   
//            UNIT=CART,LABEL=(1,SL),                                           
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT2   DD DSN=BP13.F510.RANDOM,DISP=SHR                                     
//OUTPUT2  DD DSN=BP13.F510.RANDOM.ADHOC(+1),DISP=(NEW,PASS),                   
//            UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT3   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F825.REQOCCP.ADHOC(+1),DISP=(NEW,PASS),                  
//            UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=200,RECFM=FB)                   
//*                                                                             
//INPUT4   DD DSN=BP13.F558.UPGOCCP.MATURENT,DISP=SHR                           
//OUTPUT4  DD DSN=BP13.F558.SOCOCCP.ADHOC(+1),DISP=(NEW,PASS),                  
//            UNIT=CART,LABEL=(4,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)                   
//*                                                                             
//INPUT5   DD DSN=BP13.F740.MATUREBA.ATTEMPT,DISP=SHR                           
//OUTPUT5  DD DSN=BP13.F740.MATUREBA.ATTEMPT.TAPE(+1),DISP=(NEW,PASS),          
//            UNIT=CART,LABEL=(5,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
//*---------------------------------------------------------------------        
//*  CATALOG GDG FOR QUARTERLY CARTRIDGE                                        
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=IEFBR14,COND=(0,NE)                                         
//INPUT1   DD DSN=BP13.F520.BALLOT.ADHOC(+1),DISP=(OLD,CATLG),                  
//            UNIT=(,,DEFER)                                                    
//INPUT2   DD DSN=BP13.F510.RANDOM.ADHOC(+1),DISP=(OLD,CATLG),                  
//            UNIT=(,,DEFER)                                                    
//INPUT3   DD DSN=BP13.F825.REQOCCP.ADHOC(+1),DISP=(OLD,CATLG),                 
//            UNIT=(,,DEFER)                                                    
//INPUT4   DD DSN=BP13.F558.SOCOCCP.ADHOC(+1),DISP=(OLD,CATLG),                 
//            UNIT=(,,DEFER)                                                    
//INPUT5   DD DSN=BP13.F740.MATUREBA.ATTEMPT.TAPE(+1),DISP=(OLD,CATLG),         
//            UNIT=(,,DEFER)                                                    
//*---------------------------------------------------------------------        
//*  REPRO BALLOT HISTORY LOG FILE TO CARTRIDGE                                 
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//OUTPUT5  DD DSN=BP13.F595.LOG(+1),DISP=(NEW,PASS),                            
//            UNIT=CART,LABEL=(1,SL),                                           
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
//*---------------------------------------------------------------------        
//*  CATALOG GDG FOR HISTORY FILE                                               
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IEFBR14,COND=(0,NE)                                         
//INPUT5   DD DSN=BP13.F595.LOG(+1),DISP=(OLD,CATLG),                           
//            UNIT=(,,DEFER)                                                    
//*---------------------------------------------------------------------        
//*   REPRO MATURE REQUEST BACKUP                                               
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F730.MATURERQ(+1),DISP=(NEW,CATLG),                      
//            SPACE=(CYL,(48,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* SORT BALLOT FILE BY REG-NO ORDER                                            
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F500,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(33,8,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SORT BALLOT FILE BY REG-NO ORDER                                            
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F520,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(33,8,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//*  MATCH BALLOT FILE WITH REQUEST FILE FOR LOADING TO HIST FILE               
//*  FOR MATCHED CASES, OUTPUT THE REC TO HISTORY FILE BP13F595                 
//*  FOR UNMATCHED CASES, OUTPUT THE REC BACK TO REQUEST FILE                   
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C546,COND=(0,NE)                                        
//BP13F520 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//BP13F595 DD DSN=BP13.F595.BALLOT.LOG,DISP=SHR                                 
//BP13F510 DD DSN=BP13.F500.NT,DISP=OLD                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*  REPRO BALLOT HISTORY LOG FILE TO TEMP FILE                                 
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT6   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//OUTPUT6  DD DSN=&&BP13F595,DISP=(,PASS),                                      
//            UNIT=(SYSDA,2),SPACE=(CYL,(320,20),RLSE),                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
//*---------------------------------------------------------------------        
//*  MERGE THE 2  HISTORY LOG FILE FOR THE NEXT STEP                            
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.BALLOT.LOG,DISP=SHR                                 
//         DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F595HIST,DISP=(,PASS),                                      
//            UNIT=(SYSDA,2),SPACE=(CYL,(320,20),RLSE),                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(476,25,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//*- DEFINE BALLOT HISTORY LOG FILE                                             
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&F595HIST,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEL    (BP13.K595.BALLOT.LOG) CLUSTER PURGE                            
         DEF CL (NAME(BP13.K595.BALLOT.LOG)            -                        
                 CYL(150 30)                           -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K595.BALLOT.LOG.DATA)      -                        
                 KEYS(25 475)                          -                        
                 RECSZ(500 500)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K595.BALLOT.LOG)                                      
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BALLOT.LOG.ALTX1)   -                        
               REL(BP13.K595.BALLOT.LOG)               -                        
               CYL(30 15)                              -                        
              UNIQUE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BALLOT.LOG.ALTX1.DATA)  -                        
               KEYS(9 40)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BALLOT.LOG.PATH1)   -                        
               PENT(BP13.K595.BALLOT.LOG.ALTX1))                                
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BALLOT.LOG)               -                        
               ODS(BP13.K595.BALLOT.LOG.ALTX1)                                  
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BALLOT.LOG.ALTX2)   -                        
               REL(BP13.K595.BALLOT.LOG)               -                        
               CYL(20 10)                              -                        
              UNIQUE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BALLOT.LOG.ALTX2.DATA)  -                        
               KEYS(9 81)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BALLOT.LOG.PATH2)   -                        
               PENT(BP13.K595.BALLOT.LOG.ALTX2))                                
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BALLOT.LOG)               -                        
               ODS(BP13.K595.BALLOT.LOG.ALTX2)                                  
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BALLOT.LOG.ALTX3)   -                        
               REL(BP13.K595.BALLOT.LOG)               -                        
               CYL(20 10)                              -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BALLOT.LOG.ALTX3.DATA) -                         
               KEYS(9 49)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BALLOT.LOG.PATH3)   -                        
               PENT(BP13.K595.BALLOT.LOG.ALTX3))                                
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BALLOT.LOG)               -                        
               ODS(BP13.K595.BALLOT.LOG.ALTX3)                                  
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BALLOT.LOG.ALTX4)   -                        
               REL(BP13.K595.BALLOT.LOG)               -                        
               CYL(20 10)                              -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BALLOT.LOG.ALTX4.DATA) -                         
               KEYS(9 58)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BALLOT.LOG.PATH4)   -                        
               PENT(BP13.K595.BALLOT.LOG.ALTX4))                                
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BALLOT.LOG)               -                        
               ODS(BP13.K595.BALLOT.LOG.ALTX4)                                  
//*---------------------------------------------------------------------        
//*  REPRO HISTORY OCCUPIER FILE TO CARTRIDGE - 2 GDG                           
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT4   DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT4  DD DSN=BP13.F828.HISTOCCP.QTR(+1),DISP=(NEW,PASS),                   
//            UNIT=CART,                                                        
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=200,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
//*---------------------------------------------------------------------        
//*  CATALOG GDG - HISTORY OCCUP FILE                                           
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=IEFBR14,COND=(0,NE)                                         
//INPUT4   DD DSN=BP13.F828.HISTOCCP.QTR(+1),DISP=(OLD,CATLG),                  
//            UNIT=(,,DEFER)                                                    
//*---------------------------------------------------------------------        
//*  OUTREC ALL THE HA'S - HA1 REF AND NRIC NUMBER                              
//*---------------------------------------------------------------------        
//STEP15 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//            AMP=('BUFND=23')                                                  
//SORTOUT   DD DSN=&&F740,DISP=(NEW,PASS),                                      
//             UNIT=(SYSDA),                                                    
//             DCB=(BLKSIZE=24600,LRECL=20,RECFM=FB),                           
//             SPACE=(CYL,(50,10),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(41,9,A),FORMAT=CH,FILSZ=E50000                                  
   OUTREC FIELDS=(123,6,41,9,5X)                                                
//*---------------------------------------------------------------------        
//*  OUTREC ALL THE HA'S - HA2 REF AND NRIC NUMBER                              
//*---------------------------------------------------------------------        
//STEP16 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//            AMP=('BUFND=23')                                                  
//SORTOUT   DD DSN=&&F740,DISP=(MOD,PASS),                                      
//             UNIT=(SYSDA),                                                    
//             DCB=(BLKSIZE=24600,LRECL=20,RECFM=FB),                           
//             SPACE=(CYL,(50,10),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(82,9,A),FORMAT=CH,FILSZ=E50000                                  
   OUTREC FIELDS=(123,6,82,9,5X)                                                
   OMIT COND=(82,1,CH,EQ,C' ',OR,82,1,CH,EQ,C'#')                               
//*---------------------------------------------------------------------        
//*  OUTREC ALL THE HA'S - HA3 REF AND NRIC NUMBER                              
//*---------------------------------------------------------------------        
//STEP17 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//            AMP=('BUFND=23')                                                  
//SORTOUT   DD DSN=&&F740,DISP=(MOD,PASS),                                      
//             UNIT=(SYSDA),                                                    
//             DCB=(BLKSIZE=24600,LRECL=20,RECFM=FB),                           
//             SPACE=(CYL,(50,10),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(50,9,A),FORMAT=CH,FILSZ=E50000                                  
   OUTREC FIELDS=(123,6,50,9,5X)                                                
   OMIT COND=(50,1,CH,EQ,C' ',OR,50,1,CH,EQ,C'#')                               
//*---------------------------------------------------------------------        
//*  OUTREC ALL THE HA'S - HA4 REF AND NRIC NUMBER                              
//*---------------------------------------------------------------------        
//STEP18 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//            AMP=('BUFND=23')                                                  
//SORTOUT   DD DSN=&&F740,DISP=(MOD,PASS),                                      
//             UNIT=(SYSDA),                                                    
//             DCB=(BLKSIZE=24600,LRECL=20,RECFM=FB),                           
//             SPACE=(CYL,(50,10),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(59,9,A),FORMAT=CH,FILSZ=E50000                                  
   OUTREC FIELDS=(123,6,59,9,5X)                                                
   OMIT COND=(59,1,CH,EQ,C' ',OR,59,1,CH,EQ,C'#')                               
//*---------------------------------------------------------------------        
//*  SORT ALL HA'S RECORD IN REF AND NRIC SEQUENCE                              
//*---------------------------------------------------------------------        
//STEP19 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=&&F740,DISP=(OLD,PASS)                                       
//SORTOUT   DD DSN=&&BP13F740,DISP=(MOD,PASS),                                  
//             UNIT=(SYSDA),                                                    
//             DCB=(BLKSIZE=24600,LRECL=20,RECFM=FB),                           
//             SPACE=(CYL,(50,10),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(7,9,A),FORMAT=CH,FILSZ=E50000                                   
//*---------------------------------------------------------------------        
//* SORT SOC OCCUPIER FILE INTO SEQUENTIAL FILE                                 
//* IN KEY-FLD ORDER.                                                           
//* SORT ONLY THOSE MATCHED CASES                                               
//*---------------------------------------------------------------------        
//STEP19A  EXEC  PGM=BP13C192,COND=(0,NE)                                       
//BP13F740 DD  DSN=&&BP13F520,DISP=(SHR,PASS)                                   
//BP13K825 DD  DSN=BP13.K825.REQOCCP,DISP=SHR                                   
//BP13F825 DD  DSN=&&F825OUT,DISP=(NEW,PASS),                                   
//             UNIT=(SYSDA,1),                                                  
//             DCB=(BLKSIZE=23400,LRECL=200,RECFM=FB),                          
//             SPACE=(CYL,(50,10),RLSE)                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT SOC OCCUPIER FILE INTO SEQUENTIAL FILE FOR MATURE ESTATE ONLY          
//* KEY-FLD = REF-NO + 2 SPACES/NRIC                                            
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F825OUT,DISP=(SHR,DELETE)                                   
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=23400,LRECL=200,RECFM=FB),                           
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* MATCH REQUEST OCCUPIER FILE TO EXTRACT ONLY HA'S RECORDS                    
//*---------------------------------------------------------------------        
//*STEP21   EXEC PGM=BP13C550,COND=(0,NE)                                       
//*BP13INP  DD DSN=&&BP13F740,DISP=(OLD,PASS)                                   
//*BP13F825 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                   
//*BP13OUT  DD DSN=&&F825OCCP,DISP=(NEW,PASS),                                  
//*            UNIT=(SYSDA,1),                                                  
//*            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                              
//*            SPACE=(CYL,(50,10),RLSE)                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* OUTREC HISTORY OCCUPIER FILE INTO SEQUENTIAL FILE                           
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F828,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=23400,LRECL=200,RECFM=FB),                           
//            SPACE=(CYL,(250,20),RLSE)                                         
//SYSIN   DD *                                                                  
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* MERGE SORT CURRENT K825.REQOCCP DATA WITH HISTORY OCCUPIER DATA             
//*---------------------------------------------------------------------        
//*STEP23   EXEC PGM=BP13C549,COND=(0,NE)                                       
//*BP13F825 DD DSN=&&F825OCCP,DISP=(OLD,PASS)                                   
//*BP13F828 DD DSN=&&BP13F828,DISP=(OLD,DELETE)                                 
//*P13F825O DD DSN=&&F825HIST,DISP=(NEW,PASS),                                  
//*            UNIT=(SYSDA,1),                                                  
//*            DCB=(BLKSIZE=23400,LRECL=200,RECFM=FB),                          
//*            SPACE=(CYL,(200,10),RLSE)                                        
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* MERGE SORT CURRENT K825.REQOCCP DATA WITH PREVIOUS QTR F825.REQOCCP         
//* RESULT WILL BE DATA FOR HISTOCCP FOR NEXT QTR                               
//*---------------------------------------------------------------------        
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F828,DISP=(OLD,DELETE)                                  
//         DD DSN=&&BP13F825,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&HISTORY,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=23400,LRECL=200,RECFM=FB),                           
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN   DD *                                                                  
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
     SUM FIELDS=NONE                                                            
//*---------------------------------------------------------------------        
//* DEFINE SOC OCCUP FILE BP13K828 FOR HISTORY REFERENCE IN NEXT QTR            
//*---------------------------------------------------------------------        
//STEP25   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&HISTORY,DISP=(OLD,DELETE)                                   
//SYSIN    DD *                                                                 
  DEL (BP13.K828.HISTOCCP) CLUSTER PURGE                                        
  DEF CLUSTER                                          -                        
        (NAME(BP13.K828.HISTOCCP)                      -                        
        SHR(2,3)                                       -                        
        KEYS(17 0)                                     -                        
        CYL(200 20)                                    -                        
        RECSZ(200 200)                                 -                        
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        FREESPACE(30 30)                               -                        
        CISZ(4096)                                     -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K828.HISTOCCP.DATA))                -                        
      INDEX                                            -                        
        (NAME(BP13.K828.HISTOCCP.INDEX))                                        
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K828.HISTOCCP)                                           
      IF MAXCC = 0 THEN                                -                        
        DEF AIX (NAME(BP13.K828.HISTOCCP.ALTX1)        -                        
            REL(BP13.K828.HISTOCCP)                    -                        
            CYL(10 5)                                  -                        
              UNIQUE                                   -                        
            SHR(2 3))                                  -                        
            DATA                                       -                        
            (NAME(BP13.K828.HISTOCCP.ALTX1.DATA)       -                        
            KEYS(9 8)                                  -                        
            CISZ(4096)                                 -                        
            RECSZ(100 500)                              -                       
            NUNQK)                                                              
      IF MAXCC = 0 THEN                                -                        
        DEF PATH(NAME(BP13.K828.HISTOCCP.PATH1)        -                        
            PENT(BP13.K828.HISTOCCP.ALTX1))                                     
      IF MAXCC = 0 THEN                                -                        
        BIX IDS(BP13.K828.HISTOCCP)                    -                        
            ODS(BP13.K828.HISTOCCP.ALTX1)                                       
//*---------------------------------------------------------------------        
//* DELETE BP13K825 REQUEST AFTER BALLOTING                                     
//*-------------------------------------------------------------------*         
//STEP26 EXEC PGM=BP13C51C,COND=(0,NE)                                          
//BP13F740 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*   INTIALISE MAH DATA FILE                                                   
//*---------------------------------------------------------------------        
//STEP27   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.ATTEMPT,DISP=OLD                           
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A504                                                                
//*---------------------------------------------------------------------        
