//BP13A502 JOB (BP13P),'BP13A502',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*=================================================================            
//* DBSS                                                                        
//*=================================================================            
//* PRINT INVITATION LETTER TO SUCCESSFUL APPLICANT                             
//* PRINT LETTER TO INFORM UNSUCCESSFUL APPLICANT                               
//*=================================================================            
//* NON-GRO LETTER (100% SUCCESSFUL)                                            
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=13CC5A,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* NON-GRO LETTER (101 - 200% SUCCESSFUL)                                      
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1B CP-1',END;                                      
1$DJDE$ JDE=13CC5B,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1B                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* GRO LETTER (100% SUCCESSFUL)                                                
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1C CP-1',END;                                      
1$DJDE$ JDE=13CC5C,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1C                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* NON-GRO UNSUCCESSFUL                                                        
//*-----------------------------------------------------------------            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1D CP-1',END;                                      
1$DJDE$ JDE=13POT4,JDL=BP13,FORMS=BP13DC,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1D                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* GRO UNSUCCESSFUL                                                            
//*-----------------------------------------------------------------            
//PRT05    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAL1E CP-1',END;                                      
1$DJDE$ JDE=13POT4,JDL=BP13,FORMS=BP13DF,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1E                                     
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//* SORT BY QUEUE NUMBER                                                        
//*-----------------------------------------------------------------            
//SORT01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K200.BKAPPMT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&F200SUCC,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(56,6,A),FORMAT=CH                                              
    INCLUDE COND=(14,1,CH,EQ,C'5')                                              
//*-----------------------------------------------------------------            
//*  PRINT SUCCESSFUL INVITATION                                                
//*-----------------------------------------------------------------            
//STEP02   EXEC  PGM=BP13CC55,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&F200SUCC,DISP=(OLD,DELETE)                                 
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K741 DD  DSN=BP13.K740.MATUREBA.PATH1,DISP=SHR,                           
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFND=8','BUFNI=4')                                        
//P13PC55A DD  SYSOUT=W,OUTPUT=(*.PRT01.FORMID),DEST=IOMW                       
//P13PC55B DD  SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                       
//P13PC55C DD  SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
/*                                                                              
//*=================================================================            
//*  PRINT UNSUCCESSFUL LETTER                                                  
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740NGRO,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(163,2,CH,EQ,C'  ',AND,                                         
                 260,1,CH,EQ,C'U',AND,                                          
                 376,3,CH,EQ,C'DBS')                                            
//*-----------------------------------------------------------------            
//*  PRINT UNSUCCESSFUL (NON-GRO)                                               
//*-----------------------------------------------------------------            
//STEP04   EXEC  PGM=BP13CC56,COND=(0,NE)                                       
//BP13F740 DD  DSN=&&F740NGRO,DISP=(OLD,DELETE)                                 
//BP13K825 DD  DSN=BP13.K825.REQOCCP,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13PC56 DD  SYSOUT=W,OUTPUT=(*.PRT04.FORMID),DEST=IOMW                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
/*                                                                              
//*------------------------------------------------------------------           
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740GRO,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(163,2,CH,NE,C'  ',AND,                                         
                 260,1,CH,EQ,C'U',AND,                                          
                 376,3,CH,EQ,C'DBS')                                            
//*-----------------------------------------------------------------            
//*  PRINT UNSUCCESSFUL (GRO)                                                   
//*-----------------------------------------------------------------            
//STEP04   EXEC  PGM=BP13CC56,COND=(0,NE)                                       
//BP13F740 DD  DSN=&&F740GRO,DISP=(OLD,DELETE)                                  
//BP13K825 DD  DSN=BP13.K825.REQOCCP,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K830 DD  DSN=BP13.K830.ADDR,                                              
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,                                        
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13PC56 DD  SYSOUT=W,OUTPUT=(*.PRT05.FORMID),DEST=IOMW                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
/*                                                                              
