//BP13A62A JOB (BP13P),'BP13A62A',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB09213
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* KEEP BP13F762 BTO DATA IN BP13K76A                                          
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP136299 LSB 170518 - ADD BP13K76A FOR BOOKING DASHBOARD                    
//* BP138215 AM2 030320 - UPDATE SORT FIELDS DUE TO BP13K76A CHANGES            
//**************************************************************                
//*--------------------------------------------------------------------         
//* VERIFY FILES BEFORE PRODUCTION RUN                                          
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K76A.SALEHIST,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------- 00000050
//* BACKUP SALES SUMMARY DATA                                                   
//*-------------------------------------------------------------------- 00000050
//STEP01   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K762.BTO.DEMAND,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.F762.BTO.DEMAND.BKUP(+1),DISP=(NEW,CATLG),               
//         SPACE=(CYL,(10,10),RLSE),                                    00035300
//         DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)                       00035400
//INPUT2   DD DSN=BP13.K76A.SALEHIST,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F76A.SALEHIST.BKUP(+1),DISP=(NEW,CATLG),                 
//         SPACE=(CYL,(10,10),RLSE),                                    00035300
//         DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                       00035400
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT1) OFILE(OUTPUT1)                                        
      REPRO IFILE(INPUT2) OFILE(OUTPUT2)                                        
//*-------------------------------------------------------------------* 00035800
//* SORT BP13F762, BTO                                                  00035900
//*-------------------------------------------------------------------* 00036000
//STEP02   EXEC SORT,COND=(0,NE)                                        00036100
//SORTIN  DD DSN=BP13.K762.BTO.DEMAND,DISP=SHR                          00036200
//SORTOUT DD DSN=&&BP13F762,DISP=(,PASS),                               00036300
//      SPACE=(CYL,(10,10),RLSE),                                       00036400
//      DCB=(RECFM=FB,LRECL=200,BLKSIZE=27800)                          00036500
//SYSIN   DD  *                                                         00036600
    SORT FIELDS=(61,3,A,16,6,A,1,5,A),FORMAT=CH                         00036700
//*-------------------------------------------------------------------- 00000050
//* CREATE BP13K76A FROM BP13F762                                       00000050
//*-------------------------------------------------------------------- 00000050
//STEP03   EXEC PGM=BP13C92I,COND=(0,NE)                                00002680
//BP13F762 DD DSN=&&BP13F762,DISP=(OLD,PASS)                            00002710
//BP13K76A DD DSN=BP13.K76A.SALEHIST,DISP=OLD,                          00002710
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
//*-------------------------------------------------------------------- 00000050
//* GET BALLOT FILE                                                             
//*-------------------------------------------------------------------- 00000050
//STEP04   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//OUTPUT1  DD DSN=&&BP13K740,DISP=(NEW,PASS),                                   
//         SPACE=(CYL,(150,50),RLSE),                                   00035300
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                       00035400
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT1) OFILE(OUTPUT1)                                        
//*---------------------------------------------------------------------        
//* UPDATE BALLOTED AND CANCEL APPLICATION COUNT TO BP13K76A                    
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13K740,DISP=(OLD,PASS)                                    
//         DD DSN=BP13.F740.MATUREBA.CANCEL,DISP=SHR                            
//SORTOUT  DD DSN=&&F730C92G,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(150,30),RLSE)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(187,3,A,211,2,A,376,3,A,334,6,A,123,8,A),FORMAT=CH               
  OMIT COND=(28,1,CH,EQ,C'M',OR,28,1,CH,EQ,C'G')                                
//*-------------------------------------------------------------------- 00000050
//* UPDATE BALLOTED AND CANCEL APPLICATION COUNT TO BP13K76A                    
//*-------------------------------------------------------------------- 00000050
//STEP06   EXEC PGM=BP13C92G,COND=(0,NE)                                00002680
//BP13F730 DD DSN=&&F730C92G,DISP=(OLD,PASS)                            00002710
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                          00002710
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K76A DD DSN=BP13.K76A.SALEHIST,DISP=OLD,                          00002710
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSOUT   DD SYSOUT=*                                                  00002880
//SYSPRINT DD SYSOUT=*                                                  00002890
//SYSDBG   DD SYSOUT=*                                                  00001760
//SYSDBOUT DD SYSOUT=*                                                  00001770
/*                                                                      00000050
