//BP13D506 JOB (BP13P),'BP13D506',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//*THIS JCL DETERMINES THE NUMBER OF BALLOT CHANCES AN APPLICANT                
//*IS GIVEN.  ONLY FOR APPLICATIONS RECEIVED FOR BE/BTO                         
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP133177 IL5 071107 - NEW (SIMILAR TO A601)                                 
//* BP133226 IL5 071221 - RE-DETERMINE UNSUCC COUNTS FOR LETTERS                
//* BP133248 IL5 080510 - ADD P13LB18 TO BP13CB18                               
//* BP133305 IL5 060608 - TO CHANGE BP13.K310.TRANS TO                          
//*                       BP13.F310.TRANS                                       
//* BP133440 IL5 271208 - TO ADD PROGRAM BP13CH14 TO DETERMINE                  
//*                       BALLOT HOUSEHOLD                                      
//* BP133610 ESA1030609 - TO REPLACE BP13K767 WITH BP13K816                     
//* BP133721 IL5 290909 - TO ADD NEW ALLO CAT 'SBF'                             
//* BP133810 IL5 210110 - ENANCE STEP04                                         
//* BP134036 IL5 121010 - UPDATE INPUT DD FOR BP13CH14                          
//* BP133847 ZDD 190311 - INCLUDE BP13K825 ON BP13CH14                          
//* BP134145 IL5 310311 - CEASE PRINT FOR P13LH14A                              
//* BP134930 SMR 310513 - TRANSFER CF72/CF73/CF74/CF7A/CF7B FROM AMCS           
//* BP134996 SMR 090713 - NEW REPORT FOR PPS PREGNANT IN BP13CF73               
//* BP135059 LSB 190913 - NEW REPORT FOR GEN3 AND STEP-UP GRANT                 
//* BP135144 LSB 251113 - INCLUDE NEW PROGRAM BP13CF97                          
//* BP135148 SMR 021213 - PRINT DAILY REPORTS OF PPS AND GEN3                   
//* BP135254 IL5 180314 - REPLACE BP13.K558.BP13DPRE.A50D WITH                  
//*                       BP13.K558.BP13DPRE IN STEP21                          
//* BP135254 SMR 210414 - TO REPLACE BP13K816 WITH BP13K813                     
//* BP135340 SMR 060514 - TRANSFER BP13CD83 TO BP13A512                         
//* BP135748 IL5 280515 - SORT REGN BEGINNING WITH '31' FROM BP13KB00           
//* BP136630 IL5 020217 - PRINT REPORT LH14A TO CLASS 2                         
//* BP136630 IL5 080217 - STOP PRINTING LH14A TO CLASS 2                        
//* BP136852 SMR 230617 - INCLUDE SALES-MODE = 'ROF'                            
//* BP137208 YCH2120218 - INCLUDE BP17F100 IN STEP13                            
//* BP138164 AM25160120 - NEW OUTPUT FILE P13FH14A FOR BP13CH14                 
//* BP137896 LSB 050220 - UPDATE ALLOC-SCH=TPS                                  
//* BP138285 AM25050520 - HARDCOPY REPORTS CONVERSION                           
//*              050620 - REMOVE DJDE STEPS                                     
//* BP138591 AM25020221 - CHANGE DUMMY TO NEW DSN IN P13FH14A                   
//* BP138591 LSB 030221 - TPS ADD BP13F730                                      
//* BP138623 AM25050721 - BYPASS FT 1F FOR TPS/PPS DETERMINATION                
//* BP139290 KR13100522 - CZ3H - ADD K813                                       
//* BP139673 AM25050623 - CZ3H REPORT CONVERSION                                
//*          AM25150923 - CATER FOR HFE SUBMISSION DATE                         
//* BP139780 AM25221123 - CZ3H - REMOVE K813                                    
//*          AM25301123 - CATER FOR PPS TAG 'F'                                 
//**************************************************************                
//*-----------------------------------------------------------------            
//* SORT REC FOR DUAL APPLICATION LETTER                                        
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS.DAILY,DISP=SHR                                
//SORTOUT  DD DSN=&&F730A,DISP=(NEW,PASS),                                      
//            DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                       
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(9,2,CH,EQ,C'S6',OR,9,2,CH,EQ,C'S8',OR,9,2,CH,EQ,C'S9',         
                 OR,9,2,CH,EQ,C'B6',OR,9,2,CH,EQ,C'B8',OR,                      
                 9,2,CH,EQ,C'B9')                                               
   OUTREC FIELDS=(122X,1,8,245X,127,3,122X)                                     
//*------------------------------------------------------------------           
//* SORT ACCEPTED CASE FROM SOC FILELESS PORTAL                                 
//* SORT ONLY THOSE CASES THAT ARE NOT PRINTED                                  
//* REJECT CASES WOULD BE PRINTED BY STAFF USING ONLINE PANEL - B483            
//*------------------------------------------------------------------           
//STEP01A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KB00.BEBTO,DISP=SHR                                      
//SORTOUT  DD DSN=&&F730B,DISP=(,PASS),                                         
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(20,5),RLSE),DATACLAS=MULTIVOL                         
//SYSIN    DD *                                                                 
   SORT FIELDS=(15,8,A),FORMAT=CH                                               
   INCLUDE COND=((4,3,CH,EQ,C'ACC',AND,                                         
                 74,1,CH,NE,C'Y'),AND,                                          
                (1,3,CH,EQ,C'BTO',OR,1,3,CH,EQ,C'SBF',OR,                       
                 1,3,CH,EQ,C'ROF'),AND,15,1,CH,GE,C'31')                        
   OUTREC FIELDS=(122X,15,8,370X)                                               
//*--------------------------------------------------------------------         
//* SORT BTO/BE REQUESTS TO SEQUENTIAL FILE                                     
//*---------------------------------------------------------------------        
//STEP01B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&F730C,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),DATACLAS=MULTIVOL,             
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(376,3,CH,EQ,C'BTO',OR,376,3,CH,EQ,C'SBF',OR,                 
                   376,3,CH,EQ,C'ROF')                                          
     SUM FIELDS=NONE                                                            
//*------------------------------------------------------------------           
//* SORT ACCEPTED CASE FROM SOC FILELESS PORTAL                                 
//* SORT ONLY THOSE CASES THAT ARE NOT PRINTED                                  
//* REJECT CASES WOULD BE PRINTED BY STAFF USING ONLINE PANEL - B483            
//*------------------------------------------------------------------           
//STEP01C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730A,DISP=(OLD,DELETE)                                     
//         DD DSN=&&F730B,DISP=(OLD,DELETE)                                     
//         DD DSN=&&F730C,DISP=(OLD,PASS)                                       
//SORTOUT  DD DSN=&&P13F730A,DISP=(,PASS),                                      
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(20,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
//*------------------------------------------------------------------           
//* SORT OUT CASES FROM BP13K730 FILE                                           
//*------------------------------------------------------------------           
//STEP02   EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&P13F730A,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730D,DISP=(,PASS),                                         
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(20,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT ACCEPTED CASE FROM SOC FILELESS PORTAL                                 
//* SORT ONLY THOSE CASES THAT ARE NOT PRINTED                                  
//* REJECT CASES WOULD BE PRINTED BY STAFF USING ONLINE PANEL - B483            
//*------------------------------------------------------------------           
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730D,DISP=(OLD,DELETE)                                     
//SORTOUT  DD DSN=&&F730E,DISP=(,PASS),                                         
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(20,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,2,A,123,8,A),FORMAT=CH                              
   SUM FIELDS=NONE                                                              
//*-------------------------------------------------------------------*         
//* UPDATE BALLOT HOUSEHOLD TO 'G' IF 'H' APPLICATIONS HAVE 2 NON-              
//* SELECTION RECORDS                                                           
//* INPUT - BP13F730 BP13KH10 BP13K816                                          
//* I-O   - BP13K730                                                            
//* OUTPUT - P13F730A P13LH14A                                                  
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=BP13CH14,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730E,DISP=(OLD,DELETE)                                     
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//BP13KH12 DD DSN=BP13.KH12.NOTBKCNT.HISTORY,DISP=SHR,                          
//         AMP=('BUFND=23')                                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//BP13K826 DD DSN=BP13.K825.REQOCCP.PATH1,DISP=SHR,                             
//         AMP=('BUFND=23')                                                     
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//P13F730A DD DSN=&&F730E,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13LH14A DD SYSOUT=*                                                          
//P13FH14A DD DSN=BP13.FH14.BP13D506,DISP=SHR                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* DUPLICATE RECORDS FOR ADDITIONAL RANDOM NUMBERS ASSIGNMENT                  
//* FT MCPS - TOTAL 4 RECORDS                                                   
//* UG MCPS - TOTAL 2 RECORDS                                                   
//* FT PA   - TOTAL 2 RECORDS                                                   
//* UG PA   - TOTAL 1 RECORD                                                    
//*                                                                             
//* FOR APPLICANTS WITH > 4 UNSUCC ATTEMPTS                                     
//* + 4 ATTEMPTS - 1 ADDITIONAL RECORD                                          
//* + 5 ATTEMPTS - 2 ADDITIONAL RECORDS ETC.                                    
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13CB18,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730E,DISP=(OLD,PASS)                                       
//BP13K593 DD DSN=BP13.K593.UNSUCCNT,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13F740 DD DSN=&&P13F730A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//BP13LB18 DD SYSOUT=*                                                          
//P13LB18B DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT OUT FIRST RECORD GENERATED FOR EACH APPLICANT                          
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F730A,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&P13F730B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A,29,2,A),FORMAT=CH                                     
//*-------------------------------------------------------------------*         
//* SELECT LAST RECORD GEN FOR EACH APPL                                        
//*-------------------------------------------------------------------*         
//STEP07   EXEC PGM=BP13CB14,COND=(0,NE)                                        
//BP13F740 DD DSN=&&P13F730B,DISP=(OLD,DELETE)                                  
//P13F740B DD DSN=&&F740LAST,DISP=(,PASS),                                      
//      UNIT=(SYSDA,3),SPACE=(CYL,(48,10),RLSE),                                
//      DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE BALLOT CHANCES INTO BP13K730                                         
//*---------------------------------------------------------------------        
//STEP08   EXEC  PGM=BP13CB19,COND=(0,NE)                                       
//BP13F730 DD  DSN=&&F740LAST,DISP=(OLD,DELETE)                                 
//BP13K730 DD  DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT ACCEPTED CASE FROM SOC FILELESS PORTAL                                 
//* SORT ONLY THOSE CASES THAT FLAT TYP = SP                                    
//*------------------------------------------------------------------           
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730E,DISP=(OLD,DELETE)                                     
//SORTOUT  DD DSN=&&F730SP,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(211,2,CH,EQ,C'SP')                                             
//*-----------------------------------------------------------------            
//* UPDATE NUMBER OF CHANCES FOR BOTH SP AND 4P                                 
//*-----------------------------------------------------------------            
//STEP10 EXEC PGM=BP13CB81,COND=(0,NE)                                          
//BP13F730 DD DSN=&&F730SP,DISP=(OLD,DELETE)                                    
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT OUT BTO/SBF/ROF CASES ONLY AND FT NOT 1F                               
//*------------------------------------------------------------------           
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&F730SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,20),RLSE)                                          
//SYSIN   DD *                                                                  
    SORT FIELDS=(376,3,A,123,8,A),FORMAT=CH                                     
    INCLUDE COND=((376,3,CH,EQ,C'BTO',OR,376,3,CH,EQ,C'SBF',OR,                 
                  376,3,CH,EQ,C'ROF'),AND,211,2,CH,NE,C'1F')                    
//*------------------------------------------------------------------           
//* SORT OUT CASES FROM BP13K730 FILE                                           
//*------------------------------------------------------------------           
//STEP12   EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730SORT,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730CF72,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* REPLACE SALES APPLICATION DATE BY HFE SUBMISSION DATE                       
//* -MATCHED RECORDS   = REPLACED DATE                                          
//* -UNMATCHED RECORDS = ORIGINAL DATE                                          
//*---------------------------------------------------------------------        
//STEP13A  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F730CF72,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=BP13.FECA.HFE,DISP=SHR                                        
//MATCH    DD DSN=&&F73013A1,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//UNMATCH  DD DSN=&&F73013A2,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   JOIN UNPAIRED,F1,F2                                                          
   REFORMAT FIELDS=(?,F1:1,500,F2:21,8)                                         
   OPTION COPY                                                                  
   OUTFILE FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B'),                               
             BUILD=(1:2,260,502,8,270,232)                                      
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),                             
             BUILD=(1:2,500)                                                    
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE BACK ALL RECORDS                                                      
//*---------------------------------------------------------------------        
//STEP13B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F73013A1,DISP=(OLD,DELETE)                                  
//         DD DSN=&&F73013A2,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F73013B,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,123,8,A),FORMAT=CH                                     
//*------------------------------------------------------------------           
//* DETERMINE PPS-ELIG-TAG, GEN3                                                
//*------------------------------------------------------------------           
//STEP13C  EXEC PGM=BP13CF72,COND=(0,NE)                                        
//BP17F100 DD DUMMY                                                             
//BP13F730 DD DSN=&&F73013B,DISP=(OLD,DELETE)                                   
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13F730A DD DSN=BP13.F730.CF72,DISP=OLD                                       
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* GENERATE REPORT FOR PPS-ELIG-TAG = 'Y', 'N', 'P', 'E', 'F'                  
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=BP13CF73,COND=(0,NE)                                        
//BP13F730 DD DSN=BP13.F730.CF72,DISP=SHR                                       
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13LF73A DD DSN=&&P13LF73A,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=132)                                          
//P13LF73B DD DSN=&&P13LF73B,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=132)                                          
//P13LF73C DD DSN=&&P13LF73C,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=132)                                          
//P13LF73D DD DSN=&&P13LF73D,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=132)                                          
//P13LF73E DD DSN=&&P13LF73E,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=132)                                          
//P13LF73F DD DSN=&&P13LF73F,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=132)                                          
//P13LF73G DD DSN=&&P13LF73G,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=132)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT PPS ELIGIBLE REPORT                                                   
//*-----------------------------------------------------------------            
//STEP14A  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LF73A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* PRINT PPS NOT ELIGIBLE REPORT                                               
//*-----------------------------------------------------------------            
//STEP14B  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LF73B,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* PRINT PPS PENDING REPORT                                                    
//*-----------------------------------------------------------------            
//STEP14C  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LF73C,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* PRINT PPS PREGNANT ELIGIBLE REPORT                                          
//*-----------------------------------------------------------------            
//STEP14D  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LF73D,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* PRINT 3GEN ELIGIBLE REPORT                                                  
//*-----------------------------------------------------------------            
//STEP14E  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LF73E,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* PRINT 3GEN PENDING REPORT                                                   
//*-----------------------------------------------------------------            
//STEP14F  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LF73F,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* PRINT FPPS REPORT                                                           
//*-----------------------------------------------------------------            
//STEP14G  EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&P13LF73G,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* BACKUP PPS AND 3GEN REPORTS TO ACCUM FILE                                   
//*-------------------------------------------------------------------*         
//STEP14H  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13LF73A,DISP=(OLD,DELETE)                                  
//INPUT2   DD DSN=&&P13LF73B,DISP=(OLD,DELETE)                                  
//INPUT3   DD DSN=&&P13LF73C,DISP=(OLD,DELETE)                                  
//INPUT4   DD DSN=&&P13LF73D,DISP=(OLD,DELETE)                                  
//INPUT5   DD DSN=&&P13LF73E,DISP=(OLD,DELETE)                                  
//INPUT6   DD DSN=&&P13LF73F,DISP=(OLD,DELETE)                                  
//INPUT7   DD DSN=&&P13LF73G,DISP=(OLD,DELETE)                                  
//OUTPUT1  DD DSN=BP13.P13LF73A.PPSYES,DISP=MOD                                 
//OUTPUT2  DD DSN=BP13.P13LF73B.PPSNO,DISP=MOD                                  
//OUTPUT3  DD DSN=BP13.P13LF73C.PPSPEND,DISP=MOD                                
//OUTPUT4  DD DSN=BP13.P13LF73D.PPSPREG,DISP=MOD                                
//OUTPUT5  DD DSN=BP13.P13LF73E.GEN3YES,DISP=MOD                                
//OUTPUT6  DD DSN=BP13.P13LF73F.GEN3PEND,DISP=MOD                               
//OUTPUT7  DD DSN=BP13.P13LF73G.FPPS,DISP=MOD                                   
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
     REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                     
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                     
     REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                     
     REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                     
     REPRO INFILE(INPUT7)  OUTFILE(OUTPUT7)                                     
//*---------------------------------------------------------------------        
//* UPDATE YOUNGEST-SC-CHILD AND PPS-ELIG-TAG                                   
//*---------------------------------------------------------------------        
//STEP15   EXEC PGM=BP13CF74,COND=(0,NE)                                        
//BP13F730 DD DSN=BP13.F730.CF72,DISP=SHR                                       
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DWP=R REQUEST FOR DIVORCE/SEPARATE/DECEASE-SPOUSE                  
//*------------------------------------------------------------------           
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730DWP,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(10,2),RLSE)                                           
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(471,1,CH,EQ,C'R',AND,                                         
                 (211,1,CH,EQ,C'2',OR,211,1,CH,EQ,C'3'))                        
//*------------------------------------------------------------------           
//* DETERMINE AST-ELIG-TAG, REQUESTED NRIC SHOULD NOT BE FOUND                  
//* SMS/CURR PPOS/RSL/TRF/SLS/MAM/EC                                            
//*-----------------------------------------------------------------            
//STEP17   EXEC PGM=BP13CF7A,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730DWP,DISP=(OLD,PASS)                                     
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR,                                       
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BR10K010 DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BR10K080 DD DSN=BR10.K080.PTEPPTY.HIST,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB13K510 DD DSN=BB13.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB13K500 DD DSN=BB13.K500.HISTORY,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BR05K100 DD DSN=BR05.K100.SLSSOC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BC03K020 DD DSN=BC03.K020.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BC03K010 DD DSN=BC03.K010.CAHIST,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP04K010 DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F73A DD DSN=BP13.F730.DWPELIG,DISP=OLD                                    
//BP13F73B DD DSN=BP13.F730.DWPNOTE,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT AST ELIGH/NOT-ELIG CASES                                               
//*------------------------------------------------------------------           
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DWPELIG,DISP=SHR                                    
//         DD DSN=BP13.F730.DWPNOTE,DISP=SHR                                    
//SORTOUT  DD DSN=&&F730DWTG,DISP=(,PASS),                                      
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                                   
//        SPACE=(CYL,(20,5),RLSE)                                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* REPORT FOR AST-ELIG-TAG = 'Y', 'N', 'P'                                     
//*---------------------------------------------------------------------        
//STEP19   EXEC PGM=BP13CF7B,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730DWTG,DISP=(SHR,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13LF73A DD SYSOUT=*                                                          
//P13LF73B DD SYSOUT=*                                                          
//P13LF73C DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT BTO REQUESTS TO SEQUENTIAL FILE                                        
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&F730CF97,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(376,3,CH,EQ,C'BTO')                                          
//*---------------------------------------------------------------------        
//* REPORT FOR TO CHECK SPOUSE FOUND IN RESALE HISTORY FILE                     
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=BP13CF97,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730CF97,DISP=(SHR,PASS)                                    
//BP13K558 DD DSN=BP13.K558.UPGOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13LF97 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.DPREQ749,DISP=SHR                                   
//         DD DSN=BP13.F716.DPREQ747,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(100,50),RLSE),                                        
//            DCB=(LRECL=350,BLKSIZE=27650,RECFM=FB)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A,115,8,D,123,8,A),FORMAT=CH                                
  SUM FIELDS=NONE                                                               
  OMIT COND=(1,1,CH,EQ,C'5',OR,1,1,CH,EQ,C'6',OR,                               
             75,3,CH,NE,C'003',OR,                                              
             150,3,CH,EQ,C'THS',OR,150,3,CH,EQ,C'INC',OR,                       
             150,3,CH,EQ,C'USW',OR,150,3,CH,EQ,C'DHS')                          
//*------------------------------------------------------------------           
//* OMIT FLAT TYPE 1F                                                           
//*------------------------------------------------------------------           
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730C,DISP=(SHR,DELETE)                                     
//SORTOUT  DD DSN=&&F730CZ3H,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                    
//            SPACE=(CYL,(80,50),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=COPY                                                            
    OMIT COND=(211,2,CH,EQ,C'1F')                                               
//*---------------------------------------------------------------------        
//* REPLACE SALES APPLICATION DATE BY HFE SUBMISSION DATE                       
//* -MATCHED RECORDS   = REPLACED DATE                                          
//* -UNMATCHED RECORDS = ORIGINAL DATE                                          
//*---------------------------------------------------------------------        
//STEP24A  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F730CZ3H,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=BP13.FECA.HFE,DISP=SHR                                        
//MATCH    DD DSN=&&F73024A1,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,50),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//UNMATCH  DD DSN=&&F73024A2,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,50),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   JOIN UNPAIRED,F1,F2                                                          
   REFORMAT FIELDS=(?,F1:1,500,F2:21,8)                                         
   OPTION COPY                                                                  
   OUTFILE FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B'),                               
             BUILD=(1:2,260,502,8,270,232)                                      
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),                             
             BUILD=(1:2,500)                                                    
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE BACK ALL RECORDS                                                      
//*---------------------------------------------------------------------        
//STEP24B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F73024A1,DISP=(OLD,DELETE)                                  
//         DD DSN=&&F73024A2,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F73024B,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,50),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*------------------------------------------------------------------           
//* UPDATE ALLOC-SCH=TPS, AS TENANT > 12 MTHS                                   
//* IF NOT FOUND IN F716, TAG AS INELIG TPS                                     
//*-------------------------------------------------------------------*         
//STEP24C  EXEC PGM=BP13CZ3H,COND=(0,NE)                                        
//BP13F716 DD DSN=&&BP13F716,DISP=(OLD,DELETE)                                  
//BP13F730 DD DSN=&&F73024B,DISP=(OLD,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                          00002710
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR,                                       
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13LZ3H DD DSN=&&BP13LZ3H,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=0),                              
//            SPACE=(CYL,(20,10),RLSE),DATACLAS=MULTIVOL                        
//P13LZ3HA DD DSN=&&P13LZ3HA,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=0),                              
//            SPACE=(CYL,(20,10),RLSE),DATACLAS=MULTIVOL                        
//P13LZ3HB DD DSN=&&P13LZ3HB,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FBA,LRECL=133,BLKSIZE=0),                              
//            SPACE=(CYL,(20,10),RLSE),DATACLAS=MULTIVOL                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* TO OUTPUT CZ3H REPORTS                                                      
//*--------------------------------------------------------------------         
//STEP24D  EXEC PGM=ICETOOL,COND=(0,NE)                                         
//TOOLMSG  DD SYSOUT=*                                                          
//DFSMSG   DD SYSOUT=*                                                          
//IN1      DD DSN=&&BP13LZ3H,DISP=(OLD,DELETE)                                  
//IN2      DD DSN=&&P13LZ3HA,DISP=(OLD,DELETE)                                  
//IN3      DD DSN=&&P13LZ3HB,DISP=(OLD,DELETE)                                  
//OUT1     DD DSN=BP13.LZ3H.TPSINELG,DISP=MOD                                   
//OUT2     DD DSN=BP13.LZ3H.TPSELIG,DISP=MOD                                    
//OUT3     DD DSN=BP13.LZ3H.CHKTPSOK,DISP=MOD                                   
//OUT4     DD SYSOUT=8,DEST=IOM8                                                
//OUT5     DD SYSOUT=8,DEST=IOM8                                                
//OUT6     DD SYSOUT=8,DEST=IOM8                                                
//TOOLIN   DD *                                                                 
  COPY FROM(IN1)  TO(OUT1) USING(CTL1)                                          
  COPY FROM(IN2)  TO(OUT2) USING(CTL1)                                          
  COPY FROM(IN3)  TO(OUT3) USING(CTL1)                                          
  COPY FROM(IN1)  TO(OUT4)                                                      
  COPY FROM(IN2)  TO(OUT5)                                                      
  COPY FROM(IN3)  TO(OUT6)                                                      
/*                                                                              
//CTL1CNTL DD *                                                                 
  OUTREC FIELDS=(2,100)                                                         
/*                                                                              
