//BP13A509 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* CHG REF  BY   DATE      DESCRIPTION                                         
//* -------- ---- --------  -----------                                         
//* BP130871 SSS  20000609  LISTING FOR EAALSS                                  
//* BP132596 PGS 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E            
//* BP134861 EAA1 30042013 EXPAND BP13K010 TO 600                               
//**********************************************************************        
//*    - AFTER PIGEONHOLING, ALLOW UNSUCC PRIORITY CASES TO                     
//*      JOIN PUBLIC SCHEME PIGEONHOLING                                        
//*    - ADJUST PA-MAX-CAT TAKEN OUT BY GRO                                     
//*    - PRINT SUMMARY RESULT ON PRIORITY CASES                                 
//**********************************************************************        
//* STEP 00 - 01 = LASER PRINTER JCL                                            
//* STEP 02      = BACKUP FILE                                                  
//* STEP 03      = ADJUST PA CAT QUOTA TAKEN BY GRO                             
//* STEP 04 - 07 = PRINT SUPPLY REPORT BP13L524 BF PIGEONHOLING                 
//* STEP 08      = ADJUST BALANCE GRO TO PA                                     
//* STEP 09 - 12 = PRINT SUPPLY REPORT BP13L524 AF PIGEONHOLING                 
//* STEP 13 - 14 = OUTPUT UNSUCC PRIORITY/PUBLIC FOR PA                         
//*                PIGEONHOLING                                                 
//* STEP 15      = PRINT REPORT                                                 
//**********************************************************************        
//*      VERIFY FILES BEFORE JOB RUN                                            
//**********************************************************************        
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K520.BALLOT,DISP=OLD                                     
//INPUT3   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//INPUT4   DD DSN=BP13.K720.RESIDENT,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//**************************************************************                
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//**************************************************************                
//STEP00   EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//**************************************************************                
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, WITH DUPLICATE COPIES                                             
//**************************************************************                
//STEP01   EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.GRO.AFTER,DISP=OLD                           
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.GRO.AFTER,DISP=OLD                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-------------------------------------------------------------------          
//* ADJUST MAX-PA-CAT1/CAT2/CAT3 AFTER PIGEONHOLING OF GRO                      
//*--------------------------------------------------------------------         
//STEP03   EXEC PGM=BP13C751,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K0104RMB,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&K0104RMB,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.F713.PIGEON.GRO,DISP=SHR                                 
//BP13L524 DD SYSOUT=2,OUTPUT=(*.STEP01.FORMID)                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* FOR NON-MATURE NT                                                           
//* SORT UNSUCC PRIORITY AND PUBLIC CASES FOR PA PIGEONHOLONG                   
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F520.BALLOT.NHHUPG,DISP=OLD                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ')                                            
//*---------------------------------------------------------------------        
//* FOR MATURE NT                                                               
//* SORT UNSUCC PRIORITY AND PUBLIC CASES FOR PA PIGEONHOLONG                   
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.PA,DISP=OLD                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ')                                            
//*---------------------------------------------------------------------        
//* PRINT SUMMARY OF PRIORITY GROUP BY NHH/UPG                          00010000
//* FOR TOTAL OF SUCC AND UNSUCC                                                
//*-------------------------------------------------------------------          
//STEP10   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//BP13F520 DD DSN=BP13.K520.BALLOT,DISP=SHR                                     
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//FT18F001 DD SYSOUT=2,OUTPUT=(*.STEP00.FORMID)                                 
//FT19F001 DD SYSOUT=2,OUTPUT=(*.STEP00.FORMID)                                 
//FT20F001 DD SYSOUT=2,OUTPUT=(*.STEP00.FORMID)                                 
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S726),DISP=SHR                             
//*---------------------------------------------------------------------        
//* PRINT SUMMARY OF PRIORITY GROUP BY NHH/UPG                          00010000
//* FOR TOTAL OF SUCC AND UNSUCC                                                
//*-------------------------------------------------------------------          
//STEP11   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//BP13F520 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//FT18F001 DD SYSOUT=2,OUTPUT=(*.STEP00.FORMID)                                 
//FT19F001 DD SYSOUT=2,OUTPUT=(*.STEP00.FORMID)                                 
//FT20F001 DD SYSOUT=2,OUTPUT=(*.STEP00.FORMID)                                 
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S726),DISP=SHR                             
