//BP13A512 JOB (BP13P),'BP13A512',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* CHG REF  DATE     BY   DESCRIPTION                                          
//* -------- -------- ---  -----------                                          
//* BP130652 19990824 NOR  EXPAND F520,K740,K740 RECL 300 TO 500                
//* BP130778 19991215 YCH  TO INCLUDE BP13F713.PIGEON.PA                        
//* BP130871 20000609 SSS  LISTING FOR EAALSS                                   
//* BP130897 20000807 AKT  EXPAND F558 RECL FROM 400 TO 600                     
//* BP132283 20021226 ANC1 ADD STEPS TO DETERMINE LOAN TAG & PREM CDE           
//* BP132352 20030625 SK   ADD BP13C145,BP13C144                                
//* BP132384 20030731 ANC1 ADD STEPS TO CAPTURE EXISTING/EX-DP FLATS            
//* BP132432 20031021 MJ16 REMOVE PROCESSING OF NON BANK LOAN CASES             
//* BP132451 20031202 SK   ADD BP13L520 FOR BP13C520                            
//* BP132627 20041130 SSS2 DELETE F542 / K542 DATASETS                          
//* BP132618 20050104 ROM1 READ BP04.K010 INSTEAD OF BP04.F010                  
//* BP132653 20050215 CKK7 INCLUDE BP13C175 REPORTS                             
//* BP132862 20060615 CKK7 INCLUDE BP13K648 IN BP13C528                         
//* BP133244 20080128 LSB1 ADD VERIFY FILE STEP                                 
//* BP133362 20080616 IL5  TO UPLOAD ALL APPLICATIONS TO MASTER                 
//*                        (REMOVE SORT COND IN STEP02)                         
//* BP133549 20090403 IL5  REMOVE STEP TO RE-ASSIGN OIC DURING UPLOAD           
//* BP133527 20090404 YCH2 INCLUDE UPDATE OF RESALE LEVY 'LN' OR 'LNS'          
//* BP133913 20100525 IL5  REMOVE ALL SYSOUT=2                                  
//*          20100611 ZDD  INCLUDE BP13CF11                                     
//* BP134024 20100922 ZDD  INCLUDE BP13K800 ON BP13CF11                         
//*                        INCLUDE BP13K813 ON BP13C528                         
//* BP134205 20110419 ZDD  INCLUDE BP13CF24                                     
//* BP134303 20110725 ZDD  INCLUDE BP13CF35 SAS SCHEME BP13K585/K587            
//* BP134483 20120409 IL5  CATER CHANGES FOR MGPS                               
//* BP134718 20121210 SMR2 INCLUDE BP13CF71 TO UPDATE SALE-BROCHURE-SCPY        
//* BP134718 20130116 SMR2 UPDATE OMIT COND TO INCLUDE GRO + MGPS CASES         
//* BP134782 20130215 SMR2 CALL BP13CF71 TWICE BASED ON PARAMETER               
//* BP134782 20130222 IL5  TO RUN BP13CF11 AFTER BP13CF71                       
//* BP134914 20130530 SMR2 REMOVE BP13CF71 - UPDATE K800-NUM-PPS-QUOTA          
//* BP135211 20140205 SMR2 INCLUDE BP13CF46 TO UPDATE PRIO-SUCC-QUOTA           
//* BP135231 20140215 IL5  REMOVE BP13C175 (REPORTS NOT IN USE ALREADY)         
//*                        REMOVE BP13C532 (OBSOLETE)                           
//*                        ADD COND TO UPDATE NUM-SALE-BROCHURE-SCPY            
//*                        FOR BTO APPS ONLY.  SBF WILL BE SPACES               
//* BP135340 20140506 SMR2 TRANSFER BP13CD83 FROM BP13D506                      
//* BP135369 20140522 SMR2 OMIT APPLICATIONS UNDER FTS SCHEME BEFORE            
//*                        RUNNING PROGRAM BP13CB92                             
//* BP135636 20150327 IL5 UPDATE OMIT COND TO INCLUDE GRO + MGPS CASES          
//* BP135605 20150324 SMR2 SIEVE OUT ALL SINGLE/WIDOWED/DIVORCED/               
//*                        SEPARATED APPLICANTS AND KEEP IN A FILE              
//* BP135886 20150706 IL5 ENHANCE COND TO EXCLUDE GRO + MGPS CASES              
//* BP135921 20151016 LSB ADD UPDATE ELDERLY PREMIUM                            
//* BP136096 20160115 SMR ADD NEW PROGRAM - BP13CD02 FOR PORT CASES             
//* BP137356 20180704 IL5 ADD NEW PROGRAM BP13CB89 AND BP13LF7K FOR             
//*                       DEFERRED INCOME ASSESSMENT                            
//* BP137074 20181115 LSB DETERMINE DEBAR 77 BP13C83A                           
//* BP137841 20190530 AM2 ADD STEPS FOR NEW PROGRAM BP13CD8A                    
//* BP137896 20201023 IL5 REPLACE BP13.K558.UPGOCCP WITH                        
//*                       BP13.K558.BP13DPRE.ACCUM                              
//*                       (ARISING FROM BP13D510 CHANGE FOR BP137994)           
//* BP139062 20220318 IL5 ADD REQUIRED VSAM FILES INTO VERIFY STEP              
//* BP139575 20230731 IL5 REMOVE PROGRAM BP13CF71                               
//*                       SALES HAS INFORMED THAT SALES BROC FIELD IS           
//*                       NO LONGER REQUIRED                                    
//* BP139673 20230915 AM25 CATER FOR HFE SUBMISSION DATE                        
//* BP139744 20231121 AM25 CATER FOR HFE ACCUM INSTEAD OF HFE DAILY             
//*                        ADD BACK STEPS FOR PROGRAM BP13CF71 WITH             
//*                        NEW PARM CODE 'HFE'                                  
//* BP139852 20240103 AM25 ADD BP13CF7O & BP13CF7P FOR BALLOT OVERWRITE         
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT3   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//INPUT4   DD DSN=BP13.K840.APPLHIST,DISP=OLD                                   
//INPUT5   DD DSN=BP13.K648.BANKLOAN,DISP=OLD                                   
//INPUT6   DD DSN=BP13.K022.WISOIC,DISP=OLD                                     
//INPUT7   DD DSN=BP13.K024.WISLAST,DISP=OLD                                    
//INPUT8   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT9   DD DSN=BP13.K585.HARDLUCK,DISP=OLD                                   
//INPUT10  DD DSN=BP13.K587.HARDLUCK.HIST,DISP=OLD                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
          VFY FILE(INPUT10)                                                     
//*-----------------------------------------------------------------            
//*- LOAD BALLOTED RECORD TO SOC MASTER / SOC OCCUP FILE                        
//*- BACKUP SOC MASTER                                                          
//*-----------------------------------------------------------------            
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=13')                                                  
//OUTPUT1  DD DSN=BP13.F800.APPLN,DISP=OLD                                      
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&BP13F740,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=((245,1,CH,EQ,C'P',AND,213,3,CH,NE,C'GRO'),OR,                     
              (245,1,CH,EQ,C'C',AND,213,3,CH,NE,C'GRO'),OR,                     
               213,3,CH,EQ,C'FTS',OR,213,3,CH,EQ,C'STS')                        
//*---------------------------------------------------------------------        
//* TO UPDATE CITIZENSHIP HOUSEHOLD                                             
//*---------------------------------------------------------------------        
//STEP1A   EXEC PGM=BP13CB92,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,DELETE)                                  
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13F500 DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&BP13F740,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=((245,1,CH,EQ,C'P',AND,213,3,CH,NE,C'GRO'),OR,                     
              (245,1,CH,EQ,C'C',AND,213,3,CH,NE,C'GRO'))                        
//*OMIT    COND=(226,3,CH,EQ,C'   ')                                            
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                               
  OUTREC FIELDS=(1,200,200X)                                                    
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C577,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY NRIC SEQUENCE                                                       
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&P13F558B,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27600,LRECL=600,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST, SOC-OCCUPIER FILE                             
//* MATCH NRIC IN SMS FILE, IF MATCH UPDATE AS UPGRADER                         
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=BP13U706,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&P13F558B,DISP=(OLD,PASS)                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=&&P13F558C,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//BP13F559 DD DUMMY                                                             
//BP13L706 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* MATCH NRIC WITH TRANSFER HISTORY ONLY FOR TRF-APPLN-DTE  AFTER              
//* '19970901' OR FOR DIVORCE CASES TRF-APPLN-DATE > 19970709                   
//* AND TRF-SCH-ACC IS NOT THE SAME AS SMS-SCH-ACC                              
//* AS ONE NRIC TRANSFER, ALL FOUR LESSEE WILL BE FOUND IN TRANSFER             
//* BP13.F558.UPGOCCP CONTAINS TRANSFER HISTORY DATA                            
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=BP13C619,COND=(0,NE)                                        
//BB13K510 DD DSN=BB13.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB13K500 DD DSN=BB13.K500.HISTORY,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F558 DD DSN=&&P13F558C,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT IN SCH-ACC-NI ORDER FOR RETRIEVING FLAT TYPE FROM PBF                  
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(101,11,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* FLAT TYPE  IS NOT AVAILABLE IN SMS                                          
//* BASED ON THE SCHEME ACCOUNT FR SMS EXTRACT FLAT TYPE FROM PBF               
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F558 DD DSN=&&F558SORT,DISP=(OLD,PASS)                                    
//BP13OUT  DD DSN=&&F558PBF,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C742) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT BP13F558 IN NRIC ORDER, IF ONE NRIC WITH MULTIPLE SMS REC          
//* PROGRAM WILL SELECT THE BIGGER FLAT TYPE                                    
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558PBF,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F558SMSF,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SELECT THE LEAST PRIORITY IF FOUND TO HAVE MULTIPLE SMS RECORDS             
//* SELECT BIGGER FLAT TYPE, DIRENT PURCHASE OVER OPEN MARKET                   
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13C734,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558SMSF,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558FLAT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT BY NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558FLAT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558RESL,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                            
//* MATCH NRIC IN RESALE FILE, IF MATCH UPDATE AS UPGRADER                      
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13U702,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&F558RESL,DISP=(OLD,PASS)                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//BP13L702 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REQUEST OCCUPIER BY NRIC                                               
//*---------------------------------------------------------------------        
//STEP14A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558NRIC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(9,9,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* SORT DEBARMENT FILE BY PRIMARY KEY                                          
//*---------------------------------------------------------------------        
//STEP14B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&BP04K010,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(1000,150),RLSE),                       
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,44,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//* MATCH SOC OCCUPIER REC WITH DEBARMENT REC FD IN                             
//*---------------------------------------------------------------------        
//STEP15   EXEC PGM=BP13C690,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558NRIC,DISP=(OLD,PASS)                                    
//P04K010  DD DSN=&&BP04K010,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//P13F558B DD DUMMY                                                             
//P13F558C DD DUMMY                                                             
//P13F558D DD DUMMY                                                             
//P13F558E DD DUMMY                                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY REGN NO                                                             
//*-----------------------------------------------------------------            
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558RDB,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
//*=====================================================================        
//* RDB INFO                                                                    
//*=====================================================================        
//*---------------------------------------------------------------------        
//* SPLIT F558 FILE FROM THE OUTPUT OF DETERMINE THE HOUSEHOLD TYPE             
//* IF - HHTYPE='G' OR '3' OR                                                   
//*      (HHTYPE='H' AND FILE-STATUS-SMS OR FILE-STATUS-RSL = 'OM')             
//*          OUTPUT TO BP13F716                                                 
//* ELSE                                                                        
//*      OUTPUT TO BP13F716 TO CHECK RDB                                        
//*---------------------------------------------------------------------        
//* 1)  P13F716A - TO FURTHER CHECK WITH RDB                                    
//* 2)  BP13F716 - INFO ALREADY FOUND IN SMS & RESALE                           
//*---------------------------------------------------------------------        
//STEP16A  EXEC PGM=BP13C788,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558RDB,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=&&P13F716A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT IN NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP16B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F716A,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP16C  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                                   
//P13F716A DD DSN=&&F716Q748,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                                    
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                        
//*---------------------------------------------------------------------        
//STEP16D  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716Q748,DISP=(OLD,PASS)                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=&&F716C754,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT IN REGN NO SEQUENCE                                                
//*---------------------------------------------------------------------        
//STEP16E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//         DD DSN=&&F716C754,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//*  TO DETERMINE SMS FT/STATUS, RSL FT/STATUS, RDB FT/STATUS                   
//*---------------------------------------------------------------------        
//STEP16F   EXEC PGM=BP13C519,COND=(0,NE)                                       
//BP13F716  DD DSN=&&F716REGN,DISP=(OLD,PASS)                                   
//BP13F520  DD DSN=&&BP13F740,DISP=(OLD,PASS)                                   
//P13F520A  DD DSN=&&F520C519,DISP=(NEW,PASS),                                  
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP16G  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520C519,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//*  TO DETERMINE LOAN TAG & PREMIUM CODE                                       
//*---------------------------------------------------------------------        
//STEP17    EXEC PGM=BP13C520,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520SORT,DISP=(OLD,PASS)                                   
//BP13F558  DD DSN=&&F558RDB,DISP=(OLD,PASS)                                    
//BR10K010  DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13F520A  DD DSN=&&BP13F520,DISP=(NEW,PASS),                                  
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//             UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                              
//BP13L520  DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT F520 IN REGN NO ORDER                                                  
//*-----------------------------------------------------------------            
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F520,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F740CD02,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*-------------------------------------------------------------------*         
//* UPDATE PORT-ELIG-TAG = 'S' BACK TO 'P'                                      
//* BEFORE TRANSFERRING TO SOC MASTER                                           
//*-------------------------------------------------------------------*         
//STEP18A  EXEC PGM=BP13CD02,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CD02,DISP=(OLD,DELETE)                                  
//BP13F520 DD DSN=&&P13F520A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//BP13LD02 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* TO EXTRACT THE SUCCESSFUL BALLOTED APPLICANT'S & OCCUPIER INFOR             
//* TO UPDATE THE SOC MASTER AND SOC OCCUPIER FILE                              
//* TO PASS RECORDS TO CFS FOR PRE-ELIGIBILITY CHECK                            
//*---------------------------------------------------------------------        
//STEP19    EXEC PGM=BP13C528,COND=(0,NE)                                       
//BP13F520  DD DSN=&&P13F520A,DISP=(OLD,PASS)                                   
//BP13K530  DD DSN=BP13.K530.ISSUENO,DISP=SHR                                   
//BP13K825  DD DSN=BP13.K825.REQOCCP,DISP=SHR                                   
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K840  DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13F310  DD DSN=BP13.F310.APPOINT,DISP=MOD                                   
//BP13F800  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                  
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                             
//             UNIT=SYSDA,SPACE=(CYL,(40,20),RLSE)                              
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT OUT MGPS APPLICATIONS IN REGISTRATION NUMBER ORDER                     
//*-----------------------------------------------------------------            
//STEP19A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&F740CF49,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=((245,1,CH,EQ,C'P',AND,213,3,CH,NE,C'GRO'),OR,                  
                 (245,1,CH,EQ,C'C',AND,213,3,CH,NE,C'GRO'))                     
//*-----------------------------------------------------------------*           
//* TO UPDATE  NUM-MGPS AND MGPS-QUEUE                                          
//*-----------------------------------------------------------------*           
//STEP19B  EXEC PGM=BP13CF49,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CF49,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*------------------------------------------------------------------           
//* SIEVE OUT ALL SINGLE/WIDOWED/DIVORCED/SEPARATED APPLICANTS                  
//*------------------------------------------------------------------           
//STEP19C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&BP13F820,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=400),                                 
//         SPACE=(CYL,(180,50),RLSE)                                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(96,1,CH,EQ,C'1',OR,96,1,CH,EQ,C'S',OR,                        
                  96,1,CH,EQ,C'3',OR,96,1,CH,EQ,C'W',OR,                        
                  96,1,CH,EQ,C'4',OR,96,1,CH,EQ,C'D',OR,                        
                  96,1,CH,EQ,C'5',OR,96,1,CH,EQ,C'P')                           
//*------------------------------------------------------------------           
//* MATCH BY REGN                                                               
//*------------------------------------------------------------------           
//STEP19D  EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=&&BP13F820,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//MATCH    DD DSN=BP13.F82Z.MARRSCRN.BE01,DISP=OLD                              
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(1,8,A)                                              
   JOINKEYS FILE=F2,FIELDS=(4,8,A)                                              
   REFORMAT FIELDS=(F1:1,17,28,66,96,1,F2:924,3,785,6,51,3,30,2,                
                    F1:122,8,1,44)                                              
   OUTFILE FNAMES=MATCH,                                                        
      OUTREC=(1,106,44X)                                                        
   SORT FIELDS=(85,14,A),FORMAT=CH                                              
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* TO UPDATE RESALE STATUS = 'LN' OR 'LNS' TO MASTER                           
//* AFTER DETAIL UPDATED TO MASTER                                              
//*---------------------------------------------------------------------        
//STEP24    EXEC PGM=BP13C71N,COND=(0,NE)                                       
//BP13F520  DD DSN=&&P13F520A,DISP=(OLD,PASS)                                   
//BP13K825  DD DSN=BP13.K825.REQOCCP,DISP=SHR                                   
//BB24K510  DD DSN=BB24.K510.UINHIST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BB24K500  DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT THE CASES BY NT AND QUEUE                                              
//*-----------------------------------------------------------------            
//STEP26   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F740,DISP=(NEW,PASS),                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(187,3,A,235,5,A),FORMAT=CH                                      
//*-----------------------------------------------------------------*           
//*  TO PRINT GENERATE FILE WITH MATCH HH INCOME                    *           
//*-----------------------------------------------------------------*           
//STEP27   EXEC PGM=BP13CF24,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740,DISP=(OLD,DELETE)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=23')                                                     
//BP13OUT1 DD DSN=BP13.REPORT.HHINCOME.BP13CF24,DISP=OLD                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT CASE BY REGISTRATION NUMBER                                            
//* INCLUDE SAS NOT = SPACES HARDLUCK CASES                                     
//*---------------------------------------------------------------------        
//STEP28   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730SAS,DISP=(NEW,PASS),                                    
//             UNIT=SYSDA,SPACE=(CYL,(10,8),RLSE),                              
//             DCB=(LRECL=500,RECFM=FB)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(466,1,CH,NE,C' ')                                               
//*-----------------------------------------------------------------*           
//* SAS ASSISTED CASES, DELETE FROM B1P3K585, WRITE TO BP13K587                 
//*-----------------------------------------------------------------*           
//STEP29   EXEC PGM=BP13CF35,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730SAS,DISP=(OLD,DELETE)                                   
//BP13K585 DD DSN=BP13.K585.HARDLUCK,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K587 DD DSN=BP13.K587.HARDLUCK.HIST,DISP=SHR,                             
//            AMP=('BUFNI=8','BUFND=4')                                         
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*--------------------------------------------------------------------         
//* SORT CASE BY REGISTRATION NUMBER WITHOUT DUPLICATES                         
//*---------------------------------------------------------------------        
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&F740CF71,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------*           
//* UPDATE K800-NUM-HLA                                                         
//*-----------------------------------------------------------------*           
//STEP31   EXEC PGM=BP13CF71,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CF71,DISP=(OLD,DELETE)                                  
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR,                                       
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K740 DD DUMMY                                                             
//BP13K741 DD DUMMY                                                             
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//SYSIN    DD *                                                                 
HFE                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* UPDATE K800-NUM-BALLOT-OVERWRITE FOR EIP                                    
//*-----------------------------------------------------------------*           
//STEP32   EXEC PGM=BP13CF7O,COND=(0,NE)                                        
//BP13F740 DD DSN=BP13.F740.ETHNIC.A633,DISP=SHR                                
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* UPDATE K800-NUM-BALLOT-OVERWRITE FOR NOGEN3                                 
//*-----------------------------------------------------------------*           
//STEP33   EXEC PGM=BP13CF7P,COND=(0,NE)                                        
//BP13F740 DD DSN=BP13.F740.FIVERM.NOGEN3,DISP=SHR                              
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------*          
//* BACKUP BP13K800 RECORDS CREATED TO DISK                          *          
//*------------------------------------------------------------------*          
//STEP34   EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=&&BP13F800,DISP=(SHR,PASS)                                    
//SORTJNF2 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//MATCH    DD DSN=BP13.F800.APPLN.BALLOT.BKUP(+1),DISP=(NEW,CATLG),             
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                             
//             SPACE=(CYL,(40,20),RLSE)                                         
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(4,8,A)                                              
   JOINKEYS FILE=F2,FIELDS=(4,8,A)                                              
   REFORMAT FIELDS=(F2:1,2000)                                                  
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//*  TO UPDATE K800-NUM-PRIO-SUCC-QUOTA                                         
//*-----------------------------------------------------------------*           
//STEP35   EXEC PGM=BP13CF46,COND=(0,NE)                                        
//BP13F740 DD DSN=BP13.F740.MATUREBA.PRIO.SUCC,DISP=SHR                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-----------------------------------------------------------------            
//*-SORT OUT 3-ROOM, CHECK FOR CASE ELIGIBLE FOR STEP-UP GRANT                  
//*-----------------------------------------------------------------            
//STEP36   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&F730STEP,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(20,50),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(211,1,CH,EQ,C'3')                                               
//*------------------------------------------------------------------           
//* DETERMINE STEP-UP GRANT, NON-MATURE ESTATE                                  
//* 3-ROOM APPLICANT, CURR LESSEE OF 2-ROOM FLAT                                
//*                   EX-LESSEE OF 2-ROOM FLAT, SOLD > 6 MTHS                   
//*-----------------------------------------------------------------            
//STEP37   EXEC PGM=BP13CD83,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730STEP,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K80A DD DSN=BP13.K80A.FLATINFO,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K558 DD DSN=BP13.K558.BP13DPRE.ACCUM,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13LD83 DD DSN=BP13.LD83.REPORT,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* UNCLUDE ELDERLY-TAG = F, S                                                  
//*---------------------------------------------------------------------        
//STEP38   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F740ELD,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(210,1,CH,EQ,C'F',OR,210,1,CH,EQ,C'S')                           
//*---------------------------------------------------------------------        
//* UPDATE BP13K800 WITH ELDERLY PREMIUM TAG                                    
//*---------------------------------------------------------------------        
//STEP39   EXEC PGM=BP13CZ2J,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740ELD,DISP=(OLD,PASS)                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13LZ2JA DD DSN=BP13.LZ2J.ELDPREM,DISP=OLD                                    
//P13LZ2JB DD DSN=BP13.LZ2J.NELDPREM,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP40A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.PRIO.SUCC,DISP=SHR                         
//SORTOUT  DD DSN=&&F740MTCH,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*-----------------------------------------------------------------*           
//*  TO PRINT GENERATE FILE WITH APPLICANTS DETAILS                 *           
//*-----------------------------------------------------------------*           
//STEP40B  EXEC PGM=BP13CF11,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,DELETE)                                  
//F740MTCH DD DSN=&&F740MTCH,DISP=(OLD,DELETE)                                  
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                 
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13KB00 DD DSN=BP13.KB00.BEBTO,DISP=SHR                                      
//P13F740A DD DSN=BP13.LF11.SLRESULT,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* EXCLUDE PA RECORD CREATED FOR GRO FOR EMPLOYMENT STATUS UPD                 
//*---------------------------------------------------------------------        
//STEP41A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F74041A,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  OMIT COND=(28,1,CH,EQ,C'G')                                                   
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* UPDATE BP13K820 WITH EMPLOYMENT STATUS AND <12NS AND <12EDN                 
//*---------------------------------------------------------------------        
//STEP41B  EXEC PGM=BP13CB89,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F74041A,DISP=(OLD,DELETE)                                   
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//BP13OUT1 DD SYSOUT=*                                                          
//BP13OUT2 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* INCLUDE ONLY HALF-IDP APPLICATIONS                                          
//*---------------------------------------------------------------------        
//STEP42A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F74042A,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(465,1,CH,EQ,C'S')                                               
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* REMOVE DUPS FOR HFE ACCUM                                                   
//*---------------------------------------------------------------------        
//STEP42B1 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FECA.HFE.ACCUM,DISP=SHR                                  
//SORTOUT  DD DSN=&&HFEACCUM,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                               
//            SPACE=(CYL,(50,50),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* REPLACE SALES APPLICATION DATE BY HFE SUBMISSION DATE                       
//* -MATCHED RECORDS   = REPLACED DATE                                          
//* -UNMATCHED RECORDS = ORIGINAL DATE                                          
//*---------------------------------------------------------------------        
//STEP42B2 EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F74042A,DISP=(OLD,DELETE)                                   
//SORTJNF2 DD DSN=&&HFEACCUM,DISP=(OLD,PASS)                                    
//MATCH    DD DSN=&&F74042B1,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//UNMATCH  DD DSN=&&F74042B2,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   JOIN UNPAIRED,F1,F2                                                          
   REFORMAT FIELDS=(?,F1:1,500,F2:21,8)                                         
   OPTION COPY                                                                  
   OUTFILE FNAMES=MATCH,INCLUDE=(1,1,CH,EQ,C'B'),                               
             BUILD=(1:2,260,502,8,270,232)                                      
   OUTFILE FNAMES=UNMATCH,INCLUDE=(1,1,CH,EQ,C'1'),                             
             BUILD=(1:2,500)                                                    
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE BACK ALL RECORDS                                                      
//*---------------------------------------------------------------------        
//STEP42C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F74042B1,DISP=(OLD,DELETE)                                  
//         DD DSN=&&F74042B2,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F74042C,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* UPDATE BP13K800 WITH DEFERRED INCOME ASSESSMENT TAG                         
//*---------------------------------------------------------------------        
//STEP42D  EXEC PGM=BP13CF7K,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F74042C,DISP=(OLD,DELETE)                                   
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* GENERATE REPORT                                                             
//*-----------------------------------------------------------------            
//STEP43  EXEC PGM=BP13C83A,COND=(0,NE)                                         
//BP13F800 DD DSN=BP13.F800.APPLN.BALLOT.BKUP(+1),DISP=SHR                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13L83A DD DSN=BP13.L83A.REPORT,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* INCLUDE APPLICATIONS -2ND-TIMER, NTIMER NOT Y, APPLIED FLAT 2/3RM           
//* AND ALLO SCH NOT FSH AND STS                                                
//*--------------------------------------------------------------------         
//STEP44A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F730A512,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(116,1,CH,EQ,C'G',AND,475,1,CH,NE,C'Y',AND,                      
                209,1,CH,NE,C'Y',AND,213,3,CH,NE,C'FSH',AND,                    
                213,3,CH,NE,C'STS',AND,                                         
               (211,1,CH,EQ,C'2',OR,211,1,CH,EQ,C'3'))                          
  SUM FIELDS=NONE                                                               
//*--------------------------------------------------------------------         
//* INCLUDE RESIDENT ROLE TENANT                                                
//*--------------------------------------------------------------------         
//STEP44B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.DPREQ749.ACCUM,DISP=SHR                             
//         DD DSN=BP13.F716.DPREQ749.BKUP(0),DISP=SHR                           
//SORTOUT  DD DSN=&&F716A512,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=350),                                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(75,3,CH,EQ,C'003')                                              
  SUM FIELDS=NONE                                                               
//*--------------------------------------------------------------------         
//* GENERATE REPORT FOR STEP-UP GRANT FOR RENTAL TENANTS AND                    
//* UPDATE BP13K800 WITH STEP-UP = 'T'                                          
//*--------------------------------------------------------------------         
//STEP44C  EXEC PGM=BP13CD8A,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730A512,DISP=(OLD,DELETE)                                  
//BP13F716 DD DSN=&&F716A512,DISP=(OLD,DELETE)                                  
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//BP13LD8A DD DSN=BP13.LD8A.REPORT,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP45A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&P13F740Q,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(245,1,CH,EQ,C'C',AND,213,3,CH,NE,C'GRO')                          
//*----------------------------------------------------------------*            
//* TO EXTRACT SUCCESSFUL APPLICANTS FROM REQUEST FILE             *            
//*----------------------------------------------------------------*            
//STEP45B  EXEC PGM=BP13C579,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                  
//BP13F520 DD DSN=&&P13F740Q,DISP=(OLD,PASS)                                    
//BP13F200 DD DSN=BP13.F200.BKAPPMT,DISP=MOD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* END BP13A512                                                                
//*---------------------------------------------------------------------        
