//BP13A545 JOB (BP13P),'BP13A545',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- --------------------                                           
//* BP130652 SCK 990826   EXPAND F 520,K520,K595 RECL 300 TO 500                
//* BP130780 MCC 991227   CHGE DTE-BALLOT FIELD FROM 6 TO 4                     
//*                       BYTES (&&CNRIC AND &&HNRIC)                           
//* BP130749 SRN 000218   STEP05. ADD NEW DD STATEMENT, BP13L741,               
//*                       FOR REPORT P13L741A.                                  
//* BP130857 SSS 000626   ADD GROUPID                                           
//* BP130897 AKT 000807   EXPAND F558 RECL FROM 400 TO 600                      
//* BP132555 CKK 040726   REMOVE STEP 10 ONWARDS                                
//******************************************************************            
//*  -- MANAGEMENT REPORTS FOR MATURE ESTATES --                                
//*  PRINT SUCC/UNSUCC REPORTS AFTER PIGEON-HOLING                              
//*-----------------------------------------------------------------            
//* STEP 02 & 03 = PRINT TOTAL SUCC/UNSUCC BY NT/FT/ALC-SCH                     
//*                BREAK DOWN BY NHH/UPG, (BP13L712)                            
//* STEP 04      = PRINT TOTAL SUCC/UNSUCC BY NT/FT/ALC-SCH                     
//*                BREAK DOWN BY NHH/UPG, (BP13L726)                            
//* STEP 05      = REPORT BP13S741                                              
//* STEP 06      = REPORT BP13S743                                              
//* STEP 07      = REPORT BP13S753                                              
//* STEP 08      = REPORT BP13S727                                              
//* STEP 09      = REPORT BP13S754                                              
//* STEP 10 -23  = REPORT BP13S740                                              
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, WITH DUPLICATE COPIES                                             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*------------------------------------------------------------------           
//* PRINT TOTAL REQUEST BY PRIORITY GP, BREAK DOWN BY RESIDENT/NON-RES,         
//*                                     BREAK DOWN BY UPGRADER/NHH              
//*                                     BEFORE BALLOTING.                       
//*------------------------------------------------------------------           
//STEP02 EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                     
//BP13F520  DD DSN=BP13.F740.PIGEON,DISP=SHR                                    
//PRIOFMT   DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT18F001  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S712),DISP=SHR                            
//*                                                                             
//*------------------------------------------------------------------           
//* PRINT RESULT PRIORITY REQUEST, BREAK DOWN BY RESIDENT/NON-RES,              
//*                                BREAK DOWN BY UPGRADER/NHH                   
//*                                AFTER BALLOTING.                             
//*------------------------------------------------------------------           
//STEP03 EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                     
//BP13F520  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//          AMP=('BUFND=23')                                                    
//PRIOFMT   DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT18F001  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S712),DISP=SHR                            
//*                                                                             
//*------------------------------------------------------------------           
//* PRINT SUMMARY OF PRIORITY GROUP BY NHH/UPG                                  
//* FOR TOTAL OF SUCC AND UNSUCC                                                
//*-------------------------------------------------------------------          
//STEP04   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//BP13F520 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//PRIOFMT  DD  DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT18F001 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S726),DISP=SHR                            
//*---------------------------------------------------------------------        
//* PRINT BALLOT RESULT BY NT/FT ON FLAT SUPPLY, REQUEST, SUCC COUNT            
//* SUCC PERCENTAGE                                                             
//* EXCLUDE RELOCATION SCHEME                                                   
//*--------------------------------------------------------------------         
//STEP05   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                  
//BP13F520 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//   AMP=('BUFND=23')                                                           
//PRIOFMT  DD  DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT18F001 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//BP13L741 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S741),DISP=SHR                            
//*---------------------------------------------------------------------        
//* PRINT BALLOT RESULT BY NT/FT ON REQUEST, SUCC AND UNSUCC COUNT              
//* SUCC PERCENTAGE, RATIO                                                      
//* EXCLUDE RELOCATION SCHEME                                                   
//*--------------------------------------------------------------------         
//STEP06   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                  
//BP13BALL DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//   AMP=('BUFND=23')                                                           
//BP13L743 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S743),DISP=SHR                            
//*---------------------------------------------------------------------        
//* PRINT BALLOT RESULT BY NT/FT ON REQUEST, SUCC AND UNSUCC COUNT              
//* SUCC PERCENTAGE, RATIO                                                      
//* INCLUDE RELOCATION SCHEME                                                   
//*--------------------------------------------------------------------         
//STEP07   EXEC  SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                  
//BP13BALL DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//   AMP=('BUFND=23')                                                           
//BP13L753 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S753),DISP=SHR                            
//*--------------------------------------------------------------------         
//* PRINT SUMMARY BALLOT RESULT FOR JS SCHEME, MTF, TCP SCHEME                  
//*---------------------------------------------------------------------        
//STEP08    EXEC  SAS,COND=(0,NE)                                               
//BP13F520 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//   AMP=('BUFND=23')                                                           
//FT42F001  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S727),DISP=SHR                            
//*---------------------------------------------------------------------        
//* PRINT RESIDENT PRIORITY SCHEME BY MTF/TCP, REN/RHO, GRO, PA, RDC            
//*---------------------------------------------------------------------        
//STEP09    EXEC  SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                 
//BP13F520 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//   AMP=('BUFND=23')                                                           
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S754),DISP=SHR                             
