//BP13D408 JOB (BP13P),'BP13D408',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//*=================================================================*           
//* OBJECTIVE : (1) CREATE E-STAMPING FILE FOR IRASURNING OF IRAS   *           
//*             (2) UPDATE E-STAMPING FILE RETURNED FROM IRAS       *           
//*             (3) PRINT TRACKING REPORT FOR E-STAMPING            *           
//*-----------------------------------------------------------------*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* ========  ==========  ==== ===========                          *           
//* BP130696  01/08/1999  CLT1 E-STAMPING IMPLEMENTATION.           *           
//* BP130821  11/04/2000  CLT1 BP13K625 KEY LENGTH CHANGED.         *           
//* BP130883  27/10/2000  CLT1 REMOVE CALLING OF BP13C904.          *           
//* BP131058  03/08/2001  CLT1 ADD BP13K800 TO BP13C31P.            *           
//* BP132185  22/08/2002  CLT1 REMOVE BP13K800 FROM BP13C31P.       *           
//* BP132734  12/09/2004  CLT1 ADD BP13K800 TO BP13C421.            *           
//* BP133505  19/01/2009  LSB1 ADD BP13.AG07.F640.MTHBKUP           *           
//* BP133881  22/07/2010  LJL1 TO CATER FOR IRAS E-STAMPING         *           
//* BP133884  28/10/2010  ESD1 ADD BP13K330 TO STEP02               *           
//* BP134128  13/09/2011  ESD1 CATER TO ADD THE NEW SORT PROCEDURE  *           
//*                            AND TO RUN NEW PROGRAM BP13C31N.     *           
//* BP134781  13/05/2013  JGO1 CATER TO ADD THE NEW SORT PROCEDURE  *           
//*                            AND TO RUN NEW PROGRAM BP13C31O.     *           
//* BP134779  29/05/2013  PCL4 TO UPDATE BP13L429 INTO EMAIL/FILE   *           
//*                            REPORT FORMAT                        *           
//* BP134781  31/05/2013  LJL1 TO EMPTY THE TLVS FILE AFTER RUN AND *           
//*                            TO BACKUP THE TLVS FILE.             *           
//* BP134781  07/06/2013  JGO1 ADD BP13K620 AS INPUT TO BP13C31O    *           
//* BP134809  12/06/2013  JGO1 ADD BM06K110 AS INPUT TO BP13C31O    *           
//* BP134810  28/06/2013  JGO1 ADD BP13C31E FOR DEEARMARKING        *           
//* BP135032  30/08/2013  JGO1 ADD DBSS SUBTRANSFER                 *           
//* BP134810  11/09/2013  JGO1 UPDATE INPUT OF BP13C31F             *           
//* BP135032  12/09/2013  JGO1 UPDATE ON CALL OF BP13C31F           *           
//* BP135136  25/11/2013  JGO1 UPDATE C421 AND ADD C42C FOR IRAS    *           
//*                            EMAIL ALERT                          *           
//* BP135171  11/02/2014  RJE1 TO CATER FOR DB2 UPGRADE             *           
//* BP135193  24/03/2014  JGO1 ADD K410 AS INPUT TO C31E            *           
//* BP135309  03/09/2014  JGO1 REMOVE SORT FOR C31A AND C31F        *           
//* BP135520  27/10/2014  JGO1 ADD C31I FOR ZERO DBSS SUBTRANSFER   *           
//* BP135600  02/02/2016  KSJ3 INCLUDE BP13C42J AND BP13C42I FOR    *           
//*                            RSL LEVY VOUCHER RETURN PROCESSING & *           
//*                            RENAME STEPS 07-14 TO 09-16          *           
//* BP135858  17/02/2016  KSJ3 INCL BP13K350 & BP13K130 TO BP13C42I *           
//* BP136260  19/08/2016  KSJ3 INCL BP13K62K TO BP13C421            *           
//* BP136483  11/11/2016  KSJ3 INCLUDE BP13C42M AND BP13C42N FOR    *           
//*                            FORFEITURE AND REFUND JV PROCESSING  *           
//*                            RENAME STEPS 09-16 TO 11-18          *           
//* BP136400  23/08/2017  RJB1 INCLUDE BP13C42O AND BP13C42P FOR    *           
//*                            SERS CONTRA EJV PROCESSING           *           
//* BP136986  04/10/2017  KVL1 ADDED STEPS 19-26 FOR TEMP LOAN      *           
//*                            EXCESS REFUND                        *           
//* BP136986  20/10/2017  KVL1 SHIFTED STEPS 19-22 UP TO STEPS 10G- *           
//*                            10J                                  *           
//* BP137132  31/07/2018  KR13 MIGRATION OF REPORTS AND LETTERS TO  *           
//*                            IOMS                                 *           
//* BP137333  13/08/2018  DN8  TO CATER FOR CANCELLED FLAT'S ALE    *           
//*                            THAT WAS STAMPED BY IRAS.            *           
//* BP138865  28/10/2021  KR13 REMOVED REPORT L42NA.                *           
//* BP138916  14/10/2022  ZDD3 TO CATER FOR IRAS STAMP DUTY SYSTEM  *           
//*                            CHANGES.                             *           
//* BP138916  28/10/2022  ZAR7 ADD BP13K885 ON C31M/C31N            *           
//* BP138916  02/03/2023  KAC1 ADD BP13K462 ON C31O                 *           
//*=================================================================*           
//*                                                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*                                                                             
//*-------------------------------------------------------------------*         
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                *         
//*    PRT01 : CLASS = 2, COPIES = 1 ** (SALES - AGREEMENT TEAM)      *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                *           
//*  PRT02 : CLASS = 2, COPIES = 1 ** (SALES - AGREEMENT TEAM)      *           
//*-------------------------------------------------------------------*         
//PRT02   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=13C645,JDL=BP13,COPIES=1,END;                                       
//FORMID   OUTPUT FORMS=1OS2,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP STAMPING FILE BEFORE RUN                                  *         
//*-------------------------------------------------------------------*         
//STEP01 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT     DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                  
//OUTPUT    DD DSN=BP13.F625.STAMPFEE.BKUP(+1),DISP=(NEW,CATLG),                
//          SPACE=(CYL,(10,5)),                                                 
//          DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                     
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* CREATE E-STAMPING FILE FOR IRAS                                   *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//BP13K621 DD DSN=BP13.K625.STAMPFEE.PATH1,DISP=SHR                             
//BP13K622 DD DSN=BP13.K625.STAMPFEE.PATH2,DISP=SHR                             
//AG07F640 DD DSN=AG07.F640.SOC,DISP=SHR                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR                              
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//BB14F140 DD DSN=BP13.BB14.F140.SENTIRAS.NEW,DISP=MOD                          
//BP13F640 DD DSN=BP13.F640.SOC.NTFND,DISP=MOD                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//BM06K120 DD DUMMY                                                             
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C31M) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT FOR ZERO FEE TWF AND RMP                                     *         
//*-------------------------------------------------------------------*         
//STEP2B  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F625.ZEROFEE.TWFRMP,DISP=SHR                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(283,1,CH,EQ,C'Y')                                              
//*-------------------------------------------------------------------*         
//* CREATE E-STAMPING FILE FOR IRAS ZERO FEE TWF AND RMP              *         
//*-------------------------------------------------------------------*         
//STEP2C   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F625 DD DSN=BP13.F625.ZEROFEE.TWFRMP,DISP=SHR                             
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//BP13K621 DD DSN=BP13.K625.STAMPFEE.PATH1,DISP=SHR                             
//BP13K622 DD DSN=BP13.K625.STAMPFEE.PATH2,DISP=SHR                             
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR                              
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//BB14F140 DD DSN=BP13.BB14.F140.SENTIRAS.NEW,DISP=MOD                          
//BP13F640 DD DSN=BP13.F640.SOC.NTFND,DISP=MOD                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//BM06K120 DD DUMMY                                                             
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C31N) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT FOR ZERO FEE DBSS SUBTRANSFER                                *         
//*-------------------------------------------------------------------*         
//STEP2D  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F625A,DISP=(NEW,PASS),                                   
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                                
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                   
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(284,1,CH,EQ,C'Y')                                              
//*-------------------------------------------------------------------*         
//* CREATE E-STAMPING FILE FOR IRAS ZERO FEE TWF AND RMP              *         
//*-------------------------------------------------------------------*         
//STEP2E   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F625 DD DSN=&&P13F625A,DISP=(SHR,PASS)                                    
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//BP13K621 DD DSN=BP13.K625.STAMPFEE.PATH1,DISP=SHR                             
//BP13K622 DD DSN=BP13.K625.STAMPFEE.PATH2,DISP=SHR                             
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR                              
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                              
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BB14F140 DD DSN=BP13.BB14.F140.SENTIRAS.NEW,DISP=MOD                          
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BM06K120 DD DUMMY                                                             
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C31Q) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT OUT TOL/SUA                                                  *         
//*-------------------------------------------------------------------*         
//STEP2F   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F640.SOC.AG072729,DISP=SHR                               
//SORTOUT  DD DSN=&&G07F640D,DISP=(NEW,PASS),                                   
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                                
//         DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                                   
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,19,A),FORMAT=CH                                               
   INCLUDE COND=(43,3,CH,EQ,C'SUA',OR,43,3,CH,EQ,C'TOL')                        
//*-------------------------------------------------------------------*         
//* CREATE E-STAMPING FILE FOR IRAS                                   *         
//*-------------------------------------------------------------------*         
//STEP2G   EXEC PGM=IKJEFT01,DYNAMNBR=20,REGION=4096K                           
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//BP13K621 DD DSN=BP13.K625.STAMPFEE.PATH1,DISP=SHR                             
//BP13K622 DD DSN=BP13.K625.STAMPFEE.PATH2,DISP=SHR                             
//AG07F640 DD DSN=&&G07F640D,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR                              
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                              
//BP13K462 DD DSN=BP13.K462.SOC.TOL,DISP=SHR                                    
//BP13K461 DD DSN=BP13.K462.SOC.TOL.PATH2,DISP=SHR                              
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//BB14F140 DD DSN=BP13.BB14.F140.SENTIRAS.NEW,DISP=MOD                          
//BP13K620 DD DSN=BP13.K620.STAMPNO,DISP=SHR                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BM06K120 DD DUMMY                                                             
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C31O) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
//*                                                                             
//*                                                                             
//*--------------------------------------------------------------------*        
//* TO SORT INPUT FILE F142 TO GET SUCCESSFUL VOUCHER FROM IRAS        *        
//*--------------------------------------------------------------------*        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.BB14.F142.RECVIRAS,DISP=SHR                              
//SORTOUT  DD DSN=&&P13F142A,DISP=(NEW,PASS),                                   
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                               
//          DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                  
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   INCLUDE COND=((1,5,CH,EQ,C'BATCH',AND,114,3,CH,EQ,C'   '),OR,                
                 (1,6,CH,EQ,C'DETAIL',AND,35,3,CH,EQ,C'   '))                   
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE RETURNS FROM IRAS                                          *         
//*-------------------------------------------------------------------*         
//STEP3A   EXEC PGM=BP13C421,COND=(0,NE)                                        
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//BP13K621 DD DSN=BP13.K625.STAMPFEE.PATH2,DISP=SHR                             
//BB14F142 DD DSN=&&P13F142A,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13IRPT DD DSN=BP13.IRAS.EMAIL.REPORT.SUCCESS,DISP=SHR                       
//BP13K62K DD DSN=BP13.K62K.STAMPALE,DISP=SHR                                   
//BP13F421 DD DSN=BP13.F421.STAMP.OLDDATA,DISP=MOD                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRIN  DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*                                                                             
//*--------------------------------------------------------------------*        
//* TO SORT INPUT FILE F142 TO GET REJECTED VOUCHERS FROM IRAS         *        
//*--------------------------------------------------------------------*        
//STEP3B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.BB14.F142.RECVIRAS,DISP=SHR                              
//SORTOUT  DD DSN=&&P13F142B,DISP=(NEW,PASS),                                   
//          UNIT=(SYSDA),SPACE=(TRK,(10,5),RLSE),                               
//          DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                  
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   INCLUDE COND=((1,5,CH,EQ,C'BATCH',AND,114,3,CH,NE,C'   '),OR,                
                 (1,6,CH,EQ,C'DETAIL',AND,35,3,CH,NE,C'   '))                   
/*                                                                              
//*--------------------------------------------------------------------*        
//*-------------------------------------------------------------------*         
//* CREATE E-STAMPING FILE FOR IRAS                                   *         
//*-------------------------------------------------------------------*         
//STEP3C   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BB14F142 DD DSN=&&P13F142B,DISP=(OLD,PASS)                                    
//BP13IMSG DD DSN=BP13.IRAS.ERRMSG,DISP=SHR                                     
//BP13IRPT DD DSN=BP13.IRAS.EMAIL.REPORT,DISP=SHR                               
//BP13IRP2 DD DSN=BP13.IRAS.EMAIL.REPORT.NFND,DISP=SHR                          
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//BP13K621 DD DSN=BP13.K625.STAMPFEE.PATH1,DISP=SHR                             
//BP13K622 DD DSN=BP13.K625.STAMPFEE.PATH2,DISP=SHR                             
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C42C) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BP13K625 BY K625-NUM-BATCH                                   *         
//* INCLUDE CASES WHERE K625-DTE-BATCH-SENT NOT = SPACES AND          *         
//*                     K625-DTE-IRAS-PROCESSED = SPACES              *         
//*-------------------------------------------------------------------*         
//STEP04  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F625,DISP=(NEW,PASS),                                   
//         UNIT=(SYSDA),SPACE=(CYL,(10,3),RLSE),                                
//         DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                   
//SYSIN    DD *                                                                 
   SORT FIELDS=(28,13,A),FORMAT=CH                                              
   INCLUDE COND=(245,8,CH,NE,C'        ',&,262,8,CH,EQ,C'        ')             
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON E-STAMPING BATCH NOT PROCESSED AFTER 7 DAYS       *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13C429,COND=(0,NE)                                        
//BP13F625 DD DSN=&&BP13F625,DISP=(SHR,DELETE)                                  
//*BP13L429 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13L429 DD DSN=BP13.L429.BP13C429,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRIN  DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//* DEEARMARKING FOR REJECTED VOUCHERS IN EWPC                        *         
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=BP13C31E                                                    
//AG07F225 DD DSN=AG07.F225.EVCHR.RETURN.SOC.STPFEE,DISP=SHR                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//B05K006  DD DSN=AB05.K006.SFMAST,DISP=SHR                                     
//AB05K009 DD DSN=AB05.K009.EARMHIST,DISP=SHR                                   
//AB05K902 DD DSN=AB05.K902.EARMLOG,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* CREATE E-STAMPING FILE FOR IRAS                                   *         
//*-------------------------------------------------------------------*         
//STEP6B   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13K625 DD DSN=BP13.K625.STAMPFEE,DISP=SHR                                   
//BP13K621 DD DSN=BP13.K625.STAMPFEE.PATH1,DISP=SHR                             
//BP13K622 DD DSN=BP13.K625.STAMPFEE.PATH2,DISP=SHR                             
//AG07F640 DD DSN=AG07.F640.SOC,DISP=SHR                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR                              
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                              
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BB14F140 DD DSN=BP13.BB14.F140.SENTIRAS.NEW,DISP=MOD                          
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BM06K120 DD DUMMY                                                             
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C31R) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
//*                                                                             
//*====================================================================         
//*                                                                             
//* RESALE LEVY VOUCHER RETURN FILE PROCESSING                                  
//*                                                                             
//*====================================================================         
//*-----------------------------------------------------------------            
//* SORT TO EXTRACT RESALE LEVY VOUCHERS FROM AG07F225                          
//*-----------------------------------------------------------------            
//STEP7A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F225.EVCHR.RETURN.SOC,DISP=SHR                           
//SORTOUT  DD DSN=&&AG07F225,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(TRK,(5,2),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(12,02,CH,EQ,C'00',AND,                                          
                150,03,CH,EQ,C'LVY',AND,                                        
                536,02,CH,NE,C'  ')                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* PROCESS DELETED RECORDS FROM EWPC                                           
//*-----------------------------------------------------------------            
//STEP7B   EXEC PGM=BP13C42J,COND=(0,NE)                                        
//AG07F225 DD DSN=&&AG07F225,DISP=(OLD,DELETE)                                  
//BP13KC10 DD DSN=BP13.KC10.LVYVCHR,DISP=OLD                                    
//BP13KC11 DD DSN=BP13.KC10.LVYVCHR.PATH1,DISP=OLD                              
//BP13FC10 DD DSN=BP13.FC10.ACCUM,DISP=MOD                                      
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                                       
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                                    
//P13L42JA DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L42JB DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT TO EXTRACT RESALE LEVY VOUCHERS FROM AG07F640                          
//*-----------------------------------------------------------------            
//STEP8A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F640.SOC,DISP=SHR                                        
//SORTOUT  DD DSN=&&AG07F640,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(TRK,(5,2),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(29,03,CH,EQ,C'LVY')                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* EXTRACT LEVY LIST REPORT                                                    
//*-----------------------------------------------------------------            
//STEP8B   EXEC PGM=BP13C42I,COND=(0,NE)                                        
//AG07F640 DD DSN=&&AG07F640,DISP=(OLD,DELETE)                                  
//AG07K970 DD DSN=AG07.K970.REJCODE,DISP=SHR                                    
//BP13K350 DD DSN=BP13.K350.STDAPT,DISP=SHR                                     
//BP13KC10 DD DSN=BP13.KC10.LVYVCHR,DISP=OLD                                    
//BP13KC11 DD DSN=BP13.KC10.LVYVCHR.PATH1,DISP=OLD                              
//BP13K470 DD DSN=BP13.K470.PREMIUM,DISP=OLD                                    
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=OLD                                    
//BP13FC10 DD DSN=BP13.FC10.ACCUM,DISP=MOD                                      
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                                       
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                                    
//P13L42IA DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L42IB DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*====================================================================         
//*                                                                             
//* FORFEITURE AND REFUND VOUCHER RETURN FILE PROCESSING                        
//*                                                                             
//*====================================================================         
//*-----------------------------------------------------------------            
//* SORT TO EXTRACT FORFEITURE AND REFUND VOUCHERS FROM AG07F225                
//*-----------------------------------------------------------------            
//STEP9A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F225.EVCHR.RETURN.SOC,DISP=SHR                           
//SORTOUT  DD DSN=&&AG07F22A,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(TRK,(5,2),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(12,02,CH,EQ,C'00',AND,                                          
                536,02,CH,NE,C'  ')                                             
//*            (150,03,CH,EQ,C'FOR',OR,150,03,CH,EQ,C'REF'),AND,                
//*                                                                             
//*-----------------------------------------------------------------            
//* PROCESS DELETED RECORDS FROM EWPC                                           
//*-----------------------------------------------------------------            
//STEP9B   EXEC PGM=BP13C42N,COND=(0,NE)                                        
//AG07F225 DD DSN=&&AG07F22A,DISP=(OLD,DELETE)                                  
//BP13K62A DD DSN=BP13.K62A.STAMPREF,DISP=OLD                                   
//BP13K621 DD DSN=BP13.K62A.STAMPREF.PATH2,DISP=OLD                             
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                                       
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT TO EXTRACT FORFEITURE AND REFUND VOUCHERS FROM AG07F640                
//*-----------------------------------------------------------------            
//STEP10A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F640.SOC,DISP=SHR                                        
//SORTOUT  DD DSN=&&AG07F64A,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(TRK,(5,2),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
//*  INCLUDE COND=(29,03,CH,EQ,C'FOR',OR,29,03,CH,EQ,C'REF')                    
//*                                                                             
//*-----------------------------------------------------------------            
//* UPDATE AND GENERATE REPORT                                                  
//*-----------------------------------------------------------------            
//STEP10B  EXEC PGM=BP13C42M,COND=(0,NE)                                        
//AG07F640 DD DSN=&&AG07F64A,DISP=(OLD,DELETE)                                  
//AG07K970 DD DSN=AG07.K970.REJCODE,DISP=SHR                                    
//BP13K62A DD DSN=BP13.K62A.STAMPREF,DISP=OLD                                   
//BP13K621 DD DSN=BP13.K62A.STAMPREF.PATH2,DISP=OLD                             
//AG07K960 DD DSN=AG07.K960.VRNO,DISP=SHR                                       
//AG07K930 DD DSN=AG07.K930.DDDCODE,DISP=SHR                                    
//P13L42MA DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//P13L42MB DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT TO EXTRACT SERS CONTRA VOUCHERS FROM AG07F225                          
//*-----------------------------------------------------------------            
//STEP10C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F225.EVCHR.RETURN.SOC,DISP=SHR                           
//SORTOUT  DD DSN=&&AG07F22B,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(TRK,(5,2),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(12,02,CH,EQ,C'00',AND,                                          
                150,03,CH,EQ,C'CON',AND,                                        
                536,02,CH,NE,C'  ')                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* PROCESS REJECTED RECORDS FROM EWPC                                          
//*-----------------------------------------------------------------            
//STEP10D  EXEC PGM=BP13C42O,COND=(0,NE)                                        
//AG07F225 DD DSN=&&AG07F22B,DISP=(OLD,DELETE)                                  
//BP13K300 DD DSN=BP13.K300.AGRORDER,DISP=OLD                                   
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=OLD                                    
//P13L42OA DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT TO EXTRACT SERS CONTRA VOUCHERS FROM AG07F640                          
//*-----------------------------------------------------------------            
//STEP10E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F640.SOC,DISP=SHR                                        
//SORTOUT  DD DSN=&&AG07F64B,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(TRK,(5,2),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
     INCLUDE COND=(29,03,CH,EQ,C'CON')                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* UPDATE AND GENERATE REPORT                                                  
//*-----------------------------------------------------------------            
//STEP10F  EXEC PGM=BP13C42P,COND=(0,NE)                                        
//AG07F640 DD DSN=&&AG07F64B,DISP=(OLD,DELETE)                                  
//AG07K970 DD DSN=AG07.K970.REJCODE,DISP=SHR                                    
//BP13K300 DD DSN=BP13.K300.AGRORDER,DISP=OLD                                   
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=OLD                                    
//P13L42PA DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*====================================================================         
//*                                                                             
//* TEMP LOAN EXCESS REFUND VOUCHER RETURN FILE PROCESSING                      
//*                                                                             
//*====================================================================         
//*-----------------------------------------------------------------            
//* SORT TO EXTRACT TEMP LOAN EXCESS REFUND VOUCHERS FROM AG07F225              
//*-----------------------------------------------------------------            
//STEP10G  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F225.EVCHR.RETURN.SOC,DISP=SHR                           
//SORTOUT  DD DSN=&&AG07F22A,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(CYL,(1,2),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(12,02,CH,EQ,C'00',AND,                                          
                536,02,CH,NE,C'  ',AND,                                         
                150,03,CH,EQ,C'EXC')                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* PROCESS EXTRACTED TEMP LOAN EXCESS REFUND VOUCHERS FROM AG07F225            
//*-----------------------------------------------------------------            
//STEP10H  EXEC PGM=BP13C42R,COND=(0,NE)                                        
//AG07F225 DD DSN=&&AG07F22A,DISP=(OLD,DELETE)                                  
//BP13K48K DD DSN=BP13.K48K.TLCONTRA.REQ,DISP=OLD                               
//P13L42RA DD DSN=BP13.L42RA.DELETE.VCHR,DISP=SHR                               
//P13L42RB DD DSN=BP13.L42RB.ERROR.VCHR,DISP=SHR                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT TO EXTRACT TEMP LOAN EXCESS REFUND VOUCHERS FROM AG07F640              
//*-----------------------------------------------------------------            
//STEP10I  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F640.SOC,DISP=SHR                                        
//SORTOUT  DD DSN=&&AG07F64A,                                                   
//            DISP=(NEW,PASS),                                                  
//            SPACE=(CYL,(1,2),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
     INCLUDE COND=(29,03,CH,EQ,C'EXC')                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* UPDATE AND GENERATE REPORT                                                  
//*-----------------------------------------------------------------            
//STEP10J  EXEC PGM=BP13C42Q,COND=(0,NE)                                        
//AG07F640 DD DSN=&&AG07F64A,DISP=(OLD,DELETE)                                  
//AG07K970 DD DSN=AG07.K970.REJCODE,DISP=SHR                                    
//BP13K48K DD DSN=BP13.K48K.TLCONTRA.REQ,DISP=OLD                               
//P13L42QA DD DSN=BP13.L42QA.REJECT.VCHR,DISP=SHR                               
//P13L42QB DD DSN=BP13.L42QB.ERROR.VCHR,DISP=SHR                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//* BACKUP AG07.F640.SOC                                                        
//* EMPTY  AG07.F640.SOC                                                        
//*--------------------------------------------------------------------         
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AG07.F640.SOC,DISP=SHR                                        
//         DD DSN=AG07.F640.SOC.AG072729,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.AG07.F640.SOC(+1),DISP=(NEW,CATLG),                      
//         SPACE=(CYL,(2,1)),                                                   
//         DCB=(BP13.GDG,BLKSIZE=23000,LRECL=100,RECFM=FB)                      
//INPUT2   DD DSN=AG07.F640.SOC,DISP=SHR                                        
//         DD DSN=AG07.F640.SOC.AG072729,DISP=SHR                               
//OUTPUT2  DD DSN=BP13.AG07.F640.MTHBKUP,DISP=MOD                               
//INPUT3   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT3  DD DSN=AG07.F640.SOC,DISP=OLD                                        
//INPUT4   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT4  DD DSN=AG07.F640.SOC.AG072729,DISP=OLD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
     REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                     
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                     
//*--------------------------------------------------------------------         
//* BACKUP BP13.BB14.F142.RECVIRAS                                              
//* EMPTY BP13.BB14.F142.RECVIRAS                                               
//*--------------------------------------------------------------------         
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.BB14.F142.RECVIRAS,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.BB14.F142.RECVIRAS.BKUP(+1),DISP=(NEW,CATLG),            
//         SPACE=(CYL,(2,1)),                                                   
//         DCB=(BP13.GDG,BLKSIZE=27800,LRECL=200,RECFM=FB)                      
//INPUT2   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT2  DD DSN=BP13.BB14.F142.RECVIRAS,DISP=OLD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*--------------------------------------------------------------------         
//* BACKUP BP13.BB14.F140.SENTIRAS                                              
//*--------------------------------------------------------------------         
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.BB14.F140.SENTIRAS.NEW,DISP=SHR                          
//OUTPUT1  DD DSN=BP13.BB14.F140.SENTIRAS.BKUP.NEW(+1),                         
//         DISP=(NEW,CATLG),                                                    
//         SPACE=(CYL,(2,1)),                                                   
//         DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)                      
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*--------------------------------------------------------------------         
//* BACKUP AG07.F225.EVCHR.RETURN.SOC.STPFEE                                    
//* EMPTY  AG07.F225.EVCHR.RETURN.SOC.STPFEE                                    
//*--------------------------------------------------------------------         
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AG07.F225.EVCHR.RETURN.SOC.STPFEE,DISP=SHR                    
//OUTPUT1  DD DSN=BP13.AG07.F225.SOC(+1),DISP=(NEW,CATLG),                      
//         SPACE=(CYL,(2,1)),                                                   
//         DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)                      
//INPUT2   DD DSN=AG07.F225.EVCHR.RETURN.SOC.STPFEE,DISP=SHR                    
//OUTPUT2  DD DSN=BP13.AG07.F225.MTHBKUP,DISP=MOD                               
//INPUT3   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT3  DD DSN=AG07.F225.EVCHR.RETURN.SOC.STPFEE,DISP=OLD                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
     REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                     
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13L429)                                            
//*-----------------------------------------------------------------            
//STEP15   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L429.BP13C429,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (REJECTED IRAS VOUCHERS)                              
//*-----------------------------------------------------------------            
//STEP16   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.IRAS.EMAIL.REPORT,DISP=SHR                               
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (NOT FOUND VOUCHERS)                                  
//*-----------------------------------------------------------------            
//STEP17   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.IRAS.EMAIL.REPORT.NFND,DISP=SHR                          
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (SUCCESSFUL IRAS VOUCHERS)                            
//*-----------------------------------------------------------------            
//STEP18   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.IRAS.EMAIL.REPORT.SUCCESS,DISP=SHR                       
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (P13L42RA)                                            
//*-----------------------------------------------------------------            
//STEP23   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L42RA.DELETE.VCHR,DISP=SHR                               
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (P13L42RB)                                            
//*-----------------------------------------------------------------            
//STEP24   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L42RB.ERROR.VCHR,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (P13L42QA)                                            
//*-----------------------------------------------------------------            
//STEP25   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L42QA.REJECT.VCHR,DISP=SHR                               
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (P13L42QB)                                            
//*-----------------------------------------------------------------            
//STEP26   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.L42QB.ERROR.VCHR,DISP=SHR                                
//*-------------------------------------------------------------------*         
//*                         END OF JOB                                *         
//*-------------------------------------------------------------------*         
