//BP13A699 JOB (BP13P),'BP13A699',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB02346
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET                                                                    
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F500,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=88)                                           
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(226,3,CH,EQ,C' ')                                            
     OUTREC FIELDS=(35,6,41,9,78,2,116,1,118,1,119,1,123,8,187,3,               
                    211,2,213,3,225,1,226,3,229,1,334,6,372,1,373,3,            
                    376,3,1,28,29,6)                                            
/*                                                                              
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F500,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(82,1,CH,NE,C' ',AND,                                         
                   82,1,CH,NE,C'#',AND,                                         
                   226,3,CH,EQ,C' ')                                            
     OUTREC FIELDS=(35,6,82,9,78,2,116,1,118,1,119,1,123,8,187,3,               
                    211,2,213,3,225,1,226,3,229,1,334,6,372,1,373,3,            
                    376,3,1,28,29,6)                                            
/*                                                                              
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F500,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(50,1,CH,NE,C' ',AND,                                         
                50,1,CH,NE,C'#',AND,                                            
                   226,3,CH,EQ,C' ')                                            
     OUTREC FIELDS=(35,6,50,9,78,2,116,1,118,1,119,1,123,8,187,3,               
                    211,2,213,3,225,1,226,3,229,1,334,6,372,1,373,3,            
                    376,3,1,28,29,6)                                            
/*                                                                              
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&P13F500,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(59,1,CH,NE,C' ',AND,                                         
                59,1,CH,NE,C'#',AND,                                            
                   226,3,CH,EQ,C' ')                                            
     OUTREC FIELDS=(35,6,59,9,78,2,116,1,118,1,119,1,123,8,187,3,               
                    211,2,213,3,225,1,226,3,229,1,334,6,372,1,373,3,            
                    376,3,1,28,29,6)                                            
/*                                                                              
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F500,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F500SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=88)                                           
//SYSIN    DD *                                                                 
     SORT FIELDS=(7,9,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F800,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=63,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=(155,4,CH,NE,C'    ',AND,                                     
                   1,1,CH,NE,C'C')                                              
     OUTREC FIELDS=(4,8,88,9,51,3,785,6,155,11,459,8,49,2,30,2,525,1,           
                    1,1,8X,C'Y',924,3)                                          
/*                                                                              
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F800,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=((97,1,CH,NE,C' ',AND,                                        
                    97,1,CH,NE,C'#'),AND,                                       
                   (155,4,CH,NE,C'    ',AND,                                    
                    1,1,CH,NE,C'C'))                                            
     OUTREC FIELDS=(4,8,97,9,51,3,785,6,155,11,459,8,49,2,30,2,525,1,           
                    1,1,8X,C'Y',924,3)                                          
/*                                                                              
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F800,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=((106,1,CH,NE,C' ',AND,                                       
                    106,1,CH,NE,C'#'),AND,                                      
                   (155,4,CH,NE,C'    ',AND,                                    
                    1,1,CH,NE,C'C'))                                            
     OUTREC FIELDS=(4,8,106,9,51,3,785,6,155,11,459,8,49,2,30,2,525,1,          
                    1,1,8X,C'Y',924,3)                                          
/*                                                                              
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F800,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=((115,1,CH,NE,C' ',AND,                                       
                    115,1,CH,NE,C'#'),AND,                                      
                   (155,4,CH,NE,C'    ',AND,                                    
                    1,1,CH,NE,C'C'))                                            
     OUTREC FIELDS=(4,8,115,9,51,3,785,6,155,11,459,8,49,2,30,2,525,1,          
                    1,1,8X,C'Y',924,3)                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F800,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F800SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=63)                                           
//SYSIN    DD *                                                                 
     SORT FIELDS=(9,9,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* CHECK FOR BOOKED CASES IN BP13K800                                          
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13C724,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500SORT,DISP=(OLD,PASS)                                    
//BP13F410 DD DSN=&&F800SORT,DISP=(OLD,PASS)                                    
//P13C724A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13C724B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F410,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=63)                                           
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(839,3,CH,EQ,C'200')                                          
     OUTREC FIELDS=(1,8,138,9,28,3,501,6,10,11,898,8,2X,2X,23,1,1X,             
                    839,8,C'N',3X)                                              
/*                                                                              
//*---------------------------------------------------------------------        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F410,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=((233,1,CH,NE,C' ',AND,                                       
                    233,1,CH,NE,C'#'),AND,                                      
                    839,3,CH,EQ,C'200')                                         
     OUTREC FIELDS=(1,8,233,9,28,3,501,6,10,11,898,8,2X,2X,23,1,1X,             
                    839,8,C'N',3X)                                              
/*                                                                              
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F410,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=((328,1,CH,NE,C' ',AND,                                       
                    328,1,CH,NE,C'#'),AND,                                      
                    839,3,CH,EQ,C'200')                                         
     OUTREC FIELDS=(1,8,328,9,28,3,501,6,10,11,898,8,2X,2X,23,1,1X,             
                    839,8,C'N',3X)                                              
/*                                                                              
//*--------------------------------------------------------------------         
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F410,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=((423,1,CH,NE,C' ',AND,                                       
                    423,1,CH,NE,C'#'),AND,                                      
                    839,3,CH,EQ,C'200')                                         
     OUTREC FIELDS=(1,8,423,9,28,3,501,6,10,11,898,8,2X,2X,23,1,1X,             
                    839,8,C'N',3X)                                              
/*                                                                              
//*---------------------------------------------------------------------        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F410,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F410SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=63)                                           
//SYSIN    DD *                                                                 
     SORT FIELDS=(9,9,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* CHECK FOR TPED CASES IN BP13K410                                            
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=BP13C724,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500SORT,DISP=(OLD,PASS)                                    
//BP13F410 DD DSN=&&F410SORT,DISP=(OLD,PASS)                                    
//P13C724A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13C724B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//*                      END OF COMPARISION OF BP13                             
//*                                                                             
//* -------------------------------------------------------------------         
//* -------------------------------------------------------------------         
//*                     START OF COMPARISION OF BP18                            
//*                                                                             
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP18.K300.MASTER,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P18F300,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=63,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(232,8,CH,NE,C'        ')                                     
     OUTREC FIELDS=(1,8,47,9,47X)                                               
/*                                                                              
//*---------------------------------------------------------------------        
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP18.K300.MASTER,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P18F300,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(232,8,CH,NE,C'        ',AND,                                 
                   67,1,CH,NE,C' ',AND,                                         
                67,1,CH,NE,C'#')                                                
     OUTREC FIELDS=(1,8,67,9,47X)                                               
/*                                                                              
//*---------------------------------------------------------------------        
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP18.K300.MASTER,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P18F300,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(232,8,CH,NE,C'        ',AND,                                 
                   87,1,CH,NE,C' ',AND,                                         
                87,1,CH,NE,C'#')                                                
     OUTREC FIELDS=(1,8,87,9,47X)                                               
/*                                                                              
//*---------------------------------------------------------------------        
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP18.K300.MASTER,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P18F300,DISP=(MOD,PASS)                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(232,8,CH,NE,C'        ',AND,                                 
                   107,1,CH,NE,C' ',AND,                                        
                107,1,CH,NE,C'#')                                               
     OUTREC FIELDS=(1,8,107,9,47X)                                              
/*                                                                              
//*---------------------------------------------------------------------        
//STEP26   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P18F300,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F300SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=63,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
     SORT FIELDS=(9,9,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* CHECK FOR BOOKED CASES IN BP18K300, EC MASTER FILE                          
//*---------------------------------------------------------------------        
//STEP27   EXEC PGM=BP13C724,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500SORT,DISP=(OLD,PASS)                                    
//BP13F410 DD DSN=&&F300SORT,DISP=(OLD,PASS)                                    
//P13C724A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13C724B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//STEP28   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K943.OCPR.BO,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F943,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=63,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
     INCLUDE COND=(156,4,CH,EQ,C'OWN ',OR,                                      
                   156,4,CH,EQ,C'CO  ')                                         
     OUTREC FIELDS=(1,17,47X)                                                   
/*                                                                              
//*---------------------------------------------------------------------        
//STEP29   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F943,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F943SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=63,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
     SORT FIELDS=(9,9,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* CHECK FOR TPED CASES IN BP13K943, EC ACCUMULATE SALE ORDER FILE             
//*---------------------------------------------------------------------        
//STEP30   EXEC PGM=BP13C724,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500SORT,DISP=(OLD,PASS)                                    
//BP13F410 DD DSN=&&F943SORT,DISP=(OLD,PASS)                                    
//P13C724A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13C724B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
/*                                                                              
