//BP13M904 JOB (BP13P),'BP13M904',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=====================================================================        
//* GENERATE REPORT ON SERS PORT APPLICATIONS                                   
//* JOB RUN ON 2ND OF EVERY MONTH                                               
//*=====================================================================        
//* CHG-NO    BY    DATE      DESCRIPTION                                       
//* --------  ----  --------  -----------------------------------------         
//* BP136454  SMR2  17102016  NEW JOB                                           
//* BP138461  AM25  14092020  ADD FTP STEP TO HDBWINFS1                         
//* BP139787  EFAQ1 27102023  CHANGE PATH OF THE REPORT FROM                    
//*                           'GROUP/EAPG/APPS/BP17/SERSOS1'                    
//*=====================================================================        
//* DELETE SEQUENTIAL FILE                                                      
//*---------------------------------------------------------------------        
//STEP00   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL ('BP13.REPORT.PORT.BP13CB16')                                          
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*=====================================================================        
//* SORT OUT SERS PORT CASES                                                    
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,20),SPACE=(CYL,(350,50),RLSE),                        
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(785,6,A,4,8,A),FORMAT=CH                                        
   INCLUDE COND=(1148,1,CH,EQ,C'Y',OR,1148,1,CH,EQ,C'P')                        
//*=====================================================================        
//* GENERATE MONTHLY REPORT TO CHECK SERS PORT CASES                            
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//BP17K000 DD DSN=BP17.K000.SCHREF,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K001 DD DSN=BP17.K000.SCHREF.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13LB16 DD DSN=BP13.REPORT.PORT.BP13CB16,DISP=(NEW,CATLG),                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
 DSN SYSTEM(DSN)                                                                
 RUN PROGRAM(BP13CB16) PLAN(BP13PCC) -                                          
     LIB('BP13.BATCH.LOADCOB')                                                  
 END                                                                            
//*--------------------------------------------------------------------         
//* FTP FILE TO ISG HDBWINFS1                                                   
//*--------------------------------------------------------------------         
//PS0900   EXEC FTP,PARM='HDBWINFS1 (EXIT',COND=(0,NE)                          
//NETRC    DD DSN=SY08.FTP.NETRC.BP17,DISP=SHR                                  
//INPUT    DD *                                                                 
CD /GROUP/SPRG/APPS/BP17/RDPOS1                                                 
ASCII                                                                           
PUT 'BP13.REPORT.PORT.BP13CB16' 'Port cases report.txt'                         
QUIT                                                                            
/*                                                                              
