//BP13A204 JOB (BP13P),'BP13A204',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*---------------------------------------------------------------------        
//* CHG REF  ON     BY    DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130857 000623 SSS   ADD GROUPID                                           
//* BP130956 010111 LMS   TO CHANGE DISP FOR K230/K240 FROM OLD TO SHR.         
//* BP131017 250501 LMS   TO REMOVE UPDATE OF K222,K230,K240.                   
//* BP132278 280303 JF4   CHGE BP13F230/F240 LRECL TO 450.                      
//* BP133610 020609 ESA1  TO REPLACE BP13K767 WITH BP13K816                     
//* BP133896 070510 ESA1  TO EXPAND SIZE OF BACKUP DATA                         
//* BP135305 170614 ESA1  TO REPLACE BP13K816 W/ BP13K813                       
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=OLD                                                         
//INPUT3   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=OLD                                                         
//INPUT4   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=OLD                                                         
//INPUT5   DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 7 - CHANGE ALLOCATION DATE                              
//*--------------------------------------------------------------------         
//STEP0A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.CDTEREC,DISP=OLD                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'CD')                                              
//*--------------------------------------------------------------------*        
//*  BACKUP VSAM FILE (BP13K270) TO SEQ FILE                                    
//*--------------------------------------------------------------------*        
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F270.BOOKPGM,                                           
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.F200.BKAPPMT.BKUP,                                      
//             DISP=OLD                                                         
//INPUT3   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR                                                         
//OUTPUT3  DD  DSN=BP13.F210.BKWKPLAN,                                          
//             DISP=OLD                                                         
//INPUT4   DD  DSN=BP13.K278.OCSBLK,                                            
//             DISP=SHR                                                         
//OUTPUT4  DD  DSN=BP13.F278.OCSBLK,                                            
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
       REPRO INFILE(INPUT1)   OUTFILE(OUTPUT1)                                  
       REPRO INFILE(INPUT2)   OUTFILE(OUTPUT2)                                  
       REPRO INFILE(INPUT3)   OUTFILE(OUTPUT3)                                  
       REPRO INFILE(INPUT4)   OUTFILE(OUTPUT4)                                  
//*--------------------------------------------------------------------*        
//*  TO BACKUP FILES BEFORE UPDATE                                              
//*--------------------------------------------------------------------*        
//STEP1A EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F200.BKAPPMT.BACKUP(+1),                                
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=300,RECFM=FB)                  
//INPUT2   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.F210.BKWKPLAN.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                  
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
/*                                                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F222.BP13A204.WRITE                                  
//*--------------------------------------------------------------------         
//STEP1B  EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F222.BP13A204.WRITE,                                    
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(1,1)),                                               
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F222.BP13A204.DELETE                                 
//*--------------------------------------------------------------------         
//STEP1C  EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F222.BP13A204.DELETE,                                   
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(1,1)),                                               
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F230.BP13A204                                        
//*--------------------------------------------------------------------         
//STEP1E  EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F230.BP13A204,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F240.BP13A204.WRITE                                  
//*--------------------------------------------------------------------         
//STEP1F  EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F240.BP13A204.WRITE,                                    
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F240.BP13A204.WRITE                                  
//*--------------------------------------------------------------------         
//STEP1G  EXEC    PGM=IEBGENER,COND=(0,NE)                                      
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F240.BP13A204.DELETE,                                   
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------                
//*   -- CHANGE ALLOCATION DATE --                                              
//*   THOSE FILES WITH ALLOCN-DATE AS KEY FIELD,                                
//*   HAVE TO DELETE REC AND CREATE WITH NEW ALLOCN-DATE                        
//*-------------------------------------------------------------                
//STEP02 EXEC    PGM=BP13C247,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.CDTEREC,                                           
//             DISP=SHR                                                         
//BP13K200 DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//P13F222W DD  DSN=BP13.F222.BP13A204.WRITE,                                    
//             DISP=SHR                                                         
//P13F222D DD  DSN=BP13.F222.BP13A204.DELETE,                                   
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,                                     
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13F230 DD  DSN=BP13.F230.BP13A204,                                          
//             DISP=SHR                                                         
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                            
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06F800 DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=OLD                                                         
//BP13L247 DD  SYSOUT=8,DEST=IOM8                                               
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* BACKUP FIS LOG FILE                                                         
//*--------------------------------------------------------------------         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F230.BP13A204,DISP=SHR                                   
//SORTOUT  DD  DSN=&&A204F230,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(7,8,A,30,27,A),FORMAT=CH                                       
    SUM FIELDS=NONE                                                             
//*-------------------------------------------------------------                
//*   -- CHANGE ALLOCATION DATE --                                              
//*   THOSE FILES WITH ALLOCN-DATE AS KEY FIELD,                                
//*   HAVE TO DELETE REC AND CREATE WITH NEW ALLOCN-DATE                        
//*-------------------------------------------------------------                
//STEP04 EXEC    PGM=BP13C218,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.CDTEREC,                                           
//             DISP=SHR                                                         
//BP13K230 DD  DSN=&&A204F230,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//P13F240W DD  DSN=BP13.F240.BP13A204.WRITE,                                    
//             DISP=SHR                                                         
//P13F240D DD  DSN=BP13.F240.BP13A204.DELETE,                                   
//             DISP=SHR                                                         
//BP13L218 DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* TO UPDATE ALLOCATION DATE IN BP13K278.                                      
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=BP13C209,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.CDTEREC,                                           
//             DISP=SHR                                                         
//BP13K278 DD  DSN=BP13.K278.OCSBLK,                                            
//             DISP=OLD                                                         
//BP13L209 DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//*     ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                         
//*-----------------------------------------------------------------            
//STEP04 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.CDTEREC,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
//*-----------------------------------------------------------------            
//* END BP13A204                                                                
//*-----------------------------------------------------------------            
