//BP13M600 JOB (BP13P),'BP13M600',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*===================================================================*         
//* M O N T H L Y   J O B                                             *         
//* PRINT "MONTHLY CONTROL LISTING FOR LIP EXPIRING WITHIN 1 MONTH"   *         
//* PRINT "MONTHLY CONTROL LISTING FOR SDS EXPIRING WITHIN 1 MONTH"   *         
//*===================================================================*         
//*===================================================================*         
//* CHG-NO   BY   ON      - DESCRIPTION                               *         
//*-------------------------------------------------------------------*         
//* BP130520 LLW 15041999 - NEW JOB.                                  *         
//* BP130799 CLT 03042000 - EXPAND BP13K640 TO 500 CHAR.              *         
//* BP130881 CLT 03072000 - INCLUDE RUNNING OF PROTECTED FLAT         *         
//*                         EXPIRY REPORTS.                           *         
//* BP130894 CLT 05102000 - INCLUDE RUNNING OF REPORT FOR HALF-IDP    *         
//*                         CASE.                                     *         
//* BP130883 CLT 27102000 - REMOVE BP13C904 AND CALL BP13C913         *         
//* BP132605 CLT 07122004 - PRINT REPORT AND SEND EMAIL FOR SDS CASE  *         
//* BP134267 JB8 22062011 - TO ADD BP13C427 & BP13S012                *         
//* BP135171 RJE 11022014 - TO CATER FOR DB2 UPGRADE                            
//* BP136164 LSB 20042016 - TO ADD SHB REPORT                                   
//* BP136477 RJB 31102016 - TO REMOVE LKH2 FROM MAILRCPT                        
//* BP136509 RJB 02112016 - TO REMOVE JL47 FROM MAILRCPT                        
//* BP136583 PCL 04012017 - TO REPLACE CYM3 BY KOK HIN AND YOKE PHENG *         
//* BP136460 KSJ 13032017 - TO EXPAND BP13F680 (1500-1600)                      
//* BP136460 CCC 02052017 - TO cater for extended allocations for               
//*                         steps 17 & 18                                       
//* BP137782 LJL 15042019 - TO change from TOH_KOK_HIN to                       
//*                         LAU_HONG_HUAT.                                      
//* BP138339 KR13 29062020 -REMOVED BP13C643 - IOM8 CONVERSION.       *         
//* BP138394 LJL 17082020 - TO BACKUP F683 MONTLY PREV FILE                     
//* BP138339 KR13 02092020 -REMOVED BP13C437 - IOM8 CONVERSION.       *         
//* BP138757 LJL 29072021 - TO change from LAU_HONG_HUAT to                     
//*                         BERNICE.                                            
//*===================================================================*         
//*                                                                             
//*-------------------------------------------------------------------*         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                  *         
//*  PRT01 : CLASS = M OR 2, COPIES = 1 ** (SALES - AGM TEAM)         *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=====================================================================        
//* REPORT ON APPLICANT ELIGIBLE SHB SCHEME                                     
//*=====================================================================        
//* SORT OUT 1,2.3-ROOM CASES                                                   
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F800SHB,DISP=(,PASS),                                       
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(120,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                (30,1,CH,EQ,C'1',OR,                                            
                 30,1,CH,EQ,C'2',OR,                                            
                 30,1,CH,EQ,C'3'))                                              
//*---------------------------------------------------------------------        
//* SOC PENDING BOOKING                                                         
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800SHB,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F800REGN,DISP=(,PASS),                                      
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(50,20),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,EQ,C'    ')                                            
//*---------------------------------------------------------------------        
//* NOT BOOK CASES                                                              
//*--------------------------------------------------------------------         
//STEP03  EXEC   PGM=BP13CF5A,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&F800REGN,DISP=(OLD,PASS)                                   
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K857 DD  DSN=BP13.K857.EMAIL,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F800A DD  DSN=BP13.LF5A.BP13CF5A.REGN,DISP=OLD,                            
//            DCB=(RECFM=FB,LRECL=800),                                         
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* BOOKED CASE AND NO SALE AGREEMENT NO TP                                     
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800SHB,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F800BK,DISP=(,PASS),                                        
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(80,20),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,NE,C'    ',AND,                                        
                459,8,CH,EQ,C'        ',AND,                                    
                475,8,CH,EQ,C'        ')                                        
//*---------------------------------------------------------------------        
//* REPORT ON BOOKED CASES                                                      
//*--------------------------------------------------------------------         
//STEP05  EXEC   PGM=BP13CF5A,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&F800BK,DISP=(OLD,PASS)                                     
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K857 DD  DSN=BP13.K857.EMAIL,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F800A DD  DSN=BP13.LF5A.BP13CF5A.BK,DISP=OLD,                              
//            DCB=(RECFM=FB,LRECL=800),                                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* BOOKED CASE AND WITH SALE AGREEMENT BUT NOT TP                              
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800SHB,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F800SA,DISP=(,PASS),                                        
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(80,20),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,NE,C'    ',AND,                                        
                459,8,CH,NE,C'        ',AND,                                    
                475,8,CH,EQ,C'        ')                                        
//*---------------------------------------------------------------------        
//* SALES AGREEMENT CASES                                                       
//*--------------------------------------------------------------------         
//STEP07  EXEC   PGM=BP13CF5A,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&F800SA,DISP=(OLD,PASS)                                     
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K857 DD  DSN=BP13.K857.EMAIL,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F800A DD  DSN=BP13.LF5A.BP13CF5A.SA,DISP=OLD,                              
//            DCB=(RECFM=FB,LRECL=800),                                         
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//*  TO SORT BP13.K800.APPLN                                          *         
//*  INCLUDE ONLY HALF-IDP = 'Y' SDS CASES                            *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13K800,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(150,20),RLSE)                                         
//SYSIN   DD *                                                                  
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=(179,1,CH,EQ,C'Y')                                            
//*                                                                             
//*-------------------------------------------------------------------*         
//*  TO PRINT REPORT FOR HALF IDP 'Y' CASES WHERE                     *         
//*  SDS 2ND PAYMENT IS TO BE DUE IN ONE MONTH OR ALREADY DUE         *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=BP13C326,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13K800,DISP=(SHR,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F326 DD DSN=&&BP13F326,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,2),RLSE),                               
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27000)                            
//BP13L326 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*  TO SORT BP13F326 BY OIC                                          *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F326,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&P13F326A,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(10,2),RLSE),                               
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27000)                            
//SYSIN   DD *                                                                  
          SORT FIELDS=(9,5,A),FORMAT=CH                                         
          INCLUDE COND=(9,5,CH,NE,C'     ')                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//*  TO CREATE EMAIL FILE                                             *         
//*-------------------------------------------------------------------*         
//STEP15   EXEC  PGM=BP13C460,COND=(0,NE)                                       
//BP13F326 DD DSN=&&P13F326A,DISP=(OLD,DELETE)                                  
//BP13MAIL DD DSN=BP13.MAILOUT.C460,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*- SORT BY REGN                                                               
//*-  1) AHG(COL 1248)/SHG(COL 1535) APPROVED DATE = NOT BLANK                  
//*-  2) AO DATE NOT BLANK (COL 451)                                            
//*-  3) BTO                                                                    
//*---------------------------------------------------------------------        
//STEP16 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD  DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT DD  DSN=&&BP13F800,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=2000)                                         
//SYSIN   DD  *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(((1248,1,CH,EQ,C'A',AND,1240,2,CH,GT,C'  '),OR,                 
                 (1535,1,CH,EQ,C'A',AND,1527,2,CH,GT,C'  ')),AND,               
                451,2,CH,GT,C'  ',AND,                                          
                924,3,CH,EQ,C'BTO')                                             
//*---------------------------------------------------------------------        
//*- SORT BY REGN                                                               
//*---------------------------------------------------------------------        
//STEP17 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD  DSN=BP13.F680.CPFBAL.BACKUP,DISP=SHR                              
//        DD  DSN=BP13.F680.CPFBAL.BACKUP.A110623,DISP=SHR                      
//SORTOUT DD  DSN=&&BP13F680,DISP=(,PASS),                                      
//            UNIT=(SYSDA,20),SPACE=(CYL,(80,20),RLSE),                         
//            DCB=(RECFM=FB,LRECL=1600)                                         
//SYSIN   DD  *                                                                 
  SORT FIELDS=(15,8,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
//*-------------------------------------------------------------------*         
//*- TO COMPARE CPF SAVING AND IDP                                              
//*-------------------------------------------------------------------*         
//STEP18   EXEC PGM=BP13C427,COND=(0,NE),REGION=6M                              
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13F680 DD DSN=&&BP13F680,DISP=(OLD,PASS)                                    
//P13F800A DD DSN=&&P13F800A,DISP=(,PASS),                                      
//            UNIT=(SYSDA,20),SPACE=(CYL,(50,20),RLSE),                         
//            DCB=(RECFM=FB,LRECL=2000)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*- TO BACKUP MONTHLY FILE                                                     
//*-------------------------------------------------------------------*         
//STEP19   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F683.CPF.BALANCE.MONTH,DISP=SHR                          
//OUTPUT1  DD DSN=BP13.F683.CPF.BALANCE.MONTH.PREV,DISP=SHR                     
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*--------------------------------------------------------------------         
//*- TO REINITIALISE  MONTHLY FILE                                              
//*--------------------------------------------------------------------         
//STEP19   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.BLANK.CHAR2000,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F683.CPF.BALANCE.MONTH,DISP=SHR                          
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-------------------------------------------------------------------*         
//*- MTHLY REPORT ON PROPORTION OF APPLICANTS USING AHG/SHG FOR IDP             
//*-------------------------------------------------------------------*         
//STEP19   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F800 DD DSN=&&P13F800A,DISP=(OLD,PASS)                                    
//BP13L012 DD DSN=&&BP13L012,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(3,2),RLSE),                                
//            DCB=(RECFM=VB,LRECL=150)                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S012),DISP=SHR                             
//*---------------------------------------------------------------------        
//* STEP20 : AUTO-GENERATE MAIL HEADER PART I                                   
//*          HELO SGPHDBX                                                       
//*          MAIL FROM:<XXXXXXXX@SGPHDBX>                                       
//*---------------------------------------------------------------------        
//STEP20   EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD SYSOUT=*                                                          
//SYSEXEC  DD DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                    
//SMTPHDR  DD DSN=&&P13MHDG,DISP=(NEW,PASS),                                    
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=259,RECFM=VB)                  
//SYSTSIN  DD DUMMY                                                             
//*---------------------------------------------------------------------        
//STEP21   EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                                 
//SYSOUT   DD SYSOUT=*                                                          
//MAILNAME DD DSN=&&MAILNAME,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=259)                                          
//MAILRCPT DD DSN=&&MAILRCPT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE),                                
//            DCB=(RECFM=VB,LRECL=259)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
    FILE MAILNAME;                                                              
    PUT @01 '           FILENAME="BP13L012.TXT"';                               
    PUT @01 ' ';                                                                
  RUN;                                                                          
                                                                                
  DATA _NULL_;                                                                  
    FILE MAILRCPT;                                                              
    PUT @01 'RCPT TO:<Bernice_JH_GAN@hdb.gov.sg>';                              
    PUT @01 'RCPT TO:<KONG_YOKE_PHENG@HDB.GOV.SG>';                             
    PUT @01 'DATA';                                                             
    PUT @01 'FROM:SOC SYSTEM - EMAIL ALERT';                                    
    PUT @01 'TO:<Bernice_JH_GAN@hdb.gov.sg>';                                   
    PUT @01 'TO:<KONG_YOKE_PHENG@HDB.GOV.SG>';                                  
    PUT @01 'SUBJECT : Monthly report on proportion of applicants using AHG/SHG 
for IDP';                                                                       
  RUN;                                                                          
//*---------------------------------------------------------------------        
//STEP22   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=*.STEP20.SMTPHDR,DISP=(OLD,DELETE)                            
//         DD DSN=&&MAILRCPT,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//         DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&MAILNAME,DISP=(OLD,DELETE)                                  
//         DD *                                                                 
//         DD DSN=&&BP13L012,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILOUT.BP13S012,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*-------------------------------------------------------------------*         
//STEP91   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.C460,DISP=SHR                                    
/*                                                                              
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*-------------------------------------------------------------------*         
//STEP92   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILOUT.BP13S012,DISP=SHR                                
/*                                                                              
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
