//BP13M503 JOB (BP13P),'BP13M503',CLASS=I,MSGCLASS=N,                           
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------              
//* JOB FOR PRINTING REPORTS ON RENOUNCIATION/DEATH OF                          
//* APPLICANTS/OCCUPIERS                                                        
//*---------------------------------------------------------------              
//* CHG-REQ  BY   DATE      REMARKS                                             
//* -------- ---  --------  -------                                             
//* BP130851 SRN  20000728  NEW JOB                                             
//* BP131021 LSB  20010601  CHG JCL TO REAF MTH-FILE                            
//* BP131021 CLT  20010606  INCREASE TEMP SPACES IN STEP 02/04                  
//* BP132887 BA2  20070611  CHANGE THE LENGTH OF BE01F516 IN STEP 02            
//*                         AND ADD INCLUDE ONLY PR CASES                       
//* BP136138 LSB  20160606  EXPAND TEMP SPACE                                   
//* BP136458 LSB  20161101  MATCH DEATH REC WITH BP13KH00,DELETE BY REG         
//*                         ADD MATHCING WITH BP13K825                          
//* BP136843 LSB  20170822  CONVERT BP13S091 TO BP13C904                        
//* BP137791 LSB  20190908  NW BORN BABY                                        
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KH00.HISTOCCP,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------              
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                              
//*---------------------------------------------------------------              
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------              
//*   SORT BP13K820 BY NRIC                                                     
//*---------------------------------------------------------------              
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F820OCCP,DISP=(,PASS),                                      
//           UNIT=(SYSDA,3),                                                    
//           DCB=(RECFM=FB,LRECL=400),                                          
//           SPACE=(CYL,(250,80),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------              
//*   SORT BP13K820 BY NRIC                                                     
//*---------------------------------------------------------------              
//STEP1A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F820OCCP,DISP=(MOD,PASS),                                   
//           UNIT=(SYSDA,3),                                                    
//           DCB=(RECFM=FB,LRECL=400),                                          
//           SPACE=(CYL,(250,80),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   OUTREC FIELDS=(1,200,200X)                                                   
   OMIT COND=(1,1,CH,EQ,C'6',AND,                                               
            122,6,CH,LT,C'201708')                                              
//*---------------------------------------------------------------              
//*   SORT BP13K820 BY NRIC                                                     
//*---------------------------------------------------------------              
//STEP1B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F820OCCP,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F820,DISP=(,PASS),                                      
//           UNIT=(SYSDA,3),                                                    
//           DCB=(RECFM=FB,LRECL=400),                                          
//           SPACE=(CYL,(250,80),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------              
//*   SORT BE01F516 BY NRIC                                                     
//*---------------------------------------------------------------              
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BE01.F516.EXT.CHGPRT.MTHTAPE(0),DISP=SHR                      
//SORTOUT  DD DSN=&&BE01F516,DISP=(,PASS),                                      
//           UNIT=(SYSDA,3),                                                    
//           DCB=(RECFM=FB,LRECL=320),                                          
//           SPACE=(CYL,(280,50),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(11,9,A),FORMAT=CH                                               
//*---------------------------------------------------------------              
//*   MATCH FILES , UPDATE MATCHED BP13F820 WITH                                
//*   BE01F516-DTE-CHG-NAT-PRSTAT                                               
//*---------------------------------------------------------------              
//STEP03   EXEC PGM=BP13C091,COND=(0,NE)                                        
//BP13F820 DD DSN=&&BP13F820,DISP=(OLD,PASS)                                    
//BE01F516 DD DSN=&&BE01F516,DISP=(OLD,PASS)                                    
//P13F820A DD DSN=&&F820REN,DISP=(,PASS),                                       
//           UNIT=(SYSDA,3),                                                    
//           DCB=(RECFM=FB,LRECL=400),                                          
//           SPACE=(CYL,(30,20),RLSE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------              
//*   SORT BE01F516 BY NRIC                                                     
//*---------------------------------------------------------------              
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BE01.F503.DEATH.MTHBKUP(0),DISP=SHR                           
//SORTOUT  DD DSN=&&BE01F503,DISP=(,PASS),                                      
//           UNIT=(SYSDA,3),                                                    
//           DCB=(RECFM=FB,LRECL=92),                                           
//           SPACE=(CYL,(180,20),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------              
//*   MATCH FILES , UPDATE MATCHED BP13F820 WITH                                
//*   BE01F516-DTE-DEATH                                                        
//*---------------------------------------------------------------              
//STEP05   EXEC PGM=BP13C092,COND=(0,NE)                                        
//BP13F820 DD DSN=&&BP13F820,DISP=(OLD,PASS)                                    
//BE01F503 DD DSN=&&BE01F503,DISP=(OLD,PASS)                                    
//P13F820A DD DSN=&&F820DTHA,DISP=(,PASS),                                      
//           UNIT=(SYSDA,3),                                                    
//           DCB=(RECFM=FB,LRECL=400),                                          
//           SPACE=(CYL,(80,30),RLSE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------              
//* TO SORT THE BE01F711 BY NRIC                                                
//*---------------------------------------------------------------              
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BE01.F711.BROAD.PERID.MTHTAPE(0),DISP=SHR                     
//SORTOUT  DD DSN=&&BE01F711,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,6),                                                   
//            DCB=(LRECL=560,RECFM=FB),                                         
//            SPACE=(CYL,(350,50),RLSE)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,9,CH,A)                                                        
//*---------------------------------------------------------------              
//*   MATCH FILES , UPDATE MATCHED BP13F820 WITH                                
//*   BE01F711-DTE-DEATH                                                        
//*---------------------------------------------------------------              
//STEP07 EXEC  PGM=BP13C093,COND=(0,NE)                                         
//BP13F820 DD  DSN=&&BP13F820,DISP=(OLD,PASS)                                   
//BE01F711 DD  DSN=&&BE01F711,DISP=(OLD,PASS)                                   
//P13F820A DD  DSN=&&F820DTHB,DISP=(,PASS),                                     
//           UNIT=(SYSDA,3),                                                    
//           DCB=(RECFM=FB,LRECL=400),                                          
//           SPACE=(CYL,(80,30),RLSE)                                           
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------              
//* PRINT REPORT                                                                
//*---------------------------------------------------------------              
//STEP08 EXEC SORT,COND=(0,NE)                                                  
//SORTIN  DD DSN=&&F820REN,DISP=(OLD,PASS)                                      
//        DD DSN=&&F820DTHA,DISP=(OLD,PASS)                                     
//        DD DSN=&&F820DTHB,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=&&P13F820A,DISP=(,PASS),                                       
//          DCB=(LRECL=400,DSORG=PS,RECFM=FB,BLKSIZE=0),                        
//          SPACE=(CYL,(50,30),RLSE)                                            
//SYSOUT DD SYSOUT=*                                                            
//SYSIN DD *                                                                    
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------              
//* PRINT REPORT ON RENOUNCIATION/DEATH OF APPLICANTS/OCCUPIERS                 
//*---------------------------------------------------------------              
//STEP09 EXEC  PGM=BP13C904,COND=(0,NE)                                         
//BP13F820 DD DSN=&&P13F820A,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=23')                                                     
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//P13L904A DD DSN=BP13.L904A.BP13C904,DISP=OLD                                  
//P13L904B DD DSN=BP13.L904B.BP13C904,DISP=OLD                                  
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------    00000150
//*  REPRO VSAM FILE TO CARTRIDGE                                       00000160
//*-----------------------------------------------------------------    00000170
//STEP10 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00000180
//SYSPRINT DD  SYSOUT=*                                                 00000190
//INPUT1   DD  DSN=BP13.KH00.HISTOCCP,DISP=SHR,                         00000200
//         AMP=('BUFND=23')                                             00000220
//OUTPUT1  DD  DSN=BP13.FH00.HISTOCCP.BKUP(+1),                         00000230
//             DISP=(NEW,CATLG),                                        00000240
//             UNIT=CART,                                               00000250
//             LABEL=(1,SL),                                            00000260
//             DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)          00000270
//*                                                                     00000280
//SYSIN    DD  *                                                        00000540
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//* SORT BP13KH10 BY NRIC - OUTREC REGN/NRIC                                    
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KH00.HISTOCCP,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F820FH00,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3,),                                                     
//         DCB=(RECFM=FB,LRECL=400),                                            
//         SPACE=(CYL,(200,120),RLSE)                                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(9,9,A),FORMAT=CH                                                 
  OUTREC FIELDS=(1,17,383X)                                                     
//*---------------------------------------------------------------              
//*   MATCH FILES , UPDATE MATCHED BP13F820 WITH                                
//*   BE01F516-DTE-DEATH                                                        
//*---------------------------------------------------------------              
//STEP12   EXEC PGM=BP13C092,COND=(0,NE)                                        
//BP13F820 DD DSN=&&F820FH00,DISP=(OLD,PASS)                                    
//BE01F503 DD DSN=&&BE01F503,DISP=(OLD,PASS)                                    
//P13F820A DD DSN=&&F820CDB,DISP=(,PASS),                                       
//           UNIT=(SYSDA,3),                                                    
//           DCB=(RECFM=FB,LRECL=400),                                          
//           SPACE=(CYL,(80,30),RLSE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BP13F820 BY - REGN/NRIC                                                
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F410.MTHSO.BKUP,DISP=SHR                                 
//SORTOUT  DD DSN=&&F820CDB,DISP=(MOD,PASS),                                    
//         UNIT=(SYSDA,3,),                                                     
//         DCB=(RECFM=FB,LRECL=400),                                            
//         SPACE=(CYL,(200,120),RLSE)                                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  OUTREC FIELDS=(1,8,138,9,79X,855,8,296X)                                      
//*---------------------------------------------------------------------        
//* OUTREC KEY-ISSUED-CASES TO DELETE RECORD IN BP13KH00                        
//*---------------------------------------------------------------------        
//STEP13A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F820CDB,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F820C09B,DISP=(,PASS),                                      
//         UNIT=(SYSDA,3,),                                                     
//         DCB=(RECFM=FB,LRECL=400),                                            
//         SPACE=(CYL,(200,120),RLSE)                                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
//*---------------------------------------------------------------              
//* IF BP13FH00 MATCH WITH CDB DEATH RECORD                                     
//* DELETE THE WHOLE CASE BY REGN-NO                                            
//*---------------------------------------------------------------              
//STEP14   EXEC PGM=BP13C09B,COND=(0,NE)                                        
//BP13F820 DD DSN=&&F820C09B,DISP=(OLD,PASS)                                    
//BP13KH00 DD DSN=BP13.KH00.HISTOCCP,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD DSN=BP13.L09B.REPORT,DISP=OLD                                     
//*---------------------------------------------------------------------        
//* SORT NEW BORN BABY NRIC FROM CDB BROADCAST FILE                             
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BE01.F502.BIRTH.MTHBKUP(0),DISP=SHR                           
//SORTOUT  DD DSN=&&BE01F502,DISP=(,PASS),                                      
//        DCB=(RECFM=FB,LRECL=511,BLKSIZE=27594),                               
//        SPACE=(CYL,(150,30),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,12,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* MATCH AND GENERATE REPORT IF FOUND NEW BORN BABY                            
//*-----------------------------------------------------------------            
//STEP16  EXEC PGM=BP13C50D,COND=(0,NE)                                         
//BE01F502 DD DSN=&&BE01F502,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13F50D DD DSN=&&BP13F50D,DISP=(,PASS),                                      
//         SPACE=(CYL,(5,3),RLSE),                                              
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*  SORT BY OIC AND REGN NO                                                    
//*-----------------------------------------------------------------            
//STEP17   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F50D,DISP=(OLD,DELETE)                                 
//SORTOUT  DD  DSN=&&BP13F5SR,DISP=(,PASS),                                     
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,5,A,1,8,A),FORMAT=CH                                          
//*-----------------------------------------------------------------            
//* FORMAT EMAIL REPORT - NEW BORN                                              
//*-----------------------------------------------------------------            
//STEP18  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                
//BP13F50D DD DSN=&&BP13F5SR,DISP=(OLD,PASS)                                    
//P13LC50E DD DSN=BP13.MAILRPT.BP13L50E,DISP=SHR                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C50E) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL (P13LC50E)                                            
//*-----------------------------------------------------------------            
//STEP19   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L50E,DISP=SHR                                
/*                                                                              
//*---------------------------------------------------------------              
//* FORMAT EMAIL FOR DEATH-CASES AND PR RENUNCIATION                            
//* SORT FILES BY POST OIC, PRE OIC AND REGN AND REMOVE HEADERS                 
//*---------------------------------------------------------------              
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.L904A.BP13C904,DISP=SHR                                  
//         DD DSN=BP13.L904B.BP13C904,DISP=SHR                                  
//SORTOUT  DD DSN=&&BP13L9SR,DISP=(,PASS),                                      
//            SPACE=(CYL,(8,5),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(232,8,A,193,7,A,9,8,A),FORMAT=CH                               
    INCLUDE COND=(1,7,CH,NE,C'S/NO.  ')                                         
//*-----------------------------------------------------------------            
//*   FORMAT EMAIL REPORT ON DEATH-CASES AND PR RENUNCIATION                    
//*-----------------------------------------------------------------            
//STEP21  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                
//P13L904S DD DSN=&&BP13L9SR,DISP=(OLD,DELETE)                                  
//P13L904M DD DSN=BP13.MAILRPT.BP13L904,DISP=OLD                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C50G) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
//*                                                                             
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL (P13L904B)                                            
//*-----------------------------------------------------------------            
//STEP22   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L904,DISP=SHR                                
/*                                                                              
