//BP13A234 JOB (BP13P),'BP13A234',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* CHG REQ  DATE     BY   DESCRIPTION                                          
//* -------- -------- ---  -----------                                          
//* BP132180 20020826 JAM1 PRINT REPORT ON REJECTED FLATS UNDER WIS             
//* BP135171 20140210 RJE1 TO CATER FOR DB2 UPGRADE                             
//*=================================================================            
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K248.FLAT.REJECT,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
/*                                                                              
//******************************************************************    00000130
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT          00000140
//*  DATASET, SINGLE COPY                                               00000150
//*-----------------------------------------------------------------    00000160
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                               00000170
//SYSUT1   DD  *                                                        00000180
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                             00000190
//SYSUT2   DD  SYSOUT=2,                                                00000200
//             OUTPUT=(*.FORMID)                                        00000210
//SYSPRINT DD  SYSOUT=*                                                 00000220
//SYSIN    DD  DUMMY                                                    00000230
//*-----------------------------------------------------------------    00000350
//* SORT OUT THE CONTROL REC FOR THIS OPTION                            00000360
//*-----------------------------------------------------------------    00000370
//STEP00 EXEC    SORT,COND=(0,NE)                                       00000380
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                    00000390
//             DISP=SHR                                                 00000400
//SORTOUT  DD  DSN=BP13.F205.REJREC,                                    00000410
//             DISP=OLD                                                 00000420
//SYSIN    DD  *                                                        00000430
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'RJ')                                              
/*                                                                      00000440
//*---------------------------------------------------------------------        
//* TO PRINT ESTATES, UNITS WITH ALLOCATION TAG = Z                             
//*---------------------------------------------------------------------        
//STEP01   EXEC  PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205  DD DSN=BP13.F205.REJREC,DISP=SHR                                    
//BP13K270  DD DSN=BP13.K270.BOOKPGM,DISP=SHR                                   
//BM06K110  DD DSN=BM06.K110.FLATINV,DISP=SHR                                   
//BM06K111  DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                             
//BM06K510  DD DSN=BM06.K510.ESTCDE,DISP=SHR                                    
//BP13K248  DD DSN=BP13.K248.FLAT.REJECT,DISP=SHR                               
//BP13L276 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C276) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------    00002130
//* ACCUM CONTROL REC                                                   00002140
//*-----------------------------------------------------------------    00002150
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                 00002160
//SYSPRINT DD  SYSOUT=*                                                 00002170
//INPUT1   DD  DSN=BP13.F205.REJREC,                                    00002180
//             DISP=SHR                                                 00002190
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                     00002200
//             DISP=MOD                                                 00002210
//SYSIN    DD  *                                                        00002220
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                      00002230
//*-----------------------------------------------------------------    00002610
//* END OF BP13A234                                                     00002620
//*=================================================================    00002630
