//BP13Q202 JOB (BP13P),'RUN03F',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),              
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*---------------------------------------------------------------------        
//* PASS SPR NRIC TO NRO FOR OVERSEA PROPERTY SEARCH                            
//* DATA WILL BE SENT TO CDB SYSTEM TO MHA                                      
//*---------------------------------------------------------------------        
//*-CHG-NO   BY   ON                                                            
//*--------------------------------------                                       
//* BP134194 LSB 290413 - NEW JOB                                               
//*---------------------------------------------------------------------        
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F310.TRANS.BKUP(0),DISP=SHR                               
//        DD DSN=BP13.F310.TRANS.BKUP(-1),DISP=SHR                              
//        DD DSN=BP13.F310.TRANS.BKUP(-2),DISP=SHR                              
//SORTOUT DD DSN=&&BP13F310,DISP=(,PASS),                                       
//        DCB=(RECFM=FB,LRECL=150),                                             
//        SPACE=(CYL,(50,10),RLSE)                                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
   INCLUDE COND=(9,2,CH,EQ,C'AI',OR,                                            
                 9,2,CH,EQ,C'AS')                                               
//*---------------------------------------------------------------------        
//* SORT SPR NRIC                                                               
//*---------------------------------------------------------------------        
//STEP02  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT DD DSN=&&BP13F820,DISP=(,PASS),                                       
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=400),                                             
//        SPACE=(CYL,(180,50),RLSE)                                             
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(105,2,CH,EQ,C'20')                                             
//*---------------------------------------------------------------------        
//* FORMAT RECORD TO CDB FOR MATCHING WITHG MHA, NRO                            
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13C03F,COND=(0,NE)                                        
//BP13F310 DD DSN=&&BP13F310,DISP=(OLD,PASS)                                    
//BP13F820 DD DSN=&&BP13F820,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR,                                       
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F219 DD DSN=BP13.F219.SPRNRO,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
