//BP13AMGP JOB (BP13P),'BP13AMGP',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//*    --- MATURE NEW TOWN ----                                    *            
//*    PIGEONHOLING OF PRIORITY REQUEST - MTF/TCP/REN/RH           *            
//*                                                                *            
//*    NOT THE DIFFERENCE                                          *            
//*    - TENDER PROGRAM ONLY HAVE NEW FLAT SUPPLY                  *            
//*    - SORT OUT ONLY PRIORITY CASES FOR PIGEONHOLING             *            
//*    - AFTER PIGEONHOLING, ALLOW UNSUCC PRIORITY CASES TO        *            
//*      JOIN PUBLIC SCHEME IN TRAN, NHH, COHORT PIGEONHOLING      *            
//*    - PRINT SUMMARY RESULT ON PRIORITY CASES                    *            
//*                                                                *            
//*================================================================*            
//* CHG REF  BY  ON      DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP134483 IL5 050412  NEW JCL TO PIGEONHOLE MGPS                             
//* BP134718 SMR 041212  CREATE DATASET FOR UNSUCCESSFUL MGPS                   
//* BP134903 SMR 260413  INCLUDE BP13S569                                       
//* BP135170 SMR 031213  CATER FOR NEW REQUIRMENTS OF PAIRED CASES              
//* BP135636 SMR 040315  OMIT GRO CASES                                         
//* BP135708 SMR 310315  CHANGE CLASS=2 TO CLASS=J                              
//* BP136055 IL5 171215  CATER FOR 2F FLAT TYPE                                 
//* BP136107 SMR 170216  ACCEPT PARAMETER FROM JCL IN BP13C525                  
//* BP138076 IL5 220319  STOP RUN BP13CF42                                      
//* BP138301 AM2 140520  HARDCOPY REPORTS CONVERSION                            
//* BP138500 AM2 060121  INCLUDE BP13S574                                       
//******************************************************************            
//* STEP    DESCRIPTION                                                         
//* ----    -----------                                                         
//* 00-01   LASER PRINTER JCL                                                   
//* 02 - 03 = BACKUP TENDER AND BALLOT FILE                                     
//* 04      = SORTING OUT REQUESTS FOR SEPARATE ROUND OF                        
//*                PIGEONHOLING, OUTPUT PRIORITY CASES ONLY                     
//* 05 - 06 = PRINT FLAT SUPPLY REPORT BF PIGEONHOLING                          
//* 07 - 08 = PROCESS PIGEONHOLING(BP13U534 PRIORITY ONLY)                      
//* 09 - 10 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING                          
//* 11      = MATCH RELEVANT REQUEST TO GET SUCC & UNSUCC                       
//*                BALLOT RESULT FOR PRINT REPORT                               
//* 12      = PRINT SUCC/UNSUCC REQUEST REPOR BP13L522                          
//* 13      = BACKUP TENDER FILE                                                
//*                                                                             
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN >>>> FOR MCPS                              
//*-----------------------------------------------------------------            
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.AMGP,DISP=OLD                                
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F740.MATUREBA.AMGP,DISP=OLD                              
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-------------------------------------------------------------------          
//* ADJUST MAX-PA-CAT1/CAT2/CAT3 AFTER PIGEONHOLING OF GRO                      
//*--------------------------------------------------------------------         
//*STEP01   EXEC PGM=BP13CF42,COND=(0,NE)                                       
//*BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                    
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* CREATE DUPLICATE RECORDS FOR MGPS APPLICATION AND CHG TO PA                 
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=BP13C08A,COND=(0,NE)                                        
//BP13F740 DD DSN=BP13.F740.MATUREBA.MGP,DISP=SHR                               
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//P13F740A DD DSN=BP13.F740.MATUREBA.MGPSPA,DISP=OLD                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* ASSIGN SMALLER RANDOM # TO LARGER RANDOM # FOR PAIRED CASES                 
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13CF14,COND=(0,NE)                                        
//BP13F740 DD DSN=BP13.F740.MATUREBA.MGP,DISP=SHR                               
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//BP13K741 DD DSN=BP13.K740.MATUREBA.PATH1,DISP=SHR                             
//P13F740A DD DSN=BP13.F740.MATUREBA.MGP.RANDUPD,DISP=OLD                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT THE PRIORITY REQUEST BY RANDOM NO - PARENT ONLY                    
//* F740.MATURERQ.PRIO CREATED IN BP13ACC4                                      
//*---------------------------------------------------------------------        
//STEP04  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.MGP.RANDUPD,DISP=SHR                        
//SORTOUT DD DSN=&&F740PRIO,DISP=(NEW,PASS),                                    
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                               
//        SPACE=(CYL,(80,5),RLSE)                                               
//SYSIN   DD  *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
    INCLUDE COND=(245,1,CH,EQ,C'P')                                             
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR PRIORITY CASES - PARENT ONLY              
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13U534,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F520 DD DSN=&&F740PRIO,DISP=(OLD,DELETE)                                  
//BP13K520 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L534 DD SYSOUT=8,DEST=IOM8                                                
//P13L534A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,4,2,CH,EQ,C'4P',OR,                                   
       4,2,CH,EQ,C'5 ',OR,4,2,CH,EQ,C'5P')                                      
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C524,COND=(0,NE)                                        
//BP13F010 DD DSN=&&K010AFN,DISP=(OLD,DELETE)                                   
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L524 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 1,2,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFR,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C524,COND=(0,NE)                                        
//BP13F010 DD DSN=&&K010AFR,DISP=(OLD,DELETE)                                   
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L524 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* ADD MAX-PA-CAT1/CAT2/CAT3 TO MAX-JB-CAT1/CAT2/CAT3                          
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13CF26,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT SUCCESSFUL MGPS - PARENT ONLY                                      
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F740P,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(80,5),RLSE)                                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   INCLUDE COND=(226,3,CH,NE,C'   ',AND,245,1,CH,EQ,C'P',AND,                   
                 213,3,CH,NE,C'GRO')                                            
//*---------------------------------------------------------------------        
//* SORT BY RANDOM # - CHILD ONLY                                               
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.MGP.RANDUPD,DISP=SHR                       
//SORTOUT  DD DSN=&&P13F740C,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(80,5),RLSE)                                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
   INCLUDE COND=(245,1,CH,EQ,C'C')                                              
//*------------------------------------------------------------------           
//* MATCH BY RANDOM # - MGPS CHILD CASES TO BE SHORTLISTED                      
//*------------------------------------------------------------------           
//STEP13A  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&P13F740C,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=&&P13F740P,DISP=(OLD,DELETE)                                  
//MATCH    DD DSN=&&F740MTCH,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(80,5),RLSE)                                              
//SYSIN    DD *                                                                 
  JOINKEYS FILE=F1,FIELDS=(1,27,A)                                              
  JOINKEYS FILE=F2,FIELDS=(1,27,A)                                              
  REFORMAT FIELDS=(F1:1,500)                                                    
  OUTFILE FNAMES=MATCH                                                          
  SORT FIELDS=(1,28,A),FORMAT=CH                                                
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* OMIT DUPLICATE RECORDS                                                      
//*---------------------------------------------------------------------        
//STEP13B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740MTCH,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F740NDUP,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(80,5),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,500,A),FORMAT=CH                                               
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR PRIORITY CASES - CHILD ONLY               
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=BP13U534,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F520 DD DSN=&&F740NDUP,DISP=(OLD,DELETE)                                  
//BP13K520 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=MOD                                       
//BP13L534 DD SYSOUT=8,DEST=IOM8                                                
//P13L534A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,4,2,CH,EQ,C'4P',OR,                                   
       4,2,CH,EQ,C'5 ',OR,4,2,CH,EQ,C'5P')                                      
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP16   EXEC PGM=BP13C524,COND=(0,NE)                                        
//BP13F010 DD DSN=&&K010AFN,DISP=(OLD,DELETE)                                   
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L524 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 1,2,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFR,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=BP13C524,COND=(0,NE)                                        
//BP13F010 DD DSN=&&K010AFR,DISP=(OLD,DELETE)                                   
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L524 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* CREATE DATASET FOR UNSUCCESSFUL MGPS                                        
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.MGP.UNSUCC,DISP=OLD                        
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,(245,1,CH,EQ,C'P',OR,                   
                 245,1,CH,EQ,C'C'))                                             
//*-----------------------------------------------------------------            
//* SORT MGPS APPLICATIONS                                                      
//*-----------------------------------------------------------------            
//STEP19A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F740MGPS,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(25,25),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(245,1,CH,NE,C' ',AND,213,3,CH,NE,C'GRO')                       
   SUM FIELDS=NONE                                                              
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR SUCC/UNSUCC MGPS APPLICATIONS                              
//*-----------------------------------------------------------------            
//STEP19B  EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740MGPS,DISP=(OLD,DELETE)                                  
//BP13L574 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S574),DISP=SHR                             
//*-----------------------------------------------------------------            
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//OUTPUT1  DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  REPRO PA RECORDS                                                           
//*-----------------------------------------------------------------            
//STEP21   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F740.MATUREBA.MGPSPA,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740C525,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION FORM FOR COUNTER AND MAIL CASES                           
//* 3 DIFFERENT LETTERS DEPENDING ON MCPS OPTION                                
//*------------------------------------------------------------------           
//STEP23   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740C525,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
AL3                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* INCLUDE SUCC CASES                                                          
//*-----------------------------------------------------------------            
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(25,25),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=(226,3,CH,NE,C'   ')                                            
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR PPS & NON-PPS APPLICANTS                                   
//*-----------------------------------------------------------------            
//STEP25   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,DELETE)                                  
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*--------------------------------------------------------------------         
//* END BP13AMGP                                                                
//*--------------------------------------------------------------------         
