//BP13WBK2 JOB (BP13P),'BP13WBK2',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//*--------------------------------------------------------------------------   
//* BP130487 SSS 19980507 - CHG UNIT=3480 TO UNIT=CART                          
//* BP130418 SIA 19980923 - Y2K COMPLIANCE CHANGES                              
//* BP132783 SSS 20051121 - DEL CHCKZERO                                        
//*--------------------------------------------------------------------------   
//* BACKUP OF RFF MASTER - 2 GDG                                                
//*--------------------------------------------------------------------------   
//STEP1     EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=13')                                                 
//OUTPUT1   DD DSN=BP13.F020.MASTER.WEEK(+1),                                   
//             DISP=(NEW,CATLG,DELETE),                                         
//             UNIT=CART,LABEL=(,SL),                                           
//             DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)                 
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*---------------------------------------------------------------------        
//*  CATALOG GDG                                                                
//*---------------------------------------------------------------------        
//STEP2     EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT2    DD DSN=BP13.F020.MASTER.WEEK(+1),DISP=(OLD,CATLG),                  
//             UNIT=(,,DEFER)                                                   
//*--------------------------------------------------------------------------   
