//BP13M130  JOB (BP13P),'BP13M130',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*================================================================*            
//*                                                                *            
//*     MONTHLY JOB TO PRINT REPORT ON GRANT RECOVERY              *            
//*                                                                *            
//*================================================================*            
//* CHG REF  BY   ON        DESCRIPTION                            *            
//* -------- ---  ------    -----------                                         
//* BP135812 KSJ3 20170306  UPDATE STEP13 SORT COND TO INCL CANCEL DATE         
//* BP136694 PCL4 20170421  TO CATER FOR BP13KC80                  *            
//* BP136254 MRN1 20171212  TO REMOVE BP13KD05 FROM BP13CE11 STEP14*            
//* BP136254 RJB1 20171226  TO ADD STEP12A TO FILTER CASES IN F800 *            
//* BP136448 LJL1 20180601  TO CATER FOR CURRENT FINANCIAL YEAR    *            
//* BP138113 KTM3 20191204  TO CATER FOR EHG & REGN STARTING WITH 4*            
//*=================================================================            
//*---------------------------------------------------------------------        
//* SORT BP13K130 FOR CURRENT FINANCIAL YEAR                                    
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K130.SOCHIST,DISP=SHR                                    
//SORTOUT  DD DSN=&&F130FNYR,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(20,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(5,19,A),FORMAT=CH                                                
  INCLUDE COND=(91,8,CH,GE,C'20190401',AND,                                     
               (99,3,CH,EQ,C'AHG',OR,                                           
                99,3,CH,EQ,C'SHG',OR,                                           
                99,3,CH,EQ,C'SUG',OR,                                           
                99,3,CH,EQ,C'EHG',OR,                                           
                99,3,CH,EQ,C'HGT'),AND,                                         
               (05,1,CH,EQ,C'1',OR,                                             
                05,1,CH,EQ,C'2',OR,                                             
                05,1,CH,EQ,C'3',OR,                                             
                05,1,CH,EQ,C'4'))                                               
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BP13K130 FOR 2006 FIN YEAR AND ONWARDS                                 
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K130.SOCHIST,DISP=SHR                                    
//SORTOUT  DD DSN=&&F130YR06,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(20,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(5,19,A),FORMAT=CH                                                
  INCLUDE COND=(91,8,CH,GE,C'20060401',AND,                                     
               (99,3,CH,EQ,C'AHG',OR,                                           
                99,3,CH,EQ,C'SHG',OR,                                           
                99,3,CH,EQ,C'SUG',OR,                                           
                99,3,CH,EQ,C'EHG',OR,                                           
                99,3,CH,EQ,C'HGT'),AND,                                         
               (05,1,CH,EQ,C'1',OR,                                             
                05,1,CH,EQ,C'2',OR,                                             
                05,1,CH,EQ,C'3',OR,                                             
                05,1,CH,EQ,C'4'))                                               
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT ACCUM SO FOR CURRENT FINANCIAL YEAR                                    
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//SORTOUT  DD DSN=&&F410FNYR,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(45,20),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(855,8,CH,GE,C'20190401',AND,                                    
                855,8,CH,LT,C'20200401')                                        
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT OUT AO DATE AND BK REFUND                                              
//* 185  - K800-DTE-CANCEL                                                      
//* 1232 - K800-DTE-AHG-REQ                                                     
//* 1240 - K800-DTE-AHG-PROCESS                                                 
//* 1248 - K800-NUM-AHG-STATUS                                                  
//* 1250 - K800-DTE-AHG-PAYMENT                                                 
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=BP13.F800.CANCEL.AHG,DISP=OLD                                 
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=((155,8,CH,LE,C'        ',AND,                                   
                 185,8,CH,GE,C'20060101'),AND,                                  
              ((1240,4,CH,GT,C'2002'),OR,                                       
               (1250,2,CH,GT,C'00'),OR,                                         
               (1248,1,CH,GT,C'0'),OR,                                          
               (1232,4,CH,GT,C'2002')))                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT OUT AO DATE AND BK REFUND                                              
//* 185  - K893-DTE-CANCEL                                                      
//* 1232 - K893-DTE-AHG-REQ                                                     
//* 1240 - K893-DTE-AHG-PROCESS                                                 
//* 1248 - K893-NUM-AHG-STATUS                                                  
//* 1250 - K893-DTE-AHG-PAYMENT                                                 
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=BP13.F800.CANCEL.AHG,DISP=MOD                                 
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=((155,8,CH,LE,C'        ',AND,                                   
                 185,8,CH,GE,C'20060101'),AND,                                  
              ((1240,4,CH,GT,C'2002'),OR,                                       
               (1250,2,CH,GT,C'00'),OR,                                         
               (1248,1,CH,GT,C'0'),OR,                                          
               (1232,4,CH,GT,C'2002')))                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* REDEFINE BP13.K410.KEYISS                                                   
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&F410FNYR,DISP=(OLD,DELETE)                                  
//SYSIN    DD *                                                                 
         DEL (BP13.K410.KEYISS) CL PURGE                                        
         DEF CL   (NAME(BP13.K410.KEYISS)               -                       
                   CYL(10 10)                           -                       
                   DATACLAS(MULTIVOL)                   -                       
                   UNIQUE                               -                       
                   STORCLAS(PRODRLS)                    -                       
                   LOG(NONE)                            -                       
                   SPEED                                -                       
                   SHR(2 3))                            -                       
             DATA (NAME(BP13.K410.KEYISS.DATA)          -                       
                   KEYS(8 0)                            -                       
                   RECSZ(2000 2000)                     -                       
                   FSPC(20 20)                          -                       
                   CISZ(4096))                          -                       
             INDEX(NAME(BP13.K410.KEYISS.INDEX)         -                       
                   CISZ(4096))                                                  
         IF LASTCC = 0 THEN                             -                       
            REPRO IFILE(INPUT)                          -                       
                  ODS(BP13.K410.KEYISS)                                         
         IF MAXCC = 0  THEN                             -                       
            DEF AIX  (NAME(BP13.K410.KEYISS.ALTX)       -                       
                      REL(BP13.K410.KEYISS)             -                       
                      KEYS(9 137)                       -                       
                      BUFSP(25088)                      -                       
                      SHR(2 3)                          -                       
                      NUNQK)                            -                       
                DATA (NAME(BP13.K410.KEYISS.ALTX.DATA)  -                       
                      CYL(50 25)                        -                       
                      RECSZ(23 213)                     -                       
                      FSPC(15 15)                       -                       
                      CISZ(4096))                       -                       
                INDEX(NAME(BP13.K410.KEYISS.ALTX.INDEX) -                       
                      CISZ(4096))                                               
         IF MAXCC = 0 THEN                              -                       
            DEF PATH(NAME(BP13.K410.KEYISS.PATH)        -                       
                PENT(BP13.K410.KEYISS.ALTX))                                    
         IF MAXCC = 0 THEN                              -                       
            BIX IDS(BP13.K410.KEYISS)                   -                       
                ODS(BP13.K410.KEYISS.ALTX)                                      
//*                                                                             
//*-----------------------------------------------------------------            
//* MATCH F130 RECORDS (FOR FIN YEAR) TO SOC MASTER                             
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=BP13CA51,COND=(0,NE)                                        
//BP13F130 DD DSN=&&F130FNYR,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR                                   
//BP13F13A DD DSN=BP13.F130.AHG.DP.SCHACCT,DISP=OLD                             
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY REGN AND TRANSACTION DATE                                           
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F130.AHG.DP.SCHACCT,DISP=SHR                             
//SORTOUT  DD DSN=&&BP13F130,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(20,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(5,8,A,91,8,A),FORMAT=CH                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* PRINT DETAIL INFO ON REGISTRATION FEE RECEIVED                              
//*---------------------------------------------------------------------        
//STEP09   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13F130 DD DSN=&&BP13F130,DISP=(OLD,PASS)                                    
//FT12F001 DD DSN=BP13.REPORT.M130.SCHACCT,DISP=OLD                             
//SYSIN    DD *                                                                 
  *------------------------------------------------------------------*          
  | PRINT DETAIL INFO ON REGISTRATION FEE RECEIVED                   |          
  *------------------------------------------------------------------*;         
   %GLOBAL  DATE ;                                                              
  OPTIONS  NODATE NONUMBER;                                                     
  DATA BP13F130 ;                                                               
     INFILE BP13F130;                                                           
     INPUT  @1   TYPE    $CHAR2.                                                
            @5   REGN    $CHAR8.                                                
            @13  DTE_POST $CHAR8.                                               
            @25  NRIC     $CHAR9.                                               
            @66  RECPTNO $CHAR14.                                               
            @81  AMOUNT  ZD9.2                                                  
            @90  AMT_TYP $CHAR1.                                                
            @91  DTE_TRN $CHAR8.                                                
            @99  PAY_TYP $CHAR3.                                                
            @102 SCHACC  $CHAR11.                                               
            @113 ERROR   $CHAR1.                                                
            @135 CPF     $CHAR9.;                                               
                                                                                
                                                                                
  DO;                                                                           
    CUR_DTE=PUT(TODAY(),DDMMYY10.);                                             
    CALL SYMPUT('DATE',CUR_DTE);                                                
  END;                                                                          
                                                                                
  PROC SORT; BY  REGN DTE_TRN;                                                  
  PROC PRINT;                                                                   
TITLE1 "PRTF130             S Y S T E M   O F   C O M M I T M E N T          "; 
TITLE2 "    AHG FOR APR 2019 TO MAR  2020       DATE : &DATE  PAGE  :        "; 
                                                                                
//*                                                                             
//*-----------------------------------------------------------------            
//* MATCH BP13F130 (FROM 2006) TO SORTED ACCUMSO                                
//*-----------------------------------------------------------------            
//STEP10   EXEC PGM=BP13CA52,COND=(0,NE)                                        
//BP13F130 DD DSN=&&F130YR06,DISP=(OLD,DELETE)                                  
//BP13K410 DD DSN=BP13.K410.KEYISS,DISP=SHR                                     
//BP13F13A DD DSN=BP13.F130.AHG.DP.KEYISS,DISP=OLD                              
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY REGN AND TRANSACTION DATE                                           
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F130.AHG.DP.KEYISS,DISP=SHR                              
//SORTOUT  DD DSN=&&BP13F131,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(5,8,A,91,8,A),FORMAT=CH                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* PRINT DETAIL INFO ON REGISTRATION FEE RECEIVED                              
//*---------------------------------------------------------------------        
//STEP12   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13F130 DD DSN=&&BP13F131,DISP=(OLD,PASS)                                    
//FT12F001 DD DSN=BP13.REPORT.M130.KEYISS,DISP=OLD                              
//SYSIN    DD *                                                                 
  *------------------------------------------------------------------*          
  | PRINT DETAIL INFO ON REGISTRATION FEE RECEIVED                   |          
  *------------------------------------------------------------------*;         
   %GLOBAL  DATE ;                                                              
  OPTIONS  NODATE NONUMBER;                                                     
  DATA BP13F130 ;                                                               
     INFILE BP13F130;                                                           
     INPUT  @1   TYPE    $CHAR2.                                                
            @5   REGN    $CHAR8.                                                
            @13  DTE_POST $CHAR8.                                               
            @25  NRIC     $CHAR9.                                               
            @66  RECPTNO $CHAR14.                                               
            @81  AMOUNT  ZD9.2                                                  
            @90  AMT_TYP $CHAR1.                                                
            @91  DTE_TRN $CHAR8.                                                
            @99  PAY_TYP $CHAR3.                                                
            @102 SCHACC  $CHAR11.                                               
            @113 ERROR   $CHAR1.                                                
            @122 KEY_ISS $CHAR8.                                                
            @135 CPF     $CHAR9.;                                               
                                                                                
                                                                                
  DO;                                                                           
    CUR_DTE=PUT(TODAY(),DDMMYY10.);                                             
    CALL SYMPUT('DATE',CUR_DTE);                                                
  END;                                                                          
                                                                                
  PROC SORT; BY  REGN DTE_TRN;                                                  
  PROC PRINT;                                                                   
TITLE1 "PRTF130             S Y S T E M   O F   C O M M I T M E N T          "; 
TITLE2 "    AHG FOR KEY ISSUE CASES IN FY 2019     DATE : &DATE  PAGE  :     "; 
                                                                                
//*                                                                             
//*---------------------------------------------------------------------        
//* TO MATCH BP13F800 WITH BP13K410. RECORDS NOT FOUND IN BP13K410 ARE          
//* LISTED INTO THE OUTPUT.                                                     
//*---------------------------------------------------------------------        
//STEP12A  EXEC PGM=BP13C41K,COND=(0,NE)                                        
//BP13F800 DD DSN=BP13.F800.CANCEL.AHG,DISP=SHR                                 
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//P13F800A DD DSN=BP13.F800.CANCEL.AHG.SRT,DISP=SHR                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT NON-DBSS CASES ONLY                                                    
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F800.CANCEL.AHG.SRT,DISP=SHR                             
//SORTOUT  DD DSN=BP13.F800.CANCEL.AHG.NONDBSS,DISP=OLD                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(185,8,A,4,8,A),FORMAT=CH                                         
  INCLUDE COND=(4,1,CH,LT,C'5')                                                 
//*---------------------------------------------------------------------        
//* PRINT RECOVERY REPORT                                                       
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=IKJEFT01,COND=(0,NE),REGION=4096K,                          
//            DYNAMNBR=20                                                       
//BP13F800 DD DSN=BP13.F800.CANCEL.AHG.NONDBSS,DISP=SHR                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K096 DD DSN=BP13.K096.SECURITY,DISP=SHR                                   
//P13LE11A DD DSN=BP13.LE11A.SUMMARY,DISP=OLD                                   
//P13LE11B DD DSN=BP13.LE11B.DETAIL,DISP=OLD                                    
//BP13FC80 DD DSN=BP13.FC80.PENDGRNT,DISP=OLD                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CE11) PLAN(BP13PCC) -                                         
      LIB    ('BP13.BATCH.LOADCOB')                                             
  END                                                                           
//*--------------------------------------------------------------------*        
//STEP15   EXEC SORT,COND=(4,LT)                                                
//SORTIN   DD DSN=BP13.FC80.PENDGRNT,DISP=SHR                                   
//SORTOUT  DD DSN=&&FC80,                                                       
//            DISP=(NEW,PASS,DELETE),                                           
//            SPACE=(CYL,(300,125),RLSE),                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(14,8,CH,A)                                                       
  SUM FIELDS=NONE                                                               
//*                                                                             
//*--------------------------------------------------------------------*        
//STEP16 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//BP13F100 DD DSN=&&FC80,DISP=(OLD,DELETE)                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     DEL 'BP13.KC80.PENDGRNT' CL PURGE                                          
     DEF CL    (NAME(BP13.KC80.PENDGRNT)                -                       
                CYL(20 10)                              -                       
                UNIQUE                                  -                       
                STORCLAS(PRODRLS)                       -                       
                LOG(NONE)                               -                       
                SHR(2 3))                               -                       
         DATA  (NAME(BP13.KC80.PENDGRNT.DATA)           -                       
                KEYS(8 13)                              -                       
                RECSZ(500 500)                          -                       
                CISZ(4096))                             -                       
         INDEX (NAME(BP13.KC80.PENDGRNT.INDEX))                                 
     IF LASTCC = 0 THEN                                                         
        REPRO INFILE(BP13F100)                          -                       
              ODS(BP13.KC80.PENDGRNT) REUSE                                     
     IF MAXCC = 0 THEN                                                          
        DEF AIX (NAME(BP13.KC80.PENDGRNT.ALTX1)         -                       
                 REL(BP13.KC80.PENDGRNT)                -                       
                 CYL(20 10)                             -                       
                 SHR(2 3)                               -                       
                 KEYS(16 5)                             -                       
                 CISZ(4096)                             -                       
                 RECSZ(29 29)                           -                       
                 UNQK)                                                          
        IF LASTCC = 0 THEN                              -                       
           DEF PATH(NAME(BP13.KC80.PENDGRNT.PATH1)      -                       
               PENT(BP13.KC80.PENDGRNT.ALTX1))                                  
        IF LASTCC = 0 THEN                              -                       
           BIX IDS(BP13.KC80.PENDGRNT)                  -                       
               ODS(BP13.KC80.PENDGRNT.ALTX1)                                    
     IF MAXCC = 0 THEN                                                          
        DEF AIX (NAME(BP13.KC80.PENDGRNT.ALTX2)         -                       
                 REL(BP13.KC80.PENDGRNT)                -                       
                 CYL(20 10)                             -                       
                 SHR(2 3)                               -                       
                 KEYS(21 0)                             -                       
                 CISZ(4096)                             -                       
                 RECSZ(34 34)                           -                       
                 UNQK)                                                          
        IF LASTCC = 0 THEN                              -                       
           DEF PATH(NAME(BP13.KC80.PENDGRNT.PATH2)      -                       
               PENT(BP13.KC80.PENDGRNT.ALTX2))                                  
        IF LASTCC = 0 THEN                              -                       
           BIX IDS(BP13.KC80.PENDGRNT)                  -                       
               ODS(BP13.KC80.PENDGRNT.ALTX2)                                    
     IF MAXCC = 0 THEN                                                          
        DEF AIX (NAME(BP13.KC80.PENDGRNT.ALTX3)         -                       
                 REL(BP13.KC80.PENDGRNT)                -                       
                 CYL(20 10)                             -                       
                 SHR(2 3)                               -                       
                 KEYS(14 21)                            -                       
                 CISZ(4096)                             -                       
                 RECSZ(27 27)                           -                       
                 UNQK)                                                          
        IF LASTCC = 0 THEN                              -                       
           DEF PATH(NAME(BP13.KC80.PENDGRNT.PATH3)      -                       
               PENT(BP13.KC80.PENDGRNT.ALTX3))                                  
        IF LASTCC = 0 THEN                              -                       
           BIX IDS(BP13.KC80.PENDGRNT)                  -                       
               ODS(BP13.KC80.PENDGRNT.ALTX3)                                    
//*                                                                             
//*=====================================================================        
//*     END OF JOB                                                              
//*=====================================================================        
