//BP13Y712 JOB (BP13P),'BP13Y712',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* REVISION OF INTEREST RATE - PRINT LETTER TO INFORM APPLICANT        00150000
//*=================================================================            
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP135171 RJE1 20140211 TO CATER FOR DB2 UPGRADE                             
//*-------------------------------------------------------------------          
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY LETTER                    (MA&B TEAM)                        
//*-----------------------------------------------------------------    00070004
//PRT01    EXEC PGM=IEBGENER                                            00080004
//SYSUT1   DD *                                                         00090004
$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13DV,END;                            00100004
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                           00110004
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00120004
//SYSPRINT DD SYSOUT=*                                                  00130004
//SYSIN    DD DUMMY                                                     00131004
//*                                                                     00132004
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* SORT BP13KD00 WITH LOAN COMMENCEMENT DATE                                   
//* PRINT FOR LOAN-SCH=A                                                        
//*-----------------------------------------------------------------            
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FD00,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1600),                                 
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(312,8,CH,GT,C'        ',AND,                                   
                 361,1,CH,EQ,C'A')                                              
//*-----------------------------------------------------------------    00140000
//* PRINT LETTER ON REVISION OF INTEREST RATE                           00150000
//*-----------------------------------------------------------------    00160000
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00390002
//BP13FD00 DD DSN=&&BP13FD00,DISP=(OLD,PASS)                            00391002
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00392002
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                             00395002
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                              00398002
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                        00399202
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR                                   
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13PCAD DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                          00399502
//BP13LCAD DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                          00399502
//SYSOUT   DD SYSOUT=*                                                  00570002
//SYSTSPRT DD SYSOUT=*                                                  00580002
//SYSPRINT DD SYSOUT=*                                                  00590002
//SYSDBG   DD SYSOUT=*                                                  00600002
//SYSDBOUT DD SYSOUT=*                                                  00610002
//SYSTSIN  DD *                                                         00620002
     DSN SYSTEM(DSN)                                                    00630002
     RUN PROGRAM(BP13CCAD) PLAN(BP13PCC) -                              00640002
         LIB('BP13.BATCH.LOADCOB')                                      00650002
     END                                                                00660002
