//BP13M152 JOB (BP13P),'BP13M152',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*-------------------------------------------------------------------*         
//* CHG-NO     BY   ON                                                          
//*---------------------------------                                            
//* BP132698 - LSB 180505 - NEW JOB                                             
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                   *         
//* PRT01 : 1 COPY                           (AGREEMENT TEAM)         *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT SOC MASTER FILE IN SCH-ACCNT SEQUENCE                        *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=13')                                                  
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=18000,LRECL=2000,RECFM=FB)                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(155,11,A),FORMAT=CH                                             
   INCLUDE COND=((1,1,CH,NE,C'C'),AND,                                          
                (30,2,CH,EQ,C'1A',OR,30,2,CH,EQ,C'2A'))                         
//*-------------------------------------------------------------------*         
//* IF SA CASES KEY-ISSUED, SOC-DEBTOR CLEAR, ZERO SOC-CASH           *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=BP13C108,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F120 DD DSN=BP13.F120.SATRAN.SA.M152,DISP=OLD                             
//BP13L108 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13C105,COND=(0,NE)                                        
//BP13F125 DD DSN=BP13.F120.SATRAN.SA.M152,DISP=SHR                             
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//BP13L105 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* PERFORM BALANCING FOR FEES UPDATED IN RFF MASTER AND THE          *         
//* BALANCING FILE. COND CODE = 99 FOR ANY FEES NOT BALANCED          *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=BP13C106                                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//BP13L106 DD SYSOUT=N                                                          
//BP13P106 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUM SA TRANS TO MONTHLY FILE                                              
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT4   DD DSN=BP13.F120.SATRAN.SA.M152,DISP=SHR                             
//OUTPUT4  DD DSN=BP13.F120.SATRAN.SA.MTH,DISP=MOD                              
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                     
//*                                                                             
