//BP13D904 JOB (BP13P),'BP13D904',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//******************************************************************            
//* CHG-NO  BY  ON                                                              
//* -------------------------------                                             
//* BP18273 LSB 220420 - DELETE REPORT BP13C945                                 
//******************************************************************            
//*---------------------------------------------------------------------        
//* TO BATCH UPDATE BP13K940 & BP13K943                                         
//*---------------------------------------------------------------------        
//STEP01 EXEC    PGM=BP13C941,COND=(0,NE)                                       
//BP18F300 DD  DSN=BP18.F300.INTRFACE,DISP=SHR                                  
//BP18F310 DD  DSN=BP18.F310.INTRFACE,DISP=SHR                                  
//BP13K940 DD  DSN=BP13.K940.APLCTN.BO,DISP=OLD                                 
//BP13K943 DD  DSN=BP13.K943.OCPR.BO,DISP=OLD                                   
//BP13KD05 DD  DSN=BP13.KD05.CPFGRANT,DISP=SHR                                  
//BP13KD07 DD  DSN=BP13.KD07.GRANTMAS,DISP=SHR                                  
//BP13L941 DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//*     TO CLEAR FILE BP18.F300.INTRFACE                                        
//*---------------------------------------------------------------------        
//STEP02 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             DCB=BP18.F300.INTRFACE                                           
//SYSUT2   DD  DSN=BP18.F300.INTRFACE,                                          
//             DISP=OLD                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//*     TO CLEAR FILE BP18.F310.INTRFACE                                        
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             DCB=BP18.F310.INTRFACE                                           
//SYSUT2   DD  DSN=BP18.F310.INTRFACE,                                          
//             DISP=OLD                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* TO BACKUP FILES                                                             
//*---------------------------------------------------------------------        
//STEP06 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F010.DEBAR.SOC,                                         
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F010.DEBAR.SOC.ACCUM,                                   
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                        
/*                                                                              
//*---------------------------------------------------------------------        
//*  END OF BP13D904                                                            
//*---------------------------------------------------------------------        
