//BP13AL01 JOB (BP13P),'USER:BP13',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),   00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//********************************************************************* 00000050
//* THIS JCL IS FOR PRINTING OFFER LETTERS                              00000070
//********************************************************************* 00000090
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP135171 RJE1 20140210 TO CATER FOR DB2 UPGRADE                             
//*-------------------------------------------------------------------          
//*---------------------------------------------------------------------00000130
//* EXTRACT ONLY 'PL' RECORDS FROM K205                                         
//*-------------------------------------------------------------------- 00000150
//STEP00 EXEC   SORT,COND=(0,NE)                                        00000160
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                    00000170
//             DISP=SHR                                                 00000180
//SORTOUT  DD  DSN=&&BP13F205,                                          00001360
//             DISP=(NEW,PASS),                                         00001370
//             UNIT=SYSDA,                                              00001380
//             SPACE=(CYL,(5,2),RLSE),                                  00001390
//             DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                        00001400
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                        00000210
   SORT FIELDS=COPY                                                             
   INCLUDE COND=(14,2,CH,EQ,C'PL')                                              
/*                                                                      00000220
//*---------------------------------------------------------------------00000130
//* INCLUDING ONLY DBS RECORDS FROM BP13K800 FILE.                              
//*-------------------------------------------------------------------- 00000150
//STEP01 EXEC   SORT,COND=(0,NE)                                        00000160
//SORTIN   DD  DSN=BP13.K800.APPLN,                                     00000170
//             DISP=SHR                                                 00000180
//SORTOUT  DD  DSN=&&BP13F800,                                          00001360
//             DISP=(NEW,PASS),                                         00001370
//             UNIT=SYSDA,                                              00001380
//             SPACE=(CYL,(50,20),RLSE),                                00001390
//             DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                      00001400
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                        00000210
   SORT FIELDS=COPY                                                             
   INCLUDE COND=(924,3,CH,EQ,C'DBS')                                            
/*                                                                      00000220
//*-------------------------------------------------------------------- 00000230
//*  TO CREATE SEQUENTIAL FILE (BP13LC01)                               00000240
//*-------------------------------------------------------------------- 00000250
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD  DSN=&&BP13F800,                                                  
//             DISP=(OLD,PASS)                                                  
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(OLD,PASS)                                                  
//BP13KB20 DD  DSN=BP13.KB20.DBSBK,                                             
//             DISP=SHR,                                                00001540
//             AMP=('BUFNI=8','BUFND=4')                                00001550
//BP13KA10 DD  DSN=BP13.KA10.PRJCT,                                             
//             DISP=SHR,                                                00001540
//             AMP=('BUFNI=8','BUFND=4')                                00001550
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,                                           
//             DISP=SHR,                                                00001540
//             AMP=('BUFNI=8','BUFND=4')                                00001550
//BP13KD80 DD  DSN=BP13.KD80.LOF,                                               
//             DISP=SHR,                                                00001540
//             AMP=('BUFNI=8','BUFND=4')                                00001550
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                00001540
//             AMP=('BUFNI=8','BUFND=4')                                00001550
//BP27K800 DD  DSN=BP27.K800.HLAPPLN,                                           
//             DISP=SHR,                                                00001540
//             AMP=('BUFNI=8','BUFND=4')                                00001550
//BP27K025 DD  DSN=BP27.K025.CAOIC,                                             
//             DISP=SHR,                                                00001540
//             AMP=('BUFNI=8','BUFND=4')                                00001550
//BP27K021 DD  DSN=BP27.K025.CAOIC.PATH1,                                       
//             DISP=SHR,                                                00001540
//             AMP=('BUFNI=8','BUFND=4')                                00001550
//BP13LC01 DD  DSN=BP13.LC01.REPORT,                                            
//             DISP=SHR                                                 00001370
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CL00) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------*00000330
//*  SORT BP13LC01 BY PROJECT AND FLAT TYPE.                            00000340
//*--------------------------------------------------------------------*00000350
//STEP03   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.LC01.REPORT,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13SORT,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(50,20),RLSE),                                        
//             DCB=(BLKSIZE=0,LRECL=600,RECFM=FB)                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=((117,1,CH,EQ,C'H',OR,                                          
                  117,1,CH,EQ,C'P'),AND,                                        
                (163,8,CH,EQ,C'        ',OR,                                    
                 163,8,CH,EQ,C'00000000'),AND,                                  
                 107,1,CH,EQ,C'Y')                                              
/*                                                                              
//*-------------------------------------------------------------------*         
//* TO GENERATE THE DAILY REPORT FOR DBSS OFFER LETTER TO BE RAISED   *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=BP13CL01,COND=(0,NE)                                        
//BP13LC01 DD  DSN=&&BP13SORT,                                                  
//             DISP=(OLD,PASS)                                                  
//BP13LL01 DD  SYSOUT=A,                                                        
//             DEST=X9AL                                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
