//BP13A571 JOB (BP13P),'BP13A571',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00001002
//         NOTIFY=CSD0071                                               00002000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030002
//**************************************************************        00040000
//* SMS TO VIEW ELIGIBILITY MESSAGE - BTO                               00050005
//**************************************************************        00060002
//* CHG REF  BY   ON        DESCRIPTION                                 00070002
//* -------- ---- --------  -----------                                 00080002
//* BP139745 MRR5 20230517  NEW JCL FOR SENDING SMS AND EMAIL           00090002
//* BP139960 MRR5 20240320  Replace L3/L4 with LC/LD                    00100003
//* BP139924 MRR5 20240416  SORT ONLY FOR BTO                           00101006
//*--------------------------------------------------------------------*00110000
//* DELETE THE TEMP DATA SETS                                           00112000
//*-------------------------------------------------------------------* 00113000
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                  00114000
//SYSPRINT DD   SYSOUT=*                                                00115000
//SYSIN    DD   *                                                       00116000
     DEL (BP13.F203.SMS.M1.XML01)                                       00116102
     DEL (BP13.F203.SMS.M1.XML02)                                       00116202
     DEL (BP13.F203.SMS.M1.XML03)                                       00116302
     DEL (BP13.F203.SMS.M1.XML04)                                       00116402
     DEL (BP13.F203.SMS.M1.XML05)                                       00116502
     DEL (BP13.F203.SMS.M1.XML06)                                       00116602
     DEL (BP13.F203.SMS.M1.XML07)                                       00116702
     DEL (BP13.F203.SMS.M1.XML08)                                       00116802
     DEL (BP13.F203.SMS.M1.XML09)                                       00116902
     DEL (BP13.F203.SMS.M1.XML10)                                       00117002
     DEL (BP13.F203.SMS.M1.XML11)                                       00118002
     DEL (BP13.F203.SMS.M1.XML12)                                       00119002
     DEL (BP13.F203.SMS.M1.XML13)                                       00120002
     DEL (BP13.F203.SMS.M1.XML14)                                       00121002
     DEL (BP13.F203.SMS.M1.XML15)                                       00121102
     DEL (BP13.F203.SMS.M1.XML16)                                       00121202
     DEL (BP13.F203.SMS.M1.XML17)                                       00121302
     DEL (BP13.F203.SMS.M1.XML18)                                       00121402
     DEL (BP13.F203.SMS.M1.XML19)                                       00121502
     DEL (BP13.F203.SMS.M1.XML20)                                       00121602
     IF MAXCC < 12 THEN                                                 00121702
        SET MAXCC = 0                                                   00121802
/*                                                                      00121902
//*-------------------------------------------------------------------* 00122002
//* DEFINE TEMP DATA SETS                                               00122102
//*-------------------------------------------------------------------* 00123002
//STEP01   EXEC PGM=IEFBR14,COND=(0,NE)                                 00124002
//F203001   DD  DSN=BP13.F203.SMS.M1.XML01,                             00125002
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00126002
//             SPACE=(CYL,(2,1),RLSE),                                  00127002
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00128002
/*                                                                      00129002
//F203002   DD  DSN=BP13.F203.SMS.M1.XML02,                             00130002
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00140002
//             SPACE=(CYL,(2,1),RLSE),                                  00141002
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00142002
/*                                                                      00143002
//F203003   DD  DSN=BP13.F203.SMS.M1.XML03,                             00144002
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00145002
//             SPACE=(CYL,(2,1),RLSE),                                  00146002
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00146102
/*                                                                      00146202
//F203004   DD  DSN=BP13.F203.SMS.M1.XML04,                             00146302
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00146402
//             SPACE=(CYL,(2,1),RLSE),                                  00146502
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00146602
/*                                                                      00146702
//F203005   DD  DSN=BP13.F203.SMS.M1.XML05,                             00146802
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00146902
//             SPACE=(CYL,(2,1),RLSE),                                  00147002
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00147102
/*                                                                      00147202
//F203006   DD  DSN=BP13.F203.SMS.M1.XML06,                             00147302
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00147402
//             SPACE=(CYL,(2,1),RLSE),                                  00147502
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00147602
/*                                                                      00147702
//F203007   DD  DSN=BP13.F203.SMS.M1.XML07,                             00147802
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00147902
//             SPACE=(CYL,(2,1),RLSE),                                  00148002
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00148102
/*                                                                      00148202
//F203008   DD  DSN=BP13.F203.SMS.M1.XML08,                             00148302
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00148402
//             SPACE=(CYL,(2,1),RLSE),                                  00148502
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00148602
/*                                                                      00148702
//F203009   DD  DSN=BP13.F203.SMS.M1.XML09,                             00148802
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00148902
//             SPACE=(CYL,(2,1),RLSE),                                  00149002
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00149102
/*                                                                      00149202
//F203010   DD  DSN=BP13.F203.SMS.M1.XML10,                             00149302
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00149402
//             SPACE=(CYL,(2,1),RLSE),                                  00149502
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00149602
/*                                                                      00149702
//F203011   DD  DSN=BP13.F203.SMS.M1.XML11,                             00149802
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00149902
//             SPACE=(CYL,(2,1),RLSE),                                  00150002
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00151002
/*                                                                      00152002
//F203012   DD  DSN=BP13.F203.SMS.M1.XML12,                             00152102
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00152202
//             SPACE=(CYL,(2,1),RLSE),                                  00152302
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00152402
/*                                                                      00152502
//F203013   DD  DSN=BP13.F203.SMS.M1.XML13,                             00152602
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00152702
//             SPACE=(CYL,(2,1),RLSE),                                  00152802
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00152902
/*                                                                      00153002
//F203014   DD  DSN=BP13.F203.SMS.M1.XML14,                             00153102
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00153202
//             SPACE=(CYL,(2,1),RLSE),                                  00153302
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00153402
/*                                                                      00153502
//F203015   DD  DSN=BP13.F203.SMS.M1.XML15,                             00153602
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00153702
//             SPACE=(CYL,(2,1),RLSE),                                  00153802
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00153902
/*                                                                      00154002
//F203016   DD  DSN=BP13.F203.SMS.M1.XML16,                             00154102
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00154202
//             SPACE=(CYL,(2,1),RLSE),                                  00154302
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00154402
/*                                                                      00154502
//F203017   DD  DSN=BP13.F203.SMS.M1.XML17,                             00154602
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00154702
//             SPACE=(CYL,(2,1),RLSE),                                  00154802
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00154902
/*                                                                      00155002
//F203018   DD  DSN=BP13.F203.SMS.M1.XML18,                             00155102
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00155202
//             SPACE=(CYL,(2,1),RLSE),                                  00155302
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00155402
/*                                                                      00155502
//F203019   DD  DSN=BP13.F203.SMS.M1.XML19,                             00155602
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00155702
//             SPACE=(CYL,(2,1),RLSE),                                  00155802
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00155902
/*                                                                      00156002
//F203020   DD  DSN=BP13.F203.SMS.M1.XML20,                             00156102
//             DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                      00156202
//             SPACE=(CYL,(2,1),RLSE),                                  00156302
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                      00156402
/*                                                                      00156502
//*--------------------------------------------------------------------*00156602
//* sort cases for BTO and regn starting with 8 or more                 00156705
//*--------------------------------------------------------------------*00156802
//STEP01B  EXEC SORT,COND=(0,NE)                                        00156902
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                           00157002
//SORTOUT  DD DSN=&&BP13F730,DISP=(NEW,PASS),                           00157102
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                   00157202
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                       00157302
//SYSIN    DD  *                                                        00157502
  SORT FIELDS=(33,8,A),FORMAT=CH                                        00157602
  INCLUDE COND=(33,1,CH,GE,C'8',AND,                                    00157702
                376,3,CH,EQ,C'BTO')                                     00157805
  SUM FIELDS=NONE                                                       00157902
//*---------------------------------------------------------------------00158002
//* MATCH F730 with K757                                                00158102
//*---------------------------------------------------------------------00158202
//STEP01C   EXEC SORT,COND=(0,NE),REGION=512K                           00158302
//SORTJNF1 DD DSN=&&BP13F730,DISP=(OLD,DELETE)                          00158402
//SORTJNF2 DD DSN=BP13.K757.BTO,DISP=SHR                                00158502
//MATCH    DD DSN=&&F730F757,DISP=(NEW,PASS),                           00158602
//            DCB=(RECFM=FB,LRECL=4000),                                00158702
//            SPACE=(CYL,(50,20),RLSE)                                  00158802
//SYSIN DD *                                                            00158902
   SORT FIELDS=(1,8,CH,A)                                               00159002
   JOINKEYS FILE=F1,FIELDS=(33,8,A)                                     00159102
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                      00159202
   REFORMAT FIELDS=(F2:1,4000)                                          00159302
   OUTFILE FNAMES=MATCH                                                 00159402
//*--------------------------------------------------------------------*00159502
//* sort K757-NUM-CANCEL NOT = 'Y'                                      00159602
//*--------------------------------------------------------------------*00159702
//STEP02   EXEC SORT,COND=(0,NE)                                        00159802
//SORTIN   DD DSN=&&F730F757,DISP=(OLD,DELETE)                          00159902
//SORTOUT  DD DSN=&&BP13F757,DISP=(NEW,PASS),                           00160002
//            DCB=(RECFM=FB,LRECL=4000),                                00160102
//            SPACE=(CYL,(50,20),RLSE)                                  00160202
//SYSIN    DD  *                                                        00160302
  SORT FIELDS=(1,8,A),FORMAT=CH                                         00160402
  INCLUDE COND=(2891,1,CH,NE,C'Y')                                      00160502
  SUM FIELDS=NONE                                                       00160602
//*--------------------------------------------------------------------*00162002
//*  TO PROCESS BP13F757 (NON-CANCELLED CASES)                          00170002
//*  AND OUTPUT TO BP13F203 FORMAT FOR APPT TYPE M1                     00180002
//*--------------------------------------------------------------------*00190002
//STEP03   EXEC PGM=BP13CS0F,COND=(0,NE)                                00191002
//BP13F757 DD DSN=&&BP13F757,DISP=(OLD,PASS)                            00192002
//BP13F203 DD DSN=BP13.F203.SMS.M1,DISP=OLD                             00193002
//SYSDBG   DD SYSOUT=*                                                  00242002
//SYSDBOUT DD SYSOUT=*                                                  00243002
//SYSOUT   DD SYSOUT=*                                                  00244002
//SYSIN    DD *                                                         00245002
M1                                                                      00246002
//*--------------------------------------------------------------------*00250000
//*  SORT IN KEY FIELD                                                  00260000
//*--------------------------------------------------------------------*00270000
//STEP04   EXEC SORT,COND=(0,NE)                                        00280002
//SORTIN   DD DSN=BP13.F203.SMS.M1,DISP=SHR                             00290002
//SORTOUT  DD DSN=&&F203,DISP=(NEW,PASS),                               00300000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         00310000
//         SPACE=(CYL,(8,5),RLSE)                                       00320000
//SYSIN    DD  *                                                        00330000
   SORT FIELDS=(1,19,A),FORMAT=CH                                       00340000
/*                                                                      00360000
//*=====================================================================00391000
//* GENERATE XML FILES FOR FTP TO SEND AUTOMATED SMS                    00392000
//* up to 20 xml files                                                  00392102
//*=====================================================================00393000
//STEP05    EXEC PGM=BP13CFB7,COND=(0,NE)                               00394002
//BP13F203  DD DSN=&&F203,DISP=(SHR,PASS)                               00395000
//BP13K209  DD DSN=BP13.K209.SMS.MSG,DISP=SHR                           00395102
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                              00396000
//B13DUMMY  DD DSN=BP13.DUMMY.MOBILE,DISP=SHR                           00397002
//B13F203A  DD DSN=BP13.F203.SMS.M1.XML01,DISP=SHR                      00398002
//B13F203B  DD DSN=BP13.F203.SMS.M1.XML02,DISP=SHR                      00399002
//B13F203C  DD DSN=BP13.F203.SMS.M1.XML03,DISP=SHR                      00399102
//B13F203D  DD DSN=BP13.F203.SMS.M1.XML04,DISP=SHR                      00399202
//B13F203E  DD DSN=BP13.F203.SMS.M1.XML05,DISP=SHR                      00399302
//B13F203F  DD DSN=BP13.F203.SMS.M1.XML06,DISP=SHR                      00399402
//B13F203G  DD DSN=BP13.F203.SMS.M1.XML07,DISP=SHR                      00399502
//B13F203H  DD DSN=BP13.F203.SMS.M1.XML08,DISP=SHR                      00399602
//B13F203I  DD DSN=BP13.F203.SMS.M1.XML09,DISP=SHR                      00399702
//B13F203J  DD DSN=BP13.F203.SMS.M1.XML10,DISP=SHR                      00399802
//B13F203K  DD DSN=BP13.F203.SMS.M1.XML11,DISP=SHR                      00399902
//B13F203L  DD DSN=BP13.F203.SMS.M1.XML12,DISP=SHR                      00400002
//B13F203M  DD DSN=BP13.F203.SMS.M1.XML13,DISP=SHR                      00400102
//B13F203N  DD DSN=BP13.F203.SMS.M1.XML14,DISP=SHR                      00400202
//B13F203O  DD DSN=BP13.F203.SMS.M1.XML15,DISP=SHR                      00400302
//B13F203P  DD DSN=BP13.F203.SMS.M1.XML16,DISP=SHR                      00400402
//B13F203Q  DD DSN=BP13.F203.SMS.M1.XML17,DISP=SHR                      00400502
//B13F203R  DD DSN=BP13.F203.SMS.M1.XML18,DISP=SHR                      00400602
//B13F203S  DD DSN=BP13.F203.SMS.M1.XML19,DISP=SHR                      00400702
//B13F203T  DD DSN=BP13.F203.SMS.M1.XML20,DISP=SHR                      00400802
//SYSPRINT  DD SYSOUT=*                                                 00400902
//SYSOUT    DD SYSOUT=*                                                 00401002
//SYSIN     DD *                                                        00401102
//*-------------------------------------------------------------------* 00401202
//* EMPTY EMAIL FILES for LC                                          * 00401305
//*-------------------------------------------------------------------* 00401402
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                  00401502
//SYSPRINT DD SYSOUT=*                                                  00401602
//INPUT1   DD DSN=BP13.EMPTY.CHAR200,DISP=OLD                           00401702
//OUTPUT01 DD DSN=BP13.F23A.EMAIL.L3L4.F01,DISP=OLD                     00401802
//OUTPUT02 DD DSN=BP13.F23A.EMAIL.L3L4.F02,DISP=OLD                     00401902
//OUTPUT03 DD DSN=BP13.F23A.EMAIL.L3L4.F03,DISP=OLD                     00402002
//OUTPUT04 DD DSN=BP13.F23A.EMAIL.L3L4.F04,DISP=OLD                     00402102
//OUTPUT05 DD DSN=BP13.F23A.EMAIL.L3L4.F05,DISP=OLD                     00402202
//OUTPUT06 DD DSN=BP13.F23A.EMAIL.L3L4.F06,DISP=OLD                     00402302
//OUTPUT07 DD DSN=BP13.F23A.EMAIL.L3L4.F07,DISP=OLD                     00402402
//OUTPUT08 DD DSN=BP13.F23A.EMAIL.L3L4.F08,DISP=OLD                     00402502
//OUTPUT09 DD DSN=BP13.F23A.EMAIL.L3L4.F09,DISP=OLD                     00402602
//OUTPUT10 DD DSN=BP13.F23A.EMAIL.L3L4.F10,DISP=OLD                     00402702
//OUTPUT11 DD DSN=BP13.F23A.EMAIL.L3L4.F11,DISP=OLD                     00402802
//OUTPUT12 DD DSN=BP13.F23A.EMAIL.L3L4.F12,DISP=OLD                     00402902
//OUTPUT13 DD DSN=BP13.F23A.EMAIL.L3L4.F13,DISP=OLD                     00403002
//OUTPUT14 DD DSN=BP13.F23A.EMAIL.L3L4.F14,DISP=OLD                     00403102
//OUTPUT15 DD DSN=BP13.F23A.EMAIL.L3L4.F15,DISP=OLD                     00403202
//OUTPUT16 DD DSN=BP13.F23A.EMAIL.L3L4.F16,DISP=OLD                     00403302
//OUTPUT17 DD DSN=BP13.F23A.EMAIL.L3L4.F17,DISP=OLD                     00403402
//OUTPUT18 DD DSN=BP13.F23A.EMAIL.L3L4.F18,DISP=OLD                     00403502
//OUTPUT19 DD DSN=BP13.F23A.EMAIL.L3L4.F19,DISP=OLD                     00403602
//OUTPUT20 DD DSN=BP13.F23A.EMAIL.L3L4.F20,DISP=OLD                     00403702
//SYSIN    DD *                                                         00403802
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT01)                         00403902
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT02)                         00404002
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT03)                         00404102
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT04)                         00404202
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT05)                         00404302
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT06)                         00404402
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT07)                         00404502
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT08)                         00404602
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT09)                         00404702
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT10)                         00404802
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT11)                         00404902
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT12)                         00405002
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT13)                         00405102
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT14)                         00405202
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT15)                         00405302
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT16)                         00405402
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT17)                         00405502
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT18)                         00405602
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT19)                         00405702
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT20)                         00405802
//*--------------------------------------------------------------------*00405902
//*  TO PROCESS BP13F757                                                00406002
//*  AND OUTPUT TO BP13F23A FORMAT FOR LC (BTO)                         00406105
//*  Reusing filenames for L3/L4                                        00406202
//*--------------------------------------------------------------------*00406302
//STEP07   EXEC PGM=BP13CD3E,COND=(0,NE)                                00406402
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00406502
//BP13F757 DD DSN=&&BP13F757,DISP=(OLD,PASS)                            00406602
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR,                             00406702
//            AMP=('BUFND=4','BUFNI=8')                                 00406802
//BP13F23A DD DSN=BP13.F23A.EMAIL.L3L4,DISP=OLD                         00406902
//SYSDBG   DD SYSOUT=*                                                  00407002
//SYSDBOUT DD SYSOUT=*                                                  00407102
//SYSOUT   DD SYSOUT=*                                                  00407202
//*--------------------------------------------------------------------*00407302
//*  SORT IN KEY FIELD                                                  00407402
//*--------------------------------------------------------------------*00407502
//STEP08   EXEC SORT,COND=(0,NE)                                        00407602
//SORTIN   DD DSN=BP13.F23A.EMAIL.L3L4,DISP=SHR                         00407702
//SORTOUT  DD DSN=&&BP13F23A,DISP=(NEW,PASS),                           00407802
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         00407902
//         SPACE=(CYL,(120,10),RLSE)                                    00408002
//SYSIN    DD  *                                                        00408102
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00408202
/*                                                                      00408302
//*--------------------------------------------------------------------*00408402
//*  SPLIT BY 2000 RECORDS FOR EMAIL                                   *00408502
//*--------------------------------------------------------------------*00408602
//STEP09   EXEC PGM=SORT                                                00408702
//SYSPRINT DD SYSOUT=*                                                  00408802
//SYSOUT   DD SYSOUT=*                                                  00408902
//SORTIN   DD DSN=&&BP13F23A,DISP=(SHR,PASS)                            00409002
//O1       DD DSN=BP13.F23A.EMAIL.L3L4.F01,DISP=SHR                     00409102
//O2       DD DSN=BP13.F23A.EMAIL.L3L4.F02,DISP=SHR                     00409202
//O3       DD DSN=BP13.F23A.EMAIL.L3L4.F03,DISP=SHR                     00409302
//O4       DD DSN=BP13.F23A.EMAIL.L3L4.F04,DISP=SHR                     00409402
//O5       DD DSN=BP13.F23A.EMAIL.L3L4.F05,DISP=SHR                     00409502
//O6       DD DSN=BP13.F23A.EMAIL.L3L4.F06,DISP=SHR                     00409602
//O7       DD DSN=BP13.F23A.EMAIL.L3L4.F07,DISP=SHR                     00409702
//O8       DD DSN=BP13.F23A.EMAIL.L3L4.F08,DISP=SHR                     00409802
//O9       DD DSN=BP13.F23A.EMAIL.L3L4.F09,DISP=SHR                     00409902
//O10      DD DSN=BP13.F23A.EMAIL.L3L4.F10,DISP=SHR                     00410002
//O11      DD DSN=BP13.F23A.EMAIL.L3L4.F11,DISP=SHR                     00410102
//O12      DD DSN=BP13.F23A.EMAIL.L3L4.F12,DISP=SHR                     00410202
//O13      DD DSN=BP13.F23A.EMAIL.L3L4.F13,DISP=SHR                     00410302
//O14      DD DSN=BP13.F23A.EMAIL.L3L4.F14,DISP=SHR                     00410402
//O15      DD DSN=BP13.F23A.EMAIL.L3L4.F15,DISP=SHR                     00410502
//O16      DD DSN=BP13.F23A.EMAIL.L3L4.F16,DISP=SHR                     00410602
//O17      DD DSN=BP13.F23A.EMAIL.L3L4.F17,DISP=SHR                     00410702
//O18      DD DSN=BP13.F23A.EMAIL.L3L4.F18,DISP=SHR                     00410802
//O19      DD DSN=BP13.F23A.EMAIL.L3L4.F19,DISP=SHR                     00410902
//O20      DD DSN=BP13.F23A.EMAIL.L3L4.F20,DISP=SHR                     00411002
//SYSIN    DD  *                                                        00411102
   OPTION COPY                                                          00411202
   OUTFIL FNAMES=(O1,O2,O3,O4,O5,O6,O7,O8,O9,O10,O11,O12,O13,O14,O15,   00412002
                  O16,O17,O18,O19,O20),SPLIT1R=2000                     00413002
/*                                                                      00420002
