//BP13A556 JOB (BP13P),'BP13A556',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*-------------------------------------------------------------------*         
//* OBJECTIVE :                                                       *         
//* THIS JCL IS FOR RE-ASSIGNING OIC, PRINTING THE LETTER  AND        *         
//* RE-ASSIGNING OIC FROM OIC HISTORY FILE                            *         
//*-------------------------------------------------------------------*         
//*CHG REQ  OIC  DATE       DESCRIPTION                               *         
//*-------- ---- ---------- ------------------------------------------*         
//*BP132480 SK   09/03/2004 NEW JCL                                   *         
//*BP135171 RJE1 10/02/2014 TO CATER FOR DB2 UPGRADE                            
//*-------------------------------------------------------------------*         
//* TO SEND DJDE AHEAD OF THE PRINT DATASET                           *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POTS,FORMS=BP13UF,JDL=BP13,END;                                    
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALST1J                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* TO SEND DJDE AHEAD OF THE PRINT DATASET                           *         
//* PRT01 : COPIES = 1                                                *         
//*-------------------------------------------------------------------*         
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                     00001330
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE PRODUCTION RUN                                     
//*--------------------------------------------------------------------         
//STEP01 EXEC  PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD  DSN=BP13.K022.WISOIC,DISP=OLD                                    
//INPUT2   DD  DSN=BP13.K026.ASGNOIC,DISP=OLD                                   
//INPUT3   DD  DSN=BP13.K028.OICHIST,DISP=OLD                                   
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT ASSIGN OIC - ASSIGNING CASES TO DIFFERENT OIC                      
//*--------------------------------------------------------------------         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K026.ASGNOIC,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//SORTOUT  DD DSN=&&F026A,DISP=(NEW,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(50,8),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                   
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,11,A),FORMAT=CH                                              
    INCLUDE COND=(1,4,CH,NE,C'HIST',AND,                                        
                  1,4,CH,NE,C'    ')                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* RE-ASSIGN OIC                                                               
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13C044,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026A,DISP=(OLD,PASS)                                       
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K026 DD DSN=BP13.K026.ASGNOIC,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=8','BUFNI=4')                                            
//P13F022A DD DSN=&&F022A,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,8),RLSE),                               
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT LETTER ON CHANGE OF OIC                                               
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=IKJEFT01,COND=(0,NE)                                        
//BP13F022 DD DSN=&&F022A,DISP=(OLD,PASS)                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                 
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13P042 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//BP13L042 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C042) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*---------------------------------------------------------------------        
//* SORT OUT ASSIGN OIC - ASSIGNING CASES BACK TO PREVIOUS OIC                  
//*--------------------------------------------------------------------         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K026.ASGNOIC,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//SORTOUT  DD DSN=&&F026B,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,8),RLSE),                               
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,11,A),FORMAT=CH                                              
    INCLUDE COND=(1,4,CH,EQ,C'HIST')                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT OUT OIC HISTORY FILE                                                   
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//SORTOUT  DD DSN=&&F028A,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,8),RLSE),                               
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSIN   DD *                                                                  
    SORT FIELDS=(9,5,A),FORMAT=CH                                               
    INCLUDE COND=(1,21,CH,NE,C'     ')                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* RE-ASSIGNING FROM OIC-HISTORY TO PREVIOUS OIC                               
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=BP13C052,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026B,DISP=(OLD,PASS)                                       
//BP13F028 DD DSN=&&F028A,DISP=(OLD,PASS)                                       
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K026 DD DSN=BP13.K026.ASGNOIC,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13L052 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* END OF JOB                                                                  
//*-----------------------------------------------------------------            
