//BP13A727 JOB (BP13P),'BP13A727',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* CHG REF  DATE     BY   DESCRIPTION                                          
//* -------- ----     ---  -----------                                          
//* BP130652 19991018 SRA  EXPAND F500 RECL FROM 300 TO 500                     
//* BP130753 19991110 LSB  TAKE OUT STEP01 REF-NO=Q                             
//* BP130857 20000705 SSS  REMOVE DJDE STATEMENT                                
//* BP133026 20070330 LSB  ADD BP13K800 TO BP13C159                             
//*-----------------------------------------------------------------            
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*-----------------------------------------------------------------            
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------            
//* REPRO MATURE REQUESTS TO SEQUENCIAL FILE                                    
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.RESERVE,DISP=SHR                           
//SORTOUT  DD DSN=&&F500MNT,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*  INCLUDE COND=(35,1,CH,EQ,C'Q')                                             
//*-----------------------------------------------------------------            
//* BP13.F500.SEQUENCE - ALREADY UPDATED WITH SEQ-REF-NO                        
//* COMPUTE DTE-BALLOT FOR THE QUARTER                                          
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C159,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500MNT,DISP=(OLD,PASS)                                     
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*=================================================================            
//* END BP13A727                                                                
//*=================================================================            
