//BP13D120 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//* ============================================================== *            
//*          D A I L Y    F I N A N C I A L    J O B               *            
//* ============================================================== *            
//* CHG REF  BY   ON       DESCRIPTION                             *            
//* -------- ---- -------- -----------                             *            
//* BP137965 SRG1 20190516 CREATE CPFB GRANT SEND FILE             *            
//* ============================================================== *            
//*----------------------------------------------------------------*            
//* CREATE HOUSING GRANT CREDITING FILE                            *            
//*----------------------------------------------------------------*            
//STEP01 EXEC PGM=BP13CB3B,COND=(0,NE)                                  00002550
//BP13K736 DD DSN=BP13.K736.CPFENQ,DISP=SHR                             00002560
//AB02F940 DD DSN=BP13.AB02.F940.DPFLAT,DISP=MOD                        00000310
//SYSOUT   DD SYSOUT=*                                                  00002650
//SYSDBOUT DD SYSOUT=*                                                          
//*----------------------------------------------------------------*            
//* BACKUP FILE TO GDG                                             *            
//*----------------------------------------------------------------*            
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.AB02.F940.DPFLAT,                                       
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.AB02.F940.DPFLAT.BKUP(+1),                              
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(20,15),RLSE),                                        
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                      
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*----------------------------------------------------------------*            
//*          E N D      O F     J O B                              *            
//*----------------------------------------------------------------*            
