//BP13A59F  JOB (BP13P),'BP13A59F',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//*                                                                             
//*  THIS JOB IS USE FOR GENERATING BP13F203 FOR SMS   SENDING FOR              
//*  ROF CASES                                                                  
//*                                                                             
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---  -------- -----------                                          
//* BP136992 ZDD1 100817   NEW JCL                                              
//* BP136922 ZDD1 160817   ADD STEP FOR CHECKING OF DUP HP NUMBER               
//* BP137460 SRG1 110918   INCLUDE STEP FOR ALL CASES EMAIL ADDS                
//*=================================================================            
//*---------------------------------------------------------------------        
//*             BP13.F203.SMS.ROF                                               
//*=================================================================            
//* SORT BY NT/FT/QUEUE/REGN                                                    
//*-----------------------------------------------------------------            
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                   
//           AMP=('BUFND=4','BUFNI=8')                                          
//SORTOUT DD DSN=&&BP13F740,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                               
//           SPACE=(CYL,(120,10),RLSE)                                          
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(376,3,CH,EQ,C'ROF')                                           
//*-----------------------------------------------------------------            
//* OMIT GRO, MPGS, SMALLEST MGPS RECORDS                                       
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F740,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F740CD30,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(120,10),RLSE)                                         
//SYSIN   DD  *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  OMIT COND=(28,1,CH,EQ,C'G',OR,                                                
            245,1,CH,EQ,C'P',OR,                                                
            245,1,CH,EQ,C'C')                                                   
//*-----------------------------------------------------------------*           
//*  TO BYPASS RECORD THAT FOUND ON BP13K76D - BLOCK LIST           *           
//*-----------------------------------------------------------------*           
//STEP03   EXEC PGM=BP13CF18,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CD30,DISP=(OLD,PASS)                                    
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR,                           
//           AMP=('BUFND=4','BUFNI=8')                                          
//P13F740A DD DSN=&&F740CF18,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                            
//             DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO SEPERATE CASES WITH  HANDPHONE                           *              
//*-----------------------------------------------------------------*           
//STEP04   EXEC PGM=BP13CFA3,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CF18,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F740A DD DSN=&&F740WO,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(30,15),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13F740B DD DSN=&&F740WITH,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                             
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13LCFA3 DD DUMMY                                                             
//SYSOUT    DD SYSOUT=*                                                         
//*SYSOUT   DD DSN=BP13.F23A.SMS.BP13CFA3,DISP=OLD                              
//*                                                                             
//*-----------------------------------------------------------------*           
//* TO CHECK FOR THEIR EMAIL ADDRESS                                *           
//*-----------------------------------------------------------------*           
//STEP04A  EXEC PGM=BP13CFA6,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CF18,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F740A DD DUMMY                                                             
//P13F740B DD DSN=BP13.F740.WITH.EMAIL.ROF,DISP=SHR                             
//P13LCFA6 DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------*           
//* FOR CASES WITHOUT HP, TO CHECK FOR THEIR EMAIL ADDRESS      *               
//*-----------------------------------------------------------------*           
//STEP05   EXEC PGM=BP13CFA6,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740WO,DISP=(OLD,DELETE)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F740A DD DSN=BP13.F740.WITHO.EMAIL.ROF,DISP=SHR                            
//P13F740B DD DUMMY                                                             
//P13LCFA6 DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------*        
//* TO GENERATE F203 FILE                                                       
//*--------------------------------------------------------------------*        
//STEP06   EXEC PGM=BP13CFA5,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740WITH,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F203 DD DSN=&&F203CFA5,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                            
//             DCB=(BLKSIZE=27800,LRECL=200,RECFM=FB)                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT ALL SMS FILES                                                          
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F203CFA5,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F203.SMS.ROF,DISP=SHR                                    
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,19,A),FORMAT=CH                                                
//*=====================================================================        
//* SPLIT CASES WITH GT 300% AND LE 300%                                        
//*=====================================================================        
//STEP5A    EXEC PGM=BP13CFA9,COND=(0,NE)                                       
//BP13F213  DD DSN=BP13.F203.SMS.ROF,DISP=SHR                                   
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR                                     
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR                                     
//BP13F23A  DD DSN=BP13.F203.SMS.ROF.R1,DISP=SHR                                
//BP13F23B  DD DSN=BP13.F203.SMS.ROF.R2,DISP=SHR                                
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
/*                                                                              
//*-------------------------------------------------------------------*         
//*  BACKUP SMS FILES                                                           
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F203.SMS.ROF,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F203.SMS.ROF.BACKUP(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(50,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=200,RECFM=FB)                       
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*=====================================================================        
//*=======      (((   GET HP NUMBER         )))             ===========         
//*=====================================================================        
//STEP09   EXEC PGM=ICETOOL,COND=(0,NE)                                         
//INPUT    DD DSN=BP13.F203.SMS.ROF,DISP=SHR                                    
//OUTPUT   DD DSN=BP13.F203.SMS.ROF.DUP,DISP=SHR                                
//TOOLMSG  DD SYSOUT=*                                                          
//DFSMSG   DD SYSOUT=*                                                          
//TOOLIN   DD *                                                                 
  SELECT FROM(INPUT) TO(OUTPUT) -                                               
  ON(118,9,CH)  -                                                               
  ON(118,9,CH) ALLDUPS                                                          
