//BP13A260 JOB (BP13P),'BP13A260',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*-------------------------------------------------------------------*         
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP132919 LMS 09/07/07 NEW JCL                                               
//*-------------------------------------------------------------------*         
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'A1')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C00A,COND=(0,NE)                                00581021
//BP13F205 DD DSN=&&BP13F205,DISP=(SHR,PASS)                            00583024
//BP13K870 DD DSN=BP13.K870.PANEL,DISP=SHR                              00584022
//BP13F870 DD DSN=&&BP13F870,DISP=(,PASS),                              00584022
//         UNIT=(SYSDA),SPACE=(CYL,(5,10),RLSE),                                
//         DCB=(BLKSIZE=300,LRECL=30,RECFM=FB)                                  
//SYSDBG   DD SYSOUT=*                                                  00585021
//SYSDBOUT DD SYSOUT=*                                                  00585021
//SYSOUT   DD SYSOUT=*                                                  00585021
//*---------------------------------------------------------------------        
//* PRINT REPORT BY TEAM ID                                                     
//*---------------------------------------------------------------------        
//STEP04  EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE, TEXT82'                   
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(500,500),,,ROUND)                         
//BP13F870 DD  DSN=&&BP13F870,DISP=(SHR,PASS)                                   
//BP13K875 DD  DSN=BP13.K875.PNAME,DISP=SHR                                     
//SY08K010 DD  DSN=SY08.K010.USERID,DISP=SHR                                    
//FT18F001 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S250),DISP=SHR                            
