//BP13M519 JOB (BP13P),'BP13M519',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//********************************************************************* 00000040
//* RUN ON 10TH OF THE MONTH                                            00000040
//*1) FS CASES SENT TO ROM TO GET MARRIAGE DATA                         00000040
//*2) FOR EXTRACTION OF RECORDS WITH DATE RECEIVED <=                   00000040
//*   3 MONTHS FROM SYSTEM DATE AND REWRITE TO BP13K517                 00000040
//*-------------------------------------------------------------                
//*CHG-NO   BY  ON     - REMARK                                                 
//*-------------------------------------------------------------                
//*BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                  
//*BP136646 LSB 170911 - DELETE ADHOC CASE, SEND FS CASE MONTHLY                
//*BP137791 LSB 190911 - CREATE FTS/SSC CASES                                   
//*BP138663 LSB 030921 - SENT 3 MONTH PCD NON -MARRIED CASES                    
//*BP138833 LSB 230921 - SPLIT NON-FS FROM BP13M517                             
//********************************************************************* 00000040
//*-------------------------------------------------------------------*         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                     *         
//*-------------------------------------------------------------------*         
//STEPA    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K517.ROMFTS,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//******************************************************************            
//* PROCESS SINGLE SCHEME                                                       
//******************************************************************            
//*        DELETE BP13.K517.ROMFTS CLUSTER PURGE                                
//*-------------------------------------------------------------                
//STEP10    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR250,DISP=SHR                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
             DEL 'BP13.K517.ROMFTS' CL PURGE                                    
             DEF CLUSTER                              -                 00800000
               (NAME(BP13.K517.ROMFTS)               -                  00810000
               CYL(30 10)                               -               00830000
               UNIQUE                                 -                 00840000
               SPEED                                  -                         
               STORCLAS(PRODRLS)                      -                         
               LOG(NONE)                              -                         
               SHR(2 3))                              -                 00850000
               DATA                                   -                 00860000
               (NAME(BP13.K517.ROMFTS.DATA)          -                  00870000
               KEYS(20 0)                             -                 00880000
               RECSZ(250 250)                         -                 00890000
               CISZ(4096)                             -                 00900000
               FSPC(10 10))                           -                 00910000
               INDEX                                  -                 00920000
               (NAME(BP13.K517.ROMFTS.INDEX)         -                  00930000
               CISZ(4096))                                              00940000
           IF MAXCC = 0  THEN                         -                 00950000
               REPRO IFILE(INPUT1)                    -                 00960000
               ODS(BP13.K517.ROMFTS)                 -                  00720000
               REUSE                                                            
/*                                                                              
//*-------------------------------------------------------------------*         
//* INCLUDE ALLOC-SCH=FTS, ELIG-SCH=SSC CASES                                   
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//        AMP=('BUFND=4','BUFNI=8')                                             
//SORTOUT  DD DSN=&&F800FTS,DISP=(,PASS),                                       
//        UNIT=(SYSDA,2),                                                       
//        DCB=(RECFM=FB,LRECL=2000,BLKSIZE=18000),                              
//        SPACE=(CYL,(180,80),RLSE)                                             
//SYSIN    DD  *                                                                
     SORT FIELDS=(4,8,A),FORMAT=CH                                              
     INCLUDE COND=(1,1,CH,NE,C'C',AND,                                          
                  60,3,CH,NE,C'FS ',AND,                                        
             155,4,CH,NE,C'    ')                                               
//**        (57,3,CH,EQ,C'FTS',OR,60,3,CH,EQ,C'SSC'))                           
//*-----------------------------------------------------------------            
//* SEND FS CASES TO ROM FOR MARRIAGE DATA                                      
//*-----------------------------------------------------------------            
//STEP12  EXEC PGM=BP13C50A,COND=(0,NE)                                         
//BP13F800 DD DSN=&&F800FTS,DISP=(OLD,PASS)                                     
//BP13K517 DD DSN=BP13.K517.ROMFTS,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13BE01 DD DSN=BP13.F400.SENDID.MRG.BE01,DISP=MOD                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  END OF BP13M519                                                    00000500
//*---------------------------------------------------------------------00000510
