//BP13A59J JOB (BP13P),'BP13A59J',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//*=================================================================            
//*                                                                             
//*  THIS JOB IS CREATE VFY FILE FOR EMAIL SENDING                              
//*  ROF CASES                                                                  
//*                                                                             
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---  -------- -----------                                          
//* BP136922 ZDD1 100817   NEW JCL                                              
//*=================================================================            
//* SELECTION 2 CASES FOR PRE EMAIL SENDING VERIFICATION                        
//* SEND EMAIL TO CT2/LH2/SL20/WMT1                                             
//*---------------------------------------------------------------------        
//*-------------------------------------------------------------------*         
//* EMPTY MONTHLY ACCUMULATED EMAIL FILES                             *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR200,DISP=OLD                                   
//OUTPUT01 DD DSN=BP13.F23A.EMAIL.ROF.R1.VFY,DISP=OLD                           
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT01)                                 
//*-------------------------------------------------------------------*         
//* EMPTY MONTHLY ACCUMULATED EMAIL FILES                             *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR200,DISP=OLD                                   
//OUTPUT01 DD DSN=BP13.F23A.EMAIL.ROF.R2.VFY,DISP=OLD                           
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT01)                                 
//*---------------------------------------------------------------------        
//* FOR R1                                                                      
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=ICETOOL                                                     
//DFSMSG   DD SYSOUT=*                                                          
//TOOLMSG  DD SYSOUT=*                                                          
//IN01 DD DSN=BP13.F23A.EMAIL.ROF.R1,DISP=SHR                                   
//*                                                                             
//OUT01 DD DSN=BP13.F23A.EMAIL.ROF.R1.VFY,DISP=SHR                              
//TOOLIN    DD *                                                                
  COPY FROM(IN01) USING(CT01)                                                   
//*                                                                             
//CT01CNTL  DD *                                                                
  OUTFIL FNAMES=OUT01,OUTREC=(1,73,C'CT2@HDB.GOV.SG',36X,124,77),               
         ACCEPT=2                                                               
//*                                                                             
//*---------------------------------------------------------------------        
//* FOR R2                                                                      
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=ICETOOL                                                     
//DFSMSG   DD SYSOUT=*                                                          
//TOOLMSG  DD SYSOUT=*                                                          
//IN01 DD DSN=BP13.F23A.EMAIL.ROF.R2,DISP=SHR                                   
//*                                                                             
//OUT01 DD DSN=BP13.F23A.EMAIL.ROF.R2.VFY,DISP=SHR                              
//TOOLIN    DD *                                                                
  COPY FROM(IN01) USING(CT01)                                                   
//*                                                                             
//CT01CNTL  DD *                                                                
  OUTFIL FNAMES=OUT01,OUTREC=(1,73,C'CT2@HDB.GOV.SG',36X,124,77),               
         ACCEPT=2                                                               
//*                                                                             
