//BP13A738 JOB (BP13P),'BP13A738',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=====================================================================        
//*  EXTRACT CASES INDICATE SUCC IN THE SURVEY LETTER, EXTRACT CASES            
//*  FROM RESERVE LIST FILE BP13K705 TO BP13K700                                
//*=====================================================================        
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- ---------------------------------------------        
//* BP130837 LSB 20000519 - NEW JCL                                             
//* BP132546 YCH 11062004 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)               
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K700.RESERVE,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------            
//* SORT BY DTE BALLOT, NT, FT, QUEUE NO                                        
//* INCLUDE ONLY STATUS = 'R'                                                   
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K789.SURVEY,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F789,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(TRK,(50,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=100)                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,16,A),FORMAT=CH                                              
    INCLUDE COND=(17,1,CH,EQ,C'R')                                              
//*-----------------------------------------------------------------            
//* MATCH BP13F789 AND BP13K705 AND OUTPUT TO BP13F700                          
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C076,COND=(0,NE)                                        
//BP13F789 DD DSN=&&BP13F789,DISP=(OLD,PASS)                                    
//BP13K705 DD DSN=BP13.K705.SOCLIST,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13F700 DD DSN=BP13.F700.RESERVE,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY RANDOM NUMBER                                                       
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F700.RESERVE,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F700,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                              
//             DCB=(RECFM=FB,LRECL=500)                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//*  DELETE AND DEFINE BP13K700 - RESERVE FILE                                  
//*---------------------------------------------------------------------        
//STEP04    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT     DD DSN=&&BP13F700,DISP=(OLD,PASS)                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN    DD *                                                                 
         DEL 'BP13.K700.RESERVE' CL PURGE                                       
         DEF CL (NAME(BP13.K700.RESERVE)               -                        
                 CYL(40 20)                            -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K700.RESERVE.DATA)         -                        
                 KEYS(28 0)                            -                        
                 RECSZ(500 500)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K700.RESERVE)                                         
         DEF AIX (NAME(BP13.K700.RESERVE.ALTX1)        -                        
                 REL(BP13.K700.RESERVE)                -                        
                 CYL(2 1)                              -                        
                 UNIQUE                                -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K700.RESERVE.ALTX1.DATA)   -                        
                 KEYS(9 40)                            -                        
                 CISZ(4096)                            -                        
                 RECSZ(42 933)                         -                        
                 NUNQK)                                                         
         IF MAXCC = 0 THEN                             -                        
             DEF PATH(NAME(BP13.K700.RESERVE.PATH1)    -                        
                 PENT(BP13.K700.RESERVE.ALTX1))                                 
         IF MAXCC = 0 THEN                             -                        
             BIX IDS(BP13.K700.RESERVE)                -                        
                 ODS(BP13.K700.RESERVE.ALTX1)                                   
         DEF AIX (NAME(BP13.K700.RESERVE.ALTX2)        -                        
                 REL(BP13.K700.RESERVE)                -                        
                 CYL(2 1)                              -                        
                 UNIQUE                                -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K700.RESERVE.ALTX2.DATA)   -                        
                 KEYS(6 34)                            -                        
                 CISZ(4096)                            -                        
                 RECSZ(42 933)                         -                        
                 NUNQK)                                                         
         IF MAXCC = 0 THEN                             -                        
             DEF PATH(NAME(BP13.K700.RESERVE.PATH2)    -                        
                 PENT(BP13.K700.RESERVE.ALTX2))                                 
         IF MAXCC = 0 THEN                             -                        
             BIX IDS(BP13.K700.RESERVE)                -                        
                 ODS(BP13.K700.RESERVE.ALTX2)                                   
