//BP13A646 JOB (BP13P),'BP13A646',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR PRINTING INTERRACIAL MARRIAGE LETTERS FOR ROF               
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------------------------------------            
//* BP137439 IL5  17092018 NEW JCL                                              
//* BP139376 IL5  12012023 CHANGE IOMS SERVER FROM HDBIOMNFS TO                 
//*                        HDBIOM3NFSP1                                         
//*-----------------------------------------------------------------            
//* OMIT CANCELLED APPLICATIONS                                                 
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OMIT COND=(260,1,CH,EQ,C'C')                                                
    SUM FIELDS=NONE                                                             
//*-----------------------------------------------------------------            
//* GENERATE CFM LETTERS RAW-DATA USING IOMS                                    
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13CJ01,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR,                                       
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13FB10 DD DSN=BP13.FIOMSB10.A646CJ01,DISP=OLD                               
//BP13FH10 DD DSN=BP13.FIOMSH10.A646CJ01,DISP=OLD                               
//BP13FTP  DD DSN=BP13.FIOMSFTP.A646CJ01,DISP=OLD                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
BP13A646                                                                        
BP13.FIOMSB10.A646CJ01                                                          
BP13.FIOMSH10.A646CJ01                                                          
//*--------------------------------------------------------------------         
//* STEP TO FTP SEQUENTIAL FILE TO IOMS SERVER                                  
//*PS0900  EXEC FTP,PARM='HDBIOM3AST01 (EXIT'                                   
//*NETRC    DD DSN=SY08T.FTP.NETRC.BP13,DISP=SHR                                
//*--------------------------------------------------------------------         
//STEP03  EXEC FTP,PARM='HDBIOM3NFSP1 (EXIT',COND=(0,NE)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.FIOMSFTP.A646CJ01,DISP=SHR                               
//*-----------------------------------------------------------------            
//*                      END OF JOB                                             
//*-----------------------------------------------------------------            
