//BP13A546 JOB (BP13P),'BP13A546',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* EXTRACT WAITING LIST APLLN FOR PIGEONHOLING                                 
//* NOTE: THIS JCL WAS CHANGED FOR DBSS ONLY                                    
//*                                                                             
//* THIS IS THE 1ST JCL FOR DBSS SHORTLISTING. TO RUN BEFORE ASSIGNING          
//* OF RANDOM NO. ASSIGN RANDOM NO IS BP13AA05.                                 
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP132927 CKK 101106 - NEW JCL FOR DBSS APPLICATION                          
//* BP133400 IL5 270808 - HARDCODE NT FOR GE BALLOT                             
//* BP133425 IL5 111208 - HARDCODE NT FOR BH BALLOT                             
//* BP133544 IL5 070509 - HARDCODE NT FOR TP BALLOT                             
//* BP134036 IL5 121010 - UPDATE INPUT FILES FOR BP13CH14                       
//* BP134142 IL5 150311 - HARDCODE NT FOR YS BALLOT                             
//* BP134270 IL5 060711 - HARDCODE NT FOR PG EC BALLOT                          
//* BP134371 IL5 181011 - HARDCODE NT FOR BD DBS BALLOT                         
//* BP134523 IL5 100512 - HARDCODE NT FOR PRC DBS BALLOT                        
//* BP134861 EAA1 30042013 EXPAND BP13K010 TO 600                               
//* BP138164 AM25 16012020 NEW OUTPUT FILE P13FH14A FOR BP13CH14                
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01                    APPLICATION TEAM                                  
//**************************************************************                
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//* SORT OUT DBSS APPLICATION ONLY                                              
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F500.DBSS,DISP=OLD                                       
//*SORTOUT  DD DSN=&&F500MNT,DISP=(NEW,PASS),                                   
//*            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                             
//*            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(376,3,CH,EQ,C'DBS',AND,187,3,CH,EQ,C'PRC',AND,               
                   334,6,CH,EQ,C'201204')                                       
//*  INCLUDE COND=(376,3,CH,EQ,C'EC ',AND,187,3,CH,EQ,C'PG ',AND,               
//*                334,6,CH,EQ,C'201107')                                       
//*--------------------------------------------------------------------         
//* SORT BTO MATURE REQUESTS TO SEQUENTIAL FILE                                 
//*---------------------------------------------------------------------        
//STEP02A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.DBSS,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(187,3,A,211,2,A,123,8,A),FORMAT=CH                            
//*-------------------------------------------------------------------*         
//* UPDATE BALLOT HOUSEHOLD TO 'G' IF 'H' APPLICATIONS HAVE 2 NON-              
//* SELECTION RECORDS                                                           
//* INPUT - BP13F730 BP13KH10 BP13K816                                          
//* I-O   - BP13K730                                                            
//* OUTPUT - P13F730A P13LH14A                                                  
//*-------------------------------------------------------------------*         
//STEP02B  EXEC PGM=BP13CH14,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//BP13KH12 DD DSN=BP13.KH12.NOTBKCNT.HISTORY,DISP=SHR,                          
//         AMP=('BUFND=23')                                                     
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=23')                                                     
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=23')                                                     
//BP13K826 DD DSN=BP13.K825.REQOCCP.PATH1,DISP=SHR,                             
//         AMP=('BUFND=23')                                                     
//BP13K730 DD DUMMY                                                             
//P13F730A DD DSN=BP13.F500.DBSS,DISP=OLD                                       
//P13LH14A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13FH14A DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*  SORT OUT ALL THE CANCELLED DBSS CASES FROM BALLOT LOG FILE                 
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F595,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(160,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      INCLUDE COND=(260,1,CH,EQ,C'C',AND,                                       
                    123,1,CH,EQ,C'5',AND,                                       
                    187,3,CH,EQ,C'PRC')                                         
//*   INCLUDE COND=(260,1,CH,EQ,C'C',AND,                                       
//*                 123,1,CH,EQ,C'6')                                           
//*---------------------------------------------------------------------        
//* PRINT REPORT FOR CANCELLATION DBSS REQUESTS                                 
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C527,COND=(0,NE)                                        
//BP13F595 DD DSN=&&P13F595,DISP=(OLD,PASS)                                     
//BP13K500 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K501 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                             
//BP13K502 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                             
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR                                   
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13L527 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  REPRO MATURE REQUEST                                                       
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.F500.DBSS,DISP=SHR                                       
//OUTPUT2  DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*                                                                             
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(131,1,CH,EQ,C'Y',AND,7,2,CH,EQ,C'  ')                           
  OUTREC FIELDS=(1,200,200X)                                                    
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C577,COND=(0,NE)                                        
//BP13F500 DD DSN=BP13.F500.DBSS,DISP=SHR                                       
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=BP13.F558.UPGOCCP,DISP=OLD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010N,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010N,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.BLANK.CHAR20,DISP=SHR                                    
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING             
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010D,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
                 4,2,CH,EQ,C'2A',OR,                                            
                 4,2,CH,EQ,C'1 ',OR,                                            
                 4,2,CH,EQ,C'2 ',OR,                                            
                 4,2,CH,EQ,C'E ')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY FOR 1A,2A,E FLATS                              
//* BEFORE PIGEON-HOLING                                                        
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010D,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.BLANK.CHAR20,DISP=SHR                                    
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A546                                                                
//*---------------------------------------------------------------------        
