//BP13D705  JOB (BP13P),'BP13D705',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*================================================================*            
//*                                                                *            
//*         C P F  2 4 / 7  F I L E   P R O C E S S I N G          *            
//*                                                                *            
//*================================================================*            
//* CHGE REQ     DATE     BY    DESCRIPTION                        *            
//* --------  ----------  ----  -----------                        *            
//* BP136692  26/04/2017  KSJ3  NEW JCL                            *            
//* BP136755  04/05/2017  KSJ3  ADD BP13C477                       *            
//* BP136711  16/05/2017  KSJ3  ADD BP13C478                       *            
//* BP136757  23/05/2017  KSJ3  ADD COPY SENT FILE TO ACCUM        *            
//* BP137480  07/03/2019  LJL1  INCREASE THE DISK SPACES FOR F60A  *            
//* BP138071  15/01/2020  LJL1  INCREASE THE DISK SPACES FOR F60A  *            
//* BP134261  10/01/2023  LJL1  INCREASE THE DISK SPACES FOR F60A  *            
//*================================================================*            
//*--------------------------------------------------------------------         
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                                   
//*--------------------------------------------------------------------         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K600.CPFWDL,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K60A.CPFUPD,DISP=OLD                                     
//INPUT3   DD DSN=BP13.K60F.CPFPEND,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K607.CPFREJ,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     VFY FILE(INPUT1)                                                           
     VFY FILE(INPUT2)                                                           
     VFY FILE(INPUT3)                                                           
     VFY FILE(INPUT4)                                                           
//*                                                                             
//*--------------------------------------------------------------------         
//*  BACKUP FILES BEFORE RUN                                                    
//*--------------------------------------------------------------------         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K60A.CPFUPD,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F60A.CPFUPD.BFDAILY(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(500,100)),                                            
//            DCB=(BP13.GDG,BLKSIZE=27000,LRECL=1800,RECFM=FB)                  
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*                                                                             
//*-------------------------------------------------------------------- 00049000
//*  TO EXTRACT UPDATED BP13F60A RECORDS                                        
//*-------------------------------------------------------------------- 00049200
//STEP02   EXEC SORT,COND=(0,NE)                                        00049300
//SORTIN   DD DSN=BP13.K60A.CPFUPD,DISP=SHR                             00049405
//SORTOUT  DD DSN=&&BP13F60A,DISP=(,PASS),                              00049504
//            UNIT=(SYSDA,3),DCB=(RECFM=FB,LRECL=1800,BLKSIZE=27000),   00049600
//            SPACE=(CYL,(250,50),RLSE)                                 00049700
//SYSIN    DD  *                                                        00049800
  SORT FIELDS=COPY                                                      00049900
  INCLUDE COND=((405,08,CH,EQ,C'00000000',OR,                                   
                 405,08,CH,EQ,C'        '),AND,                                 
                 736,01,CH,EQ,C'Y',AND,                                         
                (747,08,CH,NE,C'00000000',AND,                                  
                 747,08,CH,NE,C'        '))                                     
//*                                                                     00049000
//*-------------------------------------------------------------------- 00049000
//*  SYNC UPDATED BP13K60A RECORDS TO BP13K600                                  
//*-------------------------------------------------------------------- 00049200
//STEP03   EXEC PGM=BP13C474,COND=(0,NE)                                        
//BP13F60A DD DSN=&&BP13F60A,DISP=(OLD,DELETE)                          00100004
//BP13K600 DD DSN=BP13.K600.CPFWDL,DISP=OLD                             00102004
//SYSOUT   DD SYSOUT=*                                                  00110000
//*                                                                             
//*-------------------------------------------------------------------- 00049000
//*  SYNC SENT BP13K600 RECORDS (FROM BP13C470) TO BP13K60A                     
//*-------------------------------------------------------------------- 00049200
//STEP04   EXEC PGM=BP13C475,COND=(0,NE)                                        
//BP13F600 DD DSN=BP13.F600.CPFWDL.SENT,DISP=SHR                        00100004
//BP13K60A DD DSN=BP13.K60A.CPFUPD,DISP=OLD                             00102004
//SYSOUT   DD SYSOUT=*                                                  00110000
//*                                                                             
//*--------------------------------------------------------------------         
//* CREATE PENDING REC FOR NEWLY SENT CPF REGNS                                 
//*--------------------------------------------------------------------         
//STEP05   EXEC PGM=BP13C477,COND=(0,NE)                                        
//BP13F600 DD DSN=BP13.F600.CPFWDL.SENT,DISP=SHR                                
//BP13K60F DD DSN=BP13.K60F.CPFPEND,DISP=OLD                                    
//BP13K601 DD DSN=BP13.K60F.CPFPEND.PATH2,DISP=OLD                              
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* DELETE IN CPF PENDING FILE FOR SENT CPF RECORDS                             
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=BP13C478,COND=(0,NE)                                        
//BP13F600 DD DSN=BP13.F600.CPFWDL.SENT,DISP=SHR                                
//BP13K607 DD DSN=BP13.K607.CPFREJ,DISP=OLD                                     
//BP13K601 DD DSN=BP13.K607.CPFREJ.PATH2,DISP=OLD                               
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//*  BACKUP SENT FILE AND EMPTY                                                 
//*--------------------------------------------------------------------         
//STEP99   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F600.CPFWDL.SENT,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.F600.CPFWDL.SENT.BFDAILY(+1),DISP=(NEW,CATLG),           
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=1800,RECFM=FB)                      
//INPUT2   DD DSN=BP13.F600.CPFWDL.SENT,DISP=SHR                                
//OUTPUT2  DD DSN=BP13.F600.CPFWDL.SENT.ACCUM,DISP=MOD                          
//INPUT3   DD DSN=NULLFILE,                                                     
//            RECFM=FB,LRECL=1800,BLKSIZE=0                                     
//OUTPUT3  DD DSN=BP13.F600.CPFWDL.SENT,DISP=OLD                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*                                                                             
//*                                                                             
