//BP13ASUW JOB (BP13P),'BP13ASUW',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//*    UPDATE FOR SUCC-NT TO BLANK FOR UNSUCCESSFUL CASES          *            
//*    AT THE END OF SHORTLIST PROCESS                             *            
//*    PRINTS REPORTS FOR USERS                                    *            
//*    - TENDER PROGRAM ONLY HAVE NEW FLAT SUPPLY                  *            
//*    - SORT OUT ONLY GRO      CASES FOR PIGEONHOLING             *            
//*================================================================*            
//* CHG-NO  BY   ON      DESCRIPTION                                            
//* --------------------------------                                            
//*BP133292 IL5 160208 - NEW                                                    
//*BP133511 IL5 300109 - REMOVE PROGRAM BP13C71I FOR UPDATING COHORT            
//*                      FOR RECORDS WITH BALLOT STATUS = 'W'                   
//*BP133636 IL5 240709 - ADDED REPORT P13L026B ON NO OF CHANCES                 
//*                      ACCORDED DUE TO UNSUCCESSFUL ATTEMPT                   
//*BP133832 IL5 060310 - NEW REPORTS TO ON COHORTS WHERE GROS                   
//*                      TCPS AND TPS ARE SHORTLISTED                           
//*BP133870 IL5 060510 - CHANGE INCLUDE COND FOR TPS STEP                       
//*BP134036 IL5 201010 - STORE REPORTS FROM BP13S026 INTO DATASETS              
//*BP134071 ZDD 241110 - INCLUDE BP13CF20                                       
//*BP134782 SMR 180213 - ADD A REPORT FOR PPS CASES IN BP13S032                 
//*BP134914 SMR 140613 - ADD A REPORT FOR AST CASES IN BP13S032                 
//*BP135028 SMR 150813 - ADD A REPORT FOR FTS CASES IN BP13S032                 
//*BP135170 IL5 281213 - ADD BP13CF99 TO DETERMINE START Q FOR                  
//*                      S,R AND W                                              
//*BP135492 SMR 281014 - ADD A REPORT FOR SLA CASES IN BP13S032                 
//*BP135708 SMR 310315 - CHANGE CLASS=2 TO CLASS=J                              
//*BP136291 IL5 220616 - SORT SUCC PPS AND AST FROM BP13K740                    
//*BP136291 SMR 070716 - ADD NEW PROGRAMS, BP13CD18 AND BP13CD93                
//*BP136296 IL5 280716 - ADD STEP TO MATCH K813 AND K740 BEF BP13CD18           
//*BP136633 SMR 060317 - ADD REPORTS FOR FSH/RHS/RHO CASES IN BP13S032          
//*BP137052 SMR 261017 - NEW SHORTLISTING REPORTS (BP13CB63)                    
//*BP137301 FNP 120618 - INCLUDE BP13S595 FOR SHORTLISTED UNDER PRIORITY        
//*BP137455 LSB 210918 - ADD BP13FW3H, FW3I                                     
//*BP137455 FNP 250918 - REMOVE BP13FW3H,CHANGE TO BP13FW3I                     
//*BP137549 IL5 030119 - REMOVE DELETE FOR BP13.K010.TENDER.BFADJUST            
//*BP137549 FNP 180119 - CATER FOR NOT PAIRE OUTPUT FROM BP13CB63               
//*BP138214 AM2 120320 - CATER FOR BP13FW3I COPYCOB CHANGES                     
//*BP138301 AM2 140520 - HARDCOPY REPORTS CONVERSION                            
//*BP139670 AM2 250823 - CATER FOR FT(PMC)                                      
//******************************************************************            
//**********************************************************************        
//*      VERIFY FILES BEFORE JOB RUN                                            
//**********************************************************************        
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K703.SOCDATE,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------*         
//* TO SORT OUT FOR CASES IN BALLOT FILE                                        
//* GENERATE TABLE REPORT BP13L026                                              
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F730,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(260,2,A,80,2,A),FORMAT=CH                                       
//*-------------------------------------------------------------------*         
//* GENERATE REPORT BP13L026                                                    
//* SHOWS APPLICATIONS SHORTLISTED BY NT,FT,COHORT,UNSUCC ATMP                  
//*-------------------------------------------------------------------*         
//STEP02   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                   
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,DELETE)                                  
//P13L026A DD DSN=BP13.L026A.BP13S026.ASUW,DISP=SHR                             
//P13L026B DD DSN=BP13.L026B.BP13S026.ASUW,DISP=SHR                             
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S026),DISP=SHR                             
//*-------------------------------------------------------------------*         
//* TO SORT OUT GROS RECORDS IN PUBLIC ROUND                                    
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730GRO,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(28,1,CH,EQ,C'G')                                               
//*-------------------------------------------------------------------*         
//* TO SORT OUT FOR CASES IN BALLOT FILE                                        
//* GENERATE TABLE REPORT BP13L026                                              
//*-------------------------------------------------------------------*         
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730TCP,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(420,3,CH,EQ,C'TCP',OR,213,3,CH,EQ,C'TCP')                      
//*-------------------------------------------------------------------*         
//* TO SORT OUT FOR CASES IN BALLOT FILE                                        
//* GENERATE TABLE REPORT BP13L026                                              
//*-------------------------------------------------------------------*         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730TPS,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(213,3,CH,EQ,C'TPS',OR,420,3,CH,EQ,C'TPS')                      
//*-------------------------------------------------------------------*         
//* TO SORT OUT FOR CASES IN BALLOT FILE                                        
//* GENERATE TABLE REPORT BP13L026                                              
//*-------------------------------------------------------------------*         
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730HH,DISP=(NEW,PASS),                                     
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(116,1,CH,NE,C'G',AND,461,1,CH,EQ,C'G')                         
//*-------------------------------------------------------------------*         
//* TO SORT OUT FOR CASES IN BALLOT FILE                                        
//* GENERATE TABLE REPORT BP13L026                                              
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730MG,DISP=(NEW,PASS),                                     
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(28,1,CH,EQ,C'M')                                               
//*-------------------------------------------------------------------*         
//* TO SORT OUT FOR CASES IN BALLOT FILE                                        
//* GENERATE TABLE REPORT BP13L026                                              
//*-------------------------------------------------------------------*         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730SR,DISP=(NEW,PASS),                                     
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(433,1,CH,EQ,C'P')                                              
//*-------------------------------------------------------------------*         
//* TO SORT OUT FOR CASES IN BALLOT FILE                                        
//* GENERATE TABLE REPORT BP13L026                                              
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730AP,DISP=(NEW,PASS),                                     
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(244,1,CH,EQ,C'1',OR,244,1,CH,EQ,C'T')                          
//*-----------------------------------------------------------------            
//* SORT BY REGN ALL SHORTLISTED UNDER PPS QUOTA                                
//*-----------------------------------------------------------------            
//STEP10A EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                                    
//SORTOUT DD DSN=&&F740PPS,DISP=(,PASS),                                        
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(470,1,CH,EQ,C'Y')                                             
//*-----------------------------------------------------------------            
//* SORT BY REGN ON BALLOT FILE TO GET RESULT                                   
//*-----------------------------------------------------------------            
//STEP10B EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                   
//        AMP=('BUFND=23')                                                      
//SORTOUT DD DSN=&&F740PPSE,DISP=(,PASS),                                       
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(226,1,CH,NE,C' ',AND,(469,1,CH,EQ,C'Y',OR,                    
                  469,1,CH,EQ,C'E',OR,469,1,CH,EQ,C'F'),AND,                    
                  245,1,CH,EQ,C' ')                                             
//*---------------------------------------------------------------------        
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------------        
//STEP10C  EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F740PPS,DISP=(OLD,DELETE)                                   
//BP13F520 DD DSN=&&F740PPSE,DISP=(OLD,DELETE)                                  
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//P13SUCC  DD DSN=&&F740PPSQ,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BY REGN ALL SHORTLISTED UNDER AST QUOTA                                
//*-----------------------------------------------------------------            
//STEP11A EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                                    
//SORTOUT DD DSN=&&F740AST,DISP=(,PASS),                                        
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(472,1,CH,EQ,C'Y')                                             
//*-----------------------------------------------------------------            
//* SORT BY REGN ON BALLOT FILE TO GET RESULT                                   
//*-----------------------------------------------------------------            
//STEP11B EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                   
//        AMP=('BUFND=23')                                                      
//SORTOUT DD DSN=&&F740ASTE,DISP=(,PASS),                                       
//        UNIT=(SYSDA,1),SPACE=(CYL,(130,20),RLSE),                             
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                                
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(226,1,CH,NE,C' ',AND,471,1,CH,EQ,C'Y',AND,                    
                  245,1,CH,EQ,C' ')                                             
//*---------------------------------------------------------------------        
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*---------------------------------------------------------------------        
//STEP11C  EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F740AST,DISP=(OLD,DELETE)                                   
//BP13F520 DD DSN=&&F740ASTE,DISP=(OLD,DELETE)                                  
//P13UNSUC DD DUMMY                                                             
//P13SUCC  DD DSN=&&F740ASTQ,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* TO SORT OUT FTS RECORDS IN PUBLIC ROUND                                     
//*-------------------------------------------------------------------*         
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730FTS,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(213,3,CH,EQ,C'FTS')                                            
//*-------------------------------------------------------------------*         
//* TO SORT OUT SLA RECORDS IN PUBLIC ROUND                                     
//*-------------------------------------------------------------------*         
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730SLA,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(213,3,CH,EQ,C'SLA')                                            
//*-------------------------------------------------------------------*         
//* TO SORT OUT FSH RECORDS IN PUBLIC ROUND                                     
//*-------------------------------------------------------------------*         
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730FSH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(213,3,CH,EQ,C'FSH',OR,420,3,CH,EQ,C'FSH')                      
//*-------------------------------------------------------------------*         
//* TO SORT OUT RHS RECORDS IN PUBLIC ROUND                                     
//*-------------------------------------------------------------------*         
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730RHS,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(213,3,CH,EQ,C'RHS')                                            
//*-------------------------------------------------------------------*         
//* TO SORT OUT RHO RECORDS IN PUBLIC ROUND                                     
//*-------------------------------------------------------------------*         
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730RHO,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,1,28,A),FORMAT=CH                                       
   INCLUDE COND=(213,3,CH,EQ,C'RHO')                                            
//*-------------------------------------------------------------------*         
//* GENERATE REPORT BP13L027                                                    
//*-------------------------------------------------------------------*         
//STEP20   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                   
//BP13F73A DD DSN=&&F730GRO,DISP=(OLD,DELETE)                                   
//BP13F73B DD DSN=&&F730TCP,DISP=(OLD,DELETE)                                   
//BP13F73C DD DSN=&&F730TPS,DISP=(OLD,DELETE)                                   
//BP13F73D DD DSN=&&F730HH,DISP=(OLD,DELETE)                                    
//BP13F73E DD DSN=&&F730MG,DISP=(OLD,DELETE)                                    
//BP13F73F DD DSN=&&F730SR,DISP=(OLD,DELETE)                                    
//BP13F73G DD DSN=&&F730AP,DISP=(OLD,DELETE)                                    
//BP13F73H DD DSN=&&F740PPSQ,DISP=(OLD,DELETE)                                  
//BP13F73I DD DSN=&&F740ASTQ,DISP=(OLD,DELETE)                                  
//BP13F73J DD DSN=&&F730FTS,DISP=(OLD,DELETE)                                   
//BP13F73K DD DSN=&&F730SLA,DISP=(OLD,DELETE)                                   
//BP13F73L DD DSN=&&F730FSH,DISP=(OLD,DELETE)                                   
//BP13F73M DD DSN=&&F730RHS,DISP=(OLD,DELETE)                                   
//BP13F73N DD DSN=&&F730RHO,DISP=(OLD,DELETE)                                   
//P13L032A DD SYSOUT=8,DEST=IOM8                                                
//P13L032B DD SYSOUT=8,DEST=IOM8                                                
//P13L032C DD SYSOUT=8,DEST=IOM8                                                
//P13L032D DD SYSOUT=8,DEST=IOM8                                                
//P13L032E DD SYSOUT=8,DEST=IOM8                                                
//P13L032F DD SYSOUT=8,DEST=IOM8                                                
//P13L032G DD SYSOUT=8,DEST=IOM8                                                
//P13L032H DD SYSOUT=8,DEST=IOM8                                                
//P13L032I DD SYSOUT=8,DEST=IOM8                                                
//P13L032J DD SYSOUT=8,DEST=IOM8                                                
//P13L032K DD SYSOUT=8,DEST=IOM8                                                
//P13L032L DD SYSOUT=8,DEST=IOM8                                                
//P13L032M DD SYSOUT=8,DEST=IOM8                                                
//P13L032N DD SYSOUT=8,DEST=IOM8                                                
//P13L032Z DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S032),DISP=SHR                             
//*-------------------------------------------------------------------*         
//* TO SORT OUT FOR CASES IN BALLOT FILE                                        
//*-------------------------------------------------------------------*         
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F740,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                  
//SYSIN     DD  *                                                               
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* RUN PROGRAM BP13CF20                                                        
//*---------------------------------------------------------------------        
//STEP22 EXEC    PGM=BP13CF20,COND=(0,NE)                                       
//BP13F740 DD  DSN=&&BP13F740,                                                  
//             DISP=(OLD,DELETE)                                                
//BP13OUT1 DD  DSN=BP13.LF20.ASUW,                                              
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* POPULATE QUEUE NO TO BP13K703                                               
//* OUTREC 1ST HUNDRED PERCENT (REQ-STAT = '1')                                 
//* SORT BY NT, FT, RANDOM #                                                    
//*---------------------------------------------------------------------        
//STEP23A EXEC  SORT,COND=(0,NE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F740,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(187,3,A,211,2,A,1,28,A),FORMAT=CH                                
  INCLUDE COND=(260,1,CH,EQ,C'S')                                               
  OUTREC FIELDS=(1,259,C'1',261,240)                                            
//*---------------------------------------------------------------------        
//* POPULATE QUEUE NO TO BP13K703                                               
//* OUTREC 2ND HUNDRED PERCENT (REQ-STAT = '2')                                 
//* SORT BY NT, FT, RANDOM #                                                    
//*---------------------------------------------------------------------        
//STEP23B EXEC  SORT,COND=(0,NE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F740,DISP=(MOD,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(187,3,A,211,2,A,1,28,A),FORMAT=CH                                
  INCLUDE COND=(260,1,CH,EQ,C'R')                                               
  OUTREC FIELDS=(1,259,C'2',261,240)                                            
//*---------------------------------------------------------------------        
//* POPULATE QUEUE NO TO BP13K703                                               
//* OUTREC 3RD HUNDRED PERCENT (REQ-STAT = '3')                                 
//* SORT BY NT, FT, RANDOM #                                                    
//*---------------------------------------------------------------------        
//STEP23C EXEC  SORT,COND=(0,NE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F740,DISP=(MOD,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(187,3,A,211,2,A,1,28,A),FORMAT=CH                                
  INCLUDE COND=(260,1,CH,EQ,C'W')                                               
  OUTREC FIELDS=(1,259,C'3',261,240)                                            
//*---------------------------------------------------------------------        
//* POPULATE QUEUE NO TO BP13K703                                               
//* SORT BY NT, FT, REQ-STAT, RANDOM #                                          
//*---------------------------------------------------------------------        
//STEP23D EXEC  SORT,COND=(0,NE)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&BP13F740,DISP=(OLD,DELETE)                                 
//SORTOUT  DD  DSN=&&F740CF99,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(187,3,A,211,2,A,260,1,A,1,28,A),FORMAT=CH                        
//*---------------------------------------------------------------------        
//* POPULATE QUEUE NO TO BP13K703                                               
//* DETERMINE START QUEUE PER REQ-STAT/NT/FT                                    
//*---------------------------------------------------------------------        
//STEP23E  EXEC PGM=BP13CF99,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CF99,DISP=(OLD,DELETE)                                  
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BY NT, FT                                                              
//*---------------------------------------------------------------------        
//STEP24A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740CD93,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(187,3,A,211,2,A),FORMAT=CH                                     
//*---------------------------------------------------------------------        
//* GENERATE REPORT ON SHORTLISTING OF APPLICATIONS                             
//*---------------------------------------------------------------------        
//STEP24B  EXEC PGM=BP13CD93,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CD93,DISP=(OLD,DELETE)                                  
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13LD93 DD DSN=BP13.LD93.REPORT,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY BALLOT QTR, NT                                                      
//*---------------------------------------------------------------------        
//STEP25A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740CD18,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(334,6,A,376,3,A),FORMAT=CH                                     
    SUM FIELDS=NONE                                                             
//*------------------------------------------------------------------*          
//* EXTRACT RECORDS FROM K813 MATCHING BALLOT QTR FROM BP13K740      *          
//*------------------------------------------------------------------*          
//STEP25B  EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=&&F740CD18,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//MATCH    DD DSN=&&F813CD18,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=1000,BLKSIZE=0)                               
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(334,6,A,376,3,A)                                    
   JOINKEYS FILE=F2,FIELDS=(6,6,A,113,3,A)                                      
   REFORMAT FIELDS=(F2:1,1000)                                                  
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* GENERATE REPORT ON BTO/SBF SITE INFORMATION                                 
//*------------------------------------------------------------------           
//STEP25C  EXEC PGM=BP13CD18,COND=(0,NE)                                        
//BP13F813 DD DSN=&&F813CD18,DISP=(OLD,DELETE)                                  
//BP13LD18 DD DSN=BP13.LD18.REPORT,DISP=OLD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* F1 : ALL CASES (SHORTLISTED & NOT SHORTLISTED)                              
//* F2 : CASES SHORTLISTED IN BP13APPZ                                          
//* MATCH BY RANDOM NUMBER                                                      
//* EXTRACT RECORDS THAT ARE NOT SHORTLISTED IN BP13APPZ                        
//*--------------------------------------------------------------------         
//STEP26   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTJNF2 DD DSN=BP13.F740.MATUREBA.APPZ,DISP=SHR                              
//F1ONLY   DD DSN=&&F740NMR,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD *                                                                 
   JOINKEYS FILE=F1,FIELDS=(1,28,A)                                             
   JOINKEYS FILE=F2,FIELDS=(1,28,A)                                             
   JOIN UNPAIRED,F1,ONLY                                                        
   REFORMAT FIELDS=(F1:1,500)                                                   
   OUTFILE FNAMES=F1ONLY                                                        
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* MERGE THE CASES SHORTLISTED AND NOT SHORTLISTED IN BP13APPZ                 
//* CASES THAT ARE SHORTLISTED IN BP13APPZ COULD BE DETERMINED BY               
//* CHECKING THE FIELD F740-CDE-NT5 COL 199 LEN 3 TAGGED AS 'APZ'               
//*--------------------------------------------------------------------         
//STEP27  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.F740.MATUREBA.APPZ,DISP=SHR                               
//        DD DSN=&&F740NMR,DISP=(OLD,DELETE)                                    
//SORTOUT DD DSN=&&F740CB63,DISP=(NEW,PASS),                                    
//           SPACE=(CYL,(50,20),RLSE),                                          
//           DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                 
//SYSOUT  DD SYSOUT=*                                                           
//SYSIN   DD *                                                                  
    SORT FIELDS=(376,3,A,187,3,A,211,2,A,123,8,A),FORMAT=CH                     
//*--------------------------------------------------------------------         
//* GENERATE SHORTLISTING REPORTS TO BE USED FOR CLEARANCE OF                   
//* BALLOT RESULTS                                                              
//*--------------------------------------------------------------------         
//STEP28   EXEC PGM=BP13CB63,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CB63,DISP=(OLD,DELETE)                                  
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K030 DD DSN=BP13.K010.TENDER.BFADJUST,DISP=SHR                            
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13LB63 DD DSN=BP13.LB63.REPORT,DISP=OLD                                     
//BP13FW3I DD DSN=BP13.FW3I.BALLOT.RESULT.CB63,DISP=OLD                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* SORT BP13F740/BP13F595                                                      
//*-----------------------------------------------------------------            
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F595,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(334,6,A,187,3,A,211,2,A),FORMAT=CH                               
  INCLUDE COND=(((213,3,CH,EQ,C'TCP',OR,                                        
                  213,3,CH,EQ,C'GRO',OR,                                        
                  213,3,CH,EQ,C'TPS',OR,                                        
                  213,3,CH,EQ,C'REN',OR,                                        
                  213,3,CH,EQ,C'SLA',OR,                                        
                  213,3,CH,EQ,C'FSH',OR,                                        
                  213,3,CH,EQ,C'RHO',OR,                                        
                  213,3,CH,EQ,C'RHS',OR,                                        
                  213,3,CH,EQ,C'SER'),OR,                                       
                 (420,3,CH,EQ,C'TCP',OR,                                        
                  420,3,CH,EQ,C'GRO',OR,                                        
                  420,3,CH,EQ,C'TPS',OR,                                        
                  420,3,CH,EQ,C'REN',OR,                                        
                  420,3,CH,EQ,C'SLA',OR,                                        
                  420,3,CH,EQ,C'FSH',OR,                                        
                  420,3,CH,EQ,C'RHO',OR,                                        
                  420,3,CH,EQ,C'RHS',OR,                                        
                  420,3,CH,EQ,C'SER'),OR,                                       
                 (245,1,CH,EQ,C'P',OR,                                          
                  245,1,CH,EQ,C'C'),OR,                                         
                  433,1,CH,EQ,C'P',OR,                                          
                  163,2,CH,NE,C'  ',OR,                                         
                 (28,1,CH,EQ,C'M',OR,                                           
                  28,1,CH,EQ,C'G')))                                            
//*--------------------------------------------------------------------         
//* GENERATE REPORT ON SHORTLISTED ELDERLY/FT                                   
//*-----------------------------------------------------------------            
//STEP31   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                    
//BP13F595 DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//BP13F740 DD DSN=BP13.F740.MATUREBA.PRIO.SUCC.BKUP(0),DISP=SHR                 
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13L595 DD DSN=BP13.REPORT.PRIORITY,DISP=OLD                                 
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S595),DISP=SHR                             
//*-====================================================================        
//*-PREPARE BALLOT RESULT TO EXCEL FILE                                         
//*---------------------------------------------------------------------        
//* SORT BP13FW3I BY DTE-BAL, MODE, NT, FT - 100%                               
//*---------------------------------------------------------------------        
//STEP32   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FW3I.BALLOT.RESULT.A100,DISP=SHR                         
//SORTOUT  DD DSN=&&FW3IA100,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500),                                
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A),FORMAT=CH                            
//*---------------------------------------------------------------------        
//* SORT BP13FW3I BY DTE-BAL, MODE, NT, FT - 200%                               
//*---------------------------------------------------------------------        
//STEP33   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FW3I.BALLOT.RESULT.A200,DISP=SHR                         
//SORTOUT  DD DSN=&&FW3IA200,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500),                                
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A),FORMAT=CH                            
//*---------------------------------------------------------------------        
//* SORT BP13FW3I BY DTE-BAL, MODE, NT, FT - 300%                               
//*---------------------------------------------------------------------        
//STEP34   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FW3I.BALLOT.RESULT.A300,DISP=SHR                         
//SORTOUT  DD DSN=&&FW3IA300,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500),                                
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A),FORMAT=CH                            
//*---------------------------------------------------------------------        
//* SORT BP13FW3I BY DTE-BAL, MODE, NT, FT (FROM CB63)                          
//*---------------------------------------------------------------------        
//STEP35   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FW3I.BALLOT.RESULT.CB63,DISP=SHR                         
//SORTOUT  DD DSN=&&BP13FW3I,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500,BLKSIZE=27000),                  
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A),FORMAT=CH                            
//*---------------------------------------------------------------------        
//* MERGE BP13FW3I 100% WITH BP13FW3I 200%                                      
//*---------------------------------------------------------------------        
//STEP36   EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&FW3IA100,                                                   
//            DISP=(OLD,PASS)                                                   
//SORTJNF2 DD DSN=&&FW3IA200,                                                   
//            DISP=(OLD,PASS)                                                   
//SORTOUT  DD DSN=&&A100A200,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500,BLKSIZE=27000),                  
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   OPTION COPY                                                                  
   JOINKEYS FILES=F1,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOINKEYS FILES=F2,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   REFORMAT FIELDS=(F1:1,402,F2:121,282,F1:685,3815)                            
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//* MERGE BP13FW3I 100% WITH BP13FW3I 200% - UNPAIRED                           
//*---------------------------------------------------------------------        
//STEP36A  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&FW3IA100,                                                   
//            DISP=(OLD,PASS)                                                   
//SORTJNF2 DD DSN=&&FW3IA200,                                                   
//            DISP=(OLD,PASS)                                                   
//F1ONLY   DD DSN=&&A10A2UNP,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500,BLKSIZE=27000),                  
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   JOINKEYS FILES=F1,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOINKEYS FILES=F2,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOIN UNPAIRED,F1,ONLY                                                        
   REFORMAT FIELDS=(F1:1,4500)                                                  
   OUTFILE FNAMES=F1ONLY                                                        
   SORT FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A),FORMAT=CH                            
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE PAIRED AND UNPAIRED RECORDS BEFORE MATCHING WITH FW3I A300            
//*---------------------------------------------------------------------        
//STEP36B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&A100A200,DISP=(OLD,PASS)                                    
//         DD DSN=&&A10A2UNP,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&A10A20AL,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500,BLKSIZE=27000),                  
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* MERGE BP13FW3I 100% AND 200% WITH BP13FW3I 300%                             
//*---------------------------------------------------------------------        
//STEP37   EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&A10A20AL,                                                   
//            DISP=(OLD,PASS)                                                   
//SORTJNF2 DD DSN=&&FW3IA300,                                                   
//            DISP=(OLD,PASS)                                                   
//SORTOUT  DD DSN=&&A200A300,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500,BLKSIZE=27000),                  
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   OPTION COPY                                                                  
   JOINKEYS FILES=F1,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOINKEYS FILES=F2,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   REFORMAT FIELDS=(F1:1,684,F2:121,282,F1:967,3533)                            
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE BP13FW3I 100% AND 200% WITH BP13FW3I 300% - UNPAIRED                  
//*---------------------------------------------------------------------        
//STEP37A  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&A10A20AL,                                                   
//            DISP=(OLD,PASS)                                                   
//SORTJNF2 DD DSN=&&FW3IA300,                                                   
//            DISP=(OLD,PASS)                                                   
//F1ONLY   DD DSN=&&A20A3UNP,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500,BLKSIZE=27000),                  
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   JOINKEYS FILES=F1,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOINKEYS FILES=F2,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOIN UNPAIRED,F1,ONLY                                                        
   REFORMAT FIELDS=(F1:1,4500)                                                  
   OUTFILE FNAMES=F1ONLY                                                        
   SORT FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A),FORMAT=CH                            
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE PAIRED AND UNPAIRED RECORDS BEFORE MATCHING WITH FW3I CB63            
//*---------------------------------------------------------------------        
//STEP37B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&A20A3UNP,DISP=(OLD,PASS)                                    
//         DD DSN=&&A200A300,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&A120A300,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500,BLKSIZE=27000),                  
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*---------------------------------------------------------------------        
//* MERGE BP13FW3I WITH BP13FW3I (FR CB63), APPEND RECORDS AT THE BACK          
//*---------------------------------------------------------------------        
//STEP38   EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&A120A300,                                                   
//            DISP=(OLD,PASS)                                                   
//SORTJNF2 DD DSN=&&BP13FW3I,                                                   
//            DISP=(OLD,PASS)                                                   
//SORTOUT  DD DSN=&&FW3IFW3H,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500,BLKSIZE=27000),                  
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   OPTION COPY                                                                  
   JOINKEYS FILES=F1,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOINKEYS FILES=F2,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   REFORMAT FIELDS=(F1:1,966,F2:967,3146,F1:4113,36,F2:4149,352)                
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* MERGE BP13FW3I WITH BP13FW3I (FR CB63), UNPAIRED                            
//*---------------------------------------------------------------------        
//STEP38A  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&A120A300,                                                   
//            DISP=(OLD,PASS)                                                   
//SORTJNF2 DD DSN=&&BP13FW3I,                                                   
//            DISP=(OLD,PASS)                                                   
//F2ONLY   DD DSN=&&F3I3HUNP,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500,BLKSIZE=27000),                  
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   JOINKEYS FILES=F1,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOINKEYS FILES=F2,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOIN UNPAIRED,F2,ONLY                                                        
   REFORMAT FIELDS=(F2:1,4500)                                                  
   OUTFILE FNAMES=F2ONLY                                                        
   SORT FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A),FORMAT=CH                            
//*---------------------------------------------------------------------        
//* MERGE BP13FW3I WITH BP13FW3I (FR CB63), UNPAIRED, F1                        
//*---------------------------------------------------------------------        
//STEP38B  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&A120A300,                                                   
//            DISP=(OLD,PASS)                                                   
//SORTJNF2 DD DSN=&&BP13FW3I,                                                   
//            DISP=(OLD,PASS)                                                   
//F1ONLY   DD DSN=&&FA123UNP,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=4500,BLKSIZE=27000),                  
//         SPACE=(CYL,(5,5),RLSE)                                               
//SYSIN    DD *                                                                 
   JOINKEYS FILES=F1,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOINKEYS FILES=F2,FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A)                         
   JOIN UNPAIRED,F1,ONLY                                                        
   REFORMAT FIELDS=(F1:1,4500)                                                  
   OUTFILE FNAMES=F1ONLY                                                        
   SORT FIELDS=(1,6,A,8,3,A,12,3,A,16,2,A),FORMAT=CH                            
//*---------------------------------------------------------------------        
//* REFORMAT FIELDS, INITIALIZE BLANK FIELDS TO SPACES                          
//*---------------------------------------------------------------------        
//STEP39   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&FW3IFW3H,DISP=(OLD,DELETE)                                  
//         DD DSN=&&F3I3HUNP,DISP=(OLD,DELETE)                                  
//         DD DSN=&&FA123UNP,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.FW3I.BALLOT.RESULT,                                      
//            DISP=OLD                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=COPY                                                             
   OUTREC FIELDS=(1,4148,352X)                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//*  BACKUP FILES                                                               
//*-------------------------------------------------------------------*         
//STEP40   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FW3I.BALLOT.RESULT,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.FW3I.BACKUP(+1),DISP=(NEW,CATLG),                        
//            SPACE=(CYL,(8,5)),                                                
//            DCB=(BP13.GDG,BLKSIZE=27000,LRECL=4500,RECFM=FB)                  
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*                                                                             
