//BP13M502 JOB (BP13P),'BP13M502',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* CHG REF  DATE      BY   DESCRIPTION                                         
//* -------- --------  ---  -----------                                         
//* BP130857 20000108  SSS  ADD GROUPID                                         
//*=================================================================            
//*                                                                             
//*- FROM REGISTRATION OF FLATS SYSTEM (RFS) - WAITING LIST                     
//*- INCLUDE MULTI-TIERS (MT/MTS) REQUESTS                                      
//*                                                                             
//******************************************************************            
//*  SEND DYNAMIC JOB DATA ENTRIES ADHEAD OF THE PRINT DATASET                  
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13S,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//STEPA01  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT  DD DSN=&&PRIO1,DISP=(,PASS),                                         
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(500,50),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=2000)                                         
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C'C',AND,                                            
                 4,1,CH,LT,C'9',AND,                                            
                 49,2,CH,NE,C'  ',AND,                                          
                 51,3,CH,EQ,C'   ',AND,                                         
                 155,11,CH,EQ,C'           ',AND,                               
                 206,1,CH,EQ,C'Y',AND,                                          
                 785,6,CH,EQ,C'      ')                                         
//*-----------------------------------------------------------------            
//* WRITE HEADER AND DETAIL RECS TO P08F550                                     
//*-----------------------------------------------------------------            
//STEPA02  EXEC PGM=BP13C831,COND=(0,NE)                                        
//BP13F800 DD DSN=&&PRIO1,DISP=(OLD,PASS)                                       
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//P08F550  DD DSN=&&WLIST,DISP=(NEW,PASS),                              00120000
//            UNIT=SYSDA,                                               03880012
//            DCB=(LRECL=100,RECFM=FB),                                 03890012
//            SPACE=(CYL,(20,10),RLSE)                                  03890112
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*      SORT CFS APPOINTMENT MASTER BY PRIME KEY SEQUENCE                      
//*-----------------------------------------------------------------            
//STEPB1   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&WLIST,DISP=(OLD,PASS)                                       
//SORTOUT  DD DSN=&&SALES,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(100,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=100)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,19,A),FORMAT=CH                                              
    OMIT COND=(11,9,CH,EQ,C'         ')                                         
    SUM FIELDS=NONE                                                             
//*-----------------------------------------------------------------            
//* STEP4:  THIS STEP PERFORMS NRIC MATCH ON:-                                  
//*            SALES VS PROP TAX                                                
//*-----------------------------------------------------------------            
//STEPB2   EXEC PGM=BP13C836,COND=(0,NE)                                        
//P08F550  DD DSN=&&SALES,DISP=(OLD,PASS)                                       
//BR10K010 DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BR10K030 DD DSN=BR10.K030.CODE,DISP=SHR                                       
//BR10K080 DD DSN=BR10.K080.PTEPPTY.HIST,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13L836  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13A836  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//*=================================================================            
//* END BP13M502                                                                
//*=================================================================            
