//BP13A521 JOB (BP13P),'BP13A521',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* CREATE/TERMINATE CDB ROLE FOR UNSUCC BALLOTED BTO/SBF                       
//*=================================================================            
//*===================================================================*         
//* CHG REF  BY    DATE     DESCRIPTION                                         
//* -------- ---  ------   -----------                                          
//* BP137228 JF7  26032018 ADD NEW STEPS FOR 'TE' RECORDS                       
//* BP138193 SMP3 14022020 ADD BP13K800 WHEN CALLING BP13C98B                   
//*===================================================================*         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*-----------------------------------------------------------------            
//STEPA    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*********************************************************************         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                            
//*  PRT01 : CLASS = M, COPIES = 1 ** (SALES - AGREEMENT TEAM)                  
//*********************************************************************         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13S,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*---------------------------------------------------------------------        
//* INCUDE UNSUCC REQUEST                                                       
//*---------------------------------------------------------------------        
//SORT01 EXEC  SORT,COND=(0,NE)                                                 
//SORTIN   DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F740,DISP=(NEW,PASS),                                  
//         UNIT=(SYSDA,3),DCB=(RECFM=FB,LRECL=500),                             
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(260,1,CH,EQ,C'U')                                               
//*---------------------------------------------------------------------        
//* AR, ADD ROLE, START ROLE DATE = DTE-REQUEST                                 
//* AM CREATE MARRIGE RECORD                                                    
//*-----------------------------------------------------------------            
//STEP02 EXEC PGM=BP13C98A,COND=(0,NE)                                          
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F915 DD DSN=BP13.F915.CDBTRANS.BALLOT,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* INCLUDE 'AR' - ADD CDB RECORDS                                              
//* INCLUDE 'AM' - ADD MARRIAGE RECORD                                          
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F915.CDBTRANS.BALLOT,DISP=SHR                            
//SORTOUT  DD DSN=&&F915TRN1,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=18400,LRECL=800,RECFM=FB),                           
//            SPACE=(CYL,(5,5),RLSE)                                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(3,25,A,1,2,D),FORMAT=CH                                        
    INCLUDE COND=(1,2,CH,EQ,C'AR',OR,                                           
                  1,2,CH,EQ,C'AM')                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* ADD 'AR' / 'AM' CASES TO CDB BASED ON SOC-TRANSACTION FILE FROM             
//* ONLINE/BATCH UPDATE                                                         
//*--------------------------------------------------------------------         
//STEP04  EXEC   PGM=IKJEFT01,COND=(0,NE),DYNAMNBR=20                           
//*=================================================================*           
//*CALLING SUBROUTINE BE01C808 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F003 DD DSN=BE01.F003.CUSTUPD.LOGB.BP13,DISP=OLD                          
//BE01F903 DD DSN=BE01.F903.INVUPD.BP13,DISP=OLD                                
//BE01F400 DD DSN=BE01.F400.SENDID.NEWID.BP13,DISP=OLD                          
//*=================================================================*           
//*CALLING SUBROUTINE BE01C809 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F004 DD DSN=BE01.F004.MRGUPD.LOGB.BP13,DISP=OLD                           
//BE01F904 DD DSN=BE01.F904.INVMRG.BP13,DISP=OLD                                
//BE01F401 DD DSN=BE01.F401.SENDID.MRG.BP13,DISP=OLD                            
//BE01F620 DD DSN=BE01.F620.SRCUPD.LOG.BP13,DISP=OLD                            
//*=================================================================*           
//BP13F915 DD DSN=&&F915TRN1,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BE01KMSG DD DSN=BE01.KMSG.ONLINE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F820 DD DSN=BP13.F820.CDBTRANS.BALLOT,DISP=OLD                            
//P13F915A DD DSN=BP13.F915.CDBTRANS.INVALID,DISP=OLD                           
//P13F915B DD DSN=BP13.F915.CDBTRANS.ALL,DISP=OLD                               
//P13L986A DD SYSOUT=*                                                          
//BP13L986 DD SYSOUT=*                                                          
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C986) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* UPDATE THE CSTMR ID INTO BP13K820 FROM BP13F820                *            
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=BP13C991,COND=(0,NE)                                        
//BP13F820 DD DSN=BP13.F820.CDBTRANS.BALLOT,DISP=SHR                            
//BP13F915 DD DSN=BP13.F915.CDBTRANS.INVALID,DISP=SHR                           
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F820A DD DSN=BP13.F820.CSTID.BALLOT,DISP=OLD                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* 'TE' END ROLE, END ROLE DATE = SYSTEM DATE                                  
//*-----------------------------------------------------------------            
//STEP06 EXEC PGM=BP13C98B,COND=(0,NE)                                          
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F915 DD DSN=BP13.F915.CDBTRANS.BALLOT,DISP=MOD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* INCLUDE 'TE' - TERMINATE CDB RECORDS                                        
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F915.CDBTRANS.BALLOT,DISP=SHR                            
//SORTOUT  DD DSN=&&F915TRN3,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=18400,LRECL=800,RECFM=FB),                           
//            SPACE=(CYL,(5,5),RLSE)                                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(3,25,A,1,2,D),FORMAT=CH                                        
    INCLUDE COND=(1,2,CH,EQ,C'TE')                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* END OF ROW 'TE' CASES FROM CDB BASED ON SOC-TRANSACTION FILE                
//*--------------------------------------------------------------------         
//STEP08  EXEC   PGM=IKJEFT01,COND=(0,NE),DYNAMNBR=20                           
//*=================================================================*           
//*CALLING SUBROUTINE BE01C808 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F003 DD DSN=BE01.F003.CUSTUPD.LOGB.BP13,DISP=MOD                          
//BE01F903 DD DSN=BE01.F903.INVUPD.BP13,DISP=MOD                                
//BE01F400 DD DSN=BE01.F400.SENDID.NEWID.BP13,DISP=MOD                          
//*=================================================================*           
//*CALLING SUBROUTINE BE01C809 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F004 DD DSN=BE01.F004.MRGUPD.LOGB.BP13,DISP=MOD                           
//BE01F904 DD DSN=BE01.F904.INVMRG.BP13,DISP=MOD                                
//BE01F401 DD DSN=BE01.F401.SENDID.MRG.BP13,DISP=MOD                            
//BE01F620 DD DSN=BE01.F620.SRCUPD.LOG.BP13,DISP=MOD                            
//*=================================================================*           
//BP13F915 DD DSN=&&F915TRN3,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BE01KMSG DD DSN=BE01.KMSG.ONLINE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F820 DD DSN=BP13.F820.CDBTRANS.BALLOT,DISP=MOD                            
//P13F915A DD DSN=BP13.F915.CDBTRANS.INVALID,DISP=MOD                           
//P13F915B DD DSN=BP13.F915.CDBTRANS.ALL,DISP=MOD                               
//P13L986A DD SYSOUT=*                                                          
//BP13L986 DD SYSOUT=*                                                          
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C986) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* TAKE THE BACK UP OF BP13F915 FOR SUCCESSFULLY COMMITTEDCASES IN CDB         
//*--------------------------------------------------------------------         
//STEP09   EXEC PGM=BP13C992,COND=(0,NE)                                        
//P13F915A DD DSN=BP13.F915.CDBTRANS.INVALID,DISP=SHR                           
//P13F915B DD DSN=BP13.F915.CDBTRANS.ALL,DISP=SHR                               
//BP13F915 DD DSN=BP13.F915.CDBTRANS.CUSTID,DISP=OLD                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* BACKUP BP13.F915.CDBTRANS TO BP13.F915.CDBTRANS.ACCUM                       
//*--------------------------------------------------------------------         
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F915.CDBTRANS.BALLOT,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.F915.CDBTRANS.DAILY,DISP=MOD                             
//INPUT2   DD DSN=BP13.F915.CDBTRANS.CUSTID,DISP=SHR                            
//OUTPUT2  DD DSN=BP13.F915.CDBTRANS.ACCUM,DISP=MOD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
