//BP13DBK6  JOB (BP13P),'BP13DBK6',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
/*JOBPARM SYSAFF=MVS1                                                           
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : DAILY BACKUP OF MASTER                                *         
//*                                                                   *         
//*===================================================================*         
//* CHG REF  BY   ON    - DESCRIPTION                                 *         
//* ---------------------------------                                 *         
//* BP132168 CLT 160902 - BACKUP MASTERS AND SEQ FILES.               *         
//* BP132387 SSS 080903 - DELETE BALLOTING MODULE UNDER WIS           *         
//* BP132772 LSB 100606 - BACKUP DBSS FILE                            *         
//* BP133091 LMS 151207 - EXPANSION OF BP13KD00 FROM 1200 TO 1600     *         
//* BP133091 YCH 141108 - EXCLUDE BP13.**.G%%%%V00                    *         
//* BP133619 LSB 010609 - SET JOB TO RUN AT MVS1 ONLY                           
//* BP137317 IL5 020518 - STEP03 REMOVE DCB=(BP13.GDG)                *         
//* BP137713 LSB 120419 - EXPAND SPACES IN STEP03                               
//*-------------------------------------------------------------------*         
//*  BACKUP BP13 APPLN AND OCCUP FILE AFTER PRODUCTION JOBS           *         
//*  - 14 GDG                                                         *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=13')                                                 
//OUTPUT1   DD DSN=BP13.F800.APPLN.AFDAILY(+1),DISP=(,PASS),                    
//             UNIT=CART,LABEL=(1,SL),                                          
//             DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)                 
//INPUT2    DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=13')                                                 
//OUTPUT2   DD DSN=BP13.F820.OCCUP.AFDAILY(+1),DISP=(,PASS),                    
//             UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)                  
//INPUT3    DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                 
//             AMP=('BUFND=13')                                                 
//OUTPUT3   DD DSN=BP13.F840.APPLHIST.DAILY(+1),DISP=(,PASS),                   
//             UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                        
//             DCB=(BP13.GDG,BLKSIZE=23000,LRECL=500,RECFM=FB)                  
//INPUT4   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                           00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT4  DD DSN=BP13.FD00.DBSMAST.AFDAILY(+1),DISP=(,PASS),           00513000
//            UNIT=CART,LABEL=(4,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=27200,LRECL=1600,RECFM=FB)          00514200
//INPUT5   DD DSN=BP13.KD38.PPTRANS,DISP=SHR,                           00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT5  DD DSN=BP13.FD38.PPTRANS.AFDAILY(+1),DISP=(,PASS),           00513000
//            UNIT=CART,LABEL=(5,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)           00514200
//INPUT6   DD DSN=BP13.KD30.PPDUEDTE,DISP=SHR,                          00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT6  DD DSN=BP13.FD30.PPDUE.AFDAILY(+1),DISP=(,PASS),             00513000
//            UNIT=CART,LABEL=(6,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)          00514200
//INPUT7   DD DSN=BP13.KD40.APPLPAY,DISP=SHR,                           00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT7  DD DSN=BP13.FD40.APPLPAY.AFDAILY(+1),DISP=(,PASS),           00513000
//            UNIT=CART,LABEL=(7,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=27000,LRECL=1500,RECFM=FB)          00514200
//INPUT8   DD DSN=BP13.KD45.PPAYHIST,DISP=SHR,                          00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT8  DD DSN=BP13.FD45.PPAYHIST.AFDAILY(+1),DISP=(,PASS),          00513000
//            UNIT=CART,LABEL=(8,SL),VOL=REF=*.OUTPUT1,                 00513100
//            DCB=(BP13.GDG,BLKSIZE=27900,LRECL=1550,RECFM=FB)          00514200
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
     REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                      
     REPRO INFILE(INPUT3) OUTFILE(OUTPUT3)                                      
     REPRO INFILE(INPUT4) OUTFILE(OUTPUT4)                                      
     REPRO INFILE(INPUT5) OUTFILE(OUTPUT5)                                      
     REPRO INFILE(INPUT6) OUTFILE(OUTPUT6)                                      
     REPRO INFILE(INPUT7) OUTFILE(OUTPUT7)                                      
     REPRO INFILE(INPUT8) OUTFILE(OUTPUT8)                                      
//*                                                                             
//*--------------------------------------------------------------------*        
//*  CATALOG GDG                                                       *        
//*--------------------------------------------------------------------*        
//STEP02    EXEC PGM=IEFBR14,COND=(0,NE)                                        
//INPUT1    DD DSN=BP13.F800.APPLN.AFDAILY(+1),DISP=(OLD,CATLG),                
//             UNIT=(,,DEFER)                                                   
//INPUT2    DD DSN=BP13.F820.OCCUP.AFDAILY(+1),DISP=(OLD,CATLG),                
//             UNIT=(,,DEFER)                                                   
//INPUT3    DD DSN=BP13.F840.APPLHIST.DAILY(+1),DISP=(OLD,CATLG),               
//             UNIT=(,,DEFER)                                                   
//INPUT4   DD DSN=BP13.FD00.DBSMAST.AFDAILY(+1),DISP=(OLD,CATLG),       00513000
//             UNIT=(,,DEFER)                                                   
//INPUT5   DD DSN=BP13.FD38.PPTRANS.AFDAILY(+1),DISP=(OLD,CATLG),       00513000
//             UNIT=(,,DEFER)                                                   
//INPUT6   DD DSN=BP13.FD30.PPDUE.AFDAILY(+1),DISP=(OLD,CATLG),         00513000
//             UNIT=(,,DEFER)                                                   
//INPUT7   DD DSN=BP13.FD40.APPLPAY.AFDAILY(+1),DISP=(OLD,CATLG),       00513000
//             UNIT=(,,DEFER)                                                   
//INPUT8   DD DSN=BP13.FD45.PPAYHIST.AFDAILY(+1),DISP=(OLD,CATLG),      00513000
//             UNIT=(,,DEFER)                                                   
//*                                                                             
//*--------------------------------------------------------------------*        
//*  BACKUP SEQ FILES TO TAPE - 7 GDG                                  *        
//*--------------------------------------------------------------------*        
//STEP03 EXEC PGM=ADRDSSU,REGION=9M,COND=(0,NE)                                 
//SYSPRINT DD SYSOUT=*                                                          
//OUTPUT4  DD DSN=BP13.F900.SEQBKUP(+1),DISP=(,CATLG),                          
//            UNIT=CART,LABEL=(1,SL),VOL=(,,,36)                                
//*                                                                             
//SYSIN    DD *                                                                 
   DUMP                       -                                                 
   OUTDDNAME(OUTPUT4)  -                                                        
   DATASET(EXCLUDE(BP13.F510.*,BP13.F725.MHADATA -                              
           BP13.**.G%%%%V%%, -                                                  
           BP13.BATCH.*,BP13.ONLINE.*) -                                        
           INCLUDE(BP13.**) -                                                   
               BY((DSORG,NE,PAM),(DSORG,NE,VSAM))) -                            
           OPT (4)                                                              
//*--------------------------------------------------------------------*        
//*                         END OF JOB                                 *        
//*--------------------------------------------------------------------*        
