//BP13A721 JOB (BP13P),'BP13A721',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* FOR 10-YR=NO, UPDATE 'SS TO IN-ELIG CODE                                    
//**********************************************************************        
//* CHG-NO    BY   ON                                                           
//* ---------------------                                                       
//* BP130624 LSB 19990315 - ADD UPDATE BP13K705 IN BP13C557                     
//* BP130652     19990827 - EXPAND F520 RECL 300 TO 500                         
//* BP130837 LSB 20000508 - INCLUDE INELIG 'SS'                                 
//*=================================================================            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                            
//*  PRT01 : 1 COPY                           (AGREEMENT TEAM)                  
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* SORT TO INCLUDE 10-YR=NO                                                    
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F500.SEQUENCE.RESERVE,DISP=SHR                           
//SORTOUT  DD DSN=&&F500YRN,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(50,5),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(175,1,CH,EQ,C'N',OR,                                            
                258,1,CH,EQ,C'S',OR,                                            
                259,1,CH,EQ,C'S')                                               
//*---------------------------------------------------------------------        
//* UPDATE INELIG-CODE AS 'SS' FOR 10-YR=NO                                     
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C557,COND=(0,NE)                                        
//BP13F500 DD   DSN=&&F500YRN,DISP=(OLD,PASS)                                   
//BP13K700 DD   DSN=BP13.K700.RESERVE,DISP=SHR,                                 
//         AMP=('BUFND=23')                                                     
//BP13K705 DD   DSN=BP13.K705.SOCLIST,DISP=SHR,                                 
//         AMP=('BUFND=23')                                                     
//P13L557A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
