//BP13A247 JOB (BP13P),'BP13A247',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP135171 RJE1 20140210 TO CATER FOR DB2 UPGRADE                             
//*-------------------------------------------------------------------          
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*-----------------------------------------------------------------            
//STEP00 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F205,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'RF')                                              
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO PERFORM BATCH REJECTION OF FLATS                                        
//*---------------------------------------------------------------------        
//STEP01 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,                                     
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13K840 DD  DSN=BP13.K840.APPLHIST,                                          
//             DISP=SHR                                                         
//BM06F100 DD  DSN=BM06.F100.BP13C22Q,                                          
//             DISP=SHR                                                         
//BM06F110 DD  DSN=BM06.F110.BP13C22Q,                                          
//             DISP=SHR                                                         
//BM06F190 DD  DSN=BM06.F190.BP13C22Q,                                          
//             DISP=SHR                                                         
//BP13F310 DD  DSN=BP13.F310.BP13C22Q,                                          
//             DISP=SHR                                                         
//BP13F800 DD  DSN=BP13.F800.BP13C22Q,                                          
//             DISP=SHR                                                         
//BP13F840 DD  DSN=BP13.F840.BP13C22Q,                                          
//             DISP=SHR                                                         
//BP13FOUT DD  DSN=BP13.FOUT.BP13C22Q,                                          
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C22Q) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------                
//* TO SORT RECORDS                                                             
//*-------------------------------------------------------------                
//STEP02 EXEC    SORT,COND=(0,NE),                                              
//             CYL=30                                                           
//SORTIN   DD  DSN=BM06.F100.BP13C22Q,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BM06.F100.BP13C22Q,                                          
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,16,A),FORMAT=CH                                                
/*                                                                              
//*------------------------------------------------------------------           
//* TO REPRO RECORDS                                                            
//*------------------------------------------------------------------           
//STEP2A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BM06.F100.BP13C22Q,DISP=SHR                                   
//OUTPUT1  DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
/*                                                                              
//*-------------------------------------------------------------                
//* TO SORT RECORDS                                                             
//*-------------------------------------------------------------                
//STEP03 EXEC    SORT,COND=(0,NE),                                              
//             CYL=30                                                           
//SORTIN   DD  DSN=BM06.F110.BP13C22Q,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BM06.F110.BP13C22Q,                                          
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
/*                                                                              
//*--------------------------------------------------------------------         
//* TO REPRO RECORDS                                                            
//*--------------------------------------------------------------------         
//STEP3A EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BM06.F110.BP13C22Q,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
/*                                                                              
//*-------------------------------------------------------------                
//* TO SORT RECORDS                                                             
//*-------------------------------------------------------------                
//STEP04 EXEC    SORT,COND=(0,NE),                                              
//             CYL=30                                                           
//SORTIN   DD  DSN=BM06.F190.BP13C22Q,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BM06.F190.BP13C22Q,                                          
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(620,31,A),FORMAT=CH                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* TO REPRO RECORDS                                                            
//*--------------------------------------------------------------------         
//STEP4A EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BM06.F190.BP13C22Q,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BM06.K190.LOG,                                               
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
/*                                                                              
//*-------------------------------------------------------------                
//* TO SORT RECORDS                                                             
//*-------------------------------------------------------------                
//STEP05 EXEC    SORT,COND=(0,NE),                                              
//             CYL=30                                                           
//SORTIN   DD  DSN=BP13.F310.BP13C22Q,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F310.BP13C22Q,                                          
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,10,A),FORMAT=CH                                                
/*                                                                              
//*--------------------------------------------------------------------         
//* TO REPRO RECORDS                                                            
//*--------------------------------------------------------------------         
//STEP5A EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F310.BP13C22Q,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.K310.TRANS,                                             
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
/*                                                                              
//*-------------------------------------------------------------                
//* TO SORT RECORDS                                                             
//*-------------------------------------------------------------                
//STEP06 EXEC    SORT,COND=(0,NE),                                              
//             CYL=30                                                           
//SORTIN   DD  DSN=BP13.F800.BP13C22Q,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F800.BP13C22Q,                                          
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
/*                                                                              
//*--------------------------------------------------------------------         
//* TO REPRO RECORDS                                                            
//*--------------------------------------------------------------------         
//STEP6A EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F800.BP13C22Q,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
/*                                                                              
//*-------------------------------------------------------------                
//* TO SORT RECORDS                                                             
//*-------------------------------------------------------------                
//STEP07 EXEC    SORT,COND=(0,NE),                                              
//             CYL=30                                                           
//SORTIN   DD  DSN=BP13.F840.BP13C22Q,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F840.BP13C22Q,                                          
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
/*                                                                              
//*--------------------------------------------------------------------         
//* TO REPRO RECORDS                                                            
//*--------------------------------------------------------------------         
//STEP7A EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F840.BP13C22Q,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.K840.APPLHIST,                                          
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
/*                                                                              
//*---------------------------------------------------------------------        
//* TO PRINT REPORT ON RELEASE OF THE FLATS BOOKED BY APPLICANTS                
//*---------------------------------------------------------------------        
//STEP08 EXEC    SAS,COND=(0,NE)                                                
//WORK     DD  UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,10),,,ROUND)                                      
//BP13FOUT DD  DSN=BP13.FOUT.BP13C22Q,                                          
//             DISP=SHR                                                         
//FT42F001 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S219),                                    
//             DISP=SHR                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* TO SORT RECORDS                                                             
//*---------------------------------------------------------------------        
//STEP09 EXEC    SORT,COND=(0,NE)                                               
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BM06.F110.BP13C22Q,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F110,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(1,1),RLSE),                                          
//             RECFM=FB,LRECL=500,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,11,A),FORMAT=CH                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* TO UPDATE INTV FILES                                                        
//*---------------------------------------------------------------------        
//STEP10 EXEC    PGM=BP13C22R,COND=(0,NE)                                       
//BM06F110 DD  DSN=&&BM06F110,                                                  
//             DISP=(OLD,DELETE)                                                
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=OLD                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* ACCUM CONTROL REC                                                           
//*-----------------------------------------------------------------            
//STEP11 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,PASS)                                                  
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*---------------------------------------------------------------------        
//* END OF JOB BP13A247                                                         
//*---------------------------------------------------------------------        
