//BP13D119 JOB (BP13P),'BP13D119',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010002
//         NOTIFY=CSD0071                                               00020002
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030002
//*===================================================================* 00040002
//*===================================================================* 00050002
//* CHG REF  BY  ON       DESCRIPTION                                 * 00060002
//* -------- --- -------- -----------                                 * 00070002
//* BP136413 NST 271216   DELETE RESIGN STAFF IN SECURITY FILE AFTER  * 00080003
//*                       SY08 JOB                                    * 00081003
//*===================================================================* 00090002
//*-----------------------------------------------------------------    00100002
//*  SORT BP13.K860.USER USING NUM-USERID                               00110002
//*-----------------------------------------------------------------    00120002
//STEP01   EXEC  SORT,COND=(0,NE)                                       00130002
//SORTIN   DD DSN=BP13.K860.USER,                                       00140002
//            DISP=SHR                                                  00150002
//SORTOUT  DD DSN=&&BP13F860,                                           00160002
//            DISP=(NEW,PASS),                                          00170002
//            UNIT=SYSDA,                                               00180002
//            SPACE=(CYL,(2,2),RLSE),                                   00190002
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                         00200002
//SYSIN    DD *                                                         00210002
  SORT FIELDS=(1,8,A),FORMAT=CH                                         00220002
  SUM FIELDS=NONE                                                       00230002
/*                                                                      00240002
//*-----------------------------------------------------------------    00250002
//*  PROGRAM TO DELETE USERID NOT FOUND IN SY08K100                     00260002
//*-----------------------------------------------------------------    00270002
//STEP02   EXEC  PGM=BP13C000,COND=(0,NE)                               00280002
//BP13F860 DD DSN=&&BP13F860,                                           00290002
//            DISP=(OLD,DELETE)                                         00300002
//BP13K860 DD DSN=BP13.K860.USER,                                       00310002
//            DISP=OLD                                                  00320002
//BP13K870 DD DSN=BP13.K870.PANEL,                                      00330002
//            DISP=OLD                                                  00340002
//BP13K868 DD DSN=BP13.K868.USER.LOG,                                   00350002
//            DISP=OLD                                                  00360002
//BP13K878 DD DSN=BP13.K878.PANEL.LOG,                                  00370002
//            DISP=OLD                                                  00380002
//SY08K100 DD DSN=SY08.K100.USERID,                                     00390002
//            DISP=SHR                                                  00400002
//SYSDBG   DD SYSOUT=*                                                  00410002
//SYSDBOUT DD SYSOUT=*                                                  00420002
//SYSOUT   DD SYSOUT=*                                                  00430002
//SYSPRINT DD SYSOUT=*                                                  00440002
//*-------------------------------------------------------------------  00450002
