//BP13ADPV JOB (BP13P),'BP13ADPV',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------------------------------------            
//* BP135043 SMR2 21082013 SIMILAR TO BP13A505 (FOR EC BALLOTING)               
//* BP135872 SMR2 31072015 CHANGE CLASS 2 TO CLASS J                            
//* BP139931 AM25 29022024 CHANGE CLASS J TO CLASS 2                            
//*=================================================================            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=================================================================            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT02 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-IAFS1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=IAFS1A                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* SORT OUT THE RECORDS OUTPUT FROM THE ONLINE UPDATE AFTER BALLOT             
//* PANEL OR UPDATE AFTER ASSIGNED WEIGHTAGE PANEL                              
//* INCLUDE UPDATE DATE >= 950101                                               
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F595,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(13,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(477,8,A),FORMAT=CH                                              
   INCLUDE COND=(352,1,CH,EQ,C'T',AND,485,8,CH,GE,C'19950101',AND,              
                 123,1,CH,NE,C'6')                                              
//*---------------------------------------------------------------------        
//* NOTE : COL 123, WILL BE UPDATE BY REGN-NO FOR SUCC CASES, RUN THIS          
//*        STEP BEFORE ASSIGN REGN-NO                                           
//* PRINT REPORT ON BEFORE AND AFTER IMAGE OF UPDATE AFTER BALLOTING            
//* FOR INTERNAL AUDIT                                                          
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C745,COND=(0,NE)                                        
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K740 DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F595 DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//BP13L745 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT ONLY SUCCESSFUL CASES.                                             
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SORTOUT  DD DSN=&&F740MAT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,213,2,A,10,19,A),FORMAT=CH                            
     INCLUDE COND=(260,1,CH,EQ,C'S')                                            
//*-----------------------------------------------------------------            
//* OUTPUT FILES FOR SEPARATE PIGEONHOLING PROCESS, PRIORITY,                   
//* TRANSITION NHH > 7 MTH, AND COHORTS ( MAX 5 )                               
//*-----------------------------------------------------------------            
//STEP6A   EXEC PGM=BP13C741,COND=(0,NE),ADDRSPC=VIRT,REGION=4096K              
//BP13F520 DD  DSN=&&F740MAT,DISP=(OLD,PASS)                                    
//BP13MGP  DD  DSN=&&F740MGP,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13PR   DD  DSN=&&F740PRO,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13GRO  DD  DSN=&&F740GR1,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13PUB  DD DSN=&&F740PUB,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//SYSDBG   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* OUTREC AAA TO ALLO-SCH FOR ALL GRO CASES                                    
//*---------------------------------------------------------------------        
//STEP06A  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740GR1,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(,PASS),                                       
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(35,2),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,373,3,A,163,2,A,10,19,A),FORMAT=CH                       
  OUTREC FIELDS=(1,212,C'AAA',216,284)                                          
//*---------------------------------------------------------------------        
//* OUTREC SPACES TO GRO-RANK AND WARD TO NON-GRO CASES                         
//* OUTREC PA TO ALLOC-SCHEME TO NON-GRO CASES                                  
//*---------------------------------------------------------------------        
//STEP06C  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740PUB,DISP=(OLD,PASS)                                     
//         DD DSN=&&F740PRO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(MOD,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,10,19,A),FORMAT=CH                                       
  OUTREC FIELDS=(1,162,C'  ',165,48,C'PA ',216,157,C'   ',376,124)              
//*---------------------------------------------------------------------        
//* SORT BY NT, FT, WARD, GRO RANKING AND 10TH BYTE RANDOM NO                   
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740GRO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,213,3,A,373,3,A,163,2,A,                      
                  10,19,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//*  TO PRINT SUCESSFUL REQUEST ASSIGNED WITH REGISTRATION NO.                  
//*  TO ASSIGN QUEUE NO BASED ON NT,FT,REG NO.                                  
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C514,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L514 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13ADPV                                                                
//*---------------------------------------------------------------------        
