//BP13D111 JOB (BP13P),'BP13D111',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================*           
//* DO NOT RUN ON 1ST-3RD OF THE MONTH                                          
//* RUN AFTER CLOSING OF MONTH-END, DAILY POSTING                               
//*=================================================================*           
//* DAILY JOB TO RUN AFTER BP13M713, DAILY JOB BP13D104                         
//* MONTHLY JOB TO PASS DBSS TOP CASES TO SMS                                   
//* CREATE SALES ORDER FILE BP13K400                                            
//* DELETE PP MASTER AND FIN TRANSACTION FILE                                   
//* BP137725  27/05/2019  LSB1 ADD BP13K399, BM06K110 TO BP13C448       00759236
//* BP138923  24/02/2022  LSB1 REMOVE CLASS 9                           00759236
//*=================================================================*           
//* CHG-NO   BY   ON      DESCRIPTION                                           
//* -----------------------------------                                         
//* BP133289 LSB       - BP13CD48 RUN AT BP13D110                               
//* BP133489 LSB       - BP13C105,CD42 ADD TRANS-TY=71, PAYMENT-TY=PP           
//* BP133572 JB8       - BP13CD46 GET LOAN-COMM DATE FROM BP13KD03              
//* BP133572 LSB       - CHG BP13M733 AD DAILY JOB                              
//* BP133638 LSB       - ADD BP13KD65 TO BP13CD40                               
//* BP133669 LSB 040809- TAKE IN BP13.F125.DBSPAYMT.DAILY(+1)                   
//* BP133612 JB8 140809- ADD BP13CD48 (FROM BP13D110)                           
//* BP13XXXX PCL 230710- REMOVE BP13.BF02.F070.SRC.BP13DBS AND                  
//*                      BF02.F070.PROC.BP13 (STEP28 & STEP29)                  
//* BP134310 JB8 150711- LAST LOAN TAG, DEFERMENT SCHEME ENHANCEMENT            
//* BP134360 LSB 080911- BP13LD46 PRINT 2 COPIES                                
//* BP134360 JB8 131011- BP13LD46 SORT BY BO & BALLOT-DATE(PRJCT)               
//* BP134317 CCC 150212- INCLUDE AC20K720 FOR BP13C903                          
//* BP134481 CCC 200412- EXPAND TEMP DATASET SIZE AT STEP 33                    
//* BP134483 LSB 070512- SHIFT BP13CD48 TO BP13D102 JOB                         
//* BP134768 IMC 140113- ADD BP13CD5C TO SEND REPUDIATION CASES TO SMS          
//* BP134423 FGP 280113- REPLACE HARDCOPY OF BP13LD46 FOR HOUSING               
//*                      FINANCE INTO AN EOS REPORT TO BE ROUTED TO             
//*                      HF AND BO'S. REMOVE PRT03.                             
//* BP134768 IMC 170413- ADD AB03K030 AND BM06K110 TO BP13CD5C                  
//* BP135027 ESA1081013- ADD BP13KD15 ALT-KEY1 IN BP13C411                      
//* BP135133 ZA1 251113- ADD BP13KD15 TO BP13CD5C                               
//* BP135171 RJE 100214- TO CATER FOR DB2 UPGRADE                               
//* BP135339 ESA1170614- TO ADD BP13KD80 TO BP13CD40                            
//* BP135348 PCL4250614- TO ADD BP13C38K                                        
//* BP135041 ESD1 08/07/2014 CATER FOR MGL CASES FOR PGM C411.                  
//* BP135348 PCL4090714- ADD BP13KD05/BP13K895 TO BP13C38K                      
//* BP135348 PCL4170714- TO ADD P04F10A & P04F10B                               
//* BP135517 LSB 251114- TO ADD BACKUP BP13K160                                 
//* BP136911 MRN1060218- REMOVE BP13KD05 FROM CD40 (STEP02)                     
//* BP138602 LSB 080221- MOD TO BP13.F430.SOC.ACCUM                             
//*=================================================================*           
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                       *           
//*-----------------------------------------------------------------*           
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.KD00.DBSMAST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.KD03.DBSHIST,DISP=OLD                                    
//INPUT3   DD DSN=BP13.KD15.DBSSTP,DISP=OLD                                     
//INPUT4   DD DSN=BP13.KD35.APPSCHDL,DISP=OLD                                   
//INPUT5   DD DSN=BP13.KD60.ACCHIST,DISP=OLD                                    
//INPUT6   DD DSN=BP13.KD61.ACCHIST,DISP=OLD                                    
//INPUT7   DD DSN=BP13.KD63.TXHIST,DISP=OLD                                     
//INPUT8   DD DSN=BP13.KD64.TXHIST.HISTORY,DISP=OLD                             
//INPUT9   DD DSN=BP13.K410.ACCUMSO,DISP=OLD                                    
//INPUT10  DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT11  DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//INPUT12  DD DSN=BP13.K893.APPLN.HISTORY,DISP=OLD                              
//INPUT13  DD DSN=BP13.K895.OCCUP.HISTORY,DISP=OLD                              
//INPUT14  DD DSN=BP13.K840.APPLHIST,DISP=OLD                                   
//INPUT15  DD DSN=BP13.KD05.CPFGRANT,DISP=OLD                                   
//INPUT16  DD DSN=BP13.KD65.PDATE,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
          VFY FILE(INPUT10)                                                     
          VFY FILE(INPUT11)                                                     
          VFY FILE(INPUT12)                                                     
          VFY FILE(INPUT13)                                                     
          VFY FILE(INPUT14)                                                     
          VFY FILE(INPUT15)                                                     
          VFY FILE(INPUT16)                                                     
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY                           (MA&B TEAM)                        
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1A CP-1',END;                                    
1$DJDE$ JDE=BP13S,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//PRT02   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1B CP-1',END;                                    
1$DJDE$ JDE=13POT6,JDL=BP13,FORMS=BP13B6,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*-----------------------------------------------------------------            
//*  TO CHECK DATE BALANCE CLOSE AGAINST THE PREVIOUS MONTH.                    
//*  RETURNS '99' IF THE DATES ARE NOT EQUAL.                                   
//*-----------------------------------------------------------------            
//STEP0A EXEC  PGM=BP13CC25,COND=(0,NE)                                         
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD65 DD  DSN=BP13.KD65.PDATE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP FILES                                                                
//*-------------------------------------------------------------------*         
//STEP0B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KD15.DBSSTP,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.FD15.DBSSTP.M733,DISP=OLD                                
//INPUT2   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//OUTPUT2  DD DSN=BP13.FD00.DBSMAST.M733,DISP=OLD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*---------------------------------------------------------------------        
//* OMIT RECORD WITH NVP-DATE = SPACES                                          
//* OMIT RECORD ALREADY PASS TO SMS (DTE-SEND-SMS > ZEROS)                      
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD15.DBSSTP,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13FD15,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=300),                                  
//        SPACE=(CYL,(10,20),RLSE)                                              
//SYSIN    DD  *                                                                
    SORT FIELDS=(21,8,A),FORMAT=CH                                              
    OMIT COND=(82,8,CH,EQ,C'        ',OR,                                       
               114,8,CH,GT,C'00000000')                                         
//*-------------------------------------------------------------------*         
//* THIS PROGRAMME WILL TAKE IN FILE ON DBSS FLAT WHERE DEVELOPER               
//* WILL KEY IN DATA RELATED TO TAKE POSSESSION OF DBSS FLAT.                   
//* THIS PROGRAMME WILL CREATE SALES ORDER FILE FOR SMS BASS,                   
//* AND OTHER DOWN STREAM SYSTEMS.                                              
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13FD15 DD DSN=&&BP13FD15,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//AB03K050 DD DSN=AB03.K050.INTTABLE,DISP=SHR                                   
//AC20K700 DD DSN=AC20.K700.REBATE,DISP=SHR                                     
//AC20K710 DD DSN=AC20.K710.CUTOVER,DISP=SHR                                    
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//BP13KD15 DD DSN=BP13.KD15.DBSSTP,DISP=SHR                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD80 DD DSN=BP13.KD80.LOF,DISP=SHR,                                       
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD35 DD DSN=BP13.KD35.APPSCHDL,DISP=SHR                                   
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR                                      
//BP13KD65 DD  DSN=BP13.KD65.PDATE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F400 DD DSN=BP13.F410.DAILYSO.DBSS,DISP=OLD                               
//BP13LD40 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CD40) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-------------------------------------------------------------------*         
//* OUTPUT FILE TO SMS SYSTEM                                         *         
//*-------------------------------------------------------------------*         
//STEP2A   EXEC PGM=BP13C411,COND=(0,NE)                                        
//BP13F410 DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K000 DD DSN=BP17.K000.SCHREF,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K001 DD DSN=BP17.K000.SCHREF.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K100 DD DSN=BP17.K100.SERSPROJ,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K110 DD DSN=BP17.K110.SERSBLK,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K111 DD DSN=BP17.K110.SERSBLK.PATH1,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K120 DD DSN=BP17.K120.SERSUNIT,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD15 DD DSN=BP13.KD15.DBSSTP,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD11 DD DSN=BP13.KD15.DBSSTP.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD12 DD DSN=BP13.KD15.DBSSTP.PATH2,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KA20 DD DSN=BP13.KA20.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K480 DD DSN=BP13.K480.CONTRA,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F430 DD DSN=BP13.F430.DBSS,DISP=MOD                                       
//BP13K670 DD DSN=BP13.K670.BO,DISP=SHR                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT REPUDIATION CASES                                                      
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F430.DBSS,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F430,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=1000),                                        
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN   DD  *                                                                 
  SORT FIELDS=(1,11,A),FORMAT=CH                                                
  INCLUDE COND=(10,1,CH,GT,C'1')                                                
//*-------------------------------------------------------------------*         
//* PASS NEW LESSEE CODE OF SCH-ACC-NO TO SMS FOR REPUDIATION CASES             
//*-------------------------------------------------------------------*         
//STEP2B   EXEC PGM=BP13CD5C,COND=(0,NE)                                        
//BP13F430 DD DSN=&&BP13F430,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BM06K115 DD DSN=BM06.K115.DELFIS,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03F021 DD DSN=BP13.AB03.F021.SMS,DISP=MOD                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BP13K400 BY REGN,INCLUDE DBSS CASES                                    
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13F400,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(20,20),RLSE)                                              
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(914,3,CH,EQ,C'DBS')                                           
//*-------------------------------------------------------------------*         
//* WHEN DBSS FLAT IS KEY-ISSUED , SALE ORDER FILES IS CREATED.                 
//* WHEN DBSS FLAT PASS DOWN TO SMS , SOC WILL CLOSE ACCOUNT AND DELETE         
//* DBSS FILE.                                                                  
//* BP13KD00 & BP13KD63 ARE I-O FILES                                           
//* BP13KD03,BP13KD64,BP13FD18,BP13FD60,BP13FD64,BP13F440,BP13F136              
//* ARE OUTPUT FILES                                                            
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=BP13CD42,COND=(0,NE)                                        
//BP13F400 DD DSN=&&BP13F400,DISP=(OLD,PASS)                                    
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD38 DD DSN=BP13.KD38.PPTRANS,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD61 DD DSN=BP13.KD61.ACCHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD63 DD DSN=BP13.KD63.TXHIST,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD64 DD DSN=BP13.KD64.TXHIST.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F136 DD DSN=BP13.F136.DBSSTOP,DISP=OLD                                    
//BP13F440 DD DSN=BP13.F440.DBSSLOAN,DISP=MOD                                   
//BP13FD38 DD DSN=BP13.FD38.REVINST,DISP=MOD                                    
//BP13FD60 DD DSN=BP13.FD60.ACCHIST,DISP=MOD                                    
//BP13FD63 DD DSN=BP13.FD63.TXHIST,DISP=MOD                                     
//BP13LD42 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT CASH/CPF/VR REC (1ST 3 DAYS NO POSTING)                                
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DBSPAYMT.DAILY(0),DISP=SHR                          
//SORTOUT  DD DSN=&&BP13F125,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                  
//        SPACE=(CYL,(10,20),RLSE)                                              
//SYSIN    DD  *                                                                
    SORT FIELDS=(5,8,A,1,2,A),FORMAT=CH                                         
    OMIT COND=(5,8,CH,EQ,C'        ')                                           
//*-------------------------------------------------------------------*         
//* DBSS SALES ORDER FILE WILL ONLY CREATED ON THE 4TH OF THE FOLLOWING         
//* MONTH AFTER CLOSING OF ACCOUNT.ON 4TH OF THE MONTH, SOC WILL PASS           
//* DBSS LOAN INFOR TO SMS AFTER THE OPENING OF NEW MONTH.                      
//* SOC WILL ALSO PASS THE 1ST-4TH DAY POSTING FILE TO SMS BECAUSE SMS          
//* TO CATCH UP THE POSTING FOR CASH/CPF/VOUCHER                                
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=BP13CD43,COND=(0,NE)                                        
//BP13F125 DD DSN=&&BP13F125,DISP=(OLD,PASS)                                    
//BP13F400 DD DSN=&&BP13F400,DISP=(OLD,PASS)                                    
//BP13KD64 DD DSN=BP13.KD64.TXHIST.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03F001 DD DSN=BP13.F001.DBSS.PYMT,DISP=MOD                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* ACCUMULATE TOP RECORD TO MTHLY PAYMENT TRANS                                
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F136.DBSSTOP,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUMULATE PAYMENT TRANS                                                    
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F440.DBSSLOAN,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F440.DBSSLOAN.BKUP,DISP=MOD                              
//INPUT2   DD DSN=BP13.F001.DBSS.PYMT,DISP=SHR                                  
//OUTPUT2  DD DSN=BP13.AB03.F001.DBSS.PYMTBKUP,DISP=MOD                         
//INPUT3   DD DSN=BP13.FD38.REVINST,DISP=SHR                                    
//OUTPUT3  DD DSN=BP13.FD38.REVINST.BKUP,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
     REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* OUTPUT SALES ORDER TO PUB AND RESETTLEMENT FILES                  *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F410 DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//BP13F418 DD DUMMY                                                             
//BP13F220 DD DSN=BP13.F220.RESETTLE,DISP=MOD                                   
//BP13L409 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C409) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* OUTPUT FILE TO SOC APPLN/OCCUP INFOR TO RDBII                     *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=BP13C448,COND=(0,NE)                                        
//BP13F410 DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K399 DD DSN=BP13.K399.APPLOCCP,DISP=SHR,                          06321036
//            AMP=('BUFNI=4','BUFND=8')                                 06322036
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                           06323036
//            AMP=('BUFNI=4','BUFND=8')                                 06324036
//BE03F222 DD DSN=BP13.BE03.F222.NEWSALE,DISP=MOD                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* UPDATE K800-NUM-ALLOC-TAG TO 'KI' FOR KEY ISSUED CASES            *         
//* CLOSE FILE : BP13K800                                             *         
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=BP13C425,COND=(0,NE)                                        
//BP13F410 DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* ACCUMULATE THE DAILY VALID SALES ORDER TO CUMULATIVE SALES ORDER  *         
//* PRINT DETAIL SALE ORDER IF REC FOUND IN BP13K410                  *         
//* CLOSE FILE : BP13K410                                             *         
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=BP13C418,COND=(0,NE)                                        
//BP13F410 DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=OLD,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L418 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//* SORT DAILY SO RAISED TO WEEKLY ACCUMULATED FILE                   *         
//* ACCUMULATED SO FILE CONTAINS REC WILL BE CLEAR ON SATURDAY        *         
//*-------------------------------------------------------------------*         
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F410.ACCUMSO,DISP=MOD                                    
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT DAILY SO RAISED TO MTHLY SO FILE                             *         
//* MTHLY SO FILE WILL BE CLEARED ON MTH END                          *         
//*-------------------------------------------------------------------*         
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F410.MTHSO,DISP=MOD                                      
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* OUTPUT TRANS-TYPE=71,PAYMENT-TYPE=INS                                       
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.DBSSTOP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F136BAL,DISP=(,PASS),                                       
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                  
//        SPACE=(CYL,(10,20),RLSE)                                              
//SYSIN    DD  *                                                                
    SORT FIELDS=(21,8,A),FORMAT=CH                                              
    INCLUDE COND=(1,2,CH,EQ,C'71')                                              
//*-------------------------------------------------------------------*         
//* UPDATE BALANCING FILE AFTER TRANSFER LUMPSUM AND LOAN TO SMS                
//*-------------------------------------------------------------------*         
//STEP21   EXEC PGM=BP13C105,COND=(0,NE)                                        
//BP13F125 DD DSN=&&F136BAL,DISP=(OLD,PASS)                                     
//BP13K160 DD DSN=BP13.K160.BALANCE.DBSS,DISP=SHR                               
//BP13L105 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP INTERFACE FILE TO SMS                                                
//*-------------------------------------------------------------------*         
//STEP23   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F430.DBSS,DISP=SHR                                       
//OUTPUT1  DD DSN=BP13.F430.DBSS.BKUP,DISP=MOD                                  
//OUTPUT2  DD DSN=BP13.F430.SOC.ACCUM,DISP=MOD                                  
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*---------------------------------------------------------------------        
//*- SORT BY BO-CODE & BALLOT DATE                                              
//*---------------------------------------------------------------------        
//STEP24A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&F400CD46,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(10,20),RLSE)                                              
//SYSIN    DD  *                                                                
    SORT FIELDS=(31,2,A,501,6,A),FORMAT=CH                                      
//*-------------------------------------------------------------------*         
//* PRINT LETTER FOR DBSS FLAT HANDOVER FROM SOU TO BO               *          
//*-------------------------------------------------------------------*         
//STEP24   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F400 DD DSN=&&F400CD46,DISP=(OLD,PASS)                                    
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KA10 DD  DSN=BP13.KA10.PRJCT,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13KD03 DD  DSN=BP13.KD03.DBSHIST,DISP=SHR,                                  
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13LD46 DD DSN=&&BP13LD46,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(30,10),RLSE),                                         
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//BP13PD46 DD  SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CD46) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* PRINT REPORT 0N TOP DBSS LETTER TO MA&B                                     
//*-----------------------------------------------------------------            
//STEP25   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13LD46,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE THE HISTORY FILE AND DELETE RECORDS FROM BP13K800 AND      *         
//* BP13K820 FOR SUCCESSFUL TP CASE                                   *         
//* CLOSE FILE : BP13K800, BP13K820, BP13K840                         *         
//*-------------------------------------------------------------------*         
//STEP27   EXEC  PGM=BP13C423,COND=(0,NE)                                       
//BP13F410 DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K895 DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                             
//            AMP=('BUFNI=4','BUFND=8')                                         
//P13L423A DD SYSOUT=*                                                          
//P13L423B DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTPUT TRANS-TYPE=70,PAYMENT-TYPE=INS                                       
//*---------------------------------------------------------------------        
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.DBSSTOP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F136TT,DISP=(,PASS),                                        
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=150),                                  
//        SPACE=(CYL,(10,20),RLSE)                                              
//SYSIN    DD  *                                                                
    SORT FIELDS=(21,8,A),FORMAT=CH                                              
    INCLUDE COND=(1,2,CH,EQ,C'70',AND,99,3,CH,EQ,C'INS')                        
//*-----------------------------------------------------------------            
//*  CREATE BP13KD61 FROM BP13KD60                                              
//*-----------------------------------------------------------------            
//STEP31   EXEC PGM=BP13CD58,COND=(0,NE)                                        
//BP13F136 DD DSN=&&F136TT,DISP=(OLD,PASS)                                      
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=OLD                                    
//BP13KD61 DD DSN=BP13.KD61.ACCHIST,DISP=OLD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* PERFORM BALANCING FOR PP/INS UPDATED IN DBSS MASTER AND THE                 
//* BALANCING FILE. COND CODE = 99 FOR ANY FEES NOT BALANCED                    
//*-------------------------------------------------------------------*         
//STEP32   EXEC PGM=BP13CC01,COND=(0,NE)                                        
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K160 DD DSN=BP13.K160.BALANCE.DBSS,DISP=SHR                               
//BP13LC01 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* OUTPUT TRANSACTION TO END-ROLE IN CDB                                       
//*--------------------------------------------------------------------         
//STEP33    EXEC PGM=BP13C987,COND=(0,NE)                                       
//BP13F410  DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                              
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13F915  DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*===================================================================*         
//*---------------------------------------------------------------------        
//* BP13.F410.DAILYSO.DBSS                                                      
//*---------------------------------------------------------------------        
//STEP34   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F410.DAILYSO.DBSS,DISP=SHR                               
//SORTOUT  DD DSN=&&BP13F410,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),                                   
//         DCB=(RECFM=FB,LRECL=2000)                                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*--------------------------------------------------------------------         
//* BP13C38K - TO UPDATE P04F100 EFF-DATE                                       
//*--------------------------------------------------------------------         
//STEP35 EXEC    PGM=BP13C38K,COND=(0,NE)                                       
//BP13F410 DD  DSN=&&BP13F410,DISP=(OLD,PASS)                                   
//P04K010  DD  DSN=BP04.K010.DEBAR,DISP=SHR                                     
//P04K0101 DD  DSN=BP04.K010.DEBAR.PATH,DISP=SHR                                
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR                                     
//BP13KD05 DD  DSN=BP13.KD05.CPFGRANT,DISP=SHR                                  
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR                             
//P04F100  DD  DSN=BP13.BP04.F100.DBSS.TOP,DISP=MOD                             
//P04F10A  DD  DSN=BP13.F010.DBSS.DEBAR.DELETE,DISP=MOD                         
//P04F10B  DD  DSN=BP13.F010.DBSS.DEBAR.INSERT,DISP=MOD                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------         
//* TO BACKUP BP13.BP04.F100.DBSS.TOP                                           
//*-----------------------------------------------------------------            
//STEP36   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD  DSN=BP13.BP04.F100.DBSS.TOP,DISP=SHR                             
//OUTPUT1  DD  DSN=BP13.BP04.F100.DBSS.TOP.ACCUM,DISP=MOD                       
//SYSIN    DD  *                                                                
  REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                        
//*                                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP BP13K160                                                            
//*-------------------------------------------------------------------*         
//STEP37   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K160.BALANCE.DBSS,DISP=SHR,                              
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F160.BALANCE.DBSS.DAILY(+1),DISP=(NEW,CATLG),            
//            SPACE=(CYL,(3,2)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-------------------------------------------------------------------*         
//*                       END OF JOB                                  *         
//*-------------------------------------------------------------------*         
