//BP13D227 JOB (BP13P),'BP13D227',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
/*JOBPARM SYSAFF=MVS2                                                           
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* REPORT FOR FTS                                                              
//*=================================================================            
//* INPUT FILE = BP13.F595.SOCNOTFD.AFQUE.AY0H.FTS                              
//* REPORT FOR BP13AY0H(FT)                                                     
//* BP13L828 = BP13.L828.BP13S828.AFQUE.AY0H                                    
//* P13L828A = BP13.L828.DETAIL.AY0H                                            
//* BP13LB83 = BP13.LB83.BP13CB83.AFQUE.AY0H                                    
//*=================================================================            
//* CHG-NO   BY    ON   - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP135237 LSB 280214 - CHG K595.BALLOT.LOG TO K595.BP13D220                  
//* BP136160 SMR 110316 - OUTREC HOUSEHOLD, BALLOT-HH & FT2T TO BP13F007        
//* BP137101 LSB 060218 - HARLUCK FOR GL3 RESIDENT                              
//* BP137734 LSB 050419 - INCLUDE SMS-FD IN BP13F008 REPORT, DEL CB83           
//* BP137958 KV6 050819 - DELETE INLCUDE COND (COL 487)IN STEP01/03/05          
//*=================================================================            
//*- REPORT FOR FT (BP13AY0H)                                                   
//*------------------------------------------------------------------           
//* BYPASS REQUEST-STATUS=S (COL 487)                                           
//*------------------------------------------------------------------           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0H.FTS,DISP=SHR                     
//SORTOUT DD DSN=&&F730AFQ,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),                                             
//        SPACE=(CYL,(180,30),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(467,2,A,123,8,A),FORMAT=CH                                      
   INCLUDE COND=(467,2,CH,GE,C'01')                                             
//*---------------------------------------------------------------------        
//* PRINT DETAIL REPORT ON NOT BOOK AFTER CHECK REQUEST-STATUS                  
//*---------------------------------------------------------------------        
//STEP02   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                    
//WORK     DD UNIT=(SYSDA,20),SPACE=(CYL,(60,20))                               
//BP13F740 DD DSN=&&F730AFQ,DISP=(OLD,PASS)                                     
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K023 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13L828 DD DSN=BP13.L828.BP13S828.AFQUE.AY0H.FTS,DISP=SHR                    
//P13L828A DD DSN=BP13.L828.DETAIL.AY0H.FTS,DISP=OLD                            
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S828),DISP=SHR                             
//*------------------------------------------------------------------           
//* SORT BY BK CNT/BK TAG/BE CNT/BTO CNT                                        
//* INCLUDE BK_TAG = 'N'                                                        
//* BYPASS REQUEST-STATUS=S (COL 487)                                           
//*------------------------------------------------------------------           
//*STEP03   EXEC SORT,COND=(0,NE)                                               
//*SORTIN  DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0H.FTS,DISP=SHR                    
//*SORTOUT DD DSN=&&CB83AFQ,DISP=(,PASS),                                       
//*        UNIT=SYSDA,                                                          
//*        DCB=(RECFM=FB,LRECL=500),                                            
//*        SPACE=(CYL,(50,30),RLSE)                                             
//*SYSIN   DD  *                                                                
//*   SORT FIELDS=(467,2,A,469,1,A,467,2,A),FORMAT=CH                           
//*   INCLUDE COND=(469,1,CH,EQ,C'N')                                           
//*---------------------------------------------------------------------        
//* DETAIL FOR BOOKED AND NOT BOOKED BTO/BE REQUEST (GLOBAL FIGURE)             
//*---------------------------------------------------------------------        
//*STEP04   EXEC PGM=BP13CB83,COND=(0,NE)                                       
//*BP13F595 DD DSN=&&CB83AFQ,DISP=(OLD,PASS)                                    
//*BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K500 DD DSN=BP13.K500.BP13AY0H,DISP=SHR,                                 
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K501 DD DSN=BP13.K500.BP13AY0H.PATH1,DISP=SHR,                           
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K595 DD DSN=BP13.K595.BP13D220.FTS,DISP=SHR,                             
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K591 DD DSN=BP13.K595.BP13D220.FTS.PATH1,DISP=SHR,                       
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K592 DD DSN=BP13.K595.BP13D220.FTS.PATH2,DISP=SHR,                       
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K593 DD DSN=BP13.K595.BP13D220.FTS.PATH3,DISP=SHR,                       
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K594 DD DSN=BP13.K595.BP13D220.FTS.PATH4,DISP=SHR,                       
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                 
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13LB83 DD DSN=BP13.LB83.BP13CB83.AFQUE.AY0H.FTS,DISP=OLD                   
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT HIGH ATTEMPT CASE                                                  
//* COL 487 - BYPASS REQUEST-STATUS=S, ADD TO SMS-FD                            
//*------------------------------------------------------------------           
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F595.SOCNOTFD.AFQUE.AY0H.FTS,DISP=SHR                     
//SORTOUT DD DSN=&&BP13F007,DISP=(,PASS),                                       
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=200),                                             
//        SPACE=(CYL,(80,12),RLSE)                                              
//SYSIN   DD  *                                                                 
   SORT FIELDS=(470,2,A,123,8,A),FORMAT=CH                                      
   INCLUDE COND=(467,2,CH,GE,C'01')                                             
  OUTREC FIELDS=(41,9,123,8,82,9,376,3,187,3,211,2,213,3,3X,334,6,              
                225,1,116,1,461,1,475,1,397,1,149X)                             
//*-----------------------------------------------------------------    00170000
//* PRINT PROFILE                                                       00180000
//*-----------------------------------------------------------------    00210000
//STEP06   EXEC  PGM=BP13CY90,COND=(0,NE)                               01360018
//BP13F007 DD  DSN=&&BP13F007,DISP=(OLD,PASS)                           00230001
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00240000
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                          00250000
//             AMP=('BUFND=4','BUFNI=8')                                00260000
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                            00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K585 DD  DSN=BP13.K585.HARDLUCK,DISP=SHR,                         00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K828 DD  DSN=BP13.K828.HISTOCCP,DISP=SHR,                         00330002
//             AMP=('BUFND=4','BUFNI=8')                                00340000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00350002
//             AMP=('BUFND=4','BUFNI=8')                                00360002
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                    00350002
//             AMP=('BUFND=4','BUFNI=8')                                00360002
//BP13K593 DD  DSN=BP13.K593.UNSUCCNT,DISP=SHR,                         00370008
//             AMP=('BUFND=4','BUFNI=8')                                00380006
//BP13K595 DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                               
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K591 DD  DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                         
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13F008 DD  DSN=BP13.F008.AY0H.OUTPUT.FTS,DISP=OLD                   00450005
//SUMMARY   DD SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                 01620002
//SYSOUT   DD  SYSOUT=*                                                 01630002
//*=================================================================            
//* CATER FOR GL3 PPOS RESIDENT                                                 
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F730,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(80,30),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(376,3,CH,EQ,C'BTO',OR,                                 00051117
                 376,3,CH,EQ,C'SBF',OR,                                 00051117
                 376,3,CH,EQ,C'ROF')                                    00051117
//*---------------------------------------------------------------------        
//* EXTRACT NEW APPLICATION FOUND IN DEBARMENT AS GL3 RESIDENT                  
//*---------------------------------------------------------------------        
//STEP08 EXEC PGM=BP13CZ2L,COND=(0,NE)                                          
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F740 DD DSN=BP13.F740.GL3,DISP=OLD                                        
//SYSOUT DD SYSOUT=*                                                            
//SYSIN DD *                                                                    
//*------------------------------------------------------------------   00048503
//* SORT BY NRIC1/DTE-BALLOT/DTE-REQUEST                                00048603
//*------------------------------------------------------------------   00048803
//STEP09   EXEC SORT,COND=(0,NE)                                        00048904
//SORTIN  DD DSN=BP13.F740.GL3,DISP=SHR                                 00049009
//SORTOUT DD DSN=&&F740FTS,DISP=(,PASS),                                00049213
//        UNIT=(SYSDA,3),                                               00049313
//        DCB=(RECFM=FB,LRECL=500),                                     00049413
//        SPACE=(CYL,(80,30),RLSE)                                      00049513
//SYSIN   DD  *                                                         00049613
   SORT FIELDS=(41,9,A,334,6,A,261,8,A,123,8,A),FORMAT=CH               00049713
   INCLUDE COND=(213,3,CH,EQ,C'FTS',OR,                                 00051117
                 213,3,CH,EQ,C'STS',OR,                                 00051117
                 213,3,CH,EQ,C'SAP')                                    00051117
   SUM FIELDS=NONE                                                      00049817
//*------------------------------------------------------------------   00049917
//* SORT BALLOT LOG BY NRIC1/DTE-BALLOT/DTE-REQUEST                     00048603
//* INCLUDE DTE-BALLOT => 201708                                        00048603
//* OUTPUT NRIC1                                                        00048603
//*------------------------------------------------------------------   00048803
//STEP10   EXEC SORT,COND=(0,NE)                                        00050017
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                        00050117
//         AMP=('BUFND=4','BUFNI=8')                                    00050217
//SORTOUT DD DSN=&&BP13F595,DISP=(,PASS),                               00050517
//        UNIT=(SYSDA,3),                                               00050617
//        DCB=(RECFM=FB,LRECL=500),                                     00050717
//        SPACE=(CYL,(250,50),RLSE)                                     00050817
//SYSIN   DD  *                                                         00050917
   SORT FIELDS=(41,9,A,334,6,A,261,8,A),FORMAT=CH                       00051017
   INCLUDE COND=(1,1,CH,NE,C' ',AND,                                    00051117
               334,6,CH,GE,C'201708',AND,                               00051217
              (376,3,CH,EQ,C'BTO',OR,                                   00051117
               376,3,CH,EQ,C'SBF',OR,                                   00051117
               376,3,CH,EQ,C'ROF'))                                     00051117
//*------------------------------------------------------------------   00049917
//* SORT BALLOT LOG BY NRIC1/DTE-BALLOT/DTE-REQUEST                     00048603
//* INCLUDE DTE-BALLOT => 201708                                        00048603
//* OUTPUT NRIC2                                                        00048603
//*------------------------------------------------------------------   00048803
//STEP11   EXEC SORT,COND=(0,NE)                                        00050017
//SORTIN  DD DSN=&&BP13F595,DISP=(OLD,PASS)                             00050517
//SORTOUT DD DSN=&&F595FTS2,DISP=(,PASS),                               00050517
//        UNIT=(SYSDA,3),                                               00050617
//        DCB=(RECFM=FB,LRECL=500),                                     00050717
//        SPACE=(CYL,(250,50),RLSE)                                     00050817
//SYSIN   DD  *                                                         00050917
   SORT FIELDS=(82,9,A,334,6,A,261,8,A),FORMAT=CH                       00051017
   OMIT COND=(82,1,CH,EQ,C' ',OR,                                       00051117
              82,1,CH,EQ,C'#')                                          00051117
   OUTREC FIELDS=(1,40,82,9,50,451)                                             
//*------------------------------------------------------------------   00049917
//* SORT BALLOT LOG BY NRIC1/DTE-BALLOT/DTE-REQUEST                     00048603
//* INCLUDE DTE-BALLOT => 201708                                        00048603
//* OUTPUT NRIC3                                                        00048603
//*------------------------------------------------------------------   00048803
//STEP12   EXEC SORT,COND=(0,NE)                                        00050017
//SORTIN  DD DSN=&&BP13F595,DISP=(OLD,PASS)                             00050517
//SORTOUT DD DSN=&&F595FTS3,DISP=(,PASS),                               00050517
//        UNIT=(SYSDA,3),                                               00050617
//        DCB=(RECFM=FB,LRECL=500),                                     00050717
//        SPACE=(CYL,(250,50),RLSE)                                     00050817
//SYSIN   DD  *                                                         00050917
   SORT FIELDS=(50,9,A,334,6,A,261,8,A),FORMAT=CH                       00051017
   OMIT COND=(50,1,CH,EQ,C' ',OR,                                       00051117
              50,1,CH,EQ,C'#')                                          00051117
   OUTREC FIELDS=(1,40,50,9,50,451)                                             
//*------------------------------------------------------------------   00049917
//* SORT BALLOT LOG BY NRIC1/DTE-BALLOT/DTE-REQUEST                     00048603
//* INCLUDE DTE-BALLOT => 201708                                        00048603
//* OUTPUT NRIC4                                                        00048603
//*------------------------------------------------------------------   00048803
//STEP13   EXEC SORT,COND=(0,NE)                                        00050017
//SORTIN  DD DSN=&&BP13F595,DISP=(OLD,PASS)                             00050517
//SORTOUT DD DSN=&&F595FTS4,DISP=(,PASS),                               00050517
//        UNIT=(SYSDA,3),                                               00050617
//        DCB=(RECFM=FB,LRECL=500),                                     00050717
//        SPACE=(CYL,(250,50),RLSE)                                     00050817
//SYSIN   DD  *                                                         00050917
   SORT FIELDS=(59,9,A,334,6,A,261,8,A),FORMAT=CH                       00051017
   OMIT COND=(59,1,CH,EQ,C' ',OR,                                       00051117
              59,1,CH,EQ,C'#')                                          00051117
   OUTREC FIELDS=(1,40,59,9,50,451)                                             
//*------------------------------------------------------------------   00049917
//* SORT NRIC (1-4) COL 41 -(FTS CASES)                                 00048603
//*------------------------------------------------------------------   00048803
//STEP14   EXEC SORT,COND=(0,NE)                                        00050017
//SORTIN  DD DSN=&&BP13F595,DISP=(OLD,PASS)                             00050517
//        DD DSN=&&F595FTS2,DISP=(OLD,PASS)                             00050517
//        DD DSN=&&F595FTS3,DISP=(OLD,PASS)                             00050517
//        DD DSN=&&F595FTS4,DISP=(OLD,PASS)                             00050517
//SORTOUT DD DSN=&&F595FTS,DISP=(,PASS),                                00050517
//        UNIT=(SYSDA,3),                                               00050617
//        DCB=(RECFM=FB,LRECL=500),                                     00050717
//        SPACE=(CYL,(250,50),RLSE)                                     00050817
//SYSIN   DD  *                                                         00050917
   SORT FIELDS=(41,9,A,334,6,A,261,8,A,123,8,A),FORMAT=CH               00051017
   INCLUDE COND=(213,3,CH,EQ,C'FTS',OR,                                 00051117
                 213,3,CH,EQ,C'STS',OR,                                 00051117
                 213,3,CH,EQ,C'SAP')                                    00051117
//*-------------------------------------------------------------------* 00052008
//* PRINT GL3 RESIDENT PAST ATTEMPT (FTS)                               00061600
//*-------------------------------------------------------------------* 00061717
//STEP15 EXEC PGM=BP13CZ2M,COND=(0,NE)                                  00062016
//BP13F740 DD DSN=&&F740FTS,DISP=(OLD,PASS)                             00080004
//BP13F595 DD DSN=&&F595FTS,DISP=(OLD,PASS)                             00081004
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                             00110112
//         AMP=('BUFND=4','BUFNI=8')                                    00050217
//BP13F730 DD DSN=BP13.F730.GL3.ELIG,DISP=OLD                           00110012
//BP13LZ2M DD DSN=BP13.LZ2M.GL3,DISP=OLD                                00111010
//SYSOUT DD SYSOUT=*                                                    00120000
//SYSIN DD *                                                            00130000
/*                                                                      00140000
//*------------------------------------------------------------------   00048503
//* SORT BY NRIC1/DTE-BALLOT/DTE-REQUEST (PA CASE)                      00048603
//*------------------------------------------------------------------   00048803
//STEP16   EXEC SORT,COND=(0,NE)                                        00048904
//SORTIN  DD DSN=BP13.F740.GL3,DISP=SHR                                 00049009
//SORTOUT DD DSN=&&F740PA,DISP=(,PASS),                                 00049213
//        UNIT=(SYSDA,3),                                               00049313
//        DCB=(RECFM=FB,LRECL=500),                                     00049413
//        SPACE=(CYL,(80,30),RLSE)                                      00049513
//SYSIN   DD  *                                                         00049613
   SORT FIELDS=(41,9,A,334,6,A,261,8,A,123,8,A),FORMAT=CH               00049713
   OMIT COND=(213,3,CH,EQ,C'FTS',OR,                                    00051117
              213,3,CH,EQ,C'STS',OR,                                    00051117
              213,3,CH,EQ,C'SAP')                                       00051117
   SUM FIELDS=NONE                                                      00049817
//*------------------------------------------------------------------   00049917
//* SORT NRIC (1-4) COL 41 - PA                                         00048603
//*------------------------------------------------------------------   00048803
//STEP17   EXEC SORT,COND=(0,NE)                                        00050017
//SORTIN  DD DSN=&&BP13F595,DISP=(OLD,PASS)                             00050517
//        DD DSN=&&F595FTS2,DISP=(OLD,PASS)                             00050517
//        DD DSN=&&F595FTS3,DISP=(OLD,PASS)                             00050517
//        DD DSN=&&F595FTS4,DISP=(OLD,PASS)                             00050517
//SORTOUT DD DSN=&&F595PA,DISP=(,PASS),                                 00050517
//        UNIT=(SYSDA,3),                                               00050617
//        DCB=(RECFM=FB,LRECL=500),                                     00050717
//        SPACE=(CYL,(250,50),RLSE)                                     00050817
//SYSIN   DD  *                                                         00050917
   SORT FIELDS=(41,9,A,334,6,A,261,8,A,123,8,A),FORMAT=CH               00051017
   OMIT COND=(213,3,CH,EQ,C'FTS',OR,                                    00051117
              213,3,CH,EQ,C'STS',OR,                                    00051117
              213,3,CH,EQ,C'SAP')                                       00051117
//*-------------------------------------------------------------------* 00052008
//* PRINT GL3 RESIDENT PAST ATTEMPT (PA CASES)                          00061600
//*-------------------------------------------------------------------* 00061717
//STEP18 EXEC PGM=BP13CZ2M,COND=(0,NE)                                  00062016
//BP13F740 DD DSN=&&F740PA,DISP=(OLD,PASS)                              00080004
//BP13F595 DD DSN=&&F595PA,DISP=(OLD,PASS)                              00081004
//BP13F730 DD DSN=BP13.F730.GL3.ELIG,DISP=MOD                           00110012
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                             00110112
//         AMP=('BUFND=4','BUFNI=8')                                    00050217
//BP13LZ2M DD DSN=BP13.LZ2M.GL3,DISP=MOD                                00111010
//SYSOUT DD SYSOUT=*                                                    00120000
//SYSIN DD *                                                            00130000
/*                                                                      00140000
