//BP13A641 JOB (BP13P),'BP13A641',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*==================================================================           
//**************************************************************                
//* PREPARATION OF FILE FOR COMPUTER BALLOTING (COMPLETION CRMNY)               
//* NOTE: JUST UPDATE THE EST NEIGH CONT BLK IN STEP01                          
//*-------------------------------------------------------------                
//* CHGE REQ  BY    DATE    DESCRIPTION                                         
//* -------- ---- -------- -------------------------------------                
//* BP134599 ZDD  20130601  NEW PROGRAM                                         
//* BP135544 LSB  20141031  AMK PROJECT                                         
//* BP135756 NST1 20150421  DAWSON PROJECT &                                    
//*                         UPDATE PRINTING FROM SYSOUT=2 TO SYSOUT=J           
//* BP135882 NST1 20150710  PING YI GREEN PROJECT (BLK 808B)                    
//* BP135892 NST1 20150722  PING YI GREEN PROJECT (BLK 808C)                    
//* BP135963 NST1 20150918  GOLDEN KISMIS '207N1  C4    21 '                    
//* BP135983 NST1 20151019  TEBAN VIEW    '136N4  C16   55 '                    
//* BP136370 NST1 20160727  TENTERAM PEAK '714N6  C28B 117A'                    
//* BP136419 NST1 20160829  KEAT HONG MIRAGE '208N8  C910 817C'                 
//* BP136828 NST1 20170721  KAMPUNG ADMIRALTY '301N6  C26  676A & 676C'         
//*-------------------------------------------------------------                
//*-------------------------------------------------------------                
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET                                                                    
//**************************************************************                
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EASSSS1A CP-1',END;                                    
1$DJDE$ JDE=13K520,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WD1                                                    
//SYSUT2   DD SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*==================================================================           
//* SORT OUT THE CC CASES FROM FIS                                              
//*==================================================================           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.K110.FLATINV,                                            
//         DISP=SHR                                                             
//SORTOUT  DD DSN=BM06.F110.CCRMNY,DISP=SHR                                     
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     INCLUDE COND=((12,16,CH,EQ,C'301N6  C26  676A',OR,                         
                    12,16,CH,EQ,C'301N6  C26  676B'),AND,                       
                   (323,8,CH,EQ,C'00000000',OR,                                 
                    323,8,CH,EQ,C'        '),AND,                               
                   180,2,CH,NE,C'##',AND,                                       
                   180,2,CH,NE,C'  ')                                           
//*==================================================================           
//* PREPARE F500 CC CASES FILE                                                  
//*==================================================================           
//STEP02   EXEC PGM=BP13C500,COND=(0,NE)                                        
//BM06F110 DD DSN=BM06.F110.CCRMNY,DISP=SHR                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13F500 DD DSN=BP13.F500.CCRMNY,DISP=SHR                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*==================================================================           
//* SORT F500 FILE BASED ON REGN NO.                                            
//*==================================================================           
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.CCRMNY,                                             
//         DISP=SHR                                                             
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS)                                    
//SYSIN    DD *                                                                 
     SORT FIELDS=(33,8,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT THE REQUEST BEFORE PIGEONHOLING                        
//*---------------------------------------------------------------------        
//STEP04   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                   
//BP13K520 DD  DSN=&&BP13F500,DISP=(OLD,PASS)                                   
//BP13L509 DD  SYSOUT=J,OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                       
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S509),DISP=SHR                            
