//BP13ADC1  JOB (BP13P),'BP13ADC1',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* CHG REF  BY   ON     DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP132870 CKK 061110  NEW JCL FOR DBSS TO DUPLICATE GRO CASES                
//* BP133244 LSB 080128  ADD REPORT BP13L525                                    
//*=================================================================            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KB85.ISSUENO,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.FB85.ISSUENO.ADC1,DISP=OLD                               
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F740.MATUREBA.ADC1,DISP=OLD                              
//INPUT3   DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//OUTPUT3  DD DSN=BP13.F830.ADDR.ADC1,DISP=OLD                                  
//INPUT4   DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//OUTPUT4  DD DSN=BP13.F825.REQOCCP.ADC1,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
//*--------------------------------------------------------------------         
//*- SORT OUT ALL THE GRO CASES                                                 
//*--------------------------------------------------------------------         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740,DISP=(NEW,PASS),                                       
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(2,3),RLSE)                                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(163,2,CH,NE,C'  ')                                             
//*--------------------------------------------------------------------         
//*   DUPLICATE GRO CASES TO HAVE ANOTHER CHANCE IN PRIO/PA SCHEME              
//*--------------------------------------------------------------------         
//STEP02 EXEC PGM=BP13C511,COND=(0,NE)                                          
//BP13F740 DD DSN=&&F740,DISP=(SHR,PASS)                                        
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//BP13KB85 DD DSN=BP13.KB85.ISSUENO,DISP=SHR                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13KB78 DD DSN=BP13.KB78.DBSREQ.DUP,DISP=SHR                                 
//BP13L511 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT BY NT/FT/RANDOM-NO                                                     
//*------------------------------------------------------------------           
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740NTFT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION REPORT BEFORE BALLOTING                                   
//*------------------------------------------------------------------           
//STEP04   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740NTFT,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L525B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13L525C DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
