//BP13ATMP JOB (BP13P),'BP13ATMP',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*-----------------------------------------------------------------            
//* COMPUTATE UNSUCC ATTEMPTS AT END OF BALLOTING                               
//* 1) START FROM YEAR 2002, INCLUDE BE/BTO/DBSS, BYPASS WIS                    
//* 2) COUNT NO-UNSUCC FROM LATEST QTR, ONCE HIT SUCC, STOP COUNTING            
//* 3) OMIT NO RANDOM-NUMBER CASES                                              
//* 4) SUCC OUTSIDE 100% FLAT SUPPLY IS TREATED AS UNSUCC                       
//* 5) SUCC UNDER RESERVE LSIT ALSO TREATED AS UNSUCC                           
//* 6) SUCC UNDER ABOTIVE PROJECT 200309,200412 TREATED AS UNSUCC               
//* 7) BYPASS NO DTE-BALLOT, NO ALLO-CAT                                        
//* 8) DTE-BAL 200303, 200305 - CONVERT TO 200212                               
//**************************************************************                
//* CHG REF       BY     DATE    DESCRIPTION                                    
//* --------     ---- -------- ---------------------------                      
//* FMS201102068 IL5   20110516  INCREASE CYL FROM (120,20) TO (250,50)         
//*                              FOR STEPS 2 TO 6                               
//* BP134536     IL5   20120607  OMIT MGPS RECORDS (STEP1)                      
//* BP135028     SMR2  20130909  CHANGE BP13K816 TO BP13K813                    
//* FMS201600728 IL5   20160222  INCREASE CYL FROM (250,50) TO (260,60)         
//* BP136852     SMR2  20170721  OMIT ROF CASES                                 
//* BP138591     AM25  20210120  OMIT FT 1F CASES                               
//* FB202300439  IL5   20230220  ADD MULTIVOL PARM AT STEP17                    
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K593.UNSUCCNT,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------*         
//*  OMIT CONDITION FOR COMPUTATION OF UNSUCC ATTEMPTS                          
//*  CONVERT DTE-BALLOT 200303, 200305 TO 200212                                
//*  334,6,CH,EQ,C'200303',OR,                                                  
//*  334,6,CH,EQ,C'200305',OR,                                                  
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F595BALL,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(260,60))                                              
//SYSIN   DD *                                                                  
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(1,1,CH,EQ,C' ',OR,                                                
              260,1,CH,EQ,C' ',OR,                                              
              334,4,CH,LT,C'2001',OR,                                           
              334,6,CH,EQ,C'      ',OR,                                         
              334,6,CH,EQ,C'200204',OR,                                         
              334,6,CH,EQ,C'200205',OR,                                         
              245,1,CH,EQ,C'P',OR,                                              
              245,1,CH,EQ,C'C',OR,                                              
              376,1,CH,EQ,C'W',OR,                                              
              376,1,CH,EQ,C' ',OR,                                              
              376,2,CH,EQ,C'3R',OR,                                             
              376,3,CH,EQ,C'ROF',OR,                                            
              211,2,CH,EQ,C'1F')                                                
//*-----------------------------------------------------------------            
//*- OUTPUT NRIC1                                                               
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595BALL,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F595,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(260,60))                                              
//SYSIN   DD *                                                                  
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OUTREC FIELDS=(1,483,41,9,8X)                                                
   OMIT COND=(41,1,CH,EQ,C'#')                                                  
//*---------------------------------------------------------------------        
//*- OUTPUT NRIC2                                                               
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595BALL,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F595,DISP=(MOD,PASS)                                    
//SYSIN   DD *                                                                  
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OUTREC FIELDS=(1,483,82,9,8X)                                                
   OMIT COND=(82,1,CH,EQ,C'#',OR,82,1,CH,EQ,C' ')                               
//*---------------------------------------------------------------------        
//*- OUTPUT NRIC3                                                               
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595BALL,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F595,DISP=(MOD,PASS)                                    
//SYSIN   DD *                                                                  
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OUTREC FIELDS=(1,483,50,9,8X)                                                
   OMIT COND=(50,1,CH,EQ,C'#',OR,50,1,CH,EQ,C' ')                               
//*---------------------------------------------------------------------        
//*- OUTPUT NRIC4                                                               
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595BALL,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F595,DISP=(MOD,PASS)                                    
//SYSIN   DD *                                                                  
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OUTREC FIELDS=(1,483,59,9,8X)                                                
   OMIT COND=(59,1,CH,EQ,C'#',OR,59,1,CH,EQ,C' ')                               
//*---------------------------------------------------------------------        
//*- ALL NRIC - SORT OUTREC BY NRIC ASC & DTE-BALLOT DESC                       
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F595DTE,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(260,60))                                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(484,9,A,334,6,D,260,1,A),FORMAT=CH                              
//*-------------------------------------------------------------------*         
//* SORT ACCEPTED CASES BY REGN NO & DTE-ACC-REJ                      *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K580.ACCEPT,DISP=SHR,                                    
//         AMP=('BUFND=13')                                                     
//SORTOUT  DD DSN=&&F580ACC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=200),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A,20,8,D),FORMAT=CH                                          
  INCLUDE COND=(28,1,CH,EQ,C'A',AND,115,1,CH,NE,C'Y')                           
//*-------------------------------------------------------------------*         
//* SORT INVITED AND NOT ACCEPTED CASES BY REGN NO & DTE-ACC-REJ                
//* INCLUDE WITHIN-LIMIT=Y                                                      
//*-------------------------------------------------------------------*         
//*STEP7A   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.KH15.NOTBKREG,DISP=SHR,                                 
//*         AMP=('BUFND=13')                                                    
//*SORTOUT  DD DSN=&&BP13FH15,DISP=(,PASS),                                     
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=200),                                        
//*            SPACE=(CYL,(100,50),RLSE)                                        
//*SYSIN    DD  *                                                               
//*  SORT FIELDS=(55,8,A,40,8,D),FORMAT=CH                                      
//*  INCLUDE COND=(88,1,CH,EQ,C'Y')                                             
//*-------------------------------------------------------------------*         
//* FORMAT INVITED NOT BOOKED CASES TO BP13K580 LAYOUT                *         
//*-------------------------------------------------------------------*         
//*STEP7B   EXEC PGM=BP13CH13,COND=(0,NE)                                       
//*BP13FH15 DD DSN=&&BP13FH15,DISP=(OLD,PASS)                                   
//*BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//*         AMP=('BUFND=4','BUFNI=8')                                           
//*BP13F580 DD DSN=&&F580ACC,DISP=(MOD,PASS),                                   
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=200),                                        
//*            SPACE=(CYL,(100,50),RLSE)                                        
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* RETRIEVE RECS WITH LATEST DTE-ACC-REJ                             *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=BP13CB36,COND=(0,NE)                                        
//BP13F580 DD DSN=&&F580ACC,DISP=(OLD,PASS)                                     
//P13F580A DD DSN=&&F580LAST,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=200),                                         
//            SPACE=(CYL,(100,50),RLSE)                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//*- OMIT BLANK DTE-ACCEPT                                                      
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F580LAST,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F580BALL,DISP=(,PASS),                                      
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=200),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,29,A),FORMAT=CH                                               
   OMIT COND=(20,8,CH,EQ,C'        ')                                           
//*-----------------------------------------------------------------            
//*- OUTPUT NRIC1                                                               
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F580BALL,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F580,DISP=(,PASS),                                      
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=200),                                         
//            SPACE=(CYL,(250,50))                                              
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,29,A),FORMAT=CH                                               
   OMIT COND=(74,1,CH,EQ,C'#',OR,74,1,CH,EQ,C' ',OR,74,1,CH,LT,C' ')            
//*---------------------------------------------------------------------        
//*- OUTPUT NRIC2                                                               
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F580BALL,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F580,DISP=(MOD,PASS)                                    
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,29,A),FORMAT=CH                                               
   OUTREC FIELDS=(1,73,83,9,83,118)                                             
   OMIT COND=(83,1,CH,EQ,C'#',OR,83,1,CH,EQ,C' ',OR,83,1,CH,LT,C' ')            
//*---------------------------------------------------------------------        
//*- OUTPUT NRIC3                                                               
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F580BALL,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F580,DISP=(MOD,PASS)                                    
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,29,A),FORMAT=CH                                               
   OUTREC FIELDS=(1,73,92,9,83,118)                                             
   OMIT COND=(92,1,CH,EQ,C'#',OR,92,1,CH,EQ,C' ',OR,92,1,CH,LT,C' ')            
//*---------------------------------------------------------------------        
//*- OUTPUT NRIC4                                                               
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F580BALL,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F580,DISP=(MOD,PASS)                                    
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,29,A),FORMAT=CH                                               
   OUTREC FIELDS=(1,73,101,9,83,118)                                            
   OMIT COND=(101,1,CH,EQ,C'#',OR,101,1,CH,EQ,C' ',OR,101,1,CH,LT,C' ')         
//*---------------------------------------------------------------------        
//* PROGRAM TO CHECK SPOUSE NRIC                                                
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=BP13CB62,COND=(0,NE)                                        
//BP13F580 DD DSN=&&F580BALL,DISP=(OLD,PASS)                                    
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR                                   
//P13F580  DD DSN=&&BP13F580,DISP=(MOD,PASS)                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*- SORT BY NRIC ASC & DTE-ACCEPT DESC                                         
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F580,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F580SORT,DISP=(,PASS),                                      
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=200),                                         
//            SPACE=(CYL,(150,50),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(74,9,A,20,8,D),FORMAT=CH                                        
//*-------------------------------------------------------------------*         
//* REMOVE BALLOT HIST IF DTE-BALLOT <= DTE-ACPT                                
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=BP13CB38,COND=(0,NE)                                        
//BP13F580 DD DSN=&&F580SORT,DISP=(OLD,PASS)                                    
//BP13F595 DD DSN=&&F595DTE,DISP=(OLD,PASS)                                     
//P13F595A DD DSN=&&F595ACC,DISP=(,PASS),                                       
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//BP13LB38 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//*-SORT OUT CASS BY REGISRATION NUMBER FOR SPOUSE NRIC PROCESSING              
//*---------------------------------------------------------------------        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595ACC,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&P13F595,DISP=(,PASS),                                       
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* PROGRAM TO CHECK SPOUSE NRIC                                                
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=BP13CB60,COND=(0,NE)                                        
//BP13F595 DD DSN=&&P13F595,DISP=(OLD,PASS)                                     
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR                                   
//P13F595  DD DSN=&&F595ACC,DISP=(MOD,PASS)                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*- ALL NRIC - SORT OUTREC BY NRIC ASC & DTE-BALLOT DESC                       
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595ACC,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F595SORT,DISP=(,PASS),                                      
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(484,9,A,334,6,D,261,8,D,33,8,A),FORMAT=CH                       
//*---------------------------------------------------------------------        
//* COMPUTE UNSUCC ATTEMPT                                                      
//*---------------------------------------------------------------------        
//STEP20   EXEC PGM=BP13CB22,COND=(0,NE)                                        
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13F595 DD DSN=&&F595SORT,DISP=(OLD,PASS)                                    
//BP13F593 DD DSN=&&BP13F593,DISP=(,PASS),                                      
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(250,20),RLSE)                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT DUPLICATE NRIC                                                         
//*---------------------------------------------------------------------        
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F593,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F593SORT,DISP=(,PASS),                                      
//            UNIT=SYSDA,DATACLAS=MULTIVOL,                                     
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(250,20),RLSE)                                         
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,9,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//*- DEFINE BALLOT FILE BP13K593 FOR SHORTLISTING                               
//*---------------------------------------------------------------------        
//STEP22   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&F593SORT,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
         DEL 'BP13.K593.UNSUCCNT' CL PURGE                                      
         DEF CL (NAME(BP13.K593.UNSUCCNT)              -                        
                 CYL(600 100)                           -                       
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K593.UNSUCCNT.DATA) -                               
                 KEYS(9 0)                              -                       
                 RECSZ(2000 2000)                      -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K593.UNSUCCNT)                                        
