//BP13M126 JOB (BP13P),'BP13M124',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010002
//         SCHENV=PKZIP,NOTIFY=CSD0071                                  00020001
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030001
//*                                                                     00040001
//*-------------------------------------------------------------------- 00050001
//* TO SEND INTERFACE FILE (GRANT REPORT) WITHOUT DUPLICATE NRIC AND    00050104
//* GRANT TYPE                                                          00050204
//*-------------------------------------------------------------------- 00051003
//STEP01 EXEC PGM=SORT,COND=(0,NE)                                      00060003
//SYSPRINT DD SYSOUT=*                                                  00070001
//SYSOUT DD SYSOUT=*                                                    00080001
//SORTIN   DD DSN=BP13.GRANT.DTLS.REPORT,DISP=SHR                       00090001
//SORTOUT  DD DSN=&&P13CG091,                                           00100001
//            DISP=(NEW,PASS),                                          00110001
//            UNIT=SYSDA,                                               00120001
//            SPACE=(CYL,(50,30),RLSE),                                 00130001
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                        00140001
//SYSIN DD *                                                            00150001
   SORT FIELDS=(1,23,CH,A)                                              00160001
/*                                                                      00170001
//*-------------------------------------------------------------------- 00171003
//* TO REFORMAT THE GRANT REPORT WITH REGNO                             00171103
//*-------------------------------------------------------------------- 00172003
//STEP02 EXEC PGM=SORT,COND=(0,NE)                                      00180003
//SYSPRINT DD SYSOUT=*                                                  00190001
//SYSOUT DD SYSOUT=*                                                    00200001
//SORTIN   DD DSN=&&P13CG091,DISP=(OLD,PASS)                            00210001
//SORTOUT  DD DSN=&&P13CG092,                                           00220001
//            DISP=(NEW,PASS),                                          00230001
//            UNIT=SYSDA,                                               00240001
//            SPACE=(CYL,(50,30),RLSE),                                 00250001
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                        00260001
//SYSIN DD *                                                            00270001
   SORT FIELDS=COPY                                                     00280001
   OUTREC FIELDS=(1:1,8,9:11,9,18:21,6,24:28,8,32:37,10,100:X)          00290001
/*                                                                      00300001
//*                                                                     00310001
//*-------------------------------------------------------------------- 00311003
//* Delete and Define the VSAM file to have reformated report details   00311103
//*-------------------------------------------------------------------- 00312003
//STEP03    EXEC PGM=IDCAMS,COND=(0,NE)                                 00320002
//INPUT1 DD DSN=&&P13CG092,DISP=(OLD,PASS)                              00330001
//SYSPRINT  DD SYSOUT=*                                                 00340001
//SYSIN     DD  *                                                       00350001
          DEL (BP13.K29A.GRANT.REPORT) CL PURGE                         00360001
          DEF CLUSTER                                -                  00370001
              (NAME(BP13.K29A.GRANT.REPORT)           -                 00380001
              CYL(350 100)                           -                  00390001
              DATACLAS(MULTIVOL)                     -                  00400001
              STORCLAS(PRODRLS)                      -                  00410001
              LOG(NONE)                              -                  00420001
              SPEED                                  -                  00430001
              UNIQUE                                 -                  00440001
              SHR(2 3))                              -                  00450001
              DATA                                   -                  00460001
              (NAME(BP13.K29A.GRANT.REPORT.DATA)     -                  00470001
              KEYS(23 0)                           -                    00480001
              RECSZ(100 100)                         -                  00490001
              CISZ(4096)                             -                  00500001
              FSPC(20 20))                           -                  00510001
              INDEX                                  -                  00520001
              (NAME(BP13.K29A.GRANT.REPORT.INDEX)    -                  00530001
              CISZ(4096))                                               00540001
      IF MAXCC = 0  THEN                             -                  00550001
         REPRO IFILE(INPUT1)                         -                  00560001
              ODS(BP13.K29A.GRANT.REPORT)                               00570001
      IF MAXCC = 0  THEN                             -                  00580001
           DEF AIX (NAME(BP13.K29A.GRANT.REPORT.ALTX1) -                00590001
               REL(BP13.K29A.GRANT.REPORT)           -                  00600001
               REUSE                                 -                  00610001
               KEYS(15 8)                             -                 00620001
               SHR(2 3)                              -                  00630001
               NUNQK)                                -                  00640001
               DATA                                  -                  00650001
               (NAME(BP13.K29A.GRANT.REPORT.ALTX1.DATA) -               00660001
               CYL(100 50)                          -                   00670001
               RECSZ(160 190)                       -                   00680001
               FSPC(20 20)                           -                  00690001
               CISZ(4096))                           -                  00700001
               INDEX                                 -                  00710001
               (NAME(BP13.K29A.GRANT.REPORT.ALTX1.INDEX) -              00720001
               CISZ(4096))                                              00730001
         IF MAXCC = 0 THEN                           -                  00740001
           DEF PATH (NAME(BP13.K29A.GRANT.REPORT.PATH1) -               00750001
               PENT(BP13.K29A.GRANT.REPORT.ALTX1))                      00760001
         IF MAXCC = 0 THEN                                              00770001
           BIX IDS(BP13.K29A.GRANT.REPORT)           -                  00780001
               ODS(BP13.K29A.GRANT.REPORT.ALTX1)                        00790001
/*                                                                      00800001
//*                                                                     00810001
//*--------------------------------------------------------------------*00820001
//*  OMIT THE SAME NRIC AND GRANT TYPE RECORDS FROM INTERFACE FILE      00830001
//*--------------------------------------------------------------------*00840001
//STEP04 EXEC PGM=BP13CG09,COND=(0,NE)                                  00850003
//SYSPRINT DD SYSOUT=*                                                  00860001
//SYSOUT DD SYSOUT=*                                                    00870001
//BP13GRNR DD DSN=BP13.GRANT.DTLS,DISP=SHR                              00880001
//BP13K210 DD DSN=BP13.K29A.GRANT.REPORT,DISP=SHR                       00890001
//BP13K211 DD DSN=BP13.K29A.GRANT.REPORT.PATH1,DISP=SHR                 00900001
//BP13F001 DD DSN=BP13.GRANT.DTLS.DFDTAPRV,DISP=SHR                     00910001
//BP13F002 DD DSN=BP13.GRANT.DTLS.NODUPL,DISP=SHR                       00920001
//*                                                                     00930001
//*--------------------------------------------------------------------*00940001
//* To Remove duplicate records                                         00940103
//*--------------------------------------------------------------------*00941003
//STEP05 EXEC PGM=SORT,COND=(0,NE)                                      00950003
//SYSPRINT DD SYSOUT=*                                                  00960001
//SYSOUT DD SYSOUT=*                                                    00970001
//SORTIN DD DSN=BP13.GRANT.DTLS.DFDTAPRV,DISP=SHR                       00980001
//SORTOUT  DD DSN=&&P13CG095,                                           00990001
//            DISP=(NEW,PASS),                                          01000001
//            UNIT=SYSDA,                                               01010001
//            SPACE=(CYL,(50,30),RLSE),                                 01020001
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                        01030001
//SYSIN DD *                                                            01040001
     SORT FIELDS=(1,34,CH,A)                                            01050001
     SUM FIELDS=NONE                                                    01060001
/*                                                                      01070001
//*--------------------------------------------------------------------*01080001
//* To Sort based on the Grant type                                     01080103
//*--------------------------------------------------------------------*01081003
//STEP06 EXEC PGM=SORT,COND=(0,NE)                                      01090003
//SYSPRINT DD SYSOUT=*                                                  01100001
//SYSOUT DD SYSOUT=*                                                    01110001
//SORTIN DD DSN=&&P13CG095,DISP=(OLD,PASS)                              01120001
//SORTOUT DD DSN=BP13.GRANT.DTLS.DFDTAPRV.NODUPL,DISP=SHR               01130001
//SYSIN DD *                                                            01140001
     SORT FIELDS=(10,6,CH,A)                                            01150001
/*                                                                      01160001
//*--------------------------------------------------------------------*01170001
//* STEP 07 : INCLUDE HEADER AND TRAILER                                01180002
//*--------------------------------------------------------------------*01190001
//STEP07 EXEC SAS,COND=(0,NE)                                           01200002
//WORK     DD UNIT=(SYSDA,20),SPACE=(CYL,(60,20))                       01210001
//BP13F100 DD DSN=BP13.GRANT.DTLS.NODUPL,DISP=SHR                       01220001
//*        AMP=('BUFND=4','BUFNI=8')                                    01230001
//BP13F101 DD DSN=BP13.GRANT.DTLS.MTENDRPT,DISP=SHR                     01240001
//*        AMP=('BUFND=4','BUFNI=8')                                    01250001
//SYSOUT DD SYSOUT=*                                                    01260001
//SYSPRINT DD SYSOUT=*                                                  01270001
//SYSIN DD *                                                            01280001
  OPTIONS SORTPGM = BEST ;                                              01290001
                                                                        01300001
   DATA F100;                                                           01310001
    INFILE BP13F100;                                                    01320001
       INPUT @001 NRIC                    $CHAR09.                      01330001
             @010 GRANT_TYPE              $CHAR06.                      01340001
             @016 AMT_GRANT               $CHAR09.                      01350001
             @025 DTE_APPROVAL            $CHAR10.;                     01360001
                                                                        01370001
   DATA _NULL_;                                                         01380001
      FILE BP13F101 NOTITLES;                                           01390001
      SET F100 END=EOF;                                                 01400001
                                                                        01410001
      RETAIN REC_CNT 0;                                                 01420001
                                                                        01430001
      IF _N_ = 1 THEN                                                   01440001
      DO;                                                               01450001
         SYSDATE = TODAY();                                             01460001
         SYSCCYY = YEAR(SYSDATE);                                       01470001
         SYSMM   = MONTH(SYSDATE);                                      01480001
         SYSDD   = DAY(SYSDATE);                                        01490001
         PUT  @01   'HDB'                                               01500001
              @04   SYSCCYY        Z4.                                  01510001
              @08   '-'                                                 01520001
              @09   SYSMM          Z2.                                  01530001
              @11   '-'                                                 01540001
              @12   SYSDD          Z2.;                                 01550001
      END;                                                              01560001
                                                                        01570001
      REC_CNT = REC_CNT + 1;                                            01580001
                                                                        01590001
      PUT  @001 NRIC                    $CHAR09.                        01600001
           @010 GRANT_TYPE              $CHAR06.                        01610001
           @016 AMT_GRANT               $CHAR09.                        01620001
           @025 DTE_APPROVAL            $CHAR10.                        01630001
           @035 66*' ';                                                 01640001
      IF EOF THEN                                                       01650001
       DO;                                                              01660001
          PUT  @01   'HDB'                                              01670001
               @04   REC_CNT       9.;                                  01680001
      END;                                                              01690001
/*                                                                      01700001
//*                                                                     01710001
//*--------------------------------------------------------------------*01711002
//* STEP 08 : DEL ZIP FILE                                              01712002
//*--------------------------------------------------------------------*01713002
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                  01714002
//SYSPRINT DD SYSOUT=*                                                  01715002
//SYSIN    DD *                                                         01716002
     DEL BP13.GRANT.DTLS.MTENDRPT.ZIP                                   01717002
     DEL BP13.FTPPUT.GRANT.DTLS                                         01718002
     DEL BP13.ZIPINP.GRANT.DTLS                                         01719002
     IF MAXCC < 12 THEN                                                 01719102
        SET MAXCC = 0                                                   01719202
/*                                                                      01719302
//*--------------------------------------------------------------------*01719402
//* STEP09:  TO PREPARE ZIP AND FTP FILE                                01719502
//*--------------------------------------------------------------------*01719602
//STEP09 EXEC SAS,COND=(0,NE)                                           01719702
//BP13FTP DD DSN=BP13.FTPPUT.GRANT.DTLS,DISP=(NEW,CATLG),               01719802
//      AVGREC=K,SPACE=(1,(5,50),RLSE),                                 01719902
//      LRECL=100,BLKSIZE=0,RECFM=FB,DSORG=PS                           01720002
//BP13ZIP DD DSN=BP13.ZIPINP.GRANT.DTLS,DISP=(NEW,CATLG),               01721002
//      AVGREC=K,SPACE=(1,(5,50),RLSE),                                 01722002
//      LRECL=102,BLKSIZE=0,RECFM=FB,DSORG=PS                           01723002
//SYSOUT DD SYSOUT=*                                                    01724002
//SYSPRINT DD SYSOUT=*                                                  01725002
//SYSIN DD *                                                            01726002
  %GLOBAL CCYYMMDD;                                                     01727002
                                                                        01728002
  DATA _NULL_;                                                          01729002
    LENGTH ODD $2.;                                                     01729102
    LENGTH OMM $2.;                                                     01729202
    LENGTH OYY $4.;                                                     01729302
    LENGTH OHH $2.;                                                     01729402
    LENGTH ONN $2.;                                                     01729502
    LENGTH OSS $2.;                                                     01729602
    CUT_DTE = TODAY();                                                  01729702
    CUR_TME = TIME();                                                   01729802
    ODD = DAY(CUT_DTE);                                                 01729902
    OMM = MONTH(CUT_DTE);                                               01730002
    OYY = YEAR(CUT_DTE);                                                01731002
    OHH = HOUR(CUR_TME);                                                01732002
    ONN = MINUTE(CUR_TME);                                              01733002
    OSS = SECOND(CUR_TME);                                              01734002
    DTE_CURR = OYY||OMM||ODD||OHH||ONN||OSS;                            01735002
    DTE_CURR = TRANSLATE(DTE_CURR,'0',' ');                             01736002
                                                                        01737002
    STDZIP00 = "-ARCHIVE(BP13.GRANT.DTLS.MTENDRPT.ZIP)";                01738002
    STDZIP01 = "-ARCHVOL(DUMMY)";                                       01739002
    STDZIP02 = "-METHOD(FAST)";                                         01739102
    STDZIP03 = "-ZIPPED_DSN(BP13.GRANT.DTLS.MTENDRPT,";                 01739202
    STDZIP06 = "-FILE_TERMINATOR()";                                    01739302
    STDZIP07 = "   BP13.GRANT.DTLS.MTENDRPT";                           01739402
                                                                        01739502
    STDPUT00 = "CD PROD/APPN/DATA/BP13/FROM-HDB/DOS/GRANT";             01739602
    STDPUT01 = "DIR";                                                   01739702
    STDPUT02 = "BINARY";                                                01739802
    STDPUT03 = "PUT 'BP13.GRANT.DTLS.MTENDRPT.ZIP' + ";                 01739902
    STDPUT04 = "hdb_grant_details_report_";                             01740002
    STDPUT06 = ".txt";                                                  01741002
    STDPUT07 = ".zip";                                                  01742002
                                                                        01743002
    STDPUT05 = STDPUT04||DTE_CURR||STDPUT06||STDPUT07;                  01744002
    STDZIP04 = STDZIP03||STDPUT04||'-';                                 01745002
    STDZIP05 = DTE_CURR||STDPUT06||')';                                 01746002
    STDPUT08 = "LS";                                                    01747002
    STDPUT09 = "QUIT";                                                  01748002
                                                                        01749002
    FILE BP13ZIP;                                                       01749102
         PUT STDZIP00;                                                  01749202
         PUT STDZIP01;                                                  01749302
         PUT STDZIP02;                                                  01749402
         PUT STDZIP04;                                                  01749502
         PUT STDZIP05;                                                  01749602
         PUT STDZIP06;                                                  01749702
         PUT STDZIP07;                                                  01749802
                                                                        01749902
    FILE BP13FTP;                                                       01750002
         PUT STDPUT00;                                                  01751002
         PUT STDPUT01;                                                  01752002
         PUT STDPUT02;                                                  01753002
         PUT STDPUT03;                                                  01754002
         PUT STDPUT05;                                                  01755002
         PUT STDPUT08;                                                  01756002
         PUT STDPUT09;                                                  01757002
//*--------------------------------------------------------------------*01758002
//* STEP 10 : COMPRESS FILE                                             01759002
//*--------------------------------------------------------------------*01759102
//STEP10   EXEC PKZIP,COND=(0,NE)                                       01759202
//SYSIN DD DSN=BP13.ZIPINP.GRANT.DTLS,DISP=SHR                          01759302
//*--------------------------------------------------------------------*01759402
//* STEP 11 : FTP COMPRESSED FILE TO SGNETSTAGE SERVER                  01759502
//*           PATH --> E:\FTP\PROD\APPN\DATA\BP13\FROM-HDB\DOS\GRANT    01759602
//*--------------------------------------------------------------------*01759702
//STEP11   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                 01759802
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                          01759902
//INPUT    DD DSN=BP13.FTPPUT.GRANT.DTLS,DISP=SHR                       01760002
//*                                                                     01761002
//*--------------------------------------------------------------------*01770001
