//BP13M123 JOB (BP13P),'BP13M123',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010007
//         NOTIFY=CSD0071                                               00020000
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030000
//*---------------------------------------------------------------------00040000
//* MONTH END JOB FOR LOADING BB24 DATA INTO GRNT_ASSMNT, GRANT PERSON  00280000
//* TABLE                                                               00280100
//* CPF HOUSING GRANT                                                   00281000
//*---------------------------------------------------------------------00282000
//* BP138252 11052020 PP11 LOADING BB24 DATA INTO GRNT ASSMNT, GRANT    00283000
//*                        PERSON TABLE                                 00284000
//*-----------------------------------------------------------------    00290000
//STEP01   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00300000
//BP13GASM DD  DSN=BB24.BP13.GASM.GRANT,DISP=SHR                        00310000
//BP13GAPN DD  DSN=BB24.BP13.GAPN.GRANT,DISP=SHR                        00330000
//BP13DASM DD  DSN=BP13.GASM.DUP.LOAD.TABLE,DISP=OLD                    00340000
//BP13DAPN DD  DSN=BP13.GAPN.DUP.LOAD.TABLE,DISP=OLD                    00350000
//BP13EASM DD  DSN=BP13.GASM.ERR.LOAD.TABLE,DISP=OLD                    00360000
//BP13EAPN DD  DSN=BP13.GAPN.ERR.LOAD.TABLE,DISP=OLD                    00370000
//SYSOUT   DD  SYSOUT=*                                                 00380000
//SYSTSPRT DD  SYSOUT=*                                                 00390000
//SYSPRINT DD  SYSOUT=*                                                 00400000
//SYSDBG   DD  SYSOUT=*                                                 00410000
//SYSDBOUT DD  SYSOUT=*                                                 00420000
//SYSTSIN  DD  *                                                        00430000
  DSN SYSTEM(DSN)                                                       00440000
  RUN PROGRAM(BP13CB3I) PLAN(BP13PCC) -                                 00450008
      LIB('BP13.BATCH.LOADCOB')                                         00460000
  END                                                                   00470000
//*-------------------------------------------------------------------* 00481000
//*      BACKUP OF MONTH END FILE                                     * 00482000
//*-------------------------------------------------------------------* 00483000
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                  00484000
//SYSPRINT DD SYSOUT=*                                                  00485000
//INPUT1   DD DSN=BB24.BP13.GASM.GRANT,DISP=SHR                         00486000
//OUTPUT1  DD DSN=BP13.GASM.GRANT.MONTH(+1),DISP=(NEW,CATLG),           00487100
//            SPACE=(CYL,(20,10)),                                      00487200
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=435,RECFM=FB)               00487300
//INPUT2   DD DSN=BB24.BP13.GAPN.GRANT,DISP=SHR                         00487400
//OUTPUT2  DD DSN=BP13.GAPN.GRANT.MONTH(+1),DISP=(NEW,CATLG),           00487600
//            SPACE=(CYL,(20,10)),                                      00487700
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=181,RECFM=FB)               00487800
//*                                                                     00488000
//SYSIN     DD  *                                                       00489000
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                               00489100
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                               00489200
/*                                                                      00489300
//*-----------------------------------------------------------------    00491000
//* EMPTY BB24 FILES                                                  * 00500000
//*-------------------------------------------------------------------* 00510000
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                  00520000
//SYSPRINT DD SYSOUT=*                                                  00530000
//INPUT3   DD DUMMY                                                     00540000
//OUTPUT3  DD DSN=BB24.BP13.GASM.GRANT,DISP=OLD                         00550000
//OUTPUT4  DD DSN=BB24.BP13.GAPN.GRANT,DISP=OLD                         00560000
//SYSIN    DD *                                                         00570000
        REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                          00580000
        REPRO INFILE(INPUT3)  OUTFILE(OUTPUT4)                          00590000
/*                                                                      00600000
