//BP13A505 JOB (BP13P),'BP13A505',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* CHG REF  BY   ON     DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP130418 CLT 980922  Y2K COMPLIANCE CHANGE : BP13K800/BP13K820              
//* BP130652 SRA 990823  EXPAND K520,F595,F740,K740 RECL 300 TO 500             
//* BP130871 SSS 000609  LISTING FOR EAALSS                                     
//* BP132171 ED  120702  ADD STEPS FOR GROPA CASES. (STEP27-29)                 
//* BP132200 CKK 131102  SORT SERVING CASES FIRST, FOLLOWED BY GRO.             
//* BP132317 JF4 240303  BTO CHANGES FOR BP13C512 AND BP13C514                  
//* BP132360 CKK 170703  ADD BP13K825 TO PROGRAM BP13C086                       
//* BP132412 MJ16151003  INCLUDED FILE BP13K703 IN PGM BP13C514                 
//* BP132463 CKK 291203  TO ASSIGN REGN NO TO SUCCESSFUL CASES ONLY             
//* BP132496 CKK 030504  TO UPDATE FILE LAYOUT FOR BP13C745                     
//* BP132626 CKK 061204  TO BACKUP BP13K757 AND BP13K825                        
//* BP133056 CKK 200507  TO REMOVE BP13C512                                     
//* BP133147 IL5 200710  TO REMOVE VERIFY FOR K825 AND K830.                    
//* BP133730 IL5 100318  TO CEASE PRINTING BP13L536 (BP13S536)                  
//* BP133913 IL5 100525 TP CEASE PRINTING BP13L535 (BP13S535)                   
//* BP134688 IL5 021112  STEP02 - SORT FROM K595 (CHG POS FROM                  
//*                      (CHG POSITION FROM 300 TO 352)                         
//* BP135064 IL5 111013  TO UPDATE RECIPIENT FOR REPORT BP13L745                
//* BP135708 SMR 310315  CHANGE CLASS=2 TO CLASS=J                              
//* BP136157 IL5 110316  TO REMOVE DD BP13K520 FROM BP13C745                    
//*                      CHANGE DATE IN STEP2 FROM 19950101 TO                  
//*                      20150101                                               
//* BP138301 AM2 140520  HARDCOPY REPORTS CONVERSION                            
//* BP139280 YCH2 21112023 CHANGE K757 FROM 3000 TO 4000                        
//*=================================================================            
//*-----------------------------------------------------------------            
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------------        
//*      TO BACKUP INTERNET FILE FOR PRINTING                                   
//*---------------------------------------------------------------------        
//STEP1A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.K757.BTO,DISP=SHR                                        
//SYSIN    DD *                                                                 
         DEL (BP13.K757.BTO.PREV) CLUSTER PURGE                                 
         DEF CL (NAME(BP13.K757.BTO.PREV)        -                              
                 CYL(30 10)                       -                             
                 UNIQUE                          -                              
                 SPEED                           -                              
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                       -                              
                 DATA                            -                              
                 (NAME(BP13.K757.BTO.PREV.DATA) -                               
                 KEYS(8 0)                      -                               
                 RECSZ(4000 4000)                  -                            
                 FSPC(10 10)                     -                              
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                      -                              
           REPRO IFILE(INPUT)                    -                              
                 ODS(BP13.K757.BTO.PREV)                                        
//*---------------------------------------------------------------------        
//*       TO BACKUP OCCUPIER FILE FOR PRINTING                          -----   
//*--------------------------------------------------------------------------   
//STEP1B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//SYSIN    DD *                                                                 
  DEL (BP13.K825.REQOCCP.PREV) CLUSTER PURGE                                    
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K825.REQOCCP.PREV)                  -                  001   
        SHR(2,3)                                       -                  001   
        KEYS(17 0)                                     -                  001   
        CYL(10 8)                                      -                  001   
        RECSZ(200 200)                                 -                  001   
        FREESPACE(30 30)                               -                  001   
        CISZ(4096)                                     -                  001   
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                  001   
        UNQ)                                           -                  001   
      DATA                                             -                      00
        (NAME(BP13.K825.REQOCCP.PREV.DATA))            -                  001   
      INDEX                                            -                      00
        (NAME(BP13.K825.REQOCCP.PREV.INDEX))                              001   
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K825.REQOCCP.PREV)                                       
      IF MAXCC = 0 THEN                                -                        
        DEF AIX (NAME(BP13.K825.REQOCCP.PREV.ALTX1) -                           
            REL(BP13.K825.REQOCCP.PREV)                -                        
            CYL(5 2)                                  -                         
            UNIQUE                                     -                        
            SHR(2 3))                                  -                        
            DATA                                       -                        
            (NAME(BP13.K825.REQOCCP.PREV.ALTX1.DATA) -                          
            KEYS(9 8)                                  -                        
            CISZ(4096)                                 -                        
            RECSZ(60 300)                              -                        
            NUNQK)                                                              
      IF MAXCC = 0 THEN                                -                        
        DEF PATH(NAME(BP13.K825.REQOCCP.PREV.PATH1) -                           
            PENT(BP13.K825.REQOCCP.PREV.ALTX1))                                 
      IF MAXCC = 0 THEN                                -                        
        BIX IDS(BP13.K825.REQOCCP.PREV)                -                        
            ODS(BP13.K825.REQOCCP.PREV.ALTX1)                                   
//*---------------------------------------------------------------------        
//* SORT OUT THE RECORDS OUTPUT FROM THE ONLINE UPDATE AFTER BALLOT             
//* PANEL OR UPDATE AFTER ASSIGNED WEIGHTAGE PANEL                              
//* INCLUDE UPDATE DATE >= 950101                                               
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F595,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(13,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(477,8,A),FORMAT=CH                                              
   INCLUDE COND=(352,1,CH,EQ,C'T',AND,485,8,CH,GE,C'20150101',AND,              
                 123,1,CH,NE,C'6')                                              
//*---------------------------------------------------------------------        
//* NOTE : COL 123, WILL BE UPDATE BY REGN-NO FOR SUCC CASES, RUN THIS          
//*        STEP BEFORE ASSIGN REGN-NO                                           
//* PRINT REPORT ON BEFORE AND AFTER IMAGE OF UPDATE AFTER BALLOTING            
//* FOR INTERNAL AUDIT                                                          
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13C745,COND=(0,NE)                                        
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F595 DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//BP13L745 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*-  REPRO REGN NO FILE TO SEQ FILE                                            
//*---------------------------------------------------------------------        
//*STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=SHR,                                  
//*            AMP=('BUFND=12')                                                 
//*OUTPUT1  DD DSN=BP13.F530.ISSUENO,DISP=OLD                                   
//*SYSIN    DD *                                                                
//* REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                      
//*---------------------------------------------------------------------        
//*-  REPRO BALLOT FILE TO SEQ FILE                                             
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F740.MATUREBA.DAILY(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(48,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* SORT OUT ONLY SUCCESSFUL CASES.                                             
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740MAT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,213,2,A,10,19,A),FORMAT=CH                            
     INCLUDE COND=(260,1,CH,EQ,C'S')                                            
//*-----------------------------------------------------------------            
//* OUTPUT FILES FOR SEPARATE PIGEONHOLING PROCESS, PRIORITY,                   
//* TRANSITION NHH > 7 MTH, AND COHORTS ( MAX 5 )                               
//*-----------------------------------------------------------------            
//STEP6A   EXEC PGM=BP13C741,COND=(0,NE),ADDRSPC=VIRT,REGION=4096K              
//BP13F520 DD  DSN=&&F740MAT,DISP=(OLD,PASS)                                    
//BP13MGP  DD  DSN=&&F740MGP,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13PR   DD  DSN=&&F740PRO,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13GRO  DD  DSN=&&F740GR1,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13PUB  DD DSN=&&F740PUB,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//SYSDBG   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* OUTREC AAA TO ALLO-SCH FOR ALL GRO CASES                                    
//*---------------------------------------------------------------------        
//STEP06A  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740GR1,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(,PASS),                                       
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(35,2),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,373,3,A,163,2,A,10,19,A),FORMAT=CH                       
  OUTREC FIELDS=(1,212,C'AAA',216,284)                                          
//*---------------------------------------------------------------------        
//* OUTREC BBB TO ALLO-SCH FOR ALL MGP CASES                                    
//*---------------------------------------------------------------------        
//STEP06B  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740MGP,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(MOD,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,211,2,A,10,19,A),FORMAT=CH                               
  OUTREC FIELDS=(1,212,C'BBB',216,284)                                          
//*---------------------------------------------------------------------        
//* OUTREC SPACES TO GRO-RANK AND WARD TO NON-GRO CASES                         
//* OUTREC PA TO ALLOC-SCHEME TO NON-GRO CASES                                  
//*---------------------------------------------------------------------        
//STEP06C  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740PUB,DISP=(OLD,PASS)                                     
//         DD DSN=&&F740PRO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(MOD,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,10,19,A),FORMAT=CH                                       
  OUTREC FIELDS=(1,162,C'  ',165,48,C'PA ',216,157,C'   ',376,124)              
//*---------------------------------------------------------------------        
//* SORT BY NT, FT, WARD, GRO RANKING AND 10TH BYTE RANDOM NO                   
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740GRO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,213,3,A,373,3,A,163,2,A,                      
                  10,19,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//*  TO PRINT SUCESSFUL REQUEST ASSIGNED WITH REGISTRATION NO.                  
//*  TO ASSIGN QUEUE NO BASED ON NT,FT,REG NO.                                  
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C514,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L514 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A505                                                                
