//BP13A500 JOB (BP13P),'BP13A500',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//* OBJECTIVES OF THIS JCL                                                      
//* ---------------------                                                       
//* 1. TO SORT OUT BE CASES FROM BP13K730 FILE TO BP13.F500.NT                  
//* 2. TO ASSIGN BALLOT DATE                                                    
//* 3. TO PRINT REPORT ON CANCELLATION CASES DURING APPLN PERIOD                
//* 4. TO PRINT REPORT ON THE FLAT SUPPLY                                       
//* 5. TO CREATE BP13.F558.UPGOCCP                                              
//* 6. THIS JCL IS FOR BE CASES.                                                
//*                                                                             
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP130652 NOR  19990823 EXPAND F500, K500, F520, F595, F730,                 
//*                        K730 FROM 300 TO 500                                 
//* BP130754 LSB  19991103 OUTREC F825 TO F820                                  
//* BP132293 SK   20030210 READ BP13K703 FOR BP13C705                           
//* BP132463 CKK  20031110 SORT OUT ONLY BE CASES.                              
//* BP132596 PGS 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E            
//* BP133040 LSB 21082007 REGN-NO X(8), CHG STEP15                              
//* BP134861 EAA1 30042013 EXPAND BP13K010 TO 600                               
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//*STEPAA   EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*INPUT1   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                   
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD *                                                                
//*        VFY FILE(INPUT1)                                                     
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01                    APPLICATION TEAM                                  
//**************************************************************                
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*--------------------------------------------------------------------         
//* REPRO MATURE REQUESTS TO SEQUENCIAL FILE                                    
//* OMIT BTO CASES                                                              
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F500MNT,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(123,8,CH,NE,C'        ',AND,                                 
                376,2,CH,EQ,C'BE')                                              
//*---------------------------------------------------------------------        
//* BP13.F500.SEQUENCE - ALREADY UPDATED WITH SEQ-REF-NO                        
//* COMPUTE DTE-BALLOT FOR THE QUARTER                                          
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C705,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500MNT,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=BP13.F500.NT,DISP=OLD                                         
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REQUEST RECORD BY NT/REF-NO                                            
//*---------------------------------------------------------------------        
//*STEP03   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                        
//*SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                             
//*            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                           
//*SYSIN    DD *                                                                
//*     SORT FIELDS=(187,3,A,123,8,A),FORMAT=CH                                 
//*---------------------------------------------------------------------        
//* MATURE NT - TO PRINT REPORT ON APPLICANT WHO RESPOND TO                     
//*             OPENING OF NEW TOWN  FOR REGISTRATION                           
//*---------------------------------------------------------------------        
//*STEP04   EXEC PGM=BP13C590,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                   
//*BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                  
//*            AMP=('BUFND=23')                                                 
//*BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//*            AMP=('BUFND=23')                                                 
//*BP13L590 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//*  OUTPUT REC FROM SOC MASTER WITHOUT REGN DATE                               
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F595,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(160,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      INCLUDE COND=(260,1,CH,EQ,C'C')                                           
//*---------------------------------------------------------------------        
//* PRINT REPORT FOR CANCELLATION REQUESTS                                      
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=BP13C527,COND=(0,NE)                                        
//BP13F595 DD DSN=&&P13F595,DISP=(OLD,PASS)                                     
//BP13K500 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K501 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                             
//BP13K502 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                             
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR                                   
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13L527 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010N,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                             
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010N,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.BLANK.CHAR20,DISP=SHR                                    
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING             
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010D,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
                 4,2,CH,EQ,C'2A',OR,                                            
                 4,2,CH,EQ,C'E ')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY FOR DESIGN AND BUILD FLATS IN TAP              
//* BEFORE PIGEON-HOLING                                                        
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010D,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.BLANK.CHAR20,DISP=SHR                                    
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*  REPRO MATURE REQUEST                                                       
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.F500.NT,DISP=SHR                                         
//OUTPUT2  DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*                                                                             
//*=====================================================================        
//* C950230  SYSTEM TO TAG THE ESSENTIAL FAMILY NUCLEUS IN APPLICATION          
//*          BASED ON RELATIONSHIP CODES                                        
//*          (FOR PURPOSE OF MATCHING NRIC WITH SMS AND RESALE HIST)            
//*                                                                             
//*---------------------------------------------------------------------        
//*  SORT BP13K730 REC                                                          
//*---------------------------------------------------------------------        
//*STEP12   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*SORTOUT  DD DSN=&&BP13F730,DISP=(NEW,PASS),                                  
//*            UNIT=(SYSDA,1),                                                  
//*            DCB=(LRECL=500,RECFM=FB),                                        
//*            SPACE=(CYL,(160,50),RLSE)                                        
//*SYSIN    DD *                                                                
//*   SORT FIELDS=(123,8,A),FORMAT=CH                                           
//*  INCLUDE COND=(123,8,CH,GT,C'        ',AND,187,2,CH,GE,C'49',AND,           
//*               187,2,CH,LE,C'53')                                            
//*--------------------------------------------------------------------         
//*  SORT BP13K825 REC                                                          
//*--------------------------------------------------------------------         
//*STEP13   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR                                   
//*SORTOUT  DD DSN=&&OCCP,DISP=(NEW,PASS),                                      
//*            UNIT=(SYSDA,1),                                                  
//*            DCB=(LRECL=200,RECFM=FB),                                        
//*            SPACE=(CYL,(200,50),RLSE)                                        
//*SYSIN    DD *                                                                
//*    SORT FIELDS=(1,8,A,107,2,A,9,9,A),FORMAT=CH                              
//*    INCLUDE COND=(1,8,CH,GT,C'        ')                                     
//*--------------------------------------------------------------------         
//*  TO UPDATE LESSEE CHECK                                                     
//*--------------------------------------------------------------------         
//*STEP14   EXEC PGM=BP13C834,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13F825 DD DSN=&&OCCP,DISP=(OLD,PASS)                                       
//*BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                   
//*BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                   
//*BP13L834 DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSUDUMP DD SYSOUT=*                                                         
//*SYSABEND DD SYSOUT=*                                                         
//*SYSDBUG  DD SYSOUT=*                                                         
//*SYSABOUT DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                               
  OUTREC FIELDS=(1,200,200X)                                                    
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP16   EXEC PGM=BP13C577,COND=(0,NE)                                        
//BP13F500 DD DSN=BP13.F500.NT,DISP=SHR                                         
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=BP13.F558.UPGOCCP,DISP=OLD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=====================================================================        
//* END BP13A500                                                                
//*=====================================================================        
