//BP13AA12 JOB (BP13P),'BP13AA12',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*--------------------------------------------------------------------         
//* UPLOAD PPTY UNIT RECORDS FROM DEVELOPER FILE, THIS JOB WILL CREATE          
//* UNIT RECORD TO BP13KA63                                                     
//*-===================================================================         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KA63.PPTYUNIT,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------            
//* BACKUP BP13KA63                                                             
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KA63.PPTYUNIT,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.FA63.PPTYUNIT.BKUP,DISP=OLD                              
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORTOUT INPUT FILE FROM DEVELOPER                                           
//*-----------------------------------------------------------------            
//STEP03   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.FA63.UNITDEVP,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13FA63,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,10),RLSE),                                         
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*------------------------------------------------------------------*          
//* CREATE UNIT FILE IN BP13KA63                                                
//*------------------------------------------------------------------*          
//STEP04   EXEC PGM=BP13CB64,COND=(0,NE)                                        
//BP13FA63 DD DSN=&&BP13FA63,DISP=(OLD,PASS)                                    
//BP13KA63 DD DSN=BP13.KA63.PPTYUNIT,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
