//BP13A804 JOB (BP13P),'BP13A804',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*---------------------------------------------------------------------        
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130118 LSB 960717 - NEW JCL COPY BP13A507                                 
//* BP133201 YCH 221107 - BACKUP MORE FILES                                     
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA.SERS,DISP=SHR,                             
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.SERS.BKUP(+1),DISP=(NEW,PASS),             
//            UNIT=CART,LABEL=(1,SL),                                           
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT2   DD DSN=BP13.F510.RANDOM.SERS,DISP=SHR                                
//OUTPUT2  DD DSN=BP13.F510.RANDOM.SERS.BKUP(+1),DISP=(NEW,PASS),               
//            UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT3   DD DSN=BP17.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F825.REQOCCP.SERS.BKUP(+1),DISP=(NEW,PASS),              
//            UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=200,RECFM=FB)                   
//*                                                                             
//INPUT4   DD DSN=BP17.K830.ADDR,DISP=SHR                                       
//OUTPUT4  DD DSN=BP13.F830.ADDR.SERS.BKUP(+1),DISP=(NEW,PASS),                 
//            UNIT=CART,LABEL=(4,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=23500,LRECL=250,RECFM=FB)                   
//*                                                                             
//INPUT5   DD DSN=BP17.K730.SERSREQ,DISP=SHR                                    
//OUTPUT5  DD DSN=BP13.F730.SERSREQ.BKUP(+1),DISP=(NEW,PASS),                   
//            UNIT=CART,LABEL=(5,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT6   DD DSN=BP13.F500.NT.SERS,DISP=SHR                                    
//OUTPUT6  DD DSN=BP13.F500.NT.SERS.BKUP(+1),DISP=(NEW,PASS),                   
//            UNIT=CART,LABEL=(6,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT7   DD DSN=BP13.F730.SERSREQ.HHTYPE,DISP=SHR                             
//OUTPUT7  DD DSN=BP13.F730.SERSREQ.HHTYPE.BKUP(+1),DISP=(NEW,PASS),            
//            UNIT=CART,LABEL=(7,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
   REPRO INFILE(INPUT7)  OUTFILE(OUTPUT7)                                       
//*---------------------------------------------------------------------        
//*  CATALOG GDG FOR QUARTERLY CARTRIDGE                                        
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=IEFBR14,COND=(0,NE)                                         
//INPUT1   DD DSN=BP13.F740.MATUREBA.SERS.BKUP(+1),DISP=(OLD,CATLG),            
//            UNIT=(,,DEFER)                                                    
//INPUT2   DD DSN=BP13.F510.RANDOM.SERS.BKUP(+1),DISP=(OLD,CATLG),              
//            UNIT=(,,DEFER)                                                    
//INPUT3   DD DSN=BP13.F825.REQOCCP.SERS.BKUP(+1),DISP=(OLD,CATLG),             
//            UNIT=(,,DEFER)                                                    
//INPUT4   DD DSN=BP13.F830.ADDR.SERS.BKUP(+1),DISP=(OLD,CATLG),                
//            UNIT=(,,DEFER)                                                    
//INPUT5   DD DSN=BP13.F730.SERSREQ.BKUP(+1),DISP=(OLD,CATLG),                  
//            UNIT=(,,DEFER)                                                    
//INPUT6   DD DSN=BP13.F500.NT.SERS.BKUP(+1),DISP=(OLD,CATLG),                  
//            UNIT=(,,DEFER)                                                    
//INPUT7   DD DSN=BP13.F730.SERSREQ.HHTYPE.BKUP(+1),DISP=(OLD,CATLG),           
//            UNIT=(,,DEFER)                                                    
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F740.MATUREBA.SERSA810,DISP=SHR                          
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.SERSA810.BKUP(+1),                         
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,LABEL=(1,SL),                                           
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT2   DD DSN=BP13.F500.SEQUENCE.SERSA810,DISP=SHR                          
//OUTPUT2  DD DSN=BP13.F500.SEQUENCE.SERSA810.BKUP(+1),                         
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT3   DD DSN=BP13.F558.UPGOCCP.SERSA810,DISP=SHR                           
//OUTPUT3  DD DSN=BP13.F558.UPGOCCP.SERSA810.BKUP(+1),DISP=(,PASS),             
//            UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)                   
//*                                                                             
//INPUT4   DD DSN=BP13.F500.SEQUENCE.SERSA816,DISP=SHR                          
//OUTPUT4  DD DSN=BP13.F500.SEQUENCE.SERSA816.BKUP(+1),                         
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,LABEL=(4,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT5   DD DSN=BP13.F558.UPGOCCP.SERSA816,DISP=SHR                           
//OUTPUT5  DD DSN=BP13.F558.UPGOCCP.SERSA816.BKUP(+1),DISP=(,PASS),             
//            UNIT=CART,LABEL=(5,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)                   
//*                                                                             
//INPUT6   DD DSN=BP13.F500.SEQUENCE.SERSA817,DISP=SHR                          
//OUTPUT6  DD DSN=BP13.F500.SEQUENCE.SERSA817.BKUP(+1),                         
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,LABEL=(6,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT7   DD DSN=BP13.F558.UPGOCCP.SERSA817,DISP=SHR                           
//OUTPUT7  DD DSN=BP13.F558.UPGOCCP.SERSA817.BKUP(+1),DISP=(,PASS),             
//            UNIT=CART,LABEL=(7,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)                   
//*                                                                             
//INPUT8   DD DSN=BP13.F500.SEQUENCE.SERSA812,DISP=SHR                          
//OUTPUT8  DD DSN=BP13.F500.SEQUENCE.SERSA812.BKUP(+1),                         
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,LABEL=(8,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT9   DD DSN=BP13.F558.UPGOCCP.SERSA812,DISP=SHR                           
//OUTPUT9  DD DSN=BP13.F558.UPGOCCP.SERSA812.BKUP(+1),DISP=(,PASS),             
//            UNIT=CART,LABEL=(9,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)                   
//*                                                                             
//INPUT10  DD DSN=BP13.F500.SEQUENCE.SERSA818,DISP=SHR                          
//OUTPUT10 DD DSN=BP13.F500.SEQUENCE.SERSA818.BKUP(+1),                         
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,LABEL=(10,SL),VOL=REF=*.OUTPUT1,                        
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT11  DD DSN=BP13.F558.UPGOCCP.SERSA818,DISP=SHR                           
//OUTPUT11 DD DSN=BP13.F558.UPGOCCP.SERSA818.BKUP(+1),DISP=(,PASS),             
//            UNIT=CART,LABEL=(11,SL),VOL=REF=*.OUTPUT1,                        
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)                   
//*                                                                             
//INPUT12  DD DSN=BP13.F500.SEQUENCE.SERSA813,DISP=SHR                          
//OUTPUT12 DD DSN=BP13.F500.SEQUENCE.SERSA813.BKUP(+1),                         
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,LABEL=(12,SL),VOL=REF=*.OUTPUT1,                        
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT13  DD DSN=BP13.F558.UPGOCCP.SERSA813,DISP=SHR                           
//OUTPUT13 DD DSN=BP13.F558.UPGOCCP.SERSA813.BKUP(+1),DISP=(,PASS),             
//            UNIT=CART,LABEL=(13,SL),VOL=REF=*.OUTPUT1,                        
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=600,RECFM=FB)                   
//*                                                                             
//INPUT14  DD DSN=BP13.F740.MATUREBA.SERSA811,DISP=SHR                          
//OUTPUT14 DD DSN=BP13.F740.MATUREBA.SERSA811.BKUP(+1),                         
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,LABEL=(14,SL),VOL=REF=*.OUTPUT1,                        
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT15  DD DSN=BP13.F740.MATUREBA.SERSQNO,DISP=SHR                           
//OUTPUT15 DD DSN=BP13.F740.MATUREBA.SERSQNO.BKUP(+1),                          
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,LABEL=(15,SL),VOL=REF=*.OUTPUT1,                        
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT16  DD DSN=BP13.F500.TENANT.SERS,DISP=SHR                                
//OUTPUT16 DD DSN=BP13.F500.TENANT.SERS.BKUP(+1),                               
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,LABEL=(16,SL),VOL=REF=*.OUTPUT1,                        
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
   REPRO INFILE(INPUT7)  OUTFILE(OUTPUT7)                                       
   REPRO INFILE(INPUT8)  OUTFILE(OUTPUT8)                                       
   REPRO INFILE(INPUT9)  OUTFILE(OUTPUT9)                                       
   REPRO INFILE(INPUT10) OUTFILE(OUTPUT10)                                      
   REPRO INFILE(INPUT11) OUTFILE(OUTPUT11)                                      
   REPRO INFILE(INPUT12) OUTFILE(OUTPUT12)                                      
   REPRO INFILE(INPUT13) OUTFILE(OUTPUT13)                                      
   REPRO INFILE(INPUT14) OUTFILE(OUTPUT14)                                      
   REPRO INFILE(INPUT15) OUTFILE(OUTPUT15)                                      
   REPRO INFILE(INPUT16) OUTFILE(OUTPUT16)                                      
//*---------------------------------------------------------------------        
//*  CATALOG GDG FOR QUARTERLY CARTRIDGE                                        
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=IEFBR14,COND=(0,NE)                                         
//INPUT1   DD DSN=BP13.F740.MATUREBA.SERSA810.BKUP(+1),                         
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT2   DD DSN=BP13.F500.SEQUENCE.SERSA810.BKUP(+1),                         
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT3   DD DSN=BP13.F558.UPGOCCP.SERSA810.BKUP(+1),                          
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT4   DD DSN=BP13.F500.SEQUENCE.SERSA816.BKUP(+1),                         
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT5   DD DSN=BP13.F558.UPGOCCP.SERSA816.BKUP(+1),                          
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT6   DD DSN=BP13.F500.SEQUENCE.SERSA817.BKUP(+1),                         
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT7   DD DSN=BP13.F558.UPGOCCP.SERSA817.BKUP(+1),                          
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT8   DD DSN=BP13.F500.SEQUENCE.SERSA812.BKUP(+1),                         
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT9   DD DSN=BP13.F558.UPGOCCP.SERSA812.BKUP(+1),                          
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT10  DD DSN=BP13.F500.SEQUENCE.SERSA818.BKUP(+1),                         
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT11  DD DSN=BP13.F558.UPGOCCP.SERSA818.BKUP(+1),                          
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT12  DD DSN=BP13.F500.SEQUENCE.SERSA813.BKUP(+1),                         
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT13  DD DSN=BP13.F558.UPGOCCP.SERSA813.BKUP(+1),                          
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT14  DD DSN=BP13.F740.MATUREBA.SERSA811.BKUP(+1),                         
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//INPUT15  DD DSN=BP13.F740.MATUREBA.SERSQNO.BKUP(+1),                          
//            DISP=(OLD,CATLG),                                                 
//            UNIT=(,,DEFER)                                                    
//*---------------------------------------------------------------------        
//* DELETE BP13K825 AND BP13K730 RECORDS                                        
//*-------------------------------------------------------------------*         
//STEP04 EXEC PGM=BP13C51C,COND=(0,NE)                                          
//BP13F740 DD DSN=BP13.F730.SERSREQ.HHTYPE,DISP=SHR                             
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
