//BP13D100 JOB (BP13P),'BP13D100',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//* ============================================================== *            
//*                                                                *            
//*             D A I L Y    F I N A N C I A L    J O B            *            
//*                                                                *            
//* -------------------------------------------------------------- *            
//*                                                                *            
//* NOTE: DO NOT CHG STEP NUMBER FOR STEP32 AND STEP36             *            
//*                                                                *            
//* ============================================================== *            
//* BP130307 970530 LJL CATER FOR REGN FEE REFUND.                              
//* BP130338 970815 LSB BP13L100 ROUTE TO SALE UNIT INSTEAD OF FIN              
//* BP130240 971001 SSS BP13L102 TO AGM TEAM                                    
//* BP130371 971010 LJL BP13L112 TO APPLN TEAM                                  
//* BP130421 980611 SSS MICROFICHE CONVERSION                                   
//* BP130531 980806 SSS L103 HARDCOPY FOR FINANCE                               
//*                     L104 HARDCOPY FOR SALES AGREEMENT TEAM                  
//* BP130549 980811 CLT TAKE IN AC28F526 FOR COLLECTION IMPLEMENTATION          
//* BP130418 980820 CLT Y2K IMPLEMENTATION                                      
//* BP130549 981101 CLT REMOVE USAGE OF AC19 DATASETS                           
//* BP130XXX 990615 SSS REMOVE CHK FOR CC 0 AT LAST STEP FOR CLASS 5            
//* BP130690 990726 SSS REMOVE CHK FOR CC 0 AT STEP31                           
//* BP130823 000415 LSB ADD VFY FILE BP13K800                                   
//* BP131016 010530 LSB CATER FOR STUDIO APARTMENT                              
//* BP131039 010816 LSB MOVE C286 JIB FROM D400 TO D100 FOR SA                  
//* BP132309 050403 LSB ADD BP13C357 FOR BO CASE                                
//* BP132309 150403 CLT ADD BP13C339 FOR SOLICITOR BILL                         
//* BP132341 260503 MCC ADD BP13C338 FOR BO TP CASES                            
//* BP132341 310503 MCC ADD BP13C337 FOR BO CONVERSION LSE/CF                   
//* BP132362 150603 CLT ADD BP13C364 FOR INTERFACING WITH COLLN                 
//* BP132341 160603 MCC ADD SY02F001 IN C337, C338, C339, C357                  
//* BP132441 080104 CLT ADD SY02F001 IN C337, C338, C339, C357                  
//* BP132400 230304 SK  ADD BP13C458                                            
//* BP132526 180604 SK  EXPAND K671 TO 3000 LENGTH                              
//* BP132801 060304 CT2 OMIT AHG HOUSING GRANT                                  
//* BP132937 061219 LSB BYPASS DBSS FOR CASH COLLECTION                         
//* BP133194 071110 SSS STOP PRINT L104                                         
//* BP133549 090225 LSB BYPASS SCD3 VOUCHER                                     
//* BP133973 100921 CCC UPDATE B004 DATASETS TO AB02 DATASETS                   
//* BP134154 110419 LSB MOVE JOB TO RUN BEFORE BP13C106                         
//* BP134228 270611 AB9 ADD STEP40A, STEP40B,STEP40C,STEP40D FOR AMR            
//* BP134276 110711 AB9 ADD BP13C36B,BP13C36C,BP1336D,BP13C36E FOR AMR          
//* BP134276 100811 AB9 REMOVE STEP40A, STEP40B,STEP40C,STEP40D FOR AMR         
//* BP134643 210912 AB9 OMIT '6011E','6020H' '0520C' FOR SHG/SHG/INT            
//* BP134561 230413 ESD1 INCLUDE NEW OUTPUT FILE FOR BP13C104.                  
//* BP135003 220813 LSB1 ACCUM CLASS=5 TO PRINT IN CD IN JOB BP13M150           
//*                      ACCUM CLASS=5 TO BP13.L100.BP13D100                    
//* BP134391 220114 ESD1 ADDED BP13C28A PROGRAM                                 
//* BP134093 120214 LSB1 CHG B004 TO AB02,F056-F556,F003-F503,F041-F541         
//* BP135171 100214 RJE1 TO CATER FOR DB2 UPGRADE                               
//* BP135620 150512 MRN1 TO OMIT 'SRSG' FROM AG07F630                           
//* BP136098 020216 KSJ3 TO ADD SALES TYPE 18 IN THE INCL COND IN STEP25        
//* BP136058 040216 KSJ3 INCLUDE BP13C11G                                       
//* BP135858 170216 KSJ3 INCL NEW REPORT TO BP13C11G                            
//* BP135833 010416 KSJ3 TO OMIT LEVY CASES IN STEP13G                          
//* BP136367 020916 KSJ3 TO RUN BP13C36S (FROM BP13D118)                        
//* BP137219 130218 LSB1 CATER FOR FHS SALES TYPE 19                            
//* BP137325 021018 LJL1 TO CATER FOR NEW FILE FROM CASH PAYMENT KIOSK          
//*                      AC28.F569.SOC                                          
//* BP137443 111218 LJL1 TO OMIT PAYMENT TYPE SAPS FROM AG07F630                
//* BP137289 070119 LJL1 TO ALLOW NEW NEW RECEIPTING CODE 8001C (WHICH          
//*                      REPLACES THE OLD RECEIPTING CODE 1089Z - FOR           
//*                      PRIVATE PROPERTY NON-DISCLOSURE PENALTY)               
//*                      TO INTERFACE WITH COLLECTION SYSTEM. THE OLD           
//*                     RECEIPTING CODE WILL BE OBSOLETE FROM 2 MAY 2018        
//* BP138101 031219 PP11 CATER TO OMIT THE EHPS CASES FROM                      
//*                      VALIDATE VOUCHER TRANSACTIONS AND INCLUDED THE         
//*                      EHG FOR CREATE HISTORY TRANSACTIONS                    
//* BP138555 220221 PP11 CATER TO OMIT THE LHGS CASES FROM                      
//*                      VALIDATE VOUCHER TRANSACTIONS AND INCLUDED THE         
//*                      LHG FOR CREATE HISTORY TRANSACTIONS                    
//* BP138668 240321 LJL1 CATER FOR NEW RECEIPTING CODE                          
//*                      6095I FOR CASES UNDER ALLOCATION SCHEME "SHS"          
//* BP139526 150923 KAC1 CATER FOR VOUCHER INTERFACE FILE FOR COTMA(SSM)        
//*===================================================================          
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT2   DD DSN=BP13.K885.EXAPPLT,DISP=OLD                                    
//INPUT3   DD DSN=BP13.K130.SOCHIST,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//INPUT5   DD DSN=BP13.K671.BO.FIN,DISP=SHR                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
//*                                                                             
//*=================================================================            
//* BACKUP DATASET                                                              
//*-----------------------------------------------------------------            
//STEP1A   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT26  DD DSN=AC28.F526.SOC,DISP=OLD                                        
//OUTPUT26 DD DSN=BP13.AC28.F526.SOCCASH,DISP=SHR                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT26) OUTFILE(OUTPUT26) REPLACE                            
//*                                                                             
//*-----------------------------------------------------------------            
//* BACKUP DATASET                                                              
//*-----------------------------------------------------------------            
//STEP1A1  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT69  DD DSN=AC28.F569.SOC,DISP=OLD                                        
//OUTPUT69 DD DSN=BP13.AC28.F569.SOCCASH,DISP=SHR                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT69) OUTFILE(OUTPUT69) REPLACE                            
//*                                                                             
//*-----------------------------------------------------------------            
//* BACKUP DATASET                                                              
//*-----------------------------------------------------------------            
//STEP1B   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT24  DD DSN=AB02.F556.PYMNT.BP13,DISP=OLD                                 
//OUTPUT24 DD DSN=BP13.F101.CPF,DISP=SHR                                        
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT24) OUTFILE(OUTPUT24) REPLACE                            
//*                                                                             
//*-----------------------------------------------------------------            
//* BACKUP DATASET                                                              
//*-----------------------------------------------------------------            
//STEP1C   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT25  DD DSN=AG07.F630.SOC,DISP=OLD                                        
//OUTPUT25 DD DSN=BP13.F102.VOUCHER,DISP=SHR                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT25) OUTFILE(OUTPUT25) REPLACE                            
//*                                                                             
//*-----------------------------------------------------------------            
//* BACKUP DATASET                                                              
//*-----------------------------------------------------------------            
//STEP1D   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT26  DD DSN=AC28.F544.SOC,DISP=OLD                                        
//OUTPUT26 DD DSN=BP13.AC28.F544.SOC,DISP=SHR                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT26) OUTFILE(OUTPUT26) REPLACE                            
//*                                                                             
//*=================================================================            
//* SORT SOC MASTER FILE IN SCH-ACCNT SEQUENCE                                  
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=13')                                                  
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(500,50),RLSE),                             
//            DCB=(BLKSIZE=18000,LRECL=2000,RECFM=FB)                           
//SYSIN    DD *                                                                 
     SORT FIELDS=(155,11,A),FORMAT=CH                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT COLL PAYMENT FILE IN SCH-ACCNT SEQUENCE                                
//* RECEIPT = 6003D FOR DBSS PP CASH COLLECTION                                 
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AC28.F526.SOC,DISP=OLD                                        
//         DD DSN=AC28.F569.SOC,DISP=OLD                                        
//SORTOUT  DD DSN=&&AC28F526,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     OMIT COND=(91,5,CH,EQ,C'1089Z',OR,                                         
                91,5,CH,EQ,C'8001C',OR,                                         
                91,5,CH,EQ,C'0885H',OR,                                         
                91,5,CH,EQ,C'6088Z',OR,                                         
                91,5,CH,EQ,C'6095I',OR,                                         
                91,5,CH,EQ,C'6154A',OR,                                         
                91,5,CH,EQ,C'1279J',OR,                                         
                91,5,CH,EQ,C'1277G',OR,                                         
                91,5,CH,EQ,C'1224I',OR,                                         
                91,5,CH,EQ,C'6003D',OR,                                         
                91,5,CH,EQ,C'6011E',OR,                                         
                91,5,CH,EQ,C'6020H',OR,                                         
                91,5,CH,EQ,C'0520C')                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE COLL PAYMENT ON TEMPORARY FILE                                     
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13C003,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K880 DD DSN=BP13.K880.SUBTRF.SUCC,DISP=SHR,                               
//            AMP=('BUFND=4','BUFNI=8')                                         
//AC28F526 DD DSN=&&AC28F526,DISP=(OLD,DELETE)                                  
//BP13F120 DD DSN=BP13.F120.CASHTRAN,DISP=OLD                                   
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L003 DD DSN=&&BP13L003,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* ACCUM CLASS=5 REPORT TO OUTPUT TO CD IN JOB BP13M150                        
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT01  DD DSN=&&BP13L003,DISP=(OLD,PASS)                                    
//OUTPUT01 DD DSN=BP13.L100.BP13D100,DISP=MOD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT01) OUTFILE(OUTPUT01)                                    
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE FIRST PAYMENT ON HARDCOPY                                          
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L003,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*=================================================================            
//* SORT NCN FILE IN SCH-ACCNT SEQUENCE                                         
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AB02.F556.PYMNT.BP13,DISP=OLD                                 
//SORTOUT  DD DSN=&&BP13F101,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=23400,LRECL=100,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(2,9,A),FORMAT=CH                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT SOC OCCUPIER FILE IN CPF-NO ORDER                                      
//*-----------------------------------------------------------------            
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//SORTOUT  DD DSN=&&BP13F820,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(350,30),RLSE),                             
//            DCB=(BLKSIZE=27600,LRECL=400,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(19,9,A),FORMAT=CH                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* MATCH CPF FROM SOC-OCCUP WITH NCN FILE, IF MATCH GET NRIC FOR               
//* UPDATE THE CPF AMOUNT TO SOC MASTER                                         
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=BP13C111,COND=(0,NE)                                        
//BP13F820 DD DSN=&&BP13F820,DISP=(OLD,DELETE)                                  
//AB02F556 DD DSN=&&BP13F101,DISP=(OLD,DELETE)                                  
//BP13F103 DD DSN=&&BP13F103,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT NCN FILE IN SCH-ACCNT SEQUENCE FOR NON RD CASE                         
//*-----------------------------------------------------------------            
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F103,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F103A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(90,11,A),FORMAT=CH                                            
     INCLUDE COND=(90,1,CH,NE,C'R')                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* VALIDATE CPF PAYMENT FOR NON REGN DEPOSIT CASE                              
//*-----------------------------------------------------------------            
//STEP11   EXEC PGM=BP13C101,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13K880 DD DSN=BP13.K880.SUBTRF.SUCC,DISP=SHR                                
//BP13F103 DD DSN=&&P13F103A,DISP=(OLD,DELETE)                                  
//BP13F121 DD DSN=BP13.F121.CPFTRAN,DISP=OLD                                    
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//BP13L101 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT NCN FILE IN SCH-ACCNT SEQUENCE AND RD CASE                             
//*-------------------------------------- --------------------------            
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F103,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&STEP12,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(TRK,(10,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(90,11,A),FORMAT=CH                                            
     INCLUDE COND=(90,1,CH,EQ,C'R')                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* VALIDATE CPF PAYMENT FOR REGN DEP CASE                                      
//*-------------------------------------- --------------------------            
//STEP13   EXEC PGM=BP13C112,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K880 DD DSN=BP13.K880.SUBTRF.SUCC,DISP=SHR                                
//BP13F103 DD DSN=&&STEP12,DISP=(OLD,DELETE)                                    
//BP13F121 DD DSN=BP13.F121.CPFTRAN,DISP=MOD                                    
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//BP13L112 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=================================================================            
//* INCLUDE ALL BANK ORIGINATION CASES                                          
//*-----------------------------------------------------------------            
//SORT13A  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F300.SUCCESS,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F300,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1083,1,CH,EQ,C'B')                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE CPF TRANS FOR BANK LOAN CASES - SOCA                                 
//*-----------------------------------------------------------------            
//STEP13B  EXEC PGM=BP13C357,COND=(0,NE)                                        
//BP13F300 DD DSN=&&BP13F300,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F121 DD DSN=BP13.F121.CPFTRAN,DISP=MOD                                    
//BP13L357 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* SORT CASES WHERE SOLICITOR BILL BY CPF NOT PROCESSED                        
//*-----------------------------------------------------------------            
//SORT13C  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K671.BO.FIN,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F671,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=3000),                                        
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1860,1,CH,NE,C'Y')                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE CPF TRANS FOR SOLICITOR BILL PAID USING CPF                          
//*-----------------------------------------------------------------            
//STEP13D  EXEC PGM=BP13C339,COND=(0,NE)                                        
//BP13F671 DD DSN=&&BP13F671,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F121 DD DSN=BP13.F121.CPFTRAN,DISP=MOD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* INCLUDE ALL BANK ORIGINATION CASES                                          
//*-----------------------------------------------------------------            
//SORT13E  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F410.DAILYSO,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F410,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000),                                        
//            SPACE=(CYL,(5,4),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=((68,1,CH,EQ,C'B'),&,                                            
                (1745,2,CH,EQ,C'PC',OR,1745,2,CH,EQ,C'PM'))                     
//*-----------------------------------------------------------------            
//* CREATE CPF TRANS FOR BANK LOAN CASES - TP                                   
//*-----------------------------------------------------------------            
//STEP13F  EXEC  PGM=IKJEFT01,COND=(0,NE),REGION=4096K,                         
//             DYNAMNBR=20                                                      
//BP13F400 DD DSN=&&BP13F410,DISP=(OLD,DELETE)                                  
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F121 DD DSN=BP13.F121.CPFTRAN.TPBO,DISP=OLD                               
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F440 DD DSN=BP13.F440.ICPCPF,DISP=MOD                                     
//BP13L338 DD SYSOUT=8,DEST=IOM8                                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13C338) PLAN(BP13PCC) -                                      
         LIB    ('BP13.BATCH.LOADCOB')                                          
     END                                                                        
/*                                                                              
//*=================================================================            
//* SORT OUT "AHPS" AND "CHPS" CASES (AHG AND CPFHG CASES)                      
//*-----------------------------------------------------------------            
//STEP13G  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F630.SOC,DISP=SHR                                        
//SORTOUT  DD DSN=&&F630SOC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     OMIT COND=(20,4,CH,EQ,C'AHPS',OR,                                          
                20,4,CH,EQ,C'CHPS',OR,                                          
                20,4,CH,EQ,C'SAPS',OR,                                          
                20,4,CH,EQ,C'SRSG',OR,                                          
                20,4,CH,EQ,C'SCD1',OR,                                          
                20,4,CH,EQ,C'SCD2',OR,                                          
                20,4,CH,EQ,C'SCD3',OR,                                          
                20,4,CH,EQ,C'LVY1',OR,                                          
                20,4,CH,EQ,C'EHPS',OR,                                          
                20,4,CH,EQ,C'LHGS',OR,                                          
                20,4,CH,EQ,C'LVY2')                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE VOUCHER TRANSACTIONS (PAYMENT SYSTEM)                              
//*-------------------------------------- --------------------------            
//STEP14   EXEC PGM=BP13C102,COND=(0,NE)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K880 DD DSN=BP13.K880.SUBTRF.SUCC,DISP=SHR                                
//AG07F630 DD DSN=&&F630SOC,DISP=(OLD,DELETE)                                   
//BP13F122 DD DSN=BP13.F122.ADJTRAN,DISP=OLD                                    
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//BP13L102 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT RECORDS BASED ON REGN.                                                 
//* INCLUDE ONLY 'ADV','ADP','AMR','AHG','CHG','INT' TYPE.                      
//*-----------------------------------------------------------------            
//STEP15A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K140.KIVTRAN,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//SORTOUT  DD DSN=&&BP13F12A,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(BLKSIZE=23400,RECFM=FB,LRECL=150),                   
//         SPACE=(TRK,(20,5),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(5,8,A,13,8,A),FORMAT=CH                                          
  INCLUDE COND=((99,3,CH,EQ,C'ADV',OR,                                          
                 99,3,CH,EQ,C'ADP',OR,                                          
                 99,3,CH,EQ,C'AMR',OR,                                          
                 99,3,CH,EQ,C'AHG',OR,                                          
                 99,3,CH,EQ,C'CHG',OR,                                          
                 99,3,CH,EQ,C'SHG',OR,                                          
                 99,3,CH,EQ,C'SUG',OR,                                          
                 99,3,CH,EQ,C'EHG',OR,                                          
                 99,3,CH,EQ,C'LHG',OR,                                          
                 99,3,CH,EQ,C'INT'),AND,                                        
                 5,8,CH,NE,C'        ',AND,                                     
                 13,8,CH,GE,C'20120301',AND,                                    
                 114,1,CH,EQ,C'V')                                              
//*-----------------------------------------------------------------            
//* CREATE HISTORY TRANSACTIONS FOR ADV,ADP,AMR,AHG,CHG,INT FROM                
//* VALID KIV FILE.                                                             
//*-----------------------------------------------------------------            
//STEP15B EXEC PGM=BP13C36S,COND=(0,NE)                                         
//BP13F124 DD DSN=&&BP13F12A,DISP=(OLD,DELETE)                                  
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K350 DD DSN=BP13.K350.STDAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K352 DD DSN=BP13.K352.AMRAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR,                                  
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13F52A DD DSN=BP13.AC28.F52A.ERR,DISP=SHR                                   
//BP13F14A DD DSN=BP13.F140.DELETE.ACCUM,DISP=MOD                               
//BP13L36S DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* VALIDATE KIV RECORDS. DELETE VALID RECORDS FROM KIV FILE                    
//*-------------------------------------- --------------------------            
//STEP16A  EXEC PGM=BP13C103,COND=(0,NE)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K880 DD DSN=BP13.K880.SUBTRF.SUCC,DISP=SHR                                
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//BP13F124 DD DSN=BP13.F124.VALIDKIV,DISP=OLD                                   
//BP13F140 DD DSN=BP13.F140.KIVPOST,DISP=OLD                                    
//BP13L103 DD DSN=&&BP13L103,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* ACCUM CLASS=5 REPORT TO OUTPUT TO CD IN JOB BP13M150                        
//*-----------------------------------------------------------------            
//STEP16B  EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT01  DD DSN=&&BP13L103,DISP=(OLD,PASS)                                    
//OUTPUT01 DD DSN=BP13.L100.BP13D100,DISP=MOD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT01) OUTFILE(OUTPUT01)                                    
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT KIV RECORDS ON HARDCOPY                                               
//*-------------------------------------- --------------------------            
//STEP17   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L103,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*=================================================================            
//* 1. MERGE ALL THE VALIDATED PAYEMENT FILES TO BACKUP FILE                    
//* 2. SORT BY TRANS-TY, ORIG-REGN, POST DATE                                   
//*-----------------------------------------------------------------            
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F120.CASHTRAN,DISP=SHR                                   
//         DD DSN=BP13.F121.CPFTRAN,DISP=SHR                                    
//         DD DSN=BP13.F121.CPFTRAN.TPBO,DISP=SHR                               
//         DD DSN=BP13.F122.ADJTRAN,DISP=SHR                                    
//         DD DSN=BP13.F124.VALIDKIV,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F125.BACKUP(+1),DISP=(,CATLG,DELETE),                    
//            DCB=(BP13.GDG,RECFM=FB,LRECL=150,BLKSIZE=23400),                  
//            SPACE=(TRK,(20,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
/*                                                                              
//*-----------------------------------------------------------------            
//* MERGE DAILY FINANCIAL TRANSACTIONS TO TRANS FILE                            
//*-----------------------------------------------------------------            
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DAILYTRN,DISP=SHR                                   
//         DD DSN=BP13.F125.BACKUP(+1),DISP=SHR                                 
//SORTOUT  DD DSN=BP13.F125.DAILYTRN,DISP=SHR                                   
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
    INCLUDE COND=(1,2,CH,EQ,C'11',OR,1,2,CH,EQ,C'12',OR,  -                     
                  1,2,CH,EQ,C'13',OR,1,2,CH,EQ,C'14',OR,  -                     
                  1,2,CH,EQ,C'15',OR,1,2,CH,EQ,C'16')                           
/*                                                                              
//*=================================================================            
//* 1. POST PAYMENT TO RFF MASTER FROM THE VALIDATED PAYMENT TRANS              
//* 2. FOR EACH UPDATE, OUTPUT REC TO TRANSACTION HISTORY FILE                  
//* ON TEMPORARY FILE                                                           
//*-------------------------------------- --------------------------            
//STEP21   EXEC PGM=BP13C104,COND=(0,NE)                                        
//BP13F125 DD DSN=BP13.F125.DAILYTRN,DISP=SHR                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K880 DD DSN=BP13.K880.SUBTRF.SUCC,DISP=SHR,                               
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L104 DD DSN=&&BP13L104,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(60,10),RLSE),                                         
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=0)                                
//BP13L14A DD DSN=&&BP13L14A,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(60,10),RLSE),                                         
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=0)                                
//BP13F126 DD DSN=BP13.F125.DAILYTRN.SUBTRF,DISP=SHR                            
//BP13F127 DD DSN=BP13.F125.DAILYINT.SUBTRF,DISP=SHR                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* BP13L14A (ERROR LISTING) HARDCOPY TO SALES AGREEMENT TEAM                   
//*-------------------------------------- --------------------------            
//STEP22   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L14A,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* ACCUM CLASS=5 REPORT TO OUTPUT TO CD IN JOB BP13M150                        
//*-----------------------------------------------------------------            
//STEP23   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT01  DD DSN=&&BP13L104,DISP=(OLD,PASS)                                    
//         DD DSN=&&BP13L14A,DISP=(OLD,PASS)                                    
//OUTPUT01 DD DSN=BP13.L100.BP13D100,DISP=MOD                                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT01) OUTFILE(OUTPUT01)                                    
//*                                                                             
//*=================================================================            
//* INCLUDE STUDIO APARTMENT CASES, SALES TYPE = 13                             
//*-----------------------------------------------------------------            
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F410.DAILYSO,DISP=SHR                                    
//SORTOUT  DD DSN=&&F410SASO,DISP=(NEW,PASS),                                   
//            SPACE=(TRK,(20,5),RLSE),UNIT=SYSDA,                               
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(37,2,CH,EQ,C'13',OR,                                          
                  37,2,CH,EQ,C'18',OR,                                          
                  37,2,CH,EQ,C'19')                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE FINANCIAL TRANSACIONS FOR STUDIO APARTMENT                           
//* CLOSE FILE : BP13K800                                                       
//*-----------------------------------------------------------------            
//STEP25B  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F400 DD DSN=&&F410SASO,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K350 DD DSN=BP13.K350.STDAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F120 DD DSN=BP13.F120.SATRAN.SA,DISP=OLD                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C286) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BP13K671 FOR CASES WHERE BANK CONVERSION PREMIUM CASE                  
//* NOT PROCESSED                                                               
//*-----------------------------------------------------------------            
//SORT25C  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K671.BO.FIN,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F67A,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=3000),                                        
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=((1861,1,CH,NE,C'Y'),AND,                                        
                (1862,1,CH,EQ,C'Y',OR,1863,1,CH,EQ,C'Y'))                       
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE CPF TRANS FOR BANK CONVERSION STMP,CAVEAT,MORT AND SALE CF           
//*-----------------------------------------------------------------            
//STEP25D  EXEC PGM=BP13C337,COND=(0,NE)                                        
//BP13F671 DD DSN=&&BP13F67A,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F121 DD DSN=BP13.F120.SATRAN.BO,DISP=OLD                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* SORT FOR UNCOMPLETED FLAT TP CASES (HDB/PM & HDB/MG ONLY)                   
//*-----------------------------------------------------------------            
//SORT25E  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K671.BO.FIN,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F67B,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=3000),                                        
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=((1861,1,CH,NE,C'Y'),AND,                                        
                (1916,1,CH,EQ,C'Y'))                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE CPF TRANS FOR UNCOMPLETED FLAT TP CASES - MORT CF ONLY               
//*-----------------------------------------------------------------            
//STEP25F  EXEC PGM=BP13C337,COND=(0,NE)                                        
//BP13F671 DD DSN=&&BP13F67B,DISP=(OLD,DELETE)                                  
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F121 DD DSN=BP13.F120.SATRAN.BO,DISP=MOD                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT ALL 'SI' TRANS CODE ON BP13K310                                        
//*-----------------------------------------------------------------            
//STEP25G  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&F310,DISP=(NEW,PASS),                                       
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(9,2,CH,EQ,C'SI')                                                
//*-----------------------------------------------------------------            
//* JOINKEYS ALL RECORD ON K310 AND K410 RECORDS                                
//*-----------------------------------------------------------------            
//STEP25H  EXEC PGM=SORT                                                        
//SORTJNF1 DD DSN=&&F310,DISP=(OLD,PASS)                                        
//SORTJNF2 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.F410.STUDIO,DISP=SHR                                     
//SYSIN    DD *                                                                 
           JOINKEYS FILE=F1,FIELDS=(1,8,A)                                      
           JOINKEYS FILE=F2,FIELDS=(1,8,A)                                      
           REFORMAT FIELDS=(F2:1,2000)                                          
           SORT FIELDS=COPY                                                     
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* CREATE FINANCIAL TRANSACIONS FOR STUDIO APARTMENT                           
//* CLOSE FILE : BP13K800                                                       
//*-----------------------------------------------------------------            
//STEP25I  EXEC PGM=BP13C28A,COND=(0,NE)                                        
//BP13F400 DD DSN=BP13.F410.STUDIO,DISP=SHR                                     
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K350 DD DSN=BP13.K350.STDAPT,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F120 DD DSN=BP13.F120.SATRAN.SA,DISP=MOD                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*=================================================================            
//* MERGE DAILY FINANCIAL TRANS WITH SALES AGRMT TRANS                          
//* SORT BY PAYMENT TYPE                                                        
//*-----------------------------------------------------------------            
//STEP26   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DAILYTRN,DISP=SHR                                   
//         DD DSN=BP13.F120.SATRAN,DISP=SHR                                     
//         DD DSN=BP13.F120.SATRAN.SA,DISP=SHR                                  
//         DD DSN=BP13.F120.SATRAN.BO,DISP=SHR                                  
//         DD DSN=BP13.F130.MLTRF,DISP=SHR                                      
//         DD DSN=BP13.F121.CPFTRAN.TPBO,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F125.ACCUM,DISP=OLD                                      
//SYSIN    DD *                                                                 
     SORT FIELDS=(99,3,A),FORMAT=CH                                             
     OMIT COND=(99,3,CH,EQ,C'REG')                                              
/*                                                                              
//*=================================================================            
//* MERGE DAILY FINANCIAL TRANS WITH SALES AGRMT TRANS                          
//* SORT BY PAYMENT TYPE                                                        
//*-----------------------------------------------------------------            
//STEP27   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DAILYTRN,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.F125.REG,DISP=MOD                                        
//SYSIN    DD *                                                                 
     SORT FIELDS=(99,3,A),FORMAT=CH                                             
     INCLUDE COND=(99,3,CH,EQ,C'REG')                                           
/*                                                                              
//*=================================================================            
//* MERGE DAILY FINANCIAL TRANS WITH SALES AGRMT TRANS                          
//* SORT BY PAYMENT TYPE                                                        
//*-----------------------------------------------------------------            
//STEP28   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F125.DAILYTRN,DISP=SHR                                   
//SORTOUT  DD DSN=&&STEP28,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(TRK,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(99,3,A),FORMAT=CH                                             
     INCLUDE COND=(99,3,CH,EQ,C'REG')                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR REGN FEE REFUND                                            
//*-----------------------------------------------------------------            
//STEP29   EXEC SAS,COND=(0,NE)                                                 
//BP13F127 DD DSN=&&STEP28,DISP=(OLD,DELETE)                                    
//BP13L119 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S119),DISP=SHR                             
//*                                                                             
//*-----------------------------------------------------------------            
//* UPDATE BP13K800 AND BP13K885 AFTER REFUND                                   
//*-----------------------------------------------------------------            
//STEP30   EXEC PGM=BP13C128,COND=(0,NE)                                        
//BP13F125 DD DSN=BP13.F125.DAILYTRN.SUBTRF,DISP=SHR                            
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13L128 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* SORT COLL PAYMENT FILE IN SCH-ACCNT SEQUENCE                                
//*-----------------------------------------------------------------            
//STEP31   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AC28.F544.SOC,DISP=OLD                                        
//         DD DSN=AC28.F569.SOC,DISP=OLD                                        
//SORTOUT  DD DSN=&&AC28F544,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     INCLUDE COND=(91,5,CH,EQ,C'6250G',OR,                                      
                   91,5,CH,EQ,C'0933D',OR,                                      
                   91,5,CH,EQ,C'6034Z',OR,                                      
                   91,5,CH,EQ,C'6041I')                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE HISTORY TRANSACTIONS FOR LEASE STAMP FEE, CONVEY FEE,                
//* AND DEBITING TO GL ACCT 40-4151 AND 45-4151                                 
//*-----------------------------------------------------------------            
//STEP32  EXEC PGM=BP13C364,COND=(0,NE)                                         
//AC28F544 DD DSN=&&AC28F544,DISP=(OLD,DELETE)                                  
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT OUT "SBPS"  CASES                                                      
//*-----------------------------------------------------------------            
//STEP33   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AG07.F630.SOC,DISP=SHR                                        
//SORTOUT  DD DSN=&&AG07F630,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,11,A),FORMAT=CH                                             
     INCLUDE COND=(20,4,CH,EQ,C'SBPS')                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* PROCESS VOUCHER TRANSACTION FILE AND UPDATE BP13K130 &                      
//* CREATE TRANSACTION FILE (IBG).                                              
//* MANUAL PAYMENT/VOUCHER FOR THE ACCOUNT 54-4151                              
//* SYSTEM CODE - B5, TRANS-ID = "SBPS"                                         
//*-----------------------------------------------------------------            
//STEP34  EXEC PGM=BP13C458,COND=(0,NE)                                         
//AG07F630 DD DSN=&&AG07F630,DISP=(OLD,DELETE)                                  
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F121 DD DSN=BP13.F121.BANKIBG,DISP=MOD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* UPDATE BALANCING FILE USING THE VALIDATE PAYMENT TRANS                      
//*-----------------------------------------------------------------            
//STEP35   EXEC PGM=BP13C105                                                    
//BP13F125 DD DSN=BP13.F125.ACCUM,DISP=OLD                                      
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//BP13L105 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* PERFORM BALANCING FOR FEES UPDATED IN RFF MASTER AND THE                    
//* BALANCING FILE. COND CODE = 99 FOR ANY FEES NOT BALANCED                    
//*-----------------------------------------------------------------            
//STEP36   EXEC PGM=BP13C106                                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//BP13L106 DD SYSOUT=N                                                          
//BP13P106 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*  EXTRACT THE EX-APPLICANT FOR CASES THAT HAVE CD-TRANSFER > 0               
//*  AFTER REFUND = 0.                                                          
//*-----------------------------------------------------------------            
//STEP37   EXEC PGM=BP13C139                                                    
//BP13F885 DD DSN=BP13.F885.REFUND,DISP=SHR                                     
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//BP13F130 DD DSN=BP13.F130.REFUND,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* UPDATE EXAPPLT CD-TRANSFER TO  0                                            
//*-----------------------------------------------------------------            
//STEP38   EXEC PGM=BP13C141                                                    
//BP13F885 DD DSN=BP13.F885.REFUND,DISP=SHR                                     
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* UPDATE BALANCING FILE USING THE VALIDATE PAYMENT TRANS                      
//*-----------------------------------------------------------------            
//STEP39   EXEC PGM=BP13C105                                                    
//BP13F125 DD DSN=BP13.F130.REFUND,DISP=OLD                                     
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//BP13L105 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* PERFORM BALANCING FOR FEES UPDATED IN RFF MASTER AND THE                    
//* BALANCING FILE. COND CODE = 99 FOR ANY FEES NOT BALANCED                    
//*-----------------------------------------------------------------            
//STEP40   EXEC PGM=BP13C106                                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//BP13L106 DD SYSOUT=N                                                          
//BP13P106 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* MERGE DAILY FINANCIAL TRANS WITH SALES AGRMT TRANS                          
//* SORT BY PAYMENT TYPE                                                        
//*-----------------------------------------------------------------            
//STEP41   EXEC SORT                                                            
//SORTIN   DD DSN=BP13.F120.SATRAN.SUBTRF,DISP=SHR                              
//SORTOUT  DD DSN=BP13.F125.ACCUM,DISP=MOD                                      
//SYSIN    DD *                                                                 
     SORT FIELDS=(99,3,A),FORMAT=CH                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* MERGE DAILY FINANCIAL TRANS WITH STUDIO APPT AFTER                          
//* KEY ISSYE                                                                   
//*-----------------------------------------------------------------            
//STEP42   EXEC SORT                                                            
//SORTIN   DD DSN=BP13.F410.STUDIO,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F410.STUDIO.ACCUM,DISP=MOD                               
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,8,A),FORMAT=CH                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* TO PROCESS VOUCHER INTERFACE FILE FOR COTMA (SSM)                           
//*                                                                             
//*-----------------------------------------------------------------            
//STEP43   EXEC PGM=BP13C31S                                                    
//AG07F640 DD DSN=AG07.F640.SOC,DISP=SHR                                        
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K650 DD DSN=BP13.K650.PREPVRCH,DISP=SHR,                                  
//            AMP=('BUFNI=8')                                                   
//BP13L31S DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//*=================================================================            
//*          E N D      O F     J O B                                           
//*=================================================================            
