//BP13A612  JOB (BP13P),'BP13A612',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-----------------------------------------------------------------            
//* REPORT ON BTO REQUEST WITH PPOS PROFILE                                     
//* REPORT ON FT/2T, ELIG/SHORTLISTED/DP/OM FLAT/FT/PPOS TAG                    
//*-----------------------------------------------------------------            
//* BP133641 LSB 170709 - TAKE OUT PGM BP13CB53                                 
//* BP133913 ZDD 110610 - REMOVED PRINTING OF CONTROL COUNT ON BP13C754         
//* BP135171 RJE 100214 - TO CATER FOR DB2 UPGRADE                              
//*-----------------------------------------------------------------            
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET             
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* SORT BALLOT REQUEST                                                         
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH,FILSZ=E50000                                 
//*-----------------------------------------------------------------            
//* OUTPUT BP13F716 FROM BP13F500 FILE FOR NRIC 1 - 4 HA ONLY                   
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C805,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(60,15),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REQUEST RECORDS IN NRIC ORDER                                          
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(60,15),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* OUTREC NRIC1 FROM RENTAL SYSTEM FILE                                        
//* INCLUDE PROPERTY-CODE = ZEROS, RENTAL FLATS                                 
//* OMIT NRIC = BLANK                                                           
//* OMIT CDE-TENLIVE NOT = 'L'                                                  
//* OMIT MODE ALLOCATION = 'THS' OR 'INC' OR 'USW'                              
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* TO EXTRACT RENTAL SCHEME ACCOUNT & ALLOCATION SCHEME                        
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=&&F716Q748,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                                    
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                        
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716Q748,DISP=(OLD,PASS)                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=BP13.F716.CISTENC.A612,DISP=OLD                               
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT BY SCH-ACC-NO FOR SMS MATCHING                                         
//* ROLE 003= TENANT                                                            
//* ROLE 004= TENANT OCCUP                                                      
//* ROLE 023,024 = LESSEE, CO-LESSEE                                            
//* ROLE 025 = OCCUP                                                            
//*--------------------------------------------------------------------         
//STEP06 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.F716.CISTENC.A612,DISP=SHR                               
//SORTOUT  DD DSN=&&F716SCHT,DISP=(,PASS),                                      
//        DCB=(RECFM=FB,LRECL=350),                                             
//        SPACE=(CYL,(80,20),RLSE)                                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(51,11,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* TO READ SMS TO GET STATUS OF DP OR OM FLAT                                  
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13CB55,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716SCHT,DISP=(OLD,PASS)                            00120000
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                          00120000
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716O DD DSN=&&F716SMS,DISP=(,PASS),                               00120000
//            SPACE=(CYL,(80,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=0)                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY REGN/NRIC ORDER                                                     
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716SMS,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F716REGN,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=350),                              
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
//*-------------------------------------------------------------------*         
//* MOVE ROLE TO K730 POSN 474:2, FILE-STAT TO 472:2 (OM, DP FLAT)              
//*-------------------------------------------------------------------*         
//STEP09 EXEC PGM=BP13CB52,COND=(0,NE)                                          
//BP13F716 DD DSN=&&F716REGN,DISP=(OLD,PASS)                                    
//BP13F730 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//P13F730A DD DSN=&&F730ROLE,DISP=(,PASS),                              00398002
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(40,20),RLSE)                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F825,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                              
//            SPACE=(CYL,(40,20),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(131,1,CH,EQ,C'Y')                                              
//*---------------------------------------------------------------------        
//* SORT OUT PPO-TAG NOT = BLANK ( PPOS CASES DECLARE BY APPLICANT)             
//* NUM-PPO = Y OWN PRIVATE PPTY                                                
//* NUM-PPO = A OWN PRIVATE PPTY                                                
//* NUM-PPO = B DISPOSE PRIVATE PPTY                                            
//* NUM-PPO = C OWN AND DISPOSE PRIVATE PPTY                                    
//* NUM-PPO = N NO PRIVATE PPTY                                                 
//* NUM-PPO = BLANK  NO PRIVATE PPTY                                            
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730ROLE,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730PPOS,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(4,2),RLSE)                                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(347,1,CH,EQ,C' ',OR,                                           
                347,1,CH,EQ,C'N')                                               
//*---------------------------------------------------------------------        
//* MATCH ALL PPO-TAG=Y CASES WITH PPO FILES                                    
//* PPOS-TAG = P FOUND IN CURR PPOS                                             
//* PPOS-TAG = X DISPOSAL-DATE > 30 MTHS                                        
//* PPOS-TAG = H DISPOSAL-DATE =< 30 MTHS                                       
//* PPOS-TAG = Z DISPOSAL-DATE = ZEROS OR SPACES                                
//* PPOS-TAG = W NOT FOUND IN BR10 FILE                                         
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13CB54,COND=(0,NE)                                        
//BP13F825 DD DSN=&&BP13F825,DISP=(SHR,PASS)                                    
//BP13F730 DD DSN=&&F730PPOS,DISP=(OLD,PASS)                                    
//BR10K010 DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BR10K080 DD DSN=BR10.K080.PTEPPTY.HIST,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F730A DD DSN=&&BP13BR10,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(50,10),RLSE)                                          
//BR10F080 DD DSN=&&BP13F080,DISP=(,PASS),                                      
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=300),                                 
//         SPACE=(CYL,(20,10),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* OMIT PPO-TAG = W (NOTFD IN BR10 FILE)                                       
//*---------------------------------------------------------------------        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13BR10,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.PPO,DISP=OLD                                        
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     OMIT COND=(347,1,CH,EQ,C'W')                                               
//*---------------------------------------------------------------------        
//* SORT OUT PPO-TAG  = W (NOTFD IN BR10 FILE)                                  
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13BR10,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730NFND,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(347,1,CH,EQ,C'W')                                            
//*---------------------------------------------------------------------        
//* SORT OUT PPO-TAG = BLANK (NON PPOS)                                         
//*---------------------------------------------------------------------        
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730ROLE,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730NONP,DISP=(MOD,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(347,1,CH,EQ,C' ',OR,                                         
                   347,1,CH,EQ,C'N')                                            
//*---------------------------------------------------------------------        
//* SORT OUT PPO-TAG = BLANK (NON PPOS)                                         
//*---------------------------------------------------------------------        
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730NONP,DISP=(OLD,PASS)                                    
//         DD DSN=&&F730NFND,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730NALL,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
//*-------------------------------------------------------------------*         
//* FOR NON-PPOS CASES GET ADDRESS WITH ADDRESS-TYPE =N                         
//* TAG PPO=R                                                                   
//*-------------------------------------------------------------------*         
//STEP18 EXEC PGM=BP13CB50,COND=(0,NE)                                          
//BP13F730 DD DSN=&&F730NALL,DISP=(OLD,PASS)                                    
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                             00398002
//         AMP=('BUFND=8','BUFNI=4')                                    00399102
//P13F730A DD DSN=BP13.F730.NONPPO,DISP=OLD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*==================================================================           
//* PRINT REPORT ON PPO PROFILE                                                 
//*---------------------------------------------------------------------        
//STEP19 EXEC SAS,COND=(0,NE)                                                   
//INDAT1 DD DSN=BP13.F730.NONPPO,DISP=SHR                                       
//INDAT2 DD DSN=BP13.F730.PPO,DISP=SHR                                          
//FT43F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN  DD DSN=BP13.BATCH.SRC(BP13S029),DISP=SHR                               
//*---------------------------------------------------------------------        
//* END BP13A612                                                                
//*---------------------------------------------------------------------        
