//BP13A985 JOB (BP13P),'BP13A985',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=====================================================================        
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS GENERATING MGPS UNITS IN BP13FQ50                               
//*=====================================================================        
//* CHGE REQ  BY  DDMMCCYY DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP135080 SMR2 17102013 NEW JCL                                              
//* BP135080 SMR2 29102013 ADD STEP TO REDEFINE BP13K120                        
//* BP135140 SMR2 13112013 ADD STEPS TO CATER FOR BP13KQ50                      
//* BP135140 SMR2 05112013 TRANSFER STEPS FROM BP13A982                         
//* BP135140 SMR2 16012014 STORE REPORT FROM BP13S907 INTO DATASET              
//* BP135254 SMR2 21032014 ADD STEPS TO CREATE NEW FILE BP13K145                
//* BP135394 SMR2 20062014 CATER FOR FLOOR TAG                                  
//*=====================================================================        
//* VERIFY FILES BEFORE JOB RUN                                                 
//*---------------------------------------------------------------------        
//STEP00 EXEC  PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD  DSN=BP13.KQ50.GROUNIT,DISP=OLD                                   
//INPUT2   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=OLD                            
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY  FILE(INPUT1)                                                     
          VFY  FILE(INPUT2)                                                     
//*---------------------------------------------------------------------        
//* EXTRACT UNTAGGED CHILD UNITS (REMAINING CHILD UNITS)                        
//* SORT BY NT, FT, NGHBRD, CNTRCT, BLOCK, RANDOM #                             
//*---------------------------------------------------------------------        
//STEP01 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP13F120,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,3,A,117,2,A,4,4,A,8,4,A,12,5,A,18,28,A),                       
               FORMAT=CH                                                        
  INCLUDE COND=(1,3,CH,NE,C'   ',AND,65,1,CH,EQ,C' ')                           
//*---------------------------------------------------------------------        
//* RUN PROGRAM BP13C91I - DELETE UNTAGGED CHILD UNITS FROM BP13K120            
//*---------------------------------------------------------------------        
//STEP02 EXEC  PGM=BP13C91I,COND=(0,NE)                                         
//BP13F120 DD  DSN=&&BP13F120,DISP=(OLD,DELETE)                                 
//BP13K120 DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=OLD                            
//BP13F100 DD  DUMMY                                                            
//SYSIN    DD  *                                                                
C                                                                               
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* OUTREC REMAINING MGPS CHILD UNITS IN BP13F100                               
//* SORT BY NT, FT, NGHBRD, CNTRCT, BLOCK, RANDOM #                             
//*---------------------------------------------------------------------        
//STEP03 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=&&F100REMU,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,3,A,117,2,A,4,4,A,8,4,A,12,5,A,18,28,A),                       
               FORMAT=CH                                                        
  INCLUDE COND=(1,3,CH,NE,C'   ',AND,65,1,CH,EQ,C'C',AND,                       
                192,8,CH,EQ,C'BP13C91G')                                        
  OUTREC FIELDS=(119,11,7X,18,28,130,1,131,2,133,1,5X,100,3,4,4,                
                 8,4,12,5,117,2,66,2,68,32,56,2,58,4,62,3,103,3,                
                 1,3,106,3,109,6,115,2,65,1,666X)                               
//*---------------------------------------------------------------------        
//* OUTREC F100SUMM - SELECTED GRO UNITS                                        
//*---------------------------------------------------------------------        
//STEP04 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.FNLSLCT,DISP=SHR                                   
//SORTOUT  DD  DSN=&&F100SUMM,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  OUTREC FIELDS=(1,799,C'A')                                                    
//*---------------------------------------------------------------------        
//* OUTREC F100SUMM - SELECTED PARENT UNITS                                     
//*---------------------------------------------------------------------        
//STEP05 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.MGPUNIT.PARENT,DISP=SHR                            
//SORTOUT  DD  DSN=&&F100SUMM,DISP=(MOD,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  OUTREC FIELDS=(1,799,C'B')                                                    
//*---------------------------------------------------------------------        
//* OUTREC F100SUMM - SELECTED CHILD UNITS (SAME BLK & LVL AS PARENT)           
//*---------------------------------------------------------------------        
//STEP06 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.MGPUNIT.CHILD,DISP=SHR                             
//SORTOUT  DD  DSN=&&F100SUMM,DISP=(MOD,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  OUTREC FIELDS=(1,799,C'C')                                                    
//*---------------------------------------------------------------------        
//* OUTREC F100SUMM - SELECTED CHILD UNITS (REMAINING CHILD UNITS)              
//*---------------------------------------------------------------------        
//STEP07 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&F100REMU,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F100SUMM,DISP=(MOD,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  OUTREC FIELDS=(1,799,C'D')                                                    
//*---------------------------------------------------------------------        
//* SORT OUT BY TAG, NT, BLK                                                    
//*---------------------------------------------------------------------        
//STEP08 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&F100SUMM,DISP=(OLD,DELETE)                                 
//SORTOUT  DD  DSN=BP13.F100.SUMMARY,DISP=OLD                                   
//SYSIN    DD  *                                                                
  SORT FIELDS=(800,1,A,120,3,A,67,5,A),FORMAT=CH                                
//*---------------------------------------------------------------------        
//* DELETE SEQUENTIAL FILE                                                      
//*---------------------------------------------------------------------        
//STEP08A  EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
     DEL (BP13.REPORT.BP13A985.L907)                                            
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*---------------------------------------------------------------------        
//* SAS PROGRAM TO PRINT REPORT                                                 
//*---------------------------------------------------------------------        
//STEP09 EXEC  SAS,COND=(0,NE)                                                  
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(10,5))                                    
//FT42F001 DD  DSN=BP13.REPORT.BP13A985.L907,DISP=(NEW,CATLG),                  
//             DCB=(RECFM=FBA,LRECL=133,BLKSIZE=27930),                         
//             SPACE=(CYL,(10,5),RLSE)                                          
//BP13FSMY DD  DSN=BP13.F100.SUMMARY,DISP=SHR                                   
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S907),DISP=SHR                            
//*---------------------------------------------------------------------        
//* APPEND REMAINING MGPS CHILD UNITS IN BP13F100                               
//* SORT BY NT, FT, NGHBRD, CNTRCT, BLOCK, RANDOM #                             
//*---------------------------------------------------------------------        
//STEP10 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&F100REMU,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=BP13.F100.MGPUNIT.CHILD,DISP=MOD                             
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
//*---------------------------------------------------------------------        
//* OUTREC ALL (PARENT, CHILD AND REMAINING) MGPS UNITS IN BP13FQ50             
//*---------------------------------------------------------------------        
//STEP11 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=BP13.FQ50.GROUNIT,DISP=MOD                                   
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(1,3,CH,NE,C'   ')                                               
  OUTREC FIELDS=(100,3,4,4,8,4,12,5,56,2,58,4,62,3,117,2,106,3,109,6,           
                 103,3,1,3,66,2,65,1,115,2,53X)                                 
//*---------------------------------------------------------------------        
//* OUTREC PARENT MGPS UNITS FOR REPORT                                         
//*---------------------------------------------------------------------        
//STEP12A EXEC SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP13MGPS,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(1,3,CH,NE,C'   ',AND,65,1,CH,EQ,C'P')                           
  OUTREC FIELDS=(119,11,7X,18,28,130,1,131,2,133,1,5X,100,3,4,4,                
                 8,4,12,5,117,2,66,2,68,32,56,2,58,4,62,3,103,3,                
                 1,3,106,3,109,6,115,2,65,1,666X)                               
//*---------------------------------------------------------------------        
//* OUTREC CHILD (SAME BLK & LVL) MGPS UNITS FOR REPORT                         
//*---------------------------------------------------------------------        
//STEP12B EXEC SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP13MGPS,DISP=(MOD,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(1,3,CH,NE,C'   ',AND,65,1,CH,EQ,C'C',AND,                       
                192,8,CH,EQ,C'BP13C91F')                                        
  OUTREC FIELDS=(119,11,7X,18,28,130,1,131,2,133,1,5X,100,3,4,4,                
                 8,4,12,5,117,2,66,2,68,32,56,2,58,4,62,3,103,3,                
                 1,3,106,3,109,6,115,2,65,1,C'SF',664X)                         
//*---------------------------------------------------------------------        
//* OUTREC CHILD (REMAINING) MGPS UNITS FOR REPORT                              
//*---------------------------------------------------------------------        
//STEP12C EXEC SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP13MGPS,DISP=(MOD,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(1,3,CH,NE,C'   ',AND,65,1,CH,EQ,C'C',AND,                       
                192,8,CH,EQ,C'BP13C91G')                                        
  OUTREC FIELDS=(119,11,7X,18,28,130,1,131,2,133,1,5X,100,3,4,4,                
                 8,4,12,5,117,2,66,2,68,32,56,2,58,4,62,3,103,3,                
                 1,3,106,3,109,6,115,2,65,1,C'OF',664X)                         
//*------------------------------------------------------------------           
//* SORT OUT BY RANDOM #                                                        
//*------------------------------------------------------------------           
//STEP13 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.MGPUNIT,DISP=SHR                                   
//SORTOUT  DD  DSN=&&P13F100A,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(19,28,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* SORT OUT BY RANDOM #                                                        
//*------------------------------------------------------------------           
//STEP14 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&BP13MGPS,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&P13F100B,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(19,28,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* APPEND UNUSED REMAINING CHILD UNITS FOR THE REPORT                          
//*------------------------------------------------------------------           
//STEP15 EXEC PGM=SORT,COND=(0,NE)                                              
//SORTJNF1 DD DSN=&&P13F100A,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=&&P13F100B,DISP=(OLD,DELETE)                                  
//F1ONLY   DD DSN=&&BP13MGPS,DISP=(MOD,PASS),                                   
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN DD *                                                                    
  JOINKEYS FILE=F1,FIELDS=(19,28,A)                                             
  JOINKEYS FILE=F2,FIELDS=(19,28,A)                                             
  JOIN UNPAIRED,F1,ONLY                                                         
  REFORMAT FIELDS=(F1:1,800)                                                    
  OUTFILE FNAMES=F1ONLY                                                         
  OPTION COPY                                                                   
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY NT, NGHBRD, CNTRCT, BLOCK, FT, RANDOM #                             
//* REMAINING FLAT LIST AFTER GRO                                               
//*---------------------------------------------------------------------        
//STEP16 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&BP13MGPS,DISP=(OLD,DELETE)                                 
//SORTOUT  DD  DSN=BP13.REPORT.BP13A985,DISP=OLD                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(120,3,A,59,4,A,63,4,A,67,5,A,72,2,A,19,28,A),                    
               FORMAT=CH                                                        
  OUTREC FIELDS=(19,28,C';',56,3,C';',59,4,C';',63,4,C';',                      
                 67,5,C';',72,2,C';',108,2,C';',110,4,C';',                     
                 117,3,C';',120,3,C';',123,3,C';',126,6,C';',                   
                 134,1,C';',132,2,C';',135,2,C';',63X)                          
//*---------------------------------------------------------------------        
//* TO INSERT GRO UNITS TO BP13KQ50                                             
//*---------------------------------------------------------------------        
//STEP17 EXEC PGM=BP13CF19,COND=(0,NE)                                          
//BP13FQ50 DD DSN=BP13.FQ50.GROUNIT,DISP=SHR                                    
//BP13KQ50 DD DSN=BP13.KQ50.GROUNIT,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* EMPTY BP13FQ50 AFTER INSERTING                                              
//*---------------------------------------------------------------------        
//STEP18 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.FQ50.GROUNIT,DISP=OLD                                    
//SYSIN DD *                                                                    
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
//*------------------------------------------------------------------           
//* OUTREC UNUSED REMAINING CHILD UNITS IN BP13K145                             
//* SORT BY ESTATE, NGHBRD, CNTRCT, BLOCK, FT, RANDOM #                         
//*------------------------------------------------------------------           
//STEP19 EXEC PGM=SORT,COND=(0,NE)                                              
//SORTJNF1 DD DSN=BP13.F100.CHILD.REMUNIT,DISP=SHR                              
//SORTJNF2 DD DSN=&&F100REMU,DISP=(OLD,DELETE)                                  
//F1ONLY   DD DSN=&&BP13F145,DISP=(NEW,PASS),                                   
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                               
//SYSIN DD *                                                                    
  SORT FIELDS=(56,3,A,59,4,A,63,4,A,67,5,A,72,1,A,19,28,A),                     
               FORMAT=CH                                                        
  JOINKEYS FILE=F1,FIELDS=(19,28,A)                                             
  JOINKEYS FILE=F2,FIELDS=(19,28,A)                                             
  JOIN UNPAIRED,F1,ONLY                                                         
  REFORMAT FIELDS=(F1:1,200)                                                    
  OUTFILE FNAMES=F1ONLY,                                                        
     OUTREC=(56,3,59,4,63,4,67,5,72,1,19,28,10X,108,2,110,4,                    
             114,3,134,1,74,2,76,32,120,3,117,3,123,3,126,6,                    
             132,2,72,2,1,11,47,1,48,2,50,1,67X)                                
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* DELETE / DEFINE VSAM FILE BP13K145                                          
//*---------------------------------------------------------------------        
//STEP20 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//INPUT1   DD DSN=&&BP13F145,DISP=(OLD,DELETE)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          DEL 'BP13.K145.MGPSUNIT.REMUNIT' CL PURGE                             
          DEF CLUSTER                                  -                        
              (NAME(BP13.K145.MGPSUNIT.REMUNIT)        -                        
              CYL(10 5)                                -                        
              STORCLAS(PRODRLS)                        -                        
              LOG(NONE)                                -                        
              UNIQUE                                   -                        
              SHR(2 3))                                -                        
              DATA                                     -                        
              (NAME(BP13.K145.MGPSUNIT.REMUNIT.DATA)   -                        
              KEYS(55 0)                               -                        
              RECSZ(200 200)                           -                        
              CISZ(4096)                               -                        
              FSPC(10 10))                             -                        
              INDEX                                    -                        
              (NAME(BP13.K145.MGPSUNIT.REMUNIT.INDEX)  -                        
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                               -                        
      REPRO IFILE(INPUT1)                              -                        
            ODS(BP13.K145.MGPSUNIT.REMUNIT)            -                        
            REUSE                                                               
//*---------------------------------------------------------------------        
//* END OF JOB BP13A985                                                         
//*---------------------------------------------------------------------        
