//BP13D220 JOB (BP13P),'BP13D220',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* DETERMINE HARDLUCK, CUT-OFF POINT CHANGE TO 201101                          
//* JOB FOR FT = BP13D220, D22A, D22B, D22C, D22D                               
//* JOB FOR FT2 = BP13D22E, D22F, D22G, D22H                                    
//* JOB FOR PURE 2T = BP13D221                                                  
//* JOB RUN = BP13D222, DEFINE BP13K585                                         
//* JOB RUN = BP13D223, UPDATE HARDLUCK TO BP13K730, PRINT PROFILE              
//* JOB RUN = BP13D224, PRINT REPORT FOR FT                                     
//* JOB RUN = BP13D225, PRINT REPORT FOR FT2T                                   
//* JOB RUN = BP13D226, PRINT REPORT FOR PURE HARDLUCK                          
//* JCL REFER TO BP13.K595.BP13D220 INSTEAD OF BP13.K595.BALLOT.LOG             
//*=================================================================            
//* CHG-NO   BY    ON   - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP133835 LSB 160410 - ADD SBF ALLOC-CAT                                     
//* BP133835 LSB 010710 - DELETE OMIT HH=G, BTO MATURE EST                      
//* BP133891 LSB 070810 - NEW REPORT BYPASS NE                                  
//* BP133921 LSB 240810 - BYPASS JUN BTO FOR AFTER SOC, AFTER QUEUE             
//* BP133840 LSB 010910 - BYPASS JUN BTO PG FOR AFTER QUEUE REPORT              
//* BP134205 LSB 110511 - ADD BP13K813 TO BP13CB91 BYPASS HARDLUCK              
//*                       BP13CY82 REPLACE CY64                                 
//* BP134247 LSB 110611 - CB78 ADD K893,CY82 CHK MATURE-TAG,ADD PPO/EC          
//* BP134247 LSB 110711 - DELETE CB90, ENHANCE CB71, CB91                       
//* BP134388 LSB 210212 - ADD OCCUPIER SPOUSE/FS IN CB80 GET FR K828            
//* BP134598 LSB 100712 - CUT-FF DATE 2011 ATTEMPT FT= FROM 4 TO 3              
//*                                             FT/2T= FROM 6 TO 3              
//* BP134766 IMC 090113 ADD CY45, CY46, RESET COUNT FOR SBF                     
//* BP134780 IMC 270113 ADD DEFINE OF FILE BP13K803                             
//* BP135002 LSB 120813 BYPASS FTS SINGLE SCHEME FROM K595                      
//* BP135237 LSB 180214 STEP01-03 START DATE CHG FROM 200703 TO 201101          
//*                     CHG TO BP13.K595.BP13D220 WITH CASES FROM 2011          
//* BP135635 LSB 280115 ADD FTS FILE                                            
//* BP136740 LSB 110817 ADD STS SIMILAR TO FTS                                  
//* BP138220 LSB 260220 START DATE 2018/01/01 FROM 2011/01/01                   
//* BP138220 LSB 090320 START DATE 2015/01/01                                   
//* BP138220 LSB 070420 START DATE 2011/01/01                                   
//* BP138885 LSB 140921 START DATE 2015/01/01 ONLY CHG DATE IN D220             
//* BP138885 LSB 251021 START DATE 2011/01/01 ONLY CHG DATE IN D220             
//* BP139069 LSB 090122 SIMULATE 2015, 2017 ONLY CHG DATE IN D220               
//* BP139512 LSB 280223 UPDATE STEP08                                           
//*=================================================================            
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y1                                  
//*-----------------------------------------------------------------            
//STEP0A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K20H.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YH')                                               
//*-----------------------------------------------------------------            
//* REPORT ON BTO BOOK/NOT BOOK PROFILE BY QTR                                  
//* FOR FIRST TIMER ONLY                                                        
//*---------------------------------------------------------------------        
//* INCLUDE BOOKED CASES FROM MASTER BP13K800                                   
//* WEF 201403, STARTING DATE CHANGE TO 201101                                  
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K800.APPLN.INET,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F800,DISP=(,PASS),                                     
//             UNIT=(SYSDA,3),SPACE=(CYL,(500,80),RLSE),                        
//             DCB=(RECFM=FB,LRECL=2000),DATACLAS=MULTIVOL                      
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(785,6,CH,GE,C'201101')                                          
  OUTREC FIELDS=(1,1992,8X)                                                     
//*---------------------------------------------------------------------        
//* INCLUDE BOOKED CASES FROM HISTORY BP13K893                                  
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F800,DISP=(MOD,PASS),                                  
//             UNIT=(SYSDA,3),SPACE=(CYL,(500,80),RLSE),                        
//             DCB=(RECFM=FB,LRECL=2000),DATACLAS=MULTIVOL                      
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
   INCLUDE COND=(785,6,CH,GE,C'201101')                                         
  OUTREC FIELDS=(1,1992,2035,8)                                                 
//*---------------------------------------------------------------------        
//* INCLUDE BOOKED CASES                                                        
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=&&BP13F800,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F800CY63,DISP=(MOD,PASS),                                  
//             UNIT=(SYSDA,3),SPACE=(CYL,(500,80),RLSE),                        
//             DCB=(RECFM=FB,LRECL=2000),DATACLAS=MULTIVOL                      
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
   INCLUDE COND=(785,6,CH,GE,C'201101',AND,                                     
                (924,3,CH,EQ,C'BTO',OR,                                         
                 924,3,CH,EQ,C'BE ',OR,                                         
                 924,3,CH,EQ,C'SBF'))                                           
//*-----------------------------------------------------------------            
//* MATCH F205 TO GET QTR AS REQUESTED IN SOCY                                  
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13CY63,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800CY63,DISP=(OLD,PASS)                                    
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F800A DD DSN=&&F800QTR,DISP=(,PASS),                                       
//            UNIT=(SYSDA,3),SPACE=(CYL,(410,50),RLSE),                         
//            DCB=(RECFM=FB,LRECL=2000),DATACLAS=MULTIVOL                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT BY REGN-NO                                                             
//*------------------------------------------------------------------           
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=&&F800QTR,DISP=(OLD,PASS)                              00120000
//SORTOUT DD DSN=BP13.F800.BP13D220,DISP=OLD                                    
//SYSIN   DD  *                                                                 
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
//*------------------------------------------------------------------           
//* INCLUDE DTE-BALLOT FROM 201101 WEF FROM 201403 APPLICATIONS                 
//*---------------------------------------------------------------------        
//* INCLUDE BALLOT-QTR GT 2011 BTO                                              
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&F595D220,DISP=(,PASS),                                     
//             UNIT=(SYSDA,3),SPACE=(CYL,(300,30),RLSE),                        
//             DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL                       
//SYSIN    DD  *                                                                
  SORT FIELDS=(476,25,A),FORMAT=CH                                              
  INCLUDE COND=(1,1,CH,NE,C' ',AND,                                             
           213,3,CH,NE,C'AS ',AND,                                              
           213,3,CH,NE,C'GRO',AND,                                              
           213,3,CH,NE,C'REC',AND,                                              
           213,3,CH,NE,C'RE2',AND,                                              
           213,3,CH,NE,C'CCC',AND,                                              
           213,3,CH,NE,C'CC2',AND,                                              
           213,3,CH,NE,C'CDC',AND,                                              
           213,3,CH,NE,C'CDE',AND,                                              
           213,3,CH,NE,C'CSC',AND,                                              
           213,3,CH,NE,C'SEC',AND,                                              
           213,3,CH,NE,C'MC ',AND,                                              
           213,3,CH,NE,C'NC ',AND,                                              
           213,3,CH,NE,C'MC2',AND,                                              
           213,3,CH,NE,C'NET',AND,                                              
           213,3,CH,NE,C'WEC',AND,                                              
           213,3,CH,NE,C'WSC',AND,                                              
           213,3,CH,NE,C'WS2',AND,                                              
           213,3,CH,NE,C'YEC',AND,                                              
           213,3,CH,NE,C'YE2',AND,                                              
           213,3,CH,NE,C'MAE',AND,                                              
           213,3,CH,NE,C'C2E',AND,                                              
           213,3,CH,NE,C'IAE',AND,                                              
           260,1,CH,NE,C'C',AND,                                                
           334,6,CH,GE,C'201101',AND,                                           
          (376,3,CH,EQ,C'BTO',OR,                                               
           376,3,CH,EQ,C'BE ',OR,                                               
           376,3,CH,EQ,C'SBF'))                                                 
//*---------------------------------------------------------------------        
//* BYPASS FTS TO DETERMINE HARDLUCK FOR FT/FT2T/2T                             
//*---------------------------------------------------------------------        
//STEP6A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=&&F595D220,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=BP13.F595.BP13D220,DISP=OLD,                                 
//             UNIT=(SYSDA,3),SPACE=(CYL,(300,30),RLSE),                        
//             DCB=(RECFM=FB,LRECL=500)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(476,25,A),FORMAT=CH                                              
  OMIT COND=(213,3,CH,EQ,C'FTS',OR,                                             
             213,3,CH,EQ,C'STS',OR,                                             
             248,3,CH,EQ,C'SSC',OR,                                             
             248,3,CH,EQ,C'JSS',OR,                                             
             248,3,CH,EQ,C'NCS',OR,                                             
             248,3,CH,EQ,C'SSE',OR,                                             
             248,3,CH,EQ,C'JSE',OR,                                             
             248,3,CH,EQ,C'NSE')                                                
//*---------------------------------------------------------------------        
//*- DEFINE BALLOT HISTORY LOG FILE FOR RECORD FROM YEAR 2011                   
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.F595.BP13D220,DISP=SHR                                   
//SYSIN    DD *                                                                 
         DEL    (BP13.K595.BP13D220) CLUSTER PURGE                              
         DEF CL (NAME(BP13.K595.BP13D220)              -                        
                 CYL(180 30)                           -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K595.BP13D220.DATA)        -                        
                 KEYS(25 475)                          -                        
                 RECSZ(500 500)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K595.BP13D220)                                        
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BP13D220.ALTX1)     -                        
               REL(BP13.K595.BP13D220)                 -                        
               CYL(50 20)                              -                        
              UNIQUE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BP13D220.ALTX1.DATA) -                           
               KEYS(9 40)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BP13D220.PATH1)     -                        
               PENT(BP13.K595.BP13D220.ALTX1))                                  
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BP13D220)                 -                        
               ODS(BP13.K595.BP13D220.ALTX1)                                    
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BP13D220.ALTX2)     -                        
               REL(BP13.K595.BP13D220)                 -                        
               CYL(30 20)                              -                        
              UNIQUE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BP13D220.ALTX2.DATA) -                           
               KEYS(9 81)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BP13D220.PATH2)     -                        
               PENT(BP13.K595.BP13D220.ALTX2))                                  
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BP13D220)                 -                        
               ODS(BP13.K595.BP13D220.ALTX2)                                    
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BP13D220.ALTX3)     -                        
               REL(BP13.K595.BP13D220)                 -                        
               CYL(30 20)                              -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BP13D220.ALTX3.DATA) -                           
               KEYS(9 49)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BP13D220.PATH3)     -                        
               PENT(BP13.K595.BP13D220.ALTX3))                                  
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BP13D220)                 -                        
               ODS(BP13.K595.BP13D220.ALTX3)                                    
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BP13D220.ALTX4)     -                        
               REL(BP13.K595.BP13D220)                 -                        
               CYL(30 20)                              -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BP13D220.ALTX4.DATA) -                           
               KEYS(9 58)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BP13D220.PATH4)     -                        
               PENT(BP13.K595.BP13D220.ALTX4))                                  
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BP13D220)                 -                        
               ODS(BP13.K595.BP13D220.ALTX4)                                    
//*-----------------------------------------------------------------            
//* MATCH F205 TO GET QTR AS REQUESTED IN SOCY                                  
//* BYPASS MATURE ESTATE                                                        
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13CY64,COND=(0,NE)                                        
//BP13F595 DD DSN=BP13.F595.BP13D220,DISP=SHR                                   
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=&&F595NT,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,3),SPACE=(CYL,(200,50),RLSE),                         
//            DCB=(LRECL=500,RECFM=FB),DATACLAS=MULTIVOL                        
//P13F595B DD DSN=&&F595BALT,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,3),SPACE=(CYL,(220,50),RLSE),                         
//            DCB=(LRECL=500,RECFM=FB),DATACLAS=MULTIVOL                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* OMIT CANCELLED CASES, BTO MATURE ESTATE (BM)                                
//* NO RANDOM-NO, UPGRADER                                                      
//*-----------------------------------------------------------------            
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595NT,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=BP13.F500.AY0H,DISP=OLD                                       
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
//*-----------------------------------------------------------------            
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.AY0H,DISP=SHR                                       
//SORTOUT  DD DSN=&&F500AY0H,DISP=(,PASS),                                      
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(220,50),RLSE)                                             
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
//*--------------------------------------------------------------------------   
//*  DELETE AND DEFINE BP13K500 FOR TAGGING HA1 CASES                           
//*---------------------------------------------------------------------------  
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&F500AY0H,DISP=(OLD,PASS)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL 'BP13.K500.BP13AY0H' CLUSTER PURGE                                 
         DEF CL (NAME(BP13.K500.BP13AY0H)              -                        
                 CYL(150 50)                            -                       
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K500.BP13AY0H.DATA)        -                        
                 KEYS(8 122)                           -                        
                 RECSZ(500 500)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K500.BP13AY0H)                                        
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K500.BP13AY0H.ALTX1)     -                        
               REL(BP13.K500.BP13AY0H)                 -                        
               CYL(80 50)                                -                      
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K500.BP13AY0H.ALTX1.DATA)    -                        
               KEYS(9 40)                              -                        
               CISZ(4096)                              -                        
               RECSZ(22 1813)                          -                        
               NUNQK)                                                           
         IF LASTCC = 0 THEN                            -                        
           DEF PATH(NAME(BP13.K500.BP13AY0H.PATH1)     -                        
               PENT(BP13.K500.BP13AY0H.ALTX1))                                  
         IF LASTCC = 0 THEN                            -                        
           BIX IDS(BP13.K500.BP13AY0H)                 -                        
               ODS(BP13.K500.BP13AY0H.ALTX1)                                    
//*------------------------------------------------------------------           
//* EXTRACT HA1 UIN FOR BOOKED FLAT CASES                                       
//* CHECK NP13K893 HISTORY FILE 5 YEAR AGO CASES                                
//* HARDCODE > = 200901                                                         
//*--------------------------------------------------------------------         
//STEP12  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=&&BP13F800,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=BP13.F803.BKNRIC,DISP=OLD                                      
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,NE,C'    ',AND,                                        
                1,1,CH,NE,C'C')                                                 
  OUTREC FIELDS=(4,8,88,9,155,11,1352,8,475,8,924,3,1993,8,45X)                 
/*                                                                              
//*--------------------------------------------------------------------         
//*  EXTRACT HA2 UIN FOR BOOKED FLAT CASES                                      
//*--------------------------------------------------------------------         
//STEP13  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=&&BP13F800,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=BP13.F803.BKNRIC,DISP=MOD                                      
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,NE,C'    ',AND,                                        
                97,9,CH,NE,C'         ',AND,                                    
                1,1,CH,NE,C'C')                                                 
  OUTREC FIELDS=(4,8,97,9,155,11,1352,8,475,8,924,3,1993,8,45X)                 
/*                                                                              
//*--------------------------------------------------------------------         
//*  EXTRACT HA3 UIN FOR BOOKED FLAT CASES                                      
//*--------------------------------------------------------------------         
//STEP14  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=&&BP13F800,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=BP13.F803.BKNRIC,DISP=MOD                                      
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,NE,C'    ',AND,                                        
                106,9,CH,NE,C'         ',AND,                                   
                1,1,CH,NE,C'C')                                                 
  OUTREC FIELDS=(4,8,106,9,155,11,1352,8,475,8,924,3,1993,8,45X)                
/*                                                                              
//*--------------------------------------------------------------------         
//*  EXTRACT HA4 UIN FOR BOOKED FLAT CASES                                      
//*--------------------------------------------------------------------         
//STEP15  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=&&BP13F800,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=BP13.F803.BKNRIC,DISP=MOD                                      
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,NE,C'    ',AND,                                        
                115,9,CH,NE,C'         ',AND,                                   
                1,1,CH,NE,C'C')                                                 
  OUTREC FIELDS=(4,8,115,9,155,11,1352,8,475,8,924,3,1993,8,45X)                
//*--------------------------------------------------------------------         
//* SORT BOOKED APPLN NRIC FILE BY REGN/NRIC                                    
//*--------------------------------------------------------------------         
//STEP16  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.F803.BKNRIC,DISP=SHR                                      
//SORTOUT DD DSN=&&BP13F803,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(80,30),RLSE),DATACLAS=MULTIVOL,                        
//           DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
/*                                                                              
//*--------------------------------------------------------------------         
//*  TO DELETE/CREATE SOC BOOK FLAT UIN FILE                                    
//*--------------------------------------------------------------------         
//STEP17    EXEC PGM=IDCAMS                                                     
//INPUT1    DD DSN=&&BP13F803,DISP=(SHR,DELETE)                                 
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL (BP13.K803.BKNRIC) CL PURGE                                       
          DEF CLUSTER                                -                          
              (NAME(BP13.K803.BKNRIC)                -                          
              CYL(80 20)                            -                           
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K803.BKNRIC.DATA)           -                          
              KEYS(17 0)                             -                          
              RECSZ(100 100)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K803.BKNRIC.INDEX)          -                          
              CISZ(4096))                                                       
         IF MAXCC = 0  THEN                          -                          
            REPRO IFILE(INPUT1)                      -                          
              ODS(BP13.K803.BKNRIC)                                             
         IF MAXCC = 0 THEN                     -                                
           DEF AIX (NAME(BP13.K803.BKNRIC.ALTX1) -                              
               REL(BP13.K803.BKNRIC)          -                                 
               CYL(30 5)                      -                                 
               SHR(2 3)                       -                                 
               KEYS(9 8)                      -                                 
               CISZ(4096)                     -                                 
               RECSZ(100 100)                 -                                 
               NUNQK)                                                           
         IF LASTCC = 0 THEN                    -                                
           DEF PATH(NAME(BP13.K803.BKNRIC.PATH1) -                              
               PENT(BP13.K803.BKNRIC.ALTX1))                                    
         IF LASTCC = 0 THEN                    -                                
           BIX IDS(BP13.K803.BKNRIC)           -                                
               ODS(BP13.K803.BKNRIC.ALTX1)                                      
//*=====================================================================        
//* PROCESS FTS                                                                 
//*=====================================================================        
//*---------------------------------------------------------------------        
//* INCLUDE BALLOT-QTR GT 201307 FTS                                            
//*---------------------------------------------------------------------        
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=&&F595D220,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=BP13.F595.BP13D220.FTS,DISP=OLD,                             
//             UNIT=(SYSDA,3),SPACE=(CYL,(300,30),RLSE),                        
//             DATACLAS=MULTIVOL,                                               
//             DCB=(RECFM=FB,LRECL=500)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(476,25,A),FORMAT=CH                                             
   INCLUDE COND=((213,3,CH,EQ,C'FTS',OR,                                        
                  213,3,CH,EQ,C'STS',OR,                                        
                  248,3,CH,EQ,C'SSC',OR,                                        
                  248,3,CH,EQ,C'JSS',OR,                                        
                  248,3,CH,EQ,C'NCS',OR,                                        
                  248,3,CH,EQ,C'SSE',OR,                                        
                  248,3,CH,EQ,C'JSE',OR,                                        
                  248,3,CH,EQ,C'NSE'),AND,                                      
                 (334,6,CH,GE,C'201307'))                                       
//*---------------------------------------------------------------------        
//*- DEFINE BALLOT HISTORY LOG FILE FOR RECORD FROM YEAR 2011                   
//*---------------------------------------------------------------------        
//STEP19   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.F595.BP13D220.FTS,DISP=SHR                               
//SYSIN    DD *                                                                 
         DEL    (BP13.K595.BP13D220.FTS) CLUSTER PURGE                          
         DEF CL (NAME(BP13.K595.BP13D220.FTS)              -                    
                 CYL(150 50)                           -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K595.BP13D220.FTS.DATA)        -                    
                 KEYS(25 475)                          -                        
                 RECSZ(500 500)                        -                        
                 FSPC(10 10)                           -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K595.BP13D220.FTS)                                    
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BP13D220.FTS.ALTX1)     -                    
               REL(BP13.K595.BP13D220.FTS)                 -                    
               CYL(50 20)                              -                        
              UNIQUE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BP13D220.FTS.ALTX1.DATA) -                       
               KEYS(9 40)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BP13D220.FTS.PATH1)     -                    
               PENT(BP13.K595.BP13D220.FTS.ALTX1))                              
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BP13D220.FTS)                 -                    
               ODS(BP13.K595.BP13D220.FTS.ALTX1)                                
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BP13D220.FTS.ALTX2)     -                    
               REL(BP13.K595.BP13D220.FTS)                 -                    
               CYL(30 20)                              -                        
              UNIQUE                                   -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BP13D220.FTS.ALTX2.DATA) -                       
               KEYS(9 81)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BP13D220.FTS.PATH2)     -                    
               PENT(BP13.K595.BP13D220.FTS.ALTX2))                              
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BP13D220.FTS)                 -                    
               ODS(BP13.K595.BP13D220.FTS.ALTX2)                                
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BP13D220.FTS.ALTX3)     -                    
               REL(BP13.K595.BP13D220.FTS)                 -                    
               CYL(30 20)                              -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BP13D220.FTS.ALTX3.DATA) -                       
               KEYS(9 49)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BP13D220.FTS.PATH3)     -                    
               PENT(BP13.K595.BP13D220.FTS.ALTX3))                              
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BP13D220.FTS)                 -                    
               ODS(BP13.K595.BP13D220.FTS.ALTX3)                                
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K595.BP13D220.FTS.ALTX4)     -                    
               REL(BP13.K595.BP13D220.FTS)                 -                    
               CYL(30 20)                              -                        
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K595.BP13D220.FTS.ALTX4.DATA) -                       
               KEYS(9 58)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 5000)                          -                        
               NUNQK)                                                           
         IF MAXCC = 0 THEN                             -                        
           DEF PATH(NAME(BP13.K595.BP13D220.FTS.PATH4)     -                    
               PENT(BP13.K595.BP13D220.FTS.ALTX4))                              
         IF MAXCC = 0 THEN                             -                        
           BIX IDS(BP13.K595.BP13D220.FTS)                 -                    
               ODS(BP13.K595.BP13D220.FTS.ALTX4)                                
//*-----------------------------------------------------------------            
//* MATCH F205 TO GET QTR AS REQUESTED IN SOCY                                  
//* BYPASS MATURE ESTATE                                                        
//*---------------------------------------------------------------------        
//STEP20   EXEC PGM=BP13CY64,COND=(0,NE)                                        
//BP13F595 DD DSN=BP13.F595.BP13D220.FTS,DISP=SHR                               
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=&&F595NTFT,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,3),SPACE=(CYL,(200,50),RLSE),                         
//            DCB=(LRECL=500,RECFM=FB),DATACLAS=MULTIVOL                        
//P13F595B DD DSN=&&F595BFT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,3),SPACE=(CYL,(200,50),RLSE),                         
//            DCB=(LRECL=500,RECFM=FB),DATACLAS=MULTIVOL                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* OMIT CANCELLED CASES, BTO MATURE ESTATE (BM)                                
//* NO RANDOM-NO, UPGRADER                                                      
//*-----------------------------------------------------------------            
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595NTFT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F500.AY0H.FTS,DISP=OLD                                   
//SYSIN   DD  *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=((213,3,CH,EQ,C'FTS',OR,                                        
                  213,3,CH,EQ,C'STS',OR,                                        
                  248,3,CH,EQ,C'SSC',OR,                                        
                  248,3,CH,EQ,C'JSS',OR,                                        
                  248,3,CH,EQ,C'NCS',OR,                                        
                  248,3,CH,EQ,C'SSE',OR,                                        
                  248,3,CH,EQ,C'JSE',OR,                                        
                  248,3,CH,EQ,C'NSE'),AND,                                      
                 (334,6,CH,GE,C'201307'))                                       
    SUM FIELDS=NONE                                                             
//*-----------------------------------------------------------------            
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.AY0H.FTS,DISP=SHR                                   
//SORTOUT  DD DSN=&&F500AY0F,DISP=(,PASS),                                      
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(200,30),RLSE)                                             
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
//*--------------------------------------------------------------------------   
//*  DELETE AND DEFINE BP13K500 FOR TAGGING HA1 CASES                           
//*---------------------------------------------------------------------------  
//STEP23   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&F500AY0F,DISP=(OLD,PASS)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL 'BP13.K500.BP13AY0H.FTS' CLUSTER PURGE                             
         DEF CL (NAME(BP13.K500.BP13AY0H.FTS)          -                        
                 CYL(150 50)                            -                       
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K500.BP13AY0H.FTS.DATA)    -                        
                 KEYS(8 122)                           -                        
                 RECSZ(500 500)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K500.BP13AY0H.FTS)                                    
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K500.BP13AY0H.FTS.ALTX1) -                        
               REL(BP13.K500.BP13AY0H.FTS)             -                        
               CYL(80 30)                                -                      
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K500.BP13AY0H.FTS.ALTX1.DATA) -                       
               KEYS(9 40)                              -                        
               CISZ(4096)                              -                        
               RECSZ(22 1813)                          -                        
               NUNQK)                                                           
         IF LASTCC = 0 THEN                            -                        
           DEF PATH(NAME(BP13.K500.BP13AY0H.FTS.PATH1) -                        
               PENT(BP13.K500.BP13AY0H.FTS.ALTX1))                              
         IF LASTCC = 0 THEN                            -                        
           BIX IDS(BP13.K500.BP13AY0H.FTS)             -                        
               ODS(BP13.K500.BP13AY0H.FTS.ALTX1)                                
