//BP13D305 JOB (BP13P),'BP13D305',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================*           
//* CHG REF  BY    ON       DESCRIPTION                                         
//*--------- --- ---------- -----------                                         
//* BP130068 LJL 24/04/1996 CATER FOR LASER PRINTING OF SOCA LETTER             
//* BP130268 LSB 04/04/1997 OUTPUT REC TO F310.APPOINT ONLY IF                  
//*                         KEY AVAILABLE                                       
//* BP130302 LSB 02/02/1998 DELETE STEP05                                       
//* BP130418 LJL 31/08/1998 Y2K COMPLIANCE CHANGES                              
//*                         - CHANGE SORT RECL FOR BP13K300                     
//* BP130560 SSS 10/08/1998 REMOVE 'END' FROM PRT02 STATEMENT                   
//* BP130539 LLW 23/02/1999 REMOVE "PLAN(BP13C902)" FROM STEP02.                
//* BP130636 LLW 30/03/1999 1)REMOVE "PLAN(BP13C902)" FROM STEP13.              
//*                         2)INCLUDE 'C0' SORT CRITERIA IN STEP12.             
//* BP130757 SSS 25/01/2000 CLASS V FOR 40TH ANNIVERSARY LOGO                   
//* BP130857 SSS 15/05/2000 ADD GROUPID                                         
//* BP130847 CLT 11/05/2000 PRINT REPORT FOR BUY ST/RP/ST CASES                 
//* BP130883 CLT 27/10/2000 REMOVE BP13C904 AND CALL BP13C913                   
//* BP130998 CLT 01/06/2000 REMOVE RUNNING OF BP13C651/BP13C427                 
//* BP132064 CLT 27/12/2001 TC CUTOVER                                          
//* BP132352 CKK 12/06/2003 READ CSM FILE FOR BP13C384                          
//* BP132546 YCH 11/06/2004 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)               
//* BP132998 CLT 21/03/2006 PRINT HLE PROCESSED CASES                           
//* BP133385 CLT 14/07/2008 EXTRACT CASES FOR HLE EXTENSION                     
//* BP133385 CLT 13/08/2008 ADD REPRO TO BP27.F313.TRANS.HLE                    
//* BP133837 LSB 05/03/2010 ADD OPEN FILE MESSAGE                               
//* BP133961 LSB 05/08/2010 DELETE CP16 HOLIDAY FILE                            
//* BP133667 ESD1 19/08/2010 CATER TO RUN BP13C38A TO CREATE                    
//*                          LEAS FILE.                                         
//* BP134003 ESD1 19/08/2010 CATER TO RUN BP13C38B TO CREATE THE                
//*                          MAIL REPORT FOR 2ND CA.                            
//* BP133971 ESD1 13/04/2011 CATER TO RUN BP13C44C TO CREATE THE                
//*                          MAIL REPORT FOR TITLE SEARCH.                      
//* BP134225 ESD1 13/05/2011 CHANGE TEMPORARY MAIL FILE TO DATASET              
//*                          FOR TITLE SEARCH.                                  
//* BP134233 ESD1 19/05/2011 CATER TO ADD BP13C38C                              
//* BP134309 ESA1 26/07/2011 PUT 'END' TO PRT02                                 
//* BP134186 ESD1 09/09/2011 CATER TO ADD SUCCESSFUL REPORT FOR SPU             
//* BP134317 CCC5 15/02/2012 INCLUDE AC20K720 FOR BP13C903                      
//* BP134475 IMC1 28/02/2012 SORT SERS MAIL VIA LOAN TAG BEFORE ADD             
//* BP134496 ZDD1 20/03/2012 ADD BP13CF48 - SEND EMAIL FOR HLE EXTEND           
//* BP134519 AB9  15/05/2012 ADD BP13C0Y1,BP13C0Y2 SEND EMAIL FOR HLE           
//*                              MISMATCH IN LEAS & SOC                         
//* BP134525 AB9  25/05/2012 READ BP13K820 IN BP13C0Y1                          
//* BP134727 CCC5 20/01/2013 INTERFACE FILE FOR RHMS PPS INPUT                  
//* BP134449 ZDD1 05/02/2013 ADD  BP13CF76 AND BP13CF77                         
//* BP134763 LJL1 07/03/2013 ADD  BP13C0FK FOR TOL CASES.                       
//* BP134765 LJL1 15/03/2013 ADD  BP13CH22 AND BP13CH23 FOR                     
//*                               INTERIM REMINDER (EMAIL / SMS)                
//*                               ON 2ND CREDIT ASSESSMENT                      
//* BP134850 PCL4 26/03/2013 TO ADD FT & DESIGN IN BP13C38C                     
//* BP134727 CCC5 05/04/2013 TO ADD IN BP13K800 FOR BP13CD60                    
//* BP134891 ZDD1 17/05/2013 TO ENHANCE INCLUDE COND FOR HLE                    
//* BP135037 ESD1 15/08/2013 TO ADD BP27K800 TO BP13C439 PROGRAM                
//* BP135127 ESA1 08/11/2013 TO REPLACE BP13K275 WITH BP13K277                  
//* BP134709 ESD1 13/11/2013 TO ADD MAIL482 TO SEND CASE W/ CHANGE IN           
//*                          LOAN TAG.                                          
//* BP135147 ESD1 20/11/2013 TO ADD MAILF600 TO SEND CASE W/ CHANGE IN          
//*                          PARTIAL PAYMENT.                                   
//* BP135197 NST1 17/01/2014 TO RELOCATE RESALES CASE REPORT STEPS TO           
//*                          BP13D108 (PROGRAM - BP13C38C)                      
//* BP135171 RJE1 11/02/2014 TO CATER FOR DB2 UPGRADE                           
//* BP135249 ESD1 19/05/2014 TO CATER FOR COURT ORDER DELETED CASES.            
//*                          ADDED NEW PROGRAM BP13C44F.                        
//* BP135318 JGO1 28/05/2014 TO ADD EMAIL ALERT FOR AMR UPDATE THRU KIV         
//* BP135193 JGO1 30/05/2014 UPDATE OUTPUT FOR STEMP MR UPDATE THRU KIV         
//* BP135420 ESD1 20/10/2014 CATER FOR PROCESSING 2ND CA NET LOAN.              
//* BP135711 PCL4 22/05/2015 TO ADD BP13C38L                                    
//* BP135896 KSJ3 22/10/2015 TO ADD BP13C11D BP13C11E BP13C11F                  
//* BP136026 KVL1 11/11/2015 CHANGED STEP27 TO DB2 TRIGGERED STEP               
//* BP136210 PCL4 03/10/2016 TO READ BP13K800/BP27K800 - BP13C38B               
//* BP136025 RJB1 19/10/2016 TO ADD BP13CBA1                                    
//* BP136488 PCL4 24/10/2016 TO ADD BP13C39Q                                    
//* BP136025 RJB1 25/10/2016 TO ADD BP13K410 FILE ON PGM BP13CBA1               
//* BP136468 PCL4 26/10/2016 TO MOVE BP13C39Q FROM STEP59 TO STEP23I            
//* BP136509 RJB1 16/11/2016 RENAME STEP37 OUTPUT / STEP38 INPUT                
//* BP136539 PCL4 23/11/2016 TO REMOVE BP13L38L FROM BP13C38L                   
//* BP136632 KSJ3 13/04/2017 TO EXPAND BP13K600                                 
//* BP136750 PCL4 12/05/2017 TO READ BP13K317 - HLE-EXT FILE (BP13C439)         
//* BP136901 LSB1 24/07/2017 ADD ROF                                            
//* BP136278 LJL1 02/03/2018 TO CATER FOR NEW CRITERION                         
//*                          ON BUYERS WHO ARE BANKRUPTS                        
//* BP137196 LSB1 20/04/2018 AUTO SCHEDULE SOCA APPOINTMENT                     
//* BP137316 DN8  03/10/2018 INCLUDED DD BM06K110 AND BM06K100 IN               
//*                          STEP12F TO INCLUDE NEW FIELDS IN THE               
//*                          SUCCESSFUL AND UNSUCCESSFUL REPORTS.               
//* BP137316 DN8  07/02/2019 INCREASE THE FILES :                               
//*                          BP13.MAILRPT.SECOND.CA.SERS TO 300 BYTES           
//*                          BP13.MAILRPT.SUCCESS.SPU TO 250 BYTES              
//* BP137713 LJL1 12/04/2019 TO CATER FOR 2ND CA USING CPF OA API               
//* BP137786 KV6  09/05/2019 ADD OBF                                            
//* BP137713 KV6  23/09/2019 MATCH BP13F683 AND BP13F310(C5/C6 TRANS)           
//*                          &OUTPUT TO BP13.F683.CPF.BALANCE.A2NDCA            
//* BP138339 KR13 29/06/2020 REMOVED BP13C386 - IOM8 CONVERSION.    *           
//* BP137415 KTM3 19/09/2020 TO STOP EMAIL ALERT FOR BP13C44C       *           
//* BP138865 KR13 28/10/2021 CONVERT REPORTS L11D & L11F TO IOM8.   *           
//*=================================================================*           
//*-----------------------------------------------------------------*           
//*    SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETSETS              *           
//*    PRT01 : FOR CONTROL LISTING            (SALES - AGM TEAM)    *           
//*-----------------------------------------------------------------*           
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------*           
//* PRT02 JDE AND FORM ID                                           *           
//* 'END' REMOVED (ICHGE BP130560 FROM NWP2)                        *           
//*-----------------------------------------------------------------*           
//PRT02    EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1B CP-3',END;                                    
1$DJDE$ JDE=13C222,JDL=BP13,COPIES=3,FONT=R7TIBP,END;                           
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAALAG1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------*           
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                    *           
//* PRT03 : COPIES = 1 ** (SALES - AGM APPOINTMENT TEAM)            *           
//*-----------------------------------------------------------------*           
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1C CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1C                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------*           
//*  VERIFY FILES BEFORE DAILY PRODUCTION RUN                       *           
//*-----------------------------------------------------------------*           
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP27.K310.TRANS,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------*           
//* EMPTY BP13.MAILRPT.SECOND.CA                                    *           
//*-----------------------------------------------------------------*           
//STEP03      EXEC PGM=IDCAMS                                                   
//INPFL   DD DUMMY                                                              
//OUTFL   DD DSN=BP13.MAILRPT.SECOND.CA,DISP=SHR                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPFL) OUTFILE(OUTFL)                                            
//*-----------------------------------------------------------------*           
//* EMPTY BP13.MAILRPT.SECOND.CA.SERS                               *           
//*-----------------------------------------------------------------*           
//STEP04      EXEC PGM=IDCAMS                                                   
//INPFL   DD DUMMY                                                              
//OUTFL   DD DSN=BP13.MAILRPT.SECOND.CA.SERS,DISP=SHR                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  REPRO INFILE(INPFL) OUTFILE(OUTFL)                                            
//*-----------------------------------------------------------------*           
//* PRINT APPOINTMENT LETTER FOR LOOSE CASES (SOC PHASE 3)          *           
//* INCLUDE 'AL'  CASES IN K310 TRANS FILE                          *           
//*-----------------------------------------------------------------*           
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F310,DISP=(NEW,PASS),                                   
//            UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                
      INCLUDE COND=(9,2,CH,EQ,C'AL',OR,                                         
                    9,2,CH,EQ,C'AI',OR,                                         
                    9,2,CH,EQ,C'AS',OR,                                         
                    9,2,CH,EQ,C'AW',OR,                                         
                    9,2,CH,EQ,C'AA')                                            
//*-----------------------------------------------------------------*           
//* UTILITY FOR SEPERATING OCSD CASES IN F310 TRANS FILE.           *           
//*-----------------------------------------------------------------*           
//STEP06   EXEC PGM=BP13C312,REGION=1024K                                       
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BP13F310 DD DSN=&&BP13F310,DISP=(OLD,PASS)                                    
//BP13F311 DD DSN=BP13.F310.TRANS.OCSD,DISP=SHR                                 
//BP13F312 DD DSN=BP13.F310.TRANS.NONOCSD,DISP=SHR                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* ACUMMULATE TO APPOINTMENT FILE FOR LOOSE CASES                  *           
//* TO CFS FOR PRE-ELIG CHECK                                       *           
//*-----------------------------------------------------------------*           
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=BP13.F310.APPOINT,DISP=MOD                                    
//SYSIN    DD *                                                                 
    SORT FIELDS=(9,2,A,1,8,A),FORMAT=CH,FILSZ=E20000                            
    INCLUDE COND=(9,2,CH,EQ,C'AL')                                              
//*-----------------------------------------------------------------*           
//* SORT OUT THE BOOKED FLAT CASES                                  *           
//*-----------------------------------------------------------------*           
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&F310BOOK,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(9,2,A,1,8,A),FORMAT=CH,FILSZ=E20000                            
    INCLUDE COND=(9,2,CH,EQ,C'AI',OR,                                           
                  9,2,CH,EQ,C'AS',OR,                                           
                  9,2,CH,EQ,C'AW',OR,                                           
                  9,2,CH,EQ,C'AA')                                              
//*-----------------------------------------------------------------*           
//* FOR BOOKED CASES, OUTPUT TO CFS FOR PRE-ELIGIBILITY REPORT      *           
//* ONLY IF KEY AVAILABLE CASES                                     *           
//*-----------------------------------------------------------------*           
//STEP09   EXEC PGM=BP13C678,COND=(0,NE)                                        
//BP13F310 DD DSN=&&F310BOOK,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F310A DD DSN=BP13.F310.APPOINT,DISP=MOD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//****************************************************************              
//* EXTRACT DAILY BOOKING CASES TO CREATE INTERFACE FOR RHMS PPS                
//****************************************************************              
//STEP09A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&F310BK,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(10,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                  
    INCLUDE COND=(9,2,CH,EQ,C'AI',OR,                                           
                  9,2,CH,EQ,C'AS',OR,                                           
                  9,2,CH,EQ,C'AW',OR,                                           
                  9,2,CH,EQ,C'AA')                                              
//*******************************                                               
//*CREATE INTERFACE FOR RHMS PPS                                                
//*******************************                                               
//STEP09B  EXEC PGM=BP13CD60,COND=(0,NE)                                        
//BP13F310 DD DSN=&&F310BK,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13F305 DD DSN=BP13.F305.NEW,DISP=MOD                                        
//BP13F30A DD DSN=BP13.F30A.LOG,DISP=MOD                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* EXTRACT CANCELLED/ KEY ISSUED CASES FOR RHMS PPS                            
//*-----------------------------------------------------------------*           
//STEP09C  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K800.APPLN,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13F80C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(600,600),RLSE),                                      
//             DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                              
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,8,A),FORMAT=CH                                             
      INCLUDE COND=(1,1,CH,EQ,C'C')                                             
//*-----------------------------------------------------------------*           
//* CREATE INTERFACE FOR RHMS PPS                                               
//*-----------------------------------------------------------------*           
//STEP09D  EXEC PGM=BP13CD74,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F80C,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13F305 DD DSN=BP13.F305.CANCEL,DISP=MOD                                     
//BP13F30C DD DSN=BP13.F30C.LOG,DISP=MOD                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------*           
//* DEFINE AGREEMENT ORDER FILE                                     *           
//*-----------------------------------------------------------------*           
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//BP13F300 DD DSN=BP13.BLANK.CHAR2000,DISP=OLD                                  
//         DD DSN=BP13.F300.KIVAGR,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL    (BP13.K300.AGRORDER) CL PURGE                                   
         DEF CL (NAME(BP13.K300.AGRORDER)       -                               
                 CYL(5 3)                       -                               
                 DATACLAS(MULTIVOL)             -                               
                 STORCLAS(PRODRLS)               -                              
                 LOG(NONE)                       -                              
                 SPEED                          -                               
                 UNIQUE                         -                               
                 SHR(2 3))                      -                               
                 DATA                           -                               
                 (NAME(BP13.K300.AGRORDER.DATA) -                               
                 KEYS(8 0)                      -                               
                 RECSZ(2000 2000)               -                               
                 CISZ(4096))                    -                               
                 INDEX                          -                               
                 (NAME(BP13.K300.AGRORDER.INDEX))                               
        IF MAXCC = 0 THEN                                                       
           REPRO INFILE(BP13F300) ODS(BP13.K300.AGRORDER)                       
//*-----------------------------------------------------------------*           
//* PREPARE FILE FOR CLEARFILE CHECK FOR FILE RECEIVED CASES        *           
//*-----------------------------------------------------------------*           
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP12,DISP=(NEW,PASS),                                     
//            UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                
      INCLUDE COND=(9,2,CH,EQ,C'FR',OR,                                         
                    9,2,CH,EQ,C'C0')                                            
//*-----------------------------------------------------------------*           
//* PRINT APPOINTMENT LETTER FOR SA, LOOSE CASES(SOC PHASE 3)       *           
//* PRINT APPOINTMENT LETTER FOR SA, AI OR AW(SOC PHASE 3)          *           
//*-----------------------------------------------------------------*           
//STEP12   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&STEP12,DISP=(OLD,PASS)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K277 DD DSN=BP13.K277.OCSCOST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//AC20K700 DD DSN=AC20.K700.REBATE,DISP=SHR                                     
//AC20K710 DD DSN=AC20.K710.CUTOVER,DISP=SHR                                    
//AC20K720 DD DSN=AC20.K720.BLDG.BNDRY,DISP=SHR                                 
//PRTOUT    OUTPUT LINECT=0                                                     
//BP13F311 DD DSN=BP13.F310.TRANS.CFILE,DISP=MOD                                
//BP13L31A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C385) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------*           
//* SORT ALL C5 TRANSACTIONS                                        *           
//*-----------------------------------------------------------------*           
//STEP12A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP12B,DISP=(NEW,PASS),                                    
//            UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(66,24,A),FORMAT=CH,FILSZ=E20000                              
      INCLUDE COND=(9,2,CH,EQ,C'C5')                                            
      SUM FIELDS=NONE                                                           
//*-----------------------------------------------------------------*           
//*RUN BP13C38A TO CREATE LEAS FILE AND MAIL REPORT.                *           
//*-----------------------------------------------------------------*           
//STEP12B  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&STEP12B,DISP=(OLD,PASS)                                     
//BP13E640 DD DSN=BP13.E640.CA.ACTION.LOG,DISP=OLD                              
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                              
//BP17K000 DD DSN=BP17.K000.SCHREF,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K001 DD DSN=BP17.K000.SCHREF.PATH1,DISP=SHR                               
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR,                                 
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//F800LEAS DD DSN=BP13.BP27.F800.SECOND.CA,DISP=MOD                             
//F800MAIL DD DSN=&&MAIL,DISP=(NEW,PASS),                                       
//         SPACE=(TRK,(10,5),RLSE),                                             
//         DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                                    
//F800SERS DD DSN=&&MAIL2,DISP=(NEW,PASS),                                      
//         SPACE=(TRK,(10,5),RLSE),                                             
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                   
//F800RPT1 DD DSN=&&MAIL3,DISP=(NEW,PASS),                                      
//         SPACE=(TRK,(10,5),RLSE),                                             
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C38A) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
//*-----------------------------------------------------------------*           
//* SORT ALL C6 TRANSACTIONS                                 *                  
//*-----------------------------------------------------------------*           
//STEP12A1 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP12B1,DISP=(NEW,PASS),                                   
//            UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                
      INCLUDE COND=(9,2,CH,EQ,C'C6')                                            
//*-----------------------------------------------------------------*           
//*RUN BP13C38A TO CREATE LEAS FILE AND MAIL REPORT.                *           
//*-----------------------------------------------------------------*           
//STEP12B1 EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F310 DD DSN=&&STEP12B1,DISP=(OLD,PASS)                                    
//BP13E640 DD DSN=BP13.E640.CA.ACTION.LOG,DISP=OLD                              
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                              
//BP17K000 DD DSN=BP17.K000.SCHREF,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP17K001 DD DSN=BP17.K000.SCHREF.PATH1,DISP=SHR                               
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR,                                 
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//F800LEAS DD DSN=BP13.BP27.F800.SECOND.CA,DISP=MOD                             
//F800MAIL DD DSN=&&MAIL,DISP=(MOD,PASS),                                       
//         SPACE=(TRK,(10,5),RLSE),                                             
//         DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                                    
//F800SERS DD DSN=&&MAIL2,DISP=(MOD,PASS),                                      
//         SPACE=(TRK,(10,5),RLSE),                                             
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                   
//F800RPT1 DD DSN=&&MAIL3,DISP=(MOD,PASS),                                      
//         SPACE=(TRK,(10,5),RLSE),                                             
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                   
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C38A) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
//*-----------------------------------------------------------------*           
//*SORT DATA ACCORDING TO REGN.                                                 
//*-----------------------------------------------------------------*           
//STEP12C  EXEC SORT                                                            
//SORTIN   DD DSN=&&MAIL,DISP=(OLD,PASS)                                        
//SORTOUT  DD DSN=&&MAILRPT,DISP=(NEW,PASS),                                    
//         SPACE=(TRK,(10,5),RLSE),                                             
//         DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                                    
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                
//*-----------------------------------------------------------------*           
//*SORT DATA ACCORDING TO ADDRESS.                                              
//*-----------------------------------------------------------------*           
//STEP12D  EXEC SORT                                                            
//SORTIN   DD DSN=&&MAIL2,DISP=(OLD,PASS)                                       
//SORTOUT  DD DSN=&&MAILRPT2,DISP=(NEW,PASS),                                   
//         SPACE=(TRK,(10,5),RLSE),                                             
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                   
//SYSIN    DD *                                                                 
      SORT FIELDS=(133,1,A,82,32,A,65,5,A,22,32,A,5,5,A,16,5,A),                
                   FORMAT=CH                                                    
//*-----------------------------------------------------------------*           
//*SORT DATA ACCORDING TO ADDRESS.                                              
//*-----------------------------------------------------------------*           
//STEP12E  EXEC SORT                                                            
//SORTIN   DD DSN=&&MAIL3,DISP=(OLD,PASS)                                       
//SORTOUT  DD DSN=&&MAILRPT3,DISP=(NEW,PASS),                                   
//         SPACE=(TRK,(10,5),RLSE),                                             
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                                   
//SYSIN    DD *                                                                 
      SORT FIELDS=(82,32,A,65,5,A,22,32,A,5,5,A,16,5,A),FORMAT=CH               
//*-----------------------------------------------------------------*           
//*RUN BP13C38B TO CREATE MAIL REPORT.                                          
//*-----------------------------------------------------------------*           
//STEP12F  EXEC PGM=BP13C38B,REGION=1024K                                       
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//MAILFILE DD DSN=&&MAILRPT,DISP=(OLD,PASS)                                     
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//F800MAIL DD DSN=BP13.MAILRPT.SECOND.CA,DISP=SHR                               
//SERSFILE DD DSN=&&MAILRPT2,DISP=(OLD,PASS)                                    
//F800SERS DD DSN=BP13.MAILRPT.SECOND.CA.SERS,DISP=SHR                          
//RPT1FILE DD DSN=&&MAILRPT3,DISP=(OLD,PASS)                                    
//F800RPT1 DD DSN=BP13.MAILRPT.SUCCESS.SPU,DISP=SHR                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//*SORT TITLE SEARCH                                                *           
//*-----------------------------------------------------------------*           
//STEP12G  EXEC SORT                                                            
//SORTIN   DD DSN=BP13.K31A.TITLE.SEARCH,DISP=SHR                               
//SORTOUT  DD DSN=BP13.F31A.TITLE.SEARCH,DISP=SHR                               
//SYSIN    DD *                                                                 
      SORT FIELDS=COPY                                                          
//*-----------------------------------------------------------------*           
//*RUN BP13C44C                                                     *           
//*-----------------------------------------------------------------*           
//STEP12H  EXEC PGM=BP13C44C,REGION=1024K                                       
//BP13F31A DD DSN=BP13.F31A.TITLE.SEARCH,DISP=SHR                               
//MAILFILE DD DSN=BP13.MAILRPT.TITLE.SEARCH,DISP=SHR                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* SORT ALL UC FOR COURT ORDER CASES                               *           
//*-----------------------------------------------------------------*           
//STEP12I  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP12I,DISP=(NEW,PASS),                                    
//            UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                
      INCLUDE COND=(9,2,CH,EQ,C'UC')                                            
//*-----------------------------------------------------------------*           
//*RUN BP13C44F                                                     *           
//*-----------------------------------------------------------------*           
//STEP12J  EXEC PGM=BP13C44F,REGION=1024K                                       
//BP13F310 DD DSN=&&STEP12I,DISP=(OLD,PASS)                                     
//MAILFILE DD DSN=&&MAILC44F,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=132),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* MATCH THE INPUT RECORDS WITH THE BP13K800 NRIC NOS              *           
//*-----------------------------------------------------------------*           
//STEP13   EXEC PGM=BP13C383,REGION=1024K,COND=(0,NE)                           
//BP13F310 DD DSN=&&STEP12,DISP=(OLD,PASS)                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F313 DD DSN=BP13.F313.OUTPUT,DISP=SHR                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* PREPARE FILE FOR PRINTING OF ASSESSMENT MEMO                    *           
//*-----------------------------------------------------------------*           
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F313.OUTPUT,DISP=SHR                                     
//SORTOUT  DD DSN=&&F313,DISP=(NEW,PASS,DELETE),                                
//            UNIT=DISK,SPACE=(CYL,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=50,BLKSIZE=27950)                             
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                
      SUM FIELDS=NONE                                                           
//*-----------------------------------------------------------------*           
//* PRINT ASSESSMENT FORM                                           *           
//*-----------------------------------------------------------------*           
//STEP15   EXEC PGM=IKJEFT01,REGION=1024K,COND=(0,NE),DYNAMNBR=20               
//BP13F313 DD DSN=&&F313,DISP=(OLD,DELETE)                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K110 DD DSN=BB24.K110.UIN,DISP=SHR,                                       
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K010 DD DSN=BB24.K010.MASTER,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB14K580 DD DSN=BB14.K580.UNTLEASE,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13L384 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C384) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------*           
//* SORT THE TRANS FILE TO THE ACCUM TRANS FILE                     *           
//* FOR FILE RECEIVED CASES                                         *           
//*-----------------------------------------------------------------*           
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&STEP12,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=BP13.F310.TRANS.ACCUM,DISP=MOD                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*-----------------------------------------------------------------*           
//* SORT BP27K310                                                   *           
//*-----------------------------------------------------------------*           
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP27.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP27F310,DISP=(NEW,PASS),                                   
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=50,BLKSIZE=0)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  SORT FIELDS=(12,8,CH,A)                                                       
  INCLUDE COND=(1,9,CH,NE,C'         ',AND,                                     
                12,8,CH,NE,C'        ')                                         
/*                                                                              
//*-----------------------------------------------------------------*           
//* RUN BP13C313 FOR PROCESSED HLE CASES                            *           
//*-----------------------------------------------------------------*           
//STEP20   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP27F310 DD DSN=&&BP27F310,DISP=(SHR,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//P13L313A DD SYSOUT=8,DEST=IOM8                                                
//P13L313B DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C313) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------*           
//* SORT BP27K310-INCLUDE REGN=SPACES                               *           
//*-----------------------------------------------------------------*           
//STEP20A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP27.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP27F31A,DISP=(NEW,PASS),                                   
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=50,BLKSIZE=0)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  SORT FIELDS=(1,9,CH,A)                                                        
  INCLUDE COND=(1,9,CH,NE,C'         ',AND,                                     
                12,8,CH,EQ,C'        ')                                         
/*                                                                              
//*-----------------------------------------------------------------*           
//* LEASE TO CHECK CASES ACTIVE IN SOC WITH LOAN-TAG=B OR N         *           
//*-----------------------------------------------------------------*           
//STEP20B  EXEC PGM=BP13C0Y1,COND=(0,NE)                                        
//BP27F310 DD DSN=&&BP27F31A,DISP=(OLD,DELETE)                                  
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR                                
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13F0Y1 DD DSN=BP13.F0Y1.HLE,DISP=SHR                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* SORT BASED ON OIC                                               *           
//*-----------------------------------------------------------------*           
//STEP20C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F0Y1.HLE,DISP=SHR                                        
//SORTOUT  DD DSN=&&BP13F0Y1,DISP=(NEW,PASS),                                   
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                   
//SYSIN DD *                                                                    
  SORT FIELDS=(75,5,A,1,8,A),FORMAT=CH                                          
/*                                                                              
//*-----------------------------------------------------------------*           
//* GENERATE FILE TO SEND CSM                                       *           
//*-----------------------------------------------------------------*           
//STEP20D  EXEC PGM=BP13C0Y2,COND=(0,NE)                                        
//BP13F0Y1 DD DSN=&&BP13F0Y1,DISP=(OLD,DELETE)                                  
//BP13MAIL DD DSN=&&BP13F0Y2,DISP=(NEW,PASS),                                   
//            UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)                             
//P13MAILA DD DSN=&&BP13F0Y3,DISP=(NEW,PASS),                                   
//            UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* DEFINE BP27K310                                                 *           
//*-----------------------------------------------------------------*           
//STEP21 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//BP27F310 DD DSN=BP27.BLANK.CHAR50,DISP=(OLD,PASS)                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL    (BP27.K310.TRANS) CL PURGE                                      
         DEF CL (NAME(BP27.K310.TRANS) -                                        
                 TRK(5 2)                               -                       
                 DATACLAS(MULTIVOL)                     -                       
                 STORCLAS(PRODRLS)                      -                       
                  LOG(NONE)                             -                       
                 UNIQUE                                 -                       
                 SHR(2 3))                              -                       
                 DATA                                   -                       
                 (NAME(BP27.K310.TRANS.DATA)            -                       
                 KEYS(9 0)                             -                        
                 RECSZ(50 50)                           -                       
                 CISZ(4096))                            -                       
                 INDEX                                  -                       
                 (NAME(BP27.K310.TRANS.INDEX))                                  
        IF MAXCC = 0 THEN                                                       
           REPRO INFILE(BP27F310) ODS(BP27.K310.TRANS)                          
//*-----------------------------------------------------------------*           
//* SORT BP13K313 FOR CASES WHERE NEED TO EXTEND HLE VALIDITY       *           
//*-----------------------------------------------------------------*           
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K313.TRANS.HLE,DISP=SHR                                  
//SORTOUT  DD DSN=&&BP13F313,DISP=(NEW,PASS),                                   
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  SORT FIELDS=(1,11,CH,A)                                                       
  INCLUDE COND=(1,02,CH,EQ,C'01')                                               
/*                                                                              
//*-----------------------------------------------------------------*           
//* RUN BP13C439 FOR CASES THAT NEED TO EXTEND HLE EXPIRY           *           
//*-----------------------------------------------------------------*           
//STEP23   EXEC PGM=BP13C439,COND=(0,NE)                                        
//BP13F313 DD DSN=&&BP13F313,DISP=(SHR,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K313 DD DSN=BP13.K313.TRANS.HLE,DISP=SHR                                  
//BP13K317 DD DSN=BP13.K317.HLE.EXTN,DISP=SHR                                   
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//BM06K112 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                              
//BP13F800 DD DSN=BP13.F800.APPLN.HLE,DISP=SHR                                  
//P13L439A DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* SORT BP13K800 FOR CASES WITH HLE EXTENSION                      *           
//*-----------------------------------------------------------------*           
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F800.APPLN.HLE,DISP=SHR                                  
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//         UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                                  
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  SORT FIELDS=(4,8,CH,A)                                                        
  INCLUDE COND=(1375,8,CH,NE,C'        ')                                       
/*                                                                              
//*-----------------------------------------------------------------*           
//* RUN BP13CF48 TO SEND MAIL FOR UPDATED CASES                     *           
//*-----------------------------------------------------------------*           
//STEP23A  EXEC PGM=BP13CF48,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BP13K313 DD DSN=BP13.K313.TRANS.HLE,DISP=SHR                                  
//BP13MAIL DD DSN=&&BP13CF48,DISP=(NEW,PASS),                                   
//            UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT ALL BP13K800 RECORDS WITH HLE TAG OF DEFER DATE                        
//*------------------------------------------------------------------           
//STEP23B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(912,1,CH,EQ,C'Y',OR,1383,8,CH,NE,C'        ')                   
//*------------------------------------------------------------------           
//* SORT ALL BP13K800 RECORDS WITH HLE TAG OF DEFER DATE                        
//*------------------------------------------------------------------           
//STEP23D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F800DATE,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1383,8,CH,NE,C'        ',AND,                                   
                1383,8,CH,NE,C'00000000',AND,                                   
                1383,8,CH,NE,C'CCYYMMDD')                                       
//*------------------------------------------------------------------           
//* GENERATE EMAIL FOR HLE DEFERMENT                                            
//*------------------------------------------------------------------           
//STEP23E  EXEC PGM=BP13CF76,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800DATE,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13MAIL DD DSN=&&BP13CF76,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=80),                                          
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT ALL BP13K800 RECORDS WITH HLE TAG OF DEFER DATE                        
//*------------------------------------------------------------------           
//STEP23F  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F800TAG,DISP=(,PASS),                                       
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(912,1,CH,EQ,C'Y')                                               
//*------------------------------------------------------------------           
//* GENERATE EMAIL FOR HLE DEFERMENT                                            
//*------------------------------------------------------------------           
//STEP23G  EXEC PGM=BP13CF77,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800TAG,DISP=(OLD,DELETE)                                   
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//BP13MAIL DD DSN=&&BP13CF77,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=80),                                          
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//*===================================================================*         
//* SORT BP13.K313.TRANS.HLE                                                    
//*---------------------------------------------------------------------        
//STEP23H  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K313.TRANS.HLE,DISP=SHR                                  
//SORTOUT  DD DSN=&&BP13F31A,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(50,20),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=100)                                             
//SYSIN    DD *                                                                 
       SORT FIELDS=(1,18,A),FORMAT=CH                                           
       INCLUDE COND=(68,1,CH,EQ,C'N')                                           
//*--------------------------------------------------------------------         
//* BP13C39Q - UPDATE BP13K640 - AMT-MAX-LOAN / AMT-ELIG-INSTAL                 
//*--------------------------------------------------------------------         
//STEP23I EXEC    PGM=BP13C39Q,COND=(0,NE)                                      
//BP13F313 DD  DSN=&&BP13F31A,DISP=(OLD,PASS)                                   
//BP13K640 DD  DSN=BP13.K640.CA.ACTION,DISP=SHR                                 
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------*           
//* SORT BP13K313 TO SEQ FILE FOR USED BY BP27D003                  *           
//*-----------------------------------------------------------------*           
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K313.TRANS.HLE,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F313.TRANS.HLE,DISP=SHR                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
  SORT FIELDS=(1,11,CH,A)                                                       
  INCLUDE COND=(1,1,CH,NE,C' ')                                                 
/*                                                                              
//*-----------------------------------------------------------------*           
//* DEFINE BP13K313                                                 *           
//*-----------------------------------------------------------------*           
//STEP25 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//BP13F313 DD DSN=BP13.BLANK.CHAR100,DISP=(OLD,PASS)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL    (BP13.K313.TRANS.HLE) CL PURGE                                  
         DEF CL (NAME(BP13.K313.TRANS.HLE) -                                    
                 TRK(20 10)                             -                       
                 DATACLAS(MULTIVOL)                     -                       
                 STORCLAS(PRODRLS)                      -                       
                  LOG(NONE)                             -                       
                 UNIQUE                                 -                       
                 SHR(2 3))                              -                       
                 DATA                                   -                       
                 (NAME(BP13.K313.TRANS.HLE.DATA)        -                       
                 KEYS(18 0)                             -                       
                 RECSZ(100 100)                         -                       
                 CISZ(4096))                            -                       
                 INDEX                                  -                       
                 (NAME(BP13.K313.TRANS.HLE.INDEX))                              
        IF MAXCC = 0 THEN                                                       
           REPRO INFILE(BP13F313) ODS(BP13.K313.TRANS.HLE)                      
//*-----------------------------------------------------------------*           
//* DEFINE BP13K31A                                                 *           
//*-----------------------------------------------------------------*           
//STEP25A EXEC PGM=IDCAMS,COND=(0,NE)                                           
//BP13F31A DD DSN=BP13.BLANK.CHAR600,DISP=(OLD,PASS)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          DEL  (BP13.K31A.TITLE.SEARCH)  PURGE                                  
          DEF CLUSTER                                -                          
              (NAME(BP13.K31A.TITLE.SEARCH)       -                             
              CYL(30 10)                             -                          
              DATACLAS(MULTIVOL)                     -                          
              UNIQUE                                 -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K31A.TITLE.SEARCH.DATA)  -                             
              KEYS(11 0)                       -                                
              RECSZ(600 600)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K31A.TITLE.SEARCH.INDEX) -                             
              CISZ(4096))                                                       
        IF MAXCC = 0 THEN                                                       
           REPRO INFILE(BP13F31A) ODS(BP13.K31A.TITLE.SEARCH)                   
//*---------------------------------------------------------------------        
//* EXTRACT TO SEQUENTIAL FILE  FOR TOL CASES                                   
//*--------------------------------------------------------------------         
//STEP26 EXEC   SORT                                                            
//SORTIN   DD  DSN=BP13.K462.SOC.TOL,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13FR01,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=1000,RECFM=FB)                              
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,22,A),FORMAT=CH                                                
   INCLUDE COND=(553,1,CH,NE,C'Y')                                              
//*-----------------------------------------------------------------            
//* TO GENERATE EMAIL ALERT FOR SYSTEM MONITORING                               
//*-----------------------------------------------------------------            
//STEP27 EXEC PGM=IKJEFT01,COND=(0,NE),DYNAMNBR=20                              
//BP13K462 DD DSN=BP13.K462.SOC.TOL,DISP=SHR                                    
//BP13F462 DD DSN=&&BP13FR01,                                                   
//          DISP=(OLD,PASS)                                                     
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K450  DD DSN=BP13.K454.APPTABLE,DISP=SHR                                  
//BP13K451  DD DSN=BP13.K454.APPTABLE.PATH1,DISP=SHR                            
//BB24K010  DD DSN=BB24.K010.MASTER,DISP=SHR                                    
//BB24K011  DD DSN=BB24.K010.MASTER.PATH1,DISP=SHR                              
//BB24K130  DD DSN=BB24.K130.CANCEL,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F0FK  DD DSN=BP13.MAILOUT.SOC.RSLCOMP,DISP=SHR                            
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD  *                                                                
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13C0FK) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT OUT BM06 BLOCK SUMMARY ON PACD DATES                                   
//*-----------------------------------------------------------------            
//STEP28   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT DD  DSN=&&BM06K100,                                                   
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(25,8),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
   INCLUDE COND=(465,4,CH,GT,C'0000')                                           
//*-----------------------------------------------------------------            
//* EXTRACT REGN NOS WITH PCD OF 1 YR FROM CURRENT DATE                         
//*-----------------------------------------------------------------            
//STEP29 EXEC PGM=BP13CH22                                                      
//BM06F100  DD DSN=&&BM06K100,DISP=(OLD,PASS)                                   
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                             
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13FOUT DD  DSN=&&BP13FR02,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=50,RECFM=FB)                                
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* EXTRACT REGN NOS WITH VALID CASE STATUS USING DATA FROM BP13CH22            
//*-----------------------------------------------------------------            
//STEP30 EXEC PGM=BP13CH23,COND=(0,NE)                                          
//BP13FAIN DD  DSN=&&BP13FR02,                                                  
//             DISP=(OLD,PASS)                                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR,                                   
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13FR00  DD DSN=BP13.FR00.PACD.ONEYR,DISP=MOD                                
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//**********************************************************************        
//*SORT BP13K482 FOR UPDATED LOAN TAG                                           
//**********************************************************************        
//STEP31   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K482.FLATSOLD.BFSL,DISP=SHR                              
//SORTOUT  DD DSN=&&BP13F82,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=1000),                                        
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(546,1,CH,EQ,C'Y',AND,547,1,CH,EQ,C'Y')                          
//**********************************************************************        
//*RUN BP13C44D TO CREATE MAIL482                                               
//**********************************************************************        
//STEP32   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F482 DD DSN=&&BP13F82,DISP=(OLD,PASS)                                     
//BP13K482 DD DSN=BP13.K482.FLATSOLD.BFSL,DISP=SHR,                             
//          AMP=('BUFND=4','BUFNI=8')                                           
//MAILF482 DD DSN=&&MAILF482,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=132),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C44D) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//**********************************************************************        
//*SORT BP13K600 FOR CPF WITHDRAWAL AMENDMENT                                   
//**********************************************************************        
//STEP33   EXEC SORT,CYL=30                                                     
//SORTIN   DD DSN=BP13.K600.CPFWDL,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F600,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=1800),                                        
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(725,1,CH,EQ,C'Y')                                               
//**********************************************************************        
//*SORT BP13C44E TO CREATE MAILF600                                             
//**********************************************************************        
//STEP34   EXEC PGM=BP13C44E,COND=(0,NE)                                        
//BP13F600 DD DSN=&&BP13F600,DISP=(OLD,PASS)                                    
//BP13K600 DD DSN=BP13.K600.CPFWDL,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//MAILF600 DD DSN=&&MAILF600,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=132),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//STEP35   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K310.TRANS,                                             
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13AMR1,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(TRK,(150,20),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(124,2,A,61,3,A,64,2,A,1,8,A),FORMAT=CH                         
   INCLUDE COND=(9,2,CH,EQ,C'AM')                                               
/*                                                                              
//*-----------------------------------------------------------------            
//*  PRINT EMAIL ALERT FOR AMR UPDATES                                          
//*-----------------------------------------------------------------            
//STEP36 EXEC    PGM=BP13C05C,COND=(0,NE)                                       
//BP13F310 DD  DSN=&&BP13AMR1,                                                  
//             DISP=(OLD,PASS)                                                  
//BP13FRPT DD DSN=&&AMREML01,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=130),                                         
//            SPACE=(CYL,(10,10),RLSE)                                          
//SY08K010 DD DSN=SY08.K010.USERID,DISP=SHR                                     
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*===================================================================*         
//*---------------------------------------------------------------------        
//* SORT BP13K800                                                               
//*---------------------------------------------------------------------        
//STEP37   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F800L,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=2000)                                            
//SYSIN    DD *                                                                 
       SORT FIELDS=(4,8,A),FORMAT=CH                                            
       INCLUDE COND=(1294,1,CH,EQ,C'B',AND,                                     
                      1401,1,CH,NE,C' ',AND,                                    
                      1736,1,CH,NE,C'Y',AND,                                    
                      233,1,CH,EQ,C' ')                                         
//*--------------------------------------------------------------------         
//* BP13C38L - PRINT BUY FIRST CASES WITH NO LA APPOINTMENT                     
//*--------------------------------------------------------------------         
//STEP38   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD  DSN=&&P13F800L,DISP=(OLD,PASS)                                   
//BP13K022 DD  DSN=BP13.K022.WISOIC,DISP=SHR                                    
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                              
//BP27K800 DD  DSN=BP27.K800.HLAPPLN,DISP=SHR                                   
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                                     
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR                                   
//MAILC38L DD  DSN=BP13.MAILRPT.BP13L38L,DISP=SHR                               
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C38L) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//******************************************************************            
//*                                                                             
//*  SOCA/TP/SATP PRE-ECHECK BATCH PROCESSING                                   
//*                                                                             
//******************************************************************            
//*-----------------------------------------------------------------            
//*  EXTRACT APPLN RECORDS FOR SOCA                                             
//*-----------------------------------------------------------------            
//STEP39   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F80D,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=((1,1,CH,NE,C'C'),AND,                                           
    (4,1,CH,NE,C'5',AND,4,1,CH,NE,C'6'),AND,                                    
    (155,11,CH,NE,C'        ',AND,155,11,BI,NE,X'00'),AND,                      
    (924,3,CH,EQ,C'BTO',OR,924,3,CH,EQ,C'SBF',OR,                               
     924,3,CH,EQ,C'ROF',OR,924,3,CH,EQ,C'OBF'),AND,                             
    (365,8,CH,EQ,C'        ',OR,365,8,BI,EQ,X'00',OR,                           
     365,8,CH,EQ,C'00000000'),AND,                                              
    (451,8,CH,EQ,C'        ',OR,451,8,BI,EQ,X'00',OR,                           
     451,8,CH,EQ,C'00000000'))                                                  
//*                                                                             
//*-----------------------------------------------------------------            
//*  EXTRACT SOCA SUMMARY COUNT AND REGN LIST FOR PRE-ECHECK                    
//*-----------------------------------------------------------------            
//STEP40   EXEC PGM=BP13C11D,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F80D,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13FB46 DD DSN=BP13.FB46.SOCACNT,DISP=OLD                                    
//BP13FB47 DD DSN=BP13.FB47.SOCAREGN,DISP=OLD                                   
//BP13L11D DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* EXTRACT BP13F800 FOR AUTO SCHEDULE SOCA                                     
//* NO DTE-SALE-AGMT,SERS, DATE-BALLOT FROM 2017                                
//*---------------------------------------------------------------------        
//STEP40A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F800AUTO,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                                 
//         SPACE=(CYL,(100,20),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C'C',AND,                                            
               155,4,CH,NE,C'    ',AND,                                         
               459,8,CH,EQ,C'        ',AND,                                     
               785,6,CH,GE,C'201702',AND,                                       
               924,3,CH,NE,C'SER')                                              
//*-----------------------------------------------------------------            
//* GENERATE FILE ON APPLICATIONS READY TO SIGN AGREEMENT FOR LEASE             
//*-----------------------------------------------------------------            
//STEP40B  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&F800AUTO,DISP=(OLD,PASS)                                    
//BP13KQ10 DD DSN=BP13.KQ10.DOC.TBL,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//            AMP=('BUFNI=4','BUFND=8')                                         
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=4','BUFND=8')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BR10K010 DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K20A DD DSN=BP13.K20A.SAPORTAL,DISP=SHR,                                  
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13F322 DD DSN=BP13.LZ37A.REPORT,DISP=OLD,                                   
//            DCB=(BLKSIZE=0,LRECL=400,RECFM=FB),                               
//            SPACE=(CYL,(10,10),RLSE)                                          
//P13F322A DD DSN=BP13.LZ37B.REPORT,DISP=OLD,                                   
//            DCB=(BLKSIZE=0,LRECL=400,RECFM=FB),                               
//            SPACE=(CYL,(10,10),RLSE)                                          
//P13F322B DD DSN=BP13.LZ37C.REPORT,DISP=OLD,                                   
//            DCB=(BLKSIZE=0,LRECL=400,RECFM=FB),                               
//            SPACE=(CYL,(10,10),RLSE)                                          
//P13F800A DD DSN=BP13.F800.APPLN.LZ37A,DISP=OLD,                               
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(10,10),RLSE)                                          
//P13F800B DD DSN=BP13.F800.APPLN.LZ37B,DISP=OLD,                               
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(10,10),RLSE)                                          
//P13F800C DD DSN=BP13.F800.APPLN.LZ37C,DISP=OLD,                               
//            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                              
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
   DSN SYSTEM(DSN)                                                              
   RUN PROGRAM(BP13CZ37) PLAN(BP13PCC) -                                        
       LIB('BP13.BATCH.LOADCOB')                                                
   END                                                                          
//*---------------------------------------------------------------------        
//STEP40C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F800.APPLN.LZ37A,DISP=SHR                                
//         DD DSN=BP13.F800.APPLN.LZ37B,DISP=SHR                                
//SORTOUT  DD DSN=&&F800LZ37,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                                 
//         SPACE=(CYL,(100,20),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//*  EXTRACT SOCA SUMMARY COUNT AND REGN LIST FOR PRE-ECHECK                    
//*-----------------------------------------------------------------            
//STEP40D  EXEC PGM=BP13C11D,COND=(0,NE),PARM='-A'                              
//BP13F800 DD DSN=&&F800LZ37,DISP=(OLD,PASS)                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13FB46 DD DSN=BP13.FB46.SOCACNT,DISP=MOD                                    
//BP13FB47 DD DSN=BP13.FB47.SOCAREGN,DISP=MOD                                   
//BP13L11D DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                              *         
//*-------------------------------------------------------------------*         
//STEP40E  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F800.APPLN.LZ37A,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.F800.APPLN.LZ37A.BKUP(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)                  
//*                                                                             
//INPUT2   DD DSN=BP13.F800.APPLN.LZ37B,DISP=SHR                                
//OUTPUT2  DD DSN=BP13.F800.APPLN.LZ37B.BKUP(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)                  
//*                                                                             
//INPUT3   DD DSN=BP13.F800.APPLN.LZ37C,DISP=SHR                                
//OUTPUT3  DD DSN=BP13.F800.APPLN.LZ37C.BKUP(+1),DISP=(NEW,CATLG),              
//            SPACE=(CYL,(10,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=18000,LRECL=2000,RECFM=FB)                  
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*-----------------------------------------------------------------            
//*  SORT SOCA SUMMARY COUNT BY KEY                                             
//*-----------------------------------------------------------------            
//STEP41   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB46.SOCACNT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB46.SOCACNT,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,9,CH,A)                                                      
    SUM FIELDS=NONE                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//*  SORT SOCA REGN LIST BY KEY                                                 
//*-----------------------------------------------------------------            
//STEP42   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB47.SOCAREGN,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.FB47.SOCAREGN,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,26,CH,A)                                                     
    SUM FIELDS=NONE                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//*  REDEFINE BP13.KB46.SOCACNT                                                 
//*-----------------------------------------------------------------            
//STEP43   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.FB46.SOCACNT,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
     DEL 'BP13.KB46.SOCACNT' CL PURGE                                           
     DEF CL    (NAME(BP13.KB46.SOCACNT)               -                         
                CYL(10 5)                            -                          
                UNIQUE                                -                         
                SPEED                                 -                         
                STORCLAS(PRODRLS)                     -                         
                LOG(NONE)                             -                         
                SHR(2 3))                             -                         
         DATA  (NAME(BP13.KB46.SOCACNT.DATA)          -                         
                KEYS(9 0)                             -                         
                RECSZ(400 400)                        -                         
                FSPC(10 10)                           -                         
                CISZ(4096))                           -                         
         INDEX (NAME(BP13.KB46.SOCACNT.INDEX)         -                         
                CISZ(4096))                                                     
     IF LASTCC = 0 THEN                               -                         
        REPRO IFILE(INPUT)                            -                         
              ODS(BP13.KB46.SOCACNT)                                            
//*                                                                             
//*-----------------------------------------------------------------            
//*  REDEFINE BP13.FB47.SOCAREGN                                                
//*-----------------------------------------------------------------            
//STEP44   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.FB47.SOCAREGN,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
     DEL 'BP13.KB47.SOCAREGN' CL PURGE                                          
     DEF CL    (NAME(BP13.KB47.SOCAREGN)              -                         
                CYL(30 20)                            -                         
                UNIQUE                                -                         
                SPEED                                 -                         
                STORCLAS(PRODRLS)                     -                         
                LOG(NONE)                             -                         
                SHR(2 3))                             -                         
         DATA  (NAME(BP13.KB47.SOCAREGN.DATA)         -                         
                KEYS(26 0)                            -                         
                RECSZ(400 400)                        -                         
                FSPC(10 10)                           -                         
                CISZ(4096))                           -                         
         INDEX (NAME(BP13.KB47.SOCAREGN.INDEX)        -                         
                CISZ(4096))                                                     
     IF LASTCC = 0 THEN                               -                         
        REPRO IFILE(INPUT)                            -                         
              ODS(BP13.KB47.SOCAREGN)                                           
//*                                                                             
//*-----------------------------------------------------------------            
//*  EXTRACT SOC APPLN RECORDS FOR TP                                           
//*-----------------------------------------------------------------            
//STEP45   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F80E,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=((1,1,CH,NE,C'C'),AND,                                           
                (4,1,CH,NE,C'5',AND,4,1,CH,NE,C'6'),AND,                        
                (155,11,CH,NE,C'        ',AND,155,11,BI,NE,X'00'),AND,          
                (365,8,CH,NE,C'        ',AND,365,8,BI,NE,X'00',AND,             
                 365,8,CH,NE,C'00000000'),AND,                                  
                (459,8,CH,NE,C'        ',AND,459,8,BI,NE,X'00',AND,             
                 459,8,CH,NE,C'00000000'),AND,                                  
                (475,8,CH,NE,C'        ',AND,475,8,BI,NE,X'00',AND,             
                 475,8,CH,NE,C'00000000'))                                      
//*                                                                             
//*-----------------------------------------------------------------            
//*  EXTRACT TP REGN LIST FOR PRE-ECHECK                                        
//*-----------------------------------------------------------------            
//STEP46   EXEC PGM=BP13C11E,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F80E,DISP=(OLD,DELETE)                                  
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K30A DD DSN=BP13.K30A.TPPORTAL,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13FB48 DD DSN=BP13.FB48.TPREGN,DISP=OLD                                     
//BP13L11E DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*  SORT TP REGN LIST BY KEY                                                   
//*-----------------------------------------------------------------            
//STEP47   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB48.TPREGN,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.FB48.TPREGN,DISP=SHR                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,24,CH,A)                                                     
//*                                                                             
//*-----------------------------------------------------------------            
//*  REDEFINE BP13.KB48.TPREGN                                                  
//*-----------------------------------------------------------------            
//STEP48   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.FB48.TPREGN,DISP=SHR                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
     DEL 'BP13.KB48.TPREGN' CL PURGE                                            
     DEF CL    (NAME(BP13.KB48.TPREGN)                -                         
                CYL(20 10)                            -                         
                UNIQUE                                -                         
                SPEED                                 -                         
                STORCLAS(PRODRLS)                     -                         
                LOG(NONE)                             -                         
                SHR(2 3))                             -                         
         DATA  (NAME(BP13.KB48.TPREGN.DATA)           -                         
                KEYS(14 0)                            -                         
                RECSZ(400 400)                        -                         
                FSPC(10 10)                           -                         
                CISZ(4096))                           -                         
         INDEX (NAME(BP13.KB48.TPREGN.INDEX)          -                         
                CISZ(4096))                                                     
     IF LASTCC = 0 THEN                               -                         
        REPRO IFILE(INPUT)                            -                         
              ODS(BP13.KB48.TPREGN)                   -                         
              REUSE                                                             
     IF MAXCC = 0 THEN                                -                         
       DEF AIX (NAME(BP13.KB48.TPREGN.ALTX1)          -                         
           REL(BP13.KB48.TPREGN)                      -                         
           CYL(20 10)                                 -                         
           SHR(2 3)                                   -                         
           UNIQUE                                     -                         
           KEYS(8 6)                                  -                         
           CISZ(4096)                                 -                         
           RECSZ(400 400)                             -                         
           NUNQK)                                                               
     IF LASTCC = 0 THEN                               -                         
       DEF PATH(NAME(BP13.KB48.TPREGN.PATH1)          -                         
           PENT(BP13.KB48.TPREGN.ALTX1))                                        
     IF LASTCC = 0 THEN                               -                         
       BIX IDS(BP13.KB48.TPREGN)                      -                         
           ODS(BP13.KB48.TPREGN.ALTX1)                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*  EXTRACT SOC APPLN RECORDS FOR SATP PRE-ECHECK                              
//*-----------------------------------------------------------------            
//STEP49   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F80F,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=COPY                                                              
  INCLUDE COND=((1,1,CH,NE,C'C'),AND,                                           
                (4,1,CH,NE,C'5',AND,4,1,CH,NE,C'6'),AND,                        
                (155,11,CH,NE,C'        ',AND,155,11,BI,NE,X'00'),AND,          
                (365,8,CH,EQ,C'        ',OR,365,8,BI,EQ,X'00',OR,               
                 365,8,CH,EQ,C'00000000'),AND,                                  
                (459,8,CH,EQ,C'        ',OR,459,8,BI,EQ,X'00',OR,               
                 459,8,CH,EQ,C'00000000'))                                      
//*                                                                             
//*-----------------------------------------------------------------            
//*  EXTRACT SATP SUMMARY COUNT AND REGN LIST FOR PRE-ECHECK                    
//*-----------------------------------------------------------------            
//STEP50   EXEC PGM=BP13C11F,COND=(0,NE)                                        
//BP13F800 DD DSN=&&BP13F80F,DISP=(OLD,DELETE)                                  
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13FB41 DD DSN=BP13.FB41.SATPCNT,DISP=OLD                                    
//BP13FB42 DD DSN=BP13.FB42.SATPREGN,DISP=OLD                                   
//BP13L11F DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*  SORT SATP SUMMARY COUNT BY KEY                                             
//*-----------------------------------------------------------------            
//STEP51   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB41.SATPCNT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB41.SATPCNT,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,7,CH,A)                                                      
//*                                                                             
//*-----------------------------------------------------------------            
//*  SORT SATP REGN LIST BY KEY                                                 
//*-----------------------------------------------------------------            
//STEP52   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB42.SATPREGN,DISP=SHR                                   
//SORTOUT  DD DSN=BP13.FB42.SATPREGN,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,24,CH,A)                                                     
//*                                                                             
//*-----------------------------------------------------------------            
//*  REDEFINE BP13.KB41.SATPCNT                                                 
//*-----------------------------------------------------------------            
//STEP53   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.FB41.SATPCNT,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
     DEL 'BP13.KB41.SATPCNT' CL PURGE                                           
     DEF CL    (NAME(BP13.KB41.SATPCNT)               -                         
                CYL(10 5)                             -                         
                UNIQUE                                -                         
                SPEED                                 -                         
                STORCLAS(PRODRLS)                     -                         
                LOG(NONE)                             -                         
                SHR(2 3))                             -                         
         DATA  (NAME(BP13.KB41.SATPCNT.DATA)          -                         
                KEYS(7 0)                             -                         
                RECSZ(400 400)                        -                         
                FSPC(10 10)                           -                         
                CISZ(4096))                           -                         
         INDEX (NAME(BP13.KB41.SATPCNT.INDEX)         -                         
                CISZ(4096))                                                     
     IF LASTCC = 0 THEN                               -                         
        REPRO IFILE(INPUT)                            -                         
              ODS(BP13.KB41.SATPCNT)                                            
//*                                                                             
//*-----------------------------------------------------------------            
//*  REDEFINE BP13.KB42.SATPREGN                                                
//*-----------------------------------------------------------------            
//STEP54   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.FB42.SATPREGN,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
     DEL 'BP13.KB42.SATPREGN' CL PURGE                                          
     DEF CL    (NAME(BP13.KB42.SATPREGN)              -                         
                CYL(10 5)                             -                         
                UNIQUE                                -                         
                SPEED                                 -                         
                STORCLAS(PRODRLS)                     -                         
                LOG(NONE)                             -                         
                SHR(2 3))                             -                         
         DATA  (NAME(BP13.KB42.SATPREGN.DATA)         -                         
                KEYS(24 0)                            -                         
                RECSZ(400 400)                        -                         
                FSPC(10 10)                           -                         
                CISZ(4096))                           -                         
         INDEX (NAME(BP13.KB42.SATPREGN.INDEX)        -                         
                CISZ(4096))                                                     
     IF LASTCC = 0 THEN                               -                         
        REPRO IFILE(INPUT)                            -                         
              ODS(BP13.KB42.SATPREGN)                                           
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BP13K800 TO INCLUDE ONLY PARENT/CHILD = P                              
//*---------------------------------------------------------------------        
//STEP55   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F800A,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                              
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,08,A),FORMAT=CH                                                
  INCLUDE COND=(208,1,CH,EQ,C'P')                                               
//*---------------------------------------------------------------------        
//* SORT BP13F491 BY REGN                                                       
//*---------------------------------------------------------------------        
//STEP56   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F491.EMAIL,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F491,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(50,30),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,08,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* TO SURFACE AN EMAIL ALERT EVERYTIME PCD IS UPDATED                          
//*---------------------------------------------------------------------        
//STEP57   EXEC PGM=BP13CBA1,COND=(0,NE)                                        
//BP13F491 DD DSN=&&BP13F491,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=&&P13F800A,DISP=(OLD,PASS)                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LBA1 DD DSN=BP13.MAILOUT.CBA1,DISP=OLD                                    
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13T.K800.APPLN FOR BALLOT 201602 OR LATER                            
//*---------------------------------------------------------------------        
//STEP58   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F801,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,10),RLSE),                             
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(785,06,CH,GE,C'201602',AND,                                     
                509,06,CH,GE,C'201803',AND,                                     
                155,11,CH,LE,C'0')                                              
//*---------------------------------------------------------------------        
//* ENHANCE SOC TO CATER FOR NEW CRITERION ON BUYERS WHO ARE BANKRUPTS          
//*---------------------------------------------------------------------        
//STEP59  EXEC PGM=BP13C41J,COND=(0,NE)                                         
//BP13F800 DD DSN=&&BP13F801,DISP=(OLD,PASS)                                    
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L41J DD DSN=BP13.L41J.OUTPUT.MAIL,DISP=SHR                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//*-----------------------------------------------------------------*           
//* SORT ALL C5 AND C6 TRANSACTIONS                                 *           
//*-----------------------------------------------------------------*           
//STEP60A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K310.TRANS,DISP=SHR                                      
//SORTOUT  DD DSN=&&STEP60A,DISP=(NEW,PASS),                                    
//            UNIT=DISK,SPACE=(TRK,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=150,BLKSIZE=23400)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH                                             
      INCLUDE COND=(9,2,CH,EQ,C'C5',OR,9,2,CH,EQ,C'C6')                         
      SUM FIELDS=NONE                                                           
//*-----------------------------------------------------------------*           
//* SORT BP13K683 BY REGN                                                       
//*-----------------------------------------------------------------*           
//STEP60B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K683.CPF.BALANCE,DISP=SHR                                
//SORTOUT  DD DSN=&&STEP60B,DISP=(NEW,PASS),                                    
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* MATCH C5/C6 TRANSACTIONS AND BP13F683                                       
//*---------------------------------------------------------------------        
//STEP60C  EXEC SORT,COND=(0,NE)                                                
//SORTJNF1 DD DSN=&&STEP60A,DISP=(OLD,PASS)                             00005003
//SORTJNF2 DD DSN=&&STEP60B,DISP=(OLD,PASS)                             00006003
//MATCH    DD DSN=BP13.F683.CPF.BALANCE.A2NDCA,DISP=SHR                 00007003
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(1,8,A)                                      00009403
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                      00009503
   REFORMAT FIELDS=(F2:1,2000)                                          00009703
   OUTFILE FNAMES=MATCH                                                 00009802
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*---------------------------------------------------------------------        
//* SORT BP13.F683.CPF.BALANCE.A2NDCA TO BE IN REGN ORDER                       
//*---------------------------------------------------------------------        
//STEP60   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.F683.CPF.BALANCE.A2NDCA,DISP=OLD                        
//SORTOUT  DD  DSN=&&BP13F683,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(10,10),RLSE),                             
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* ENHANCE SOC TO CATER FOR SECOND CA WITHOUT BATCH CPF OA                     
//*---------------------------------------------------------------------        
//STEP61   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13F683,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=BP13.K683.CPF.SECONDCA,DISP=SHR                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
//*-----------------------------------------------------------------*           
//*                        END OF BP13D305                          *           
//*-----------------------------------------------------------------*           
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC WTOG,COND=(0,NE)                                                
   ----> ############################################                           
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13D305                             
   ---->    PLEASE OPEN BP27K310.                                               
   ----> ############################################                           
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP31   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.SECOND.CA,DISP=SHR                               
//*-----------------------------------------------------------------            
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//*STEP32   EXEC SENDMAIL,COND=(4,LT)                                           
//*INPUT    DD DSN=BP13.MAILRPT.TITLE.SEARCH,DISP=SHR                           
//*-----------------------------------------------------------------            
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP33   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.SECOND.CA.SERS,DISP=SHR                          
//*-----------------------------------------------------------------            
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP35   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.SUCCESS.SPU,DISP=SHR                             
//*-----------------------------------------------------------------            
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP36   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13CF48,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP37   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13F0Y2,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP38   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13F0Y3,DISP=(OLD,DELETE)                                  
//*-----------------------------------------------------------------            
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP39   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13CF76,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP40   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13CF77,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP41   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILOUT.SOC.RSLCOMP,DISP=SHR                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP42   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&MAILF482,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP43   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&MAILF600,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP44   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&MAILC44F,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP45   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&AMREML01,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL (BP13C38L)                                            
//*-----------------------------------------------------------------            
//STEP46   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=BP13.MAILRPT.BP13L38L,DISP=SHR                                
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP48   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.CBA1,DISP=SHR                                    
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP51   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.L41J.OUTPUT.MAIL,DISP=SHR                                
/*                                                                              
//*-----------------------------------------------------------------            
//*  END OF BP13D305 JOB                                                        
//*-----------------------------------------------------------------            
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
