//BP13W101 JOB (BP13P),'BP13W101',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB02291
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================== 00130010
//* REPORT TO BQG                                                       00130010
//*==================================================================== 00130010
//* CHG REF  BY   ON       DESCRIPTION                                          
//* BP135970 ZDD1 28/01/16 NEW JCL REPORT OF NO OF KEY ISSUED TO SEND           
//*                        VIA EMAIL                                            
//* BP136522 PCL4 29/12/16 TO ADD BP13C38Z                                      
//* BP136961 zdd1 12/09/17 change email recpnt                                  
//* BP138701 KV8  09/07/21 SORTING FILE DESENDENT ORDER & CHANGED SAS           
//*                        TEXT                                                 
//*==================================================================== 00130010
//*-----------------------------------------------------------------    00130010
//* COL 417 FIRST SALES DATA                                            00130010
//* COL 425 HANDOVER DATE                                               00130010
//*-----------------------------------------------------------------    00130010
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                 00130010
//SORTIN   DD DSN=BM06.K100.BLOCK,DISP=SHR,                             00130010
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&BM06F100,DISP=(,PASS),                              00130010
//         UNIT=SYSDA,                                                  00130010
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                          00130010
//         SPACE=(CYL,(30,10),RLSE)                                     00130010
//SYSIN    DD *                                                         00130010
   SORT FIELDS=(1,16,A),FORMAT=CH                                       00130010
   INCLUDE COND=(23,1,CH,EQ,C'I',AND,                                           
                417,4,CH,GE,C'2010')                                            
//*-----------------------------------------------------------------    00130010
//* COL 425 HANDOVER DATE                                               00130010
//* COL 433 KEY ISSUE DATE                                              00130010
//*-----------------------------------------------------------------    00130010
//STEP01A  EXEC SORT,CYL=30,COND=(0,NE)                                 00130010
//SORTIN   DD DSN=BM06.K100.BLOCK,DISP=SHR,                             00130010
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&BM06F101,DISP=(,PASS),                              00130010
//         UNIT=SYSDA,                                                  00130010
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=0),                          00130010
//         SPACE=(CYL,(30,10),RLSE)                                     00130010
//SYSIN    DD *                                                         00130010
   SORT FIELDS=(1,11,A,425,8,D,433,8,D),FORMAT=CH                       00130010
   INCLUDE COND=(23,1,CH,EQ,C'I',AND,                                           
                417,4,CH,GE,C'2010')                                            
/*                                                                              
//*--------------------------------------------------------------------         
//* REPORT TO BQG ON CASES WITH SO-APPOINTMENT-DATE                             
//*--------------------------------------------------------------------         
//STEP02   EXEC  PGM=BP13C492,COND=(0,NE)                                       
//BM06F10A DD DSN=&&BM06F101,DISP=(OLD,PASS)                                    
//BM06F100 DD DSN=&&BM06F100,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                             
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K120 DD DSN=BM06.K115.DELFIS,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K121 DD DSN=BM06.K115.DELFIS.PATH2,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BM06K130 DD DSN=BM06.K130.BLOCK.PIDB,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L492 DD DSN=BP13.L492.BP13L492,DISP=SHR                                   
//BP13KEY1 DD DUMMY                                                             
//BP13FOR1 DD DUMMY                                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*****************************************************************             
//*         AUTO-GENERATE MAIL HEADER PART I                                    
//*         HELO SGPHDBX                                                        
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                        
//*****************************************************************             
//STEP03   EXEC PGM=IRXJCL,PARM='SMTPHDR'                                       
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//SMTPHDR  DD  DSN=&&P13HDG1,DISP=(NEW,PASS),                                   
//         SPACE=(CYL,(1,1)),DCB=(DSORG=PS,LRECL=499,RECFM=VB)                  
//SYSTSIN  DD  DUMMY                                                            
//*                                                                             
//*****************************************************************             
//*         CREATE EMAIL RECIPIENT AND SUBJECT                                  
//*****************************************************************             
//STEP04    EXEC SAS,OPTIONS='MACRO'                                            
//SYSOUT   DD SYSOUT=*                                                          
//BP13RCPT DD DSN=&&BP13RCPT,DISP=(NEW,PASS),                                   
//         LRECL=500,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(CYL,(30,10),RLSE)                                     00130010
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DATA _NULL_;                                                                
        FILE BP13RCPT;                                                          
        PUT @01 'RCPT TO:<HDB-BSCDall@hdb.gov.sg>';                             
        PUT @01 'DATA                                    ';                     
        PUT @01 'FROM:SOC SYSTEM-EMAIL ALERT             ';                     
        PUT @01 'TO:HDB-BSCDall@hdb.gov.sg';                                    
        PUT @01 'SUBJECT: BSC - NO. OF KEYS ISSUED   ';                         
//*****************************************************************             
//*               CREATE EMAIL FOR FIRST ATTACHMENT                             
//*****************************************************************             
//STEP05   EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=*.STEP03.SMTPHDR,DISP=(OLD,DELETE)                            
//         DD DSN=&&BP13RCPT,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(MPHDR),DISP=SHR                          
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILOUT.L492,DISP=SHR                                    
//*        LRECL=500,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//*        SPACE=(CYL,(30,10),RLSE)                                     00130010
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*****************************************************************             
//*               SPECIFY ATTACHMENT FILE NAME FOR SECOND FILE                  
//******************************************************************            
//STEP06A   EXEC SAS,OPTIONS='MACRO'                                            
//SYSOUT   DD SYSOUT=*                                                          
//BP13BODY DD DSN=&&BP13BODY,DISP=(NEW,PASS),                                   
//         LRECL=500,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DATA _NULL_;                                                                
        FILE BP13BODY;                                                          
        PUT @01 '                                  ';                           
        PUT @01 'Dear PD/PDA(BSC)                  ';                           
        PUT @01 '                                  ';                           
        PUT @01 'The information on BSC Key Issuance'                           
        PUT @36 ' for the week is ready. ';                                     
        PUT @01 '                                  ';                           
        PUT @01 '2. To view the file, you have to download the fi'              
        PUT @49 'le.';                                                          
        PUT @01 '                                  ';                           
        PUT @01 '3. Open Microsoft Excel, click "File" tab follow'              
        PUT @49 'ed by "Open". Find the location wher';                         
        PUT @01 'e the file was downloaded. Change "All Excel Fil'              
        PUT @49 'es" to "All Files". You would find ';                          
        PUT @01 'the text file. Open the file.';                                
        PUT @01 '                                  ';                           
        PUT @01 '4. A Text Import Wizard will appear. Select "Del'              
        PUT @49 'imited", tick "Semi-colon" and click';                         
        PUT @01 ' "Finish".';                                                   
        PUT @01 '                                  ';                           
        PUT @01 '5. The BSC Key Issuance is ready for viewing.';                
        PUT @01 '                                  ';                           
//*------------------------------------------------------------------*          
//*               CREATE BODY                                                   
//*------------------------------------------------------------------*          
//STEP06B  EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=AV05.MIME.HEADERS.VB(RTEXTHDR),DISP=SHR                       
//         DD DSN=&&BP13BODY,DISP=(OLD,DELETE)                                  
//         DD DSN=AV05.MIME.HEADERS.VB(BOUNDARY),DISP=SHR                       
//SYSUT2   DD DSN=BP13.MAILOUT.L492,DISP=MOD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*****************************************************************             
//*               SPECIFY ATTACHMENT FILE NAME FOR SECOND FILE                  
//******************************************************************            
//STEP06    EXEC SAS,OPTIONS='MACRO'                                            
//SYSOUT   DD SYSOUT=*                                                          
//BP13NAME DD DSN=&&BP13NAME,DISP=(NEW,PASS),                                   
//         LRECL=500,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,                      
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
    DATA _NULL_;                                                                
        FILE BP13NAME;                                                          
        PUT @01 '                                  ';                           
        PUT @01 '           FILENAME="BP13L492.TXT"';                           
//*------------------------------------------------------------------*          
//*               CREATE EMAIL FOR 3ND ATTACHMENT                               
//*------------------------------------------------------------------*          
//STEP06   EXEC PGM=IEBGENER                                                    
//SYSUT1   DD DSN=AV05.MIME.HEADERS.VB(TEXTHDR),DISP=SHR                        
//         DD DSN=AV05.MIME.HEADERS.VB(ATCHHDR),DISP=SHR                        
//         DD DSN=&&BP13NAME,DISP=(OLD,DELETE)                                  
//         DD DSN=BP13.L492.BP13L492,DISP=SHR                                   
//         DD DSN=AV05.MIME.HEADERS.VB(END),DISP=SHR                            
//SYSUT2   DD DSN=BP13.MAILOUT.L492,DISP=MOD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* SORT BP13K410                                                               
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F415,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=2000)                                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(839,8,CH,NE,C'        ',AND,                                   
                 839,8,CH,NE,C'00000000',AND,                                   
                 1169,1,CH,EQ,C'Y')                                             
//*---------------------------------------------------------------------        
//* SORT BP13K330                                                               
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K330.ACCUMAO,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F331,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                                
//         DCB=(RECFM=FB,LRECL=2000)                                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(877,9,A),FORMAT=CH                                              
   INCLUDE COND=(654,8,CH,NE,C'        ',AND,                                   
                 654,8,CH,NE,C'00000000',AND,                                   
                 791,1,CH,EQ,C'Y')                                              
//*--------------------------------------------------------------------         
//* BP13C38Z - TO PRINT REFUND OF EXCESS PAYMENT CASES                          
//*--------------------------------------------------------------------         
//STEP09  EXEC    PGM=BP13C38Z,COND=(0,NE)                                      
//BP13F330 DD  DSN=&&BP13F331,DISP=(OLD,PASS)                                   
//BP13F410 DD  DSN=&&BP13F415,DISP=(OLD,PASS)                                   
//BP13L38Z DD  DSN=BP13.L38Z.BP13L38Z,DISP=SHR                                  
//MAILC38Z DD  DSN=BP13.MAILRPT.BP13L38Z,DISP=SHR                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//****************************************************************              
//*         SEND THE SMTP MAIL                                                  
//*****************************************************************             
//STEP10   EXEC SENDMAIL                                                        
//INPUT    DD DSN=BP13.MAILOUT.L492,DISP=SHR                                    
//****************************************************************              
//STEP11   EXEC SENDMAIL                                                        
//INPUT    DD DSN=BP13.MAILRPT.BP13L38Z,DISP=SHR                                
//****************************************************************              
//*-------------------------------------------------------------------*         
//*          E N D      O F     J O B                                 *         
//*-------------------------------------------------------------------*         
