//BP13A254 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),         00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//*-------------------------------------------------------------------- 00000050
//* CHG NO   BY  ON     - DESCRIPTION                                   00000060
//* ---------------------------------                                   00000070
//* BP132562 LMS 160106 - NEW JCL                                       00000080
//* BP134086 ESD1301210   CATER TO STOP SENDING TXT TO MEDIACORP                
//*                       PERMANENTLY.                                          
//* BP134621 ESA15092012  CATER FOR NEW BP13K247 LAYOUT                         
//*-------------------------------------------------------------------- 00000090
//*-------------------------------------------------------------------- 00000100
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                       00000110
//*-------------------------------------------------------------------- 00000120
//STEP00  EXEC   PGM=IDCAMS,COND=(0,NE)                                 00000130
//INPUT1   DD  DSN=BP13.K230.FLATLIST,                                  00000140
//             DISP=OLD                                                 00000150
//INPUT2   DD  DSN=BP13.K23A.FLATLIST,                                  00000160
//             DISP=OLD                                                 00000170
//INPUT3   DD  DSN=BP13.K240.HEADFLAT,                                  00000180
//             DISP=OLD                                                 00000190
//INPUT4   DD  DSN=BP13.K247.SUMMARY,                                   00000200
//             DISP=OLD                                                 00000210
//SYSPRINT DD  SYSOUT=*                                                 00000220
//SYSIN    DD  *                                                        00000230
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
/*                                                                      00000240
//*---------------------------------------------------------------------        
//* BACKUP FILES BEFORE UPDATE                                                  
//*---------------------------------------------------------------------        
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT1  DD  DSN=BP13.F230.FLATLIST.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(20,10),RLSE),                                        
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=450,RECFM=FB)                      
//INPUT2   DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT2  DD  DSN=BP13.F240.HEADFLAT.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=450,RECFM=FB)                      
//INPUT3   DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//OUTPUT3  DD  DSN=BP13.F222.SUMALLOC.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                  
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
/*                                                                              
//*---------------------------------------------------------------------00000250
//* TO DELETE RECS FROM K230 BASED ON F230                              00000260
//*---------------------------------------------------------------------00000270
//STEPA01 EXEC   PGM=BP13C211,COND=(0,NE)                               00000280
//BP13F230 DD  DSN=BP13.F230.BP13A251.DELETE,                           00000290
//             DISP=SHR                                                 00000300
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                  00000310
//             DISP=OLD,                                                00000320
//             AMP=('BUFND=4','BUFNI=8')                                00000330
//SYSDBG   DD  SYSOUT=*                                                 00000340
//SYSDBOUT DD  SYSOUT=*                                                 00000350
//SYSOUT   DD  SYSOUT=*                                                 00000360
/*                                                                      00000370
//*---------------------------------------------------------------------00000380
//* TO DELETE RECS FROM K240 BASED ON F240                              00000390
//*---------------------------------------------------------------------00000400
//STEPA02 EXEC   PGM=BP13C216,COND=(0,NE)                               00000410
//BP13F240 DD  DSN=BP13.F240.BP13A251.DELETE,                           00000420
//             DISP=SHR                                                 00000430
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                  00000440
//             DISP=OLD,                                                00000450
//             AMP=('BUFND=4','BUFNI=8')                                00000460
//SYSDBG   DD  SYSOUT=*                                                 00000470
//SYSDBOUT DD  SYSOUT=*                                                 00000480
//SYSOUT   DD  SYSOUT=*                                                 00000490
/*                                                                      00000500
//*---------------------------------------------------------------------00000510
//* SORT FLATLIST IN SCH-ACC-NO ORDER                                   00000520
//* BP13F230 - THIS ROUND FLAT LIST                                     00000530
//* BP13K240 - ACCUMULATED HEAD FLAT                                    00000540
//*---------------------------------------------------------------------00000550
//STEPA03 EXEC   SORT,COND=(0,NE)                                       00000560
//SORTIN   DD  DSN=BP13.F240.BP13A251.UPDATE,                           00000570
//             DISP=SHR                                                 00000580
//SORTOUT  DD  DSN=&&BP13F240,                                          00000590
//             DISP=(NEW,PASS),                                         00000600
//             UNIT=SYSDA,                                              00000610
//             SPACE=(CYL,(10,5),RLSE),                                 00000620
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                       00000630
//SYSIN    DD  *                                                        00000640
    SORT FIELDS=(1,450,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
/*                                                                      00000650
//*---------------------------------------------------------------------00000660
//* SORT FLATLIST IN SCH-ACC-NO ORDER                                   00000670
//* BP13F230 - THIS ROUND FLAT LIST                                     00000680
//* BP13K240 - ACCUMULATED HEAD FLAT                                    00000690
//*---------------------------------------------------------------------00000700
//STEPA04 EXEC   SORT,COND=(0,NE)                                       00000710
//SORTIN   DD  DSN=&&BP13F240,                                          00000720
//             DISP=(SHR,PASS)                                          00000730
//SORTOUT  DD  DSN=&&BP13F24A,                                          00000740
//             DISP=(NEW,PASS),                                         00000750
//             UNIT=SYSDA,                                              00000760
//             SPACE=(CYL,(10,5),RLSE),                                 00000770
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                       00000780
//SYSIN    DD  *                                                        00000790
    SORT FIELDS=(5,52,A),FORMAT=CH                                              
    OMIT COND=(5,2,CH,EQ,C'02',OR,5,10,CH,EQ,C'          ')                     
/*                                                                      00000800
//*---------------------------------------------------------------------00000810
//* TO ADD/REPLACE HEADER RECORDS TO BP13.K240.HEADFLAT                 00000820
//*---------------------------------------------------------------------00000830
//STEPA05 EXEC   PGM=IDCAMS,COND=(0,NE)                                 00000840
//SYSPRINT DD  SYSOUT=*                                                 00000850
//INPUT1   DD  DSN=&&BP13F24A,                                          00000860
//             DISP=(SHR,DELETE)                                        00000870
//OUTPUT1  DD  DSN=BP13.K240.HEADFLAT,                                  00000880
//             DISP=OLD,                                                00000890
//             AMP=('BUFND=8','BUFNI=4')                                00000900
//SYSIN    DD  *                                                        00000910
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                      00000920
//*-----------------------------------------------------------------            
//* PRINT LIST OF SELLING PRICE                                                 
//*-----------------------------------------------------------------            
//STEPA06 EXEC    PGM=BP13C21C,COND=(0,NE)                                      
//BP13F240 DD  DSN=BP13.F240.BP13A251.DELETE,                                   
//             DISP=SHR                                                         
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-------------------------------------------------------------------- 00000930
//* BACKUP FIS LOG FILE                                                 00000940
//*-------------------------------------------------------------------- 00000950
//STEPA06 EXEC   SORT,COND=(0,NE)                                       00000960
//SORTIN   DD  DSN=BP13.K240.HEADFLAT,                                  00000970
//             DISP=SHR                                                 00000980
//SORTOUT  DD  DSN=&&BP13F247,                                          00000990
//             DISP=(,PASS),                                            00001000
//             UNIT=(SYSDA,1),                                          00001010
//             SPACE=(CYL,(10,5),RLSE),                                 00001020
//             DCB=(RECFM=FB,LRECL=50,BLKSIZE=0)                        00001030
//SYSIN    DD  *                                                        00001040
  SORT FIELDS=(131,42,A,7,8,A),FORMAT=CH                                        
  INCLUDE COND=(5,2,CH,EQ,C'01')                                                
  OUTREC FIELDS=(131,42,7,8,117,6,356,1,43X)                                    
  SUM FIELDS=NONE                                                               
/*                                                                      00001050
//*---------------------------------------------------------------------00001060
//* DEFINE LMS VSAM FILE                                                00001070
//*---------------------------------------------------------------------00001080
//STEPA07 EXEC   PGM=IDCAMS,COND=(0,NE)                                 00001090
//INPUT1   DD  DSN=&&BP13F247,                                          00001100
//             DISP=(SHR,PASS)                                          00001110
//SYSPRINT DD  SYSOUT=*                                                 00001120
//SYSIN    DD  *                                                        00001130
          DEL 'BP13.K247.SUMMARY' CLUSTER PURGE                                 
          DEF CLUSTER                                -                          
              (NAME(BP13.K247.SUMMARY)               -                          
              TRK(10 5)                              -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K247.SUMMARY.DATA) -                                   
              KEYS(56 0)                             -                          
              RECSZ(100 100)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K247.SUMMARY.INDEX) -                                  
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K247.SUMMARY)                                              
/*                                                                      00001140
//*---------------------------------------------------------------------00001150
//* TO SORT OUT DETAIL RECORDS                                          00001160
//*---------------------------------------------------------------------00001170
//STEPA08 EXEC   SORT,COND=(0,NE)                                       00001180
//SORTIN   DD  DSN=BP13.F230.BP13A251.DELETE,                           00001190
//             DISP=SHR                                                 00001200
//SORTOUT  DD  DSN=&&BP13F230,                                          00001210
//             DISP=(NEW,PASS),                                         00001220
//             UNIT=SYSDA,                                              00001230
//             SPACE=(CYL,(10,5),RLSE),                                 00001240
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                       00001250
//SYSIN    DD  *                                                        00001260
    SORT FIELDS=(64,11,A),FORMAT=CH                                             
    INCLUDE COND=(5,2,CH,EQ,C'02')                                              
/*                                                                      00001270
//*---------------------------------------------------------------------00001280
//* TO ADD/REPLACE DETAIL RECORDS TO BP13.K230.FLATLIST                 00001290
//*---------------------------------------------------------------------00001300
//STEPA09 EXEC   PGM=IDCAMS,COND=(0,NE)                                 00001310
//SYSPRINT DD  SYSOUT=*                                                 00001320
//INPUT1   DD  DSN=&&BP13F230,                                          00001330
//             DISP=(SHR,DELETE)                                        00001340
//OUTPUT1  DD  DSN=BP13.K23A.FLATLIST,                                  00001350
//             DISP=OLD,                                                00001360
//             AMP=('BUFND=8','BUFNI=4')                                00001370
//SYSIN    DD  *                                                        00001380
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                               
/*                                                                      00001390
//*---------------------------------------------------------------------00001400
//* BACKUP FILES BEFORE DELETE                                          00001410
//*---------------------------------------------------------------------00001420
//STEPA10 EXEC   SORT,COND=(0,NE)                                       00001430
//SORTIN   DD  DSN=BP13.F230.BP13A251.DELETE,                           00001440
//             DISP=SHR                                                 00001450
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001460
//             DISP=MOD                                                 00001470
//SYSIN    DD  *                                                        00001480
    SORT FIELDS=(1,250,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F230',C'DELETE',1,250,C'BP13A251',28X)                 
/*                                                                      00001490
//*---------------------------------------------------------------------00001500
//* BACKUP FILES BEFORE DELETE                                          00001510
//*---------------------------------------------------------------------00001520
//STEPA11 EXEC   SORT,COND=(0,NE)                                       00001530
//SORTIN   DD  DSN=BP13.F240.BP13A251.DELETE,                           00001540
//             DISP=SHR                                                 00001550
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001560
//             DISP=MOD                                                 00001570
//SYSIN    DD  *                                                        00001580
    SORT FIELDS=(1,250,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F240',C'DELETE',1,250,C'BP13A251',28X)                 
/*                                                                      00001590
//*---------------------------------------------------------------------00001600
//* BACKUP FILES BEFORE DELETE                                          00001610
//*---------------------------------------------------------------------00001620
//STEPA12 EXEC   SORT,COND=(0,NE)                                       00001630
//SORTIN   DD  DSN=BP13.F240.BP13A251.UPDATE,                           00001640
//             DISP=SHR                                                 00001650
//SORTOUT  DD  DSN=BP13.F998.BP13D206,                                  00001660
//             DISP=MOD                                                 00001670
//SYSIN    DD  *                                                        00001680
    SORT FIELDS=(1,250,A),FORMAT=CH                                             
    OUTREC FIELDS=(C'BP13F240',C'UPDATE',1,250,C'BP13A251',28X)                 
/*                                                                      00001690
//*-------------------------------------------------------------------- 00001700
//* EMPTY SLSFIS FILE                                                   00001710
//*-------------------------------------------------------------------- 00001720
//STEPA13 EXEC   PGM=IDCAMS,COND=(0,NE)                                 00001730
//SYSPRINT DD  SYSOUT=*                                                 00001740
//INPUT1   DD  DUMMY                                                    00001750
//OUTPUT1  DD  DSN=BP13.F230.BP13A251.DELETE,                           00001760
//             DISP=SHR                                                 00001770
//SYSIN    DD  *                                                        00001780
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                      00001790
//*-------------------------------------------------------------------- 00001800
//* EMPTY SLSFIS FILE                                                   00001810
//*-------------------------------------------------------------------- 00001820
//STEPA14 EXEC   PGM=IDCAMS,COND=(0,NE)                                 00001830
//SYSPRINT DD  SYSOUT=*                                                 00001840
//INPUT1   DD  DUMMY                                                    00001850
//OUTPUT1  DD  DSN=BP13.F240.BP13A251.DELETE,                           00001860
//             DISP=SHR                                                 00001870
//SYSIN    DD  *                                                        00001880
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                      00001890
//*-------------------------------------------------------------------- 00001900
//* EMPTY SLSFIS FILE                                                   00001910
//*-------------------------------------------------------------------- 00001920
//STEPA15 EXEC   PGM=IDCAMS,COND=(0,NE)                                 00001930
//SYSPRINT DD  SYSOUT=*                                                 00001940
//INPUT1   DD  DUMMY                                                    00001950
//OUTPUT1  DD  DSN=BP13.F240.BP13A251.UPDATE,                           00001960
//             DISP=SHR                                                 00001970
//SYSIN    DD  *                                                        00001980
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                      00001990
//*-----------------------------------------------------------------    00002000
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET      00002010
//*-----------------------------------------------------------------    00002020
//PRT01  EXEC    PGM=IEBGENER                                           00002030
//SYSUT1   DD  *                                                        00002040
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                             00002050
//SYSUT2   DD  SYSOUT=2,                                                00002060
//             OUTPUT=(*.FORMID)                                        00002070
//SYSPRINT DD  SYSOUT=*                                                 00002080
//SYSIN    DD  DUMMY                                                    00002090
//*-----------------------------------------------------------------    00002100
//* SORT OUT THE CONTROL REC FOR THIS OPTION                            00002110
//*-----------------------------------------------------------------    00002120
//STEPB01 EXEC   SORT,COND=(0,NE)                                       00002130
//SORTIN   DD  DSN=BP13.K208.ADJ.FLATLIST,                              00002140
//             DISP=SHR                                                 00002150
//SORTOUT  DD  DSN=&&BP13F208,                                          00002160
//             DISP=(NEW,PASS),                                         00002170
//             UNIT=DISK,                                               00002180
//             SPACE=(CYL,(2,1),RLSE),                                  00002190
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                       00002200
//SYSIN    DD  *                                                        00002210
   SORT FIELDS=(9,13,A),FORMAT=CH                                               
   INCLUDE COND=(1,8,CH,EQ,C'BP13A251')                                         
/*                                                                      00002220
//*-----------------------------------------------------------------            
//* CONVERT FLAT TYPE FROM E TO 6                                               
//*-----------------------------------------------------------------            
//STEPB02 EXEC    PGM=BP13C21D,COND=(0,NE)                                      
//BP13F208 DD  DSN=&&BP13F208,                                                  
//             DISP=(SHR,PASS)                                                  
//P13F208A DD  DSN=&&P13F208A,                                          00002160
//             DISP=(NEW,PASS),                                         00002170
//             UNIT=DISK,                                               00002180
//             SPACE=(CYL,(2,1),RLSE),                                  00002190
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                       00002200
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------    00002100
//* SORT OUT THE CONTROL REC FOR THIS OPTION                            00002110
//*-----------------------------------------------------------------    00002120
//STEPB03 EXEC   SORT,COND=(0,NE)                                       00002130
//SORTIN   DD  DSN=&&P13F208A,                                          00002140
//             DISP=(SHR,PASS)                                          00002150
//SORTOUT  DD  DSN=&&P13F208B,                                          00002160
//             DISP=(NEW,PASS),                                         00002170
//             UNIT=DISK,                                               00002180
//             SPACE=(CYL,(2,1),RLSE),                                  00002190
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                       00002200
//SYSIN    DD  *                                                        00002210
   SORT FIELDS=(9,13,A),FORMAT=CH                                               
/*                                                                      00002220
//*-----------------------------------------------------------------    00002230
//* TO SORT DETAIL REC BY ALLOCATION-DATE, NT, FT                       00002240
//*-----------------------------------------------------------------    00002250
//STEPB04 EXEC   SORT,COND=(0,NE)                                       00002260
//SYSOUT   DD  SYSOUT=*                                                 00002270
//SORTIN   DD  DSN=BP13.K230.FLATLIST,                                  00002280
//             DISP=SHR,                                                00002290
//             AMP=('BUFND=8','BUFNI=4')                                00002300
//SORTOUT  DD  DSN=&&P13F230A,                                          00002310
//             DISP=(NEW,PASS),                                         00002320
//             UNIT=SYSDA,                                              00002330
//             SPACE=(TRK,(20,10),RLSE),                                00002340
//             DCB=(LRECL=450,RECFM=FB),                                00002350
//             DSORG=PS                                                 00002360
//SYSIN    DD  *                                                        00002370
  SORT  FIELDS=(7,8,A,30,20,A,50,2,A),FORMAT=CH                                 
/*                                                                      00002380
//*-----------------------------------------------------------------    00002390
//* TO SORT SUMMARY REC BY ALLOCATION-DATE, NT, FT                      00002400
//*-----------------------------------------------------------------    00002410
//STEPB05 EXEC   SORT,COND=(0,NE)                                       00002420
//SYSOUT   DD  SYSOUT=*                                                 00002430
//SORTIN   DD  DSN=BP13.K240.HEADFLAT,                                  00002440
//             DISP=SHR,                                                00002450
//             AMP=('BUFND=8','BUFNI=4')                                00002460
//SORTOUT  DD  DSN=&&P13F240A,                                          00002470
//             DISP=(NEW,PASS),                                         00002480
//             UNIT=SYSDA,                                              00002490
//             SPACE=(TRK,(10,5),RLSE),                                 00002500
//             DCB=(LRECL=450,RECFM=FB),                                00002510
//             DSORG=PS                                                 00002520
//SYSIN    DD  *                                                        00002530
  SORT  FIELDS=(7,8,A,30,20,A,50,2,A),FORMAT=CH                                 
/*                                                                      00002540
//*-----------------------------------------------------------------    00002550
//* TO REFORMAT RECORDS                                                 00002560
//*-----------------------------------------------------------------    00002570
//STEPB06 EXEC   PGM=BP13C22D,COND=(0,NE)                               00002580
//BP13F208 DD  DSN=&&P13F208B,                                          00002590
//             DISP=(SHR,DELETE)                                        00002600
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                   00002610
//             DISP=SHR                                                 00002620
//BP13F230 DD  DSN=&&P13F230A,                                          00002630
//             DISP=(SHR,DELETE)                                        00002640
//BP13F240 DD  DSN=&&P13F240A,                                          00002650
//             DISP=(SHR,DELETE)                                        00002660
//P13F230A DD  DSN=&&P13F230B,                                          00002670
//             DISP=(NEW,PASS),                                         00002680
//             UNIT=SYSDA,                                              00002690
//             SPACE=(CYL,(30,15),RLSE),                                00002700
//             DCB=(LRECL=450,RECFM=FB),                                00002710
//             DSORG=PS                                                 00002720
//SYSDBG   DD  SYSOUT=*                                                 00002730
//SYSDBOUT DD  SYSOUT=*                                                 00002740
//SYSOUT   DD  SYSOUT=*                                                 00002750
/*                                                                      00002760
//*-----------------------------------------------------------------    00002770
//* TO REFORMAT RECORDS                                                 00002780
//*-----------------------------------------------------------------    00002790
//STEPB07 EXEC   SORT,COND=(0,NE)                                       00002800
//SORTIN   DD  DSN=&&P13F230B,                                          00002810
//             DISP=(SHR,DELETE)                                        00002820
//SORTOUT  DD  DSN=&&P13F230C,                                          00002830
//             DISP=(NEW,PASS),                                         00002840
//             UNIT=SYSDA,                                              00002850
//             SPACE=(TRK,(30,15),RLSE),                                00002860
//             DCB=(LRECL=450,RECFM=FB),                                00002870
//             DSORG=PS                                                 00002880
//SYSOUT   DD  SYSOUT=*                                                 00002890
//SYSIN    DD  *                                                        00002900
  SORT  FIELDS=(7,8,A,97,10,A,30,27,A,5,2,A),FORMAT=CH                          
/*                                                                      00002910
//*-----------------------------------------------------------------    00002920
//* TO CALCULATE THE TOTAL NUMBER OF DETAIL REC SENT                    00002930
//*-----------------------------------------------------------------    00002940
//STEPB08 EXEC   PGM=BP13C252,COND=(0,NE)                               00002950
//P13F230A DD  DSN=&&P13F230C,                                          00002960
//             DISP=(SHR,DELETE)                                        00002970
//P13F230B DD  DSN=&&P13F230D,                                          00002980
//             DISP=(NEW,PASS),                                         00002990
//             UNIT=SYSDA,                                              00003000
//             SPACE=(TRK,(30,15),RLSE),                                00003010
//             DCB=(LRECL=450,RECFM=FB),                                00003020
//             DSORG=PS                                                 00003030
//SYSDBG   DD  SYSOUT=*                                                 00003040
//SYSDBOUT DD  SYSOUT=*                                                 00003050
//SYSOUT   DD  SYSOUT=*                                                 00003060
/*                                                                      00003070
//*---------------------------------------------------------------------00003080
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER                                   00003090
//*---------------------------------------------------------------------00003100
//STEPB09 EXEC   SORT,COND=(0,NE)                                       00003110
//SORTIN   DD  DSN=&&P13F230D,                                          00003120
//             DISP=(SHR,DELETE)                                        00003130
//SORTOUT  DD  DSN=&&P13F230E,                                          00003140
//             DISP=(NEW,PASS),                                         00003150
//             UNIT=SYSDA,                                              00003160
//             SPACE=(CYL,(5,3),RLSE),                                  00003170
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                       00003180
//SYSIN    DD  *                                                        00003190
     SORT FIELDS=(7,8,A,97,10,A,30,27,A,5,2,A,59,5,A,57,2,A),FORMAT=CH          
/*                                                                      00003200
//*---------------------------------------------------------------------00003210
//* EDIT RECORDS WITH NUM-SELECTION = '3R ' (FOR RECID = '05')          00003220
//*---------------------------------------------------------------------00003230
//STEPB10 EXEC   PGM=BP13C279,COND=(0,NE)                               00003240
//BP13F230 DD  DSN=&&P13F230E,                                          00003250
//             DISP=(SHR,PASS)                                          00003260
//P13F230O DD  DSN=BP13.F230.ADJUST,                                    00003270
//             DISP=SHR                                                 00003280
//SYSDBG   DD  SYSOUT=*                                                 00003290
//SYSDBOUT DD  SYSOUT=*                                                 00003300
//SYSOUT   DD  SYSOUT=*                                                 00003310
/*                                                                      00003570
//*-------------------------------------------------------------------- 00003580
//* END JOB BP13A254                                                    00003590
//*-------------------------------------------------------------------- 00003600
