//BP13A228 JOB (BP13P),'BP13A228',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//**************************************************************                
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//*----------------------------------                                           
//* BP130970 LSB 010808 - CHG BP13C228 ADD ONE OUTPUT FILE                      
//* BP133736 ESA1041209- ADD BM06K100 TO BP13C226                               
//* BP133851 ESA1120310 - TO ADD BP13KQ30 IN BP13C226                           
//* BP135171 RJE 100214 - TO CATER FOR DB2 UPGRADE                              
//* BP136348 ESA1011117 - TO ADD DJ02KL5A & DJ02KL50 IN BP13C250                
//**************************************************************                
//*                                                                             
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*                                                                             
//**************************************************************                
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//* SORT OUT THE CONTROL REC FOR THIS OPTION                                    
//*-----------------------------------------------------------------            
//STEP00 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K205.CTLREC,                                            
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=OLD                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'FT')                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* TO SORT RECORDS IN ZONE/NT/FLAT-TYPE/ALLOC-DATE SEQUENCE                    
//*-----------------------------------------------------------------            
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F800,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(559,2,A,546,3,A,544,2,A,291,8,A),FORMAT=CH                      
/*                                                                              
//*-----------------------------------------------------------------            
//* DELETE THE ACCUMULATED FLAT LIST FILE                                       
//*-----------------------------------------------------------------            
//STEP02 EXEC    PGM=BP13C228,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,DELETE)                                                
//BM6F800  DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=OLD                                                         
//BM6F800D DD  DUMMY                                                            
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP13A215 LSB 961126 - NEW REPORT ON AVG SELL-PRICE FOR 3RM/4A FLAT          
//* BP130883 CLT 301000 - REMOVE CALLING OF BP13C904                            
//*---------------------------------------------------------------------        
//*   PROGRAM TO OUTPUT FILE FOR PRINTING APPENDIX B                            
//*   PROGRAM BP13C226 TO REPLACE BM06300A                                      
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06F110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13KQ30 DD  DSN=BP13.KQ30.PAIR,                                              
//             DISP=SHR                                                         
//BP13KQ31 DD  DSN=BP13.KQ30.PAIR.PATH1,                                        
//             DISP=SHR                                                         
//BP13F270 DD  DSN=BP13.F270.BP13A200,                                          
//             DISP=MOD                                                         
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSOUT   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C226) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* PRINT LIST OF SELLILNG PRICE                                                
//*--------------------------------------------------------------------         
//STEP04 EXEC    SAS,COND=(0,NE)                                                
//WORK     DD  UNIT=SYSDA,                                                      
//             SPACE=(CYL,(30,10),,,ROUND)                                      
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BM06K238 DD  DSN=BM06.K238.REVECD,                                            
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BM06C224 DD  DSN=BM06.F696.SELLSP,                                            
//             DISP=OLD                                                         
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S202),                                    
//             DISP=SHR                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//*   OUTPUT LIST OF SELLING PRICE TO HARDCOPY                                  
//*--------------------------------------------------------------------         
//STEP05 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  DSN=BM06.F696.SELLSP,                                            
//             DISP=SHR                                                         
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-----------------------------------------------------------------            
//*   TO SORT FILE BY NT/FT                                                     
//*-----------------------------------------------------------------            
//STEP06 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&BM06F80A,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(50,25),RLSE),                                        
//             DCB=*.SORTIN                                                     
//SYSIN    DD  *                                                                
      SORT FIELDS=(559,2,A,546,3,A,544,2,A,                                     
                   23,5,A,503,7,A,501,2,A),FORMAT=CH                            
//*---------------------------------------------------------------------        
//*   TO PRINT FLATLIST BY NT/FT                                                
//*---------------------------------------------------------------------        
//STEP07 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BM06F800 DD  DSN=&&BM06F80A,                                                  
//             DISP=(OLD,DELETE)                                                
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//DJ02KL5A DD  DSN=DJ02.KL5A.LRA.BATCH.LOG,                                     
//             DISP=SHR                                                         
//DJ02KL50 DD  DSN=DJ02.KL50.LRA.BATCH.LOG,                                     
//             DISP=SHR                                                         
//P13L250  DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C250) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* ACCUMULATE THE FLATLIST FILE FOR INTV                                       
//* INCLUDE ONLY INTV TAG = 'Y'                                                 
//*-----------------------------------------------------------------            
//STEP08 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
   INCLUDE COND=(557,1,CH,EQ,C'Y')                                              
   SUM FIELDS=NONE                                                              
/*                                                                              
//*-----------------------------------------------------------------            
//* ACCUM CONTROL REC                                                           
//*-----------------------------------------------------------------            
//STEP09 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*-----------------------------------------------------------------            
//* PRT REPORT IN AVERAGE SELLING PRICE FOR 3RM/4A FLAT FOR ZONE=3R             
//*-----------------------------------------------------------------            
//STEP12 EXEC    SAS,COND=(0,NE),                                               
//             OPTIONS='MACRO'                                                  
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=BP13.F205.PRICEREC,                                          
//             DISP=SHR                                                         
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                            
//             DISP=SHR                                                         
//FT12F001 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S210),                                    
//             DISP=SHR                                                         
