//BP13D208 JOB (BP13P),'BP13D209',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//*=================================================================            
//* INTERFACE WITH ROM ON MARRIAGE DATA                                         
//*                                                                             
//* 1) RETURN FROM ROM, UPDATE MARRIAGE DATA                                    
//*                                                                             
//* FOR FS APPLICATION, SEND TO ROM FOR SCREENING                               
//* 2) INPUT RECORD BOOKED AND NOT SIGN-SA-DATE                                 
//* 3) INPUT RECORD SIGN-SA WITH PACD=M AND WITH PACD DATE                      
//*=================================================================            
//* CHG--NO  BY    ON      -  REMARK                                            
//*--------------------------------------------------------------------         
//* BP136646 LSB1 12092017 - GET ROM DATA, CONVERT FS TO PA                     
//* BP137791 LSB1 10092019 - INCLUDE FTS, SSC REPORT                            
//* BP138833 LSB1 03092021 - BYPASS K517-REMARK=UPDATED BF RUN BP13C50C         
//* BP138833 LSB1 03092027 - MOVE NON-FS MATCHING TO BP13M520 JOB               
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K517.ROMDATA,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT3   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//INPUT4   DD DSN=BP13.K810.WAITHIST,DISP=OLD                                   
//INPUT5   DD DSN=BP13.K848.BKIMAGE,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
//*-------------------------------------------------------------------* 00000050
//*          TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET             00000060
//*-------------------------------------------------------------------* 00000070
//STEP00 EXEC    PGM=IEBGENER                                           00000080
//SYSUT1   DD  *                                                        00000090
$DJDE$ JDE=BP13D,COPIES=2,JDL=BP13,END;                                         
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                            00000100
//SYSUT2   DD  SYSOUT=2,                                                00000110
//             OUTPUT=(*.FORMID)                                        00000120
//SYSPRINT DD  SYSOUT=*                                                 00000130
//SYSIN    DD  DUMMY                                                    00000140
//*-------------------------------------------------------------------- 00000150
//* SORT F416 BY NRIC IN ASCENDING AND MARRIAGE DATE BY DESENDING ORDER 00000160
//*-------------------------------------------------------------------- 00000170
//STEP01 EXEC    SORT,COND=(0,NE)                                       00000180
//SORTIN   DD  DSN=BE01.F416.MRG.CONVERT.DAYBKUP(0),                    00000190
//             DISP=SHR                                                 00000200
//SORTOUT  DD  DSN=&&BE01F416,                                          00000210
//             DISP=(,PASS),                                            00000220
//             SPACE=(CYL,(50,20),RLSE),                                00000230
//             DCB=(RECFM=FB,LRECL=700)                                 00000240
//SYSIN    DD  *                                                        00000250
   SORT FIELDS=(11,20,A,188,10,D),FORMAT=CH                                     
/*                                                                      00000260
//*-------------------------------------------------------------------- 00000270
//* SORT F517 BY NRIC IN ASCENDING ORDER                                00000280
//*-------------------------------------------------------------------- 00000290
//STEP02 EXEC    SORT,COND=(0,NE)                                       00000300
//SORTIN   DD  DSN=BP13.K517.ROMDATA,                                   00000310
//             DISP=SHR                                                 00000320
//SORTOUT  DD  DSN=&&BP13F517,                                          00000330
//             DISP=(,PASS),                                            00000340
//             SPACE=(CYL,(50,20),RLSE),                                00000350
//             DCB=(RECFM=FB,LRECL=250)                                 00000360
//SYSIN    DD  *                                                        00000370
   SORT FIELDS=(1,20,A),FORMAT=CH                                               
   INCLUDE COND=(87,9,CH,EQ,C'         ')                                       
/*                                                                      00000380
//*-------------------------------------------------------------------- 00000390
//* TO MATCH F416 AND F517 BY NRIC AND UPDATE K517                      00000400
//*-------------------------------------------------------------------- 00000410
//STEP03 EXEC    PGM=BP13C921,COND=(0,NE)                               00000420
//BE01F416 DD  DSN=&&BE01F416,                                          00000430
//             DISP=(OLD,PASS)                                          00000440
//BP13F517 DD  DSN=&&BP13F517,                                          00000450
//             DISP=(OLD,PASS)                                          00000460
//BP13K517 DD  DSN=BP13.K517.ROMDATA,                                   00000470
//             DISP=SHR,                                                00000480
//             AMP=('BUFND=23')                                         00000490
//SYSOUT   DD  SYSOUT=*                                                 00000500
//SYSTSPRT DD  SYSOUT=*                                                 00000510
//SYSPRINT DD  SYSOUT=*                                                 00000520
//SYSDBG   DD  SYSOUT=*                                                 00000530
//SYSDBOUT DD  SYSOUT=*                                                 00000540
//SYSTSIN  DD  *                                                        00000550
//*-------------------------------------------------------------------- 00000270
//* SORT FS BY REGN/NRIC,WITH ROM DATA CASE                             00000280
//* INCLUDE NUM-TRANS NOT = 'P'                                         00000280
//*-------------------------------------------------------------------- 00000290
//STEP04 EXEC    SORT,COND=(0,NE)                                       00000300
//SORTIN   DD  DSN=BP13.K517.ROMDATA,                                   00000310
//             DISP=SHR                                                 00000320
//SORTOUT  DD  DSN=&&F517C50C,                                          00000330
//             DISP=(,PASS),                                            00000340
//             SPACE=(CYL,(50,20),RLSE),                                00000350
//             DCB=(RECFM=FB,LRECL=250)                                 00000360
//SYSIN    DD  *                                                        00000370
   SORT FIELDS=(218,8,A,1,20,A),FORMAT=CH                                       
   INCLUDE COND=(188,8,CH,GT,C'00000000',AND,                                   
                 206,7,CH,EQ,C'BP13C50',AND,                                    
                 218,8,CH,NE,C'        ',AND,                                   
                 218,7,CH,NE,C'UPDATED',AND,                                    
                 226,1,CH,NE,C'P')                                              
/*                                                                      00000380
//*-----------------------------------------------------------------            
//* UPDATE ELIG SCHEME FS TO PA IN BP13K800                                     
//* UPDATE MARITAL STATUS IN BP13K820                                           
//*-----------------------------------------------------------------            
//STEP05  EXEC PGM=BP13C50C,COND=(0,NE)                                         
//BP13F517 DD DSN=&&F517C50C,DISP=(OLD,PASS)                                    
//BP13K517 DD DSN=BP13.K517.ROMDATA,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR,                                   
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K810 DD DSN=BP13.K810.WAITHIST,DISP=SHR,                                  
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFNI=4','BUFND=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFNI=4','BUFND=8')                                         
//P13F517A DD DSN=BP13.F517.ROMDATA.DELETE,DISP=MOD                             
//BP13L50C DD DSN=BP13.L50C.REPORT,DISP=MOD                                     
//BP13F50C DD DUMMY                                                             
//P13LC50D DD DUMMY                                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
