//BP13Y704 JOB (BP13P),'BP13Y704',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*---------------------------------------------------------------------        
//* ONETIME FILE TO TC ON DBSS CASES UPON TOP FOR TC TO BILL DEVELOPER          
//* ON SC/CC                                                                    
//* OUTFILE TO SMS, SMS WILL PASS TO TC GATEWAY                                 
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD DSN=&&BM06F120,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=700),                                  
//        SPACE=(CYL,(100,50),RLSE)                                             
//SYSIN    DD  *                                                                
    SORT FIELDS=(592,6,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* SORT OUT PROJECT D01                                                        
//* SORT BY POSTAL CODE                                                         
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.KA20.BLOCK,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13FA20,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0),                               
//            SPACE=(CYL,(1,3),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(116,6,A),FORMAT=CH                                               
  INCLUDE COND=(1,3,CH,EQ,C'D13')                                               
//*-------------------------------------------------------------------*         
//* FILE TO TC ON SC/CC                                                         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13CD52,COND=(0,NE)                                        
//BM06F120 DD DSN=&&BM06F120,DISP=(OLD,PASS)                                    
//BP13FA20 DD DSN=&&BP13FA20,DISP=(OLD,PASS)                                    
//BP13KA10 DD DSN=BP13.KA10.PRJCT,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SY21F120 DD DSN=&&BP13AB03,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),                               
//            SPACE=(CYL,(10,8),RLSE)                                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* OMIT DUPLICATE HDB-REF-NO                                                   
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&BP13AB03,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&AB03F120,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),                               
//            SPACE=(CYL,(10,8),RLSE)                                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(9,9,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
//*-------------------------------------------------------------------*         
//* OUTPUT FILE TO SMS, PASS TO TC GATEWAY                                      
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&AB03F120,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=AB03.SY21.F120.LESSEE,DISP=MOD                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* OUTPUT FILE TO SMS BACKUP FILE, PASS TO TC GATEWAY                          
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&AB03F120,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=AB03.SY21.F120.LESSEE.MOD,DISP=MOD                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
