//BP13A271 JOB (BP13P),'BP13A271',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* CHG REF  ON     BY    DESCRIPTION                                           
//* ---------------------------------                                           
//* BP133392 080728 LMS1  NEW JOB FOR UPDATE OF BOOKING APPOINTMENT FOR         
//*                       RESERVED LIST CASES.                                  
//* BP133610 020609 ESA1  TO REPLACE BP13K767 WITH BP13K816                     
//* BP133851 220210 ESA1  TO ADD BP13K800 IN BP13C241                           
//* BP133896 070510 ESA1  TO EXPAND SIZE OF BACKUP DATA                         
//* BP134253 070511 ESD1  CATER TO CHANGE F222 FILE.                            
//* BP134513 120412 ESA1  ADD BP13K200 ALT FILE IN BP13C241                     
//* BP134681 190912 ESA1  TO REPLACE BP13K816 WITH BP13K813                     
//* BP135171 100214 RJE1  TO CATER FOR DB2 UPGRADE                              
//* BP135404 030714 ESA1  TO REMOVE CNTRL REPORT PRINTING FOR BP13C240          
//*********************************************************************         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR UPDATING OF BOOKING APPMT DATE AND TIME FOR                 
//* MATURE NEW TOWNS ONLY (BOOKING EXERCISE ON NEW TOWN BASIS).                 
//*********************************************************************         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=OLD                                                         
//INPUT3   DD  DSN=BP13.K278.OCSBLK,                                            
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
/*                                                                              
//*-----------------------------------------------------------------            
//* SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT DATASET              
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 5 - SCHEDULE BOOKING APPMT (NT)                         
//*--------------------------------------------------------------------         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.APNTREC,DISP=OLD                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'UN',AND,63,1,CH,EQ,C'Y')                          
//*--------------------------------------------------------------------*        
//*  TO BACKUP FILES BEFORE UPDATE                                              
//*--------------------------------------------------------------------*        
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F200.BKAPPMT.BACKUP(+1),                                
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=300,RECFM=FB)                  
//INPUT2   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.F210.BKWKPLAN.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                  
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
/*                                                                              
//*--------------------------------------------------------------------*        
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO                       
//*--------------------------------------------------------------------*        
//STEP03 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(9,3,A,12,2,A,50,6,A,57,5,A),FORMAT=CH                          
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CANCELLATION CASES                                                          
//*--------------------------------------------------------------------*        
//STEP04 EXEC    PGM=BP13C240,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.APNTREC,                                           
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,DELETE)                                                
//P13F200O DD  DSN=&&P13F200B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//P13F240O DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CASES WITH SHORTLIST-QTR NOT THE SAME AS BALLOT-QTR.                        
//*--------------------------------------------------------------------*        
//STEP05 EXEC    PGM=BP13C273,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=BP13.F205.APNTREC,                                           
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L273 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK SOC MASTER FILE FOR CASES ALREADY ACCEPTED A FLAT.                 
//*--------------------------------------------------------------------*        
//STEP06 EXEC    PGM=BP13C285,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200C,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=BP13.F205.APNTREC,                                           
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L285 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*00000690
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE      00000700
//* CASES WITH DIFFERENT ZONE/NT/FT.                                    00000710
//*--------------------------------------------------------------------*00000720
//STEP6A EXEC    PGM=BP13C27A,COND=(0,NE)                               00000730
//BP13F200 DD  DSN=&&P13F200D,                                          00000740
//             DISP=(SHR,PASS)                                          00000750
//BP13F205 DD  DSN=BP13.F205.APNTREC,                                   00000760
//             DISP=SHR                                                 00000770
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000780
//             DISP=SHR                                                 00000790
//P13F200O DD  DSN=&&P13F200E,                                          00000800
//             DISP=(NEW,PASS),                                         00000810
//             UNIT=SYSDA,                                              00000820
//             SPACE=(CYL,(10,5),RLSE),                                 00000830
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00000840
//BP13L27A DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                 00000870
//SYSDBOUT DD  SYSOUT=*                                                 00000880
//SYSOUT   DD  SYSOUT=*                                                 00000890
/*                                                                      00000900
//*--------------------------------------------------------------------*        
//*  TO SCHEDULE BOOKING APPOINTMENT BY NT/FT/REGN-NO BASED ON THE     *        
//*  BOOKING WORK PLAN                                                 *        
//*--------------------------------------------------------------------*        
//STEP07 EXEC    PGM=BP13C241,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200E,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000780
//             DISP=SHR                                                 00000790
//BP13K200 DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K201 DD  DSN=BP13.K200.BKAPPMT.PATH1,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F222.BP13A271                                        
//*--------------------------------------------------------------------         
//STEP08  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F222.BP13A271,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(1,1)),                                               
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//*     TO CREATE ALLOCATION SUMMARY FILE (BP13K222)                            
//*---------------------------------------------------------------------        
//STEP08A   EXEC PGM=BP13C24F,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.APNTREC,                                           
//             DISP=(SHR,PASS)                                                  
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13F222 DD  DSN=BP13.F222.BP13A271,                                          
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=2                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
/*                                                                              
//*---------------------------------------------------------------------        
//*     TO CREATE ALLOCATION SUMMARY FILE (BP13K222)                            
//*---------------------------------------------------------------------        
//STEP09 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=BP13.F205.APNTREC,                                           
//             DISP=SHR                                                         
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//CP27K090 DD  DSN=CP27.K090.HOLIDAY,                                           
//             DISP=SHR                                                         
//BP13K278 DD  DSN=BP13.K278.OCSBLK,                                            
//             DISP=OLD                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C248) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP20 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.APNTREC,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*--------------------------------------------------------------------*        
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO                       
//*--------------------------------------------------------------------*        
//STEP24 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200F,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(9,3,A,12,2,A,50,6,A,57,5,A),FORMAT=CH                          
/*                                                                              
//*--------------------------------------------------------------------*00000690
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE      00000700
//* CASES WITH DIFFERENT ZONE/NT/FT.                                    00000710
//*--------------------------------------------------------------------*00000720
//STEP25 EXEC    PGM=BP13C27C,COND=(0,NE)                               00000730
//BP13F200 DD  DSN=&&P13F200F,                                          00000740
//             DISP=(SHR,PASS)                                          00000750
//BP13F205 DD  DSN=BP13.F205.APNTREC,                                   00000760
//             DISP=SHR                                                 00000770
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000780
//             DISP=SHR                                                 00000790
//BP13L27C DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                 00000870
//SYSDBOUT DD  SYSOUT=*                                                 00000880
//SYSOUT   DD  SYSOUT=*                                                 00000890
/*                                                                      00000900
//*---------------------------------------------------------------------        
//* TO GET BP13F800 FROM BP13F200                                               
//*---------------------------------------------------------------------        
//STEP26 EXEC    PGM=BP13C23D,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200E,                                          00000740
//             DISP=(SHR,PASS)                                          00000750
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13F800 DD  DSN=&&BP13F800,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                              
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*  TO EXTRACT OCCUPIER RECORDS                                                
//*---------------------------------------------------------------------        
//STEP27 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//SORTOUT  DD  DSN=&&BP13F820,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,75),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*   TO RETRIEVE CORRESPONDING F820 BASED ON F800-NUM-REGN                     
//*--------------------------------------------------------------------         
//STEP28 EXEC    PGM=BP13C268,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&BP13F800,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F820 DD  DSN=&&BP13F820,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F82A DD  DSN=&&P13F820A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,75),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------00000030
//* TO CHECK UTS                                                        00000040
//*-------------------------------------------------------------------- 00000050
//STEP29  EXEC   PGM=BP13C23B,COND=(0,NE)                               00002680
//BP13F820 DD  DSN=&&P13F820A,DISP=(SHR,PASS)                           00002710
//BR11K010 DD  DSN=BR11.K010.LESSEE,DISP=SHR                            00002710
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//*---------------------------------------------------------------------00000030
//* TO SORT RECORD BY KEY-FLD                                           00000040
//*---------------------------------------------------------------------------  
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F820A,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&TEMP1,DISP=(NEW,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),                               
//            SPACE=(TRK,(100,50),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//*      TO CREATE SOC OCCUPIER FILE  (BP13.K820.BP13A271)                      
//*--------------------------------------------------------------------         
//STEP31    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=&&TEMP1,DISP=(OLD,PASS)                                       
//SYSIN     DD  *                                                               
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K820.BP13A271)             -                   00810000
              CYL(10 5)                            -                    00830000
              SPEED                                  -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K820.BP13A271.DATA)         -                  00870000
              KEYS(17 0)                             -                  00880000
              RECSZ(400 400)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K820.BP13A271.INDEX) -                         00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K820.BP13A271)                                   00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.K820.BP13A271.ALTX1) -                    00980000
               REL(BP13.K820.BP13A271)               -                  00990000
               REUSE                                 -                  01010000
               KEYS(9 8)                             -                  01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.K820.BP13A271.ALTX1.DATA) -                   01070000
               CYL(10 5)                          -                     01080000
               RECSZ(31 354)                         -                  01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.K820.BP13A271.ALTX1.INDEX) -                  01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.K820.BP13A271.PATH1) -                   01160000
               PENT(BP13.K820.BP13A271.ALTX1))                          01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.K820.BP13A271)               -                  01190000
               ODS(BP13.K820.BP13A271.ALTX1)                            01200000
//*-----------------------------------------------------------------            
//*   SORT OUT UTS CASES                                                        
//*-----------------------------------------------------------------            
//STEP32 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&P13F820A,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F820B,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),                               
//            SPACE=(TRK,(100,50),RLSE)                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(400,1,CH,EQ,C'Y')                                             
    SUM FIELDS=NONE                                                             
//*---------------------------------------------------------------------00000030
//* EDTK800W - TO UPDATE BTO ZONE                                       00000040
//*-------------------------------------------------------------------- 00000050
//STEP33  EXEC   PGM=BP13C23C,COND=(0,NE)                               00002680
//BP13F820 DD  DSN=&&P13F820B,DISP=(SHR,PASS)                           00002710
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR                           00002710
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR                             00002710
//BP13K820 DD  DSN=BP13.K820.BP13A271,DISP=SHR                          00002710
//BP13L23C DD  SYSOUT=2,                                                00002710
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//*---------------------------------------------------------------------        
//* TO DELETE TEMP FILE                                                         
//*---------------------------------------------------------------------        
//STEP34 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   DEL BP13.K820.BP13A271 CL PURGE                                              
/*                                                                              
