//BP13A622 JOB (BP13P),'BP13A622',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB09213
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* REMOVE CANCELLED APPLICATIONS AFTER ASSIGNING RANDOM NUMBER                 
//* THIS JCL SHOULD BE RUN AFTER BALLOT WITH AUDITOR                            
//******************************************************************            
//* CHG REF  BY  ON       DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP133582 IL5 090422 - NEW                                                   
//**************************************************************                
//*---------------------------------------------------------------------00033700
//* DELETE INTERMEDIATE FILES                                           00033800
//*---------------------------------------------------------------------00033900
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                  00034000
//SYSPRINT DD SYSOUT=*                                                  00034100
//SYSIN    DD *                                                         00034200
         DEL 'BP13.F740.MATUREBA.CANCEL'                                00034300
              IF MAXCC < 12 THEN                                        00034500
                 SET MAXCC = 0                                          00034600
//*-------------------------------------------------------------------* 00034700
//* SORT BP13F740 BY REGN NO, RANDOM KEY DESC (STUDIO APT)            * 00034800
//*-------------------------------------------------------------------* 00034900
//STEP02   EXEC SORT,COND=(0,NE)                                        00035000
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                            00035100
//SORTOUT DD DSN=BP13.F740.MATUREBA.CANCEL,DISP=(,CATLG),               00035200
//      SPACE=(CYL,(10,10),RLSE),                                       00035300
//      DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                          00035400
//SYSIN   DD  *                                                         00035500
    SORT FIELDS=(1,28,A),FORMAT=CH                                      00035600
    INCLUDE COND=(260,1,CH,EQ,C'C')                                     00035700
//*-------------------------------------------------------------------* 00035800
//* SORT BP13F740 BY REGN NO, RANDOM KEY DESC (NON-STUDIO APARTMENT)  * 00035900
//*-------------------------------------------------------------------* 00036000
//STEP03   EXEC SORT,COND=(0,NE)                                        00036100
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                            00036200
//SORTOUT DD DSN=&&BP13K740,DISP=(,PASS),                               00036300
//      SPACE=(CYL,(48,10),RLSE),                                       00036400
//      DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                          00036500
//SYSIN   DD  *                                                         00036600
    SORT FIELDS=(1,28,A),FORMAT=CH                                      00036700
    INCLUDE COND=(260,1,CH,NE,C'C')                                     00036800
//*---------------------------------------------------------------------00036900
//* DELETE BALLOT FILE                                                  00037000
//*---------------------------------------------------------------------00037100
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                  00037200
//SYSPRINT DD SYSOUT=*                                                  00037300
//SYSIN    DD *                                                         00037400
         DEL (BP13.K740.MATUREBA) CL PURGE                              00037500
//*---------------------------------------------------------------------00041600
//* TO CREATE THE BALLOT FILE & TO ENSURE THAT NO DUPLICATE RANDOM NO   00041700
//* BY USINF DEFINE VSAM BALLOT FILE                                    00041800
//*---------------------------------------------------------------------00041900
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                  00042000
//SYSPRINT DD SYSOUT=*                                                  00042100
//INPUT    DD DSN=&&BP13K740,DISP=(OLD,PASS)                            00042204
//SYSIN    DD *                                                         00042300
         DEF CL (NAME(BP13.K740.MATUREBA)        -                      00042400
                 CYL(36 5)                       -                      00042500
                 UNIQUE                          -                      00042600
                 SPEED                           -                      00042700
                 STORCLAS(PRODRLS)               -                      00042800
                 LOG(NONE)                       -                      00042900
                 SHR(2 3))                       -                      00043000
                 DATA                            -                      00043100
                 (NAME(BP13.K740.MATUREBA.DATA)  -                      00043200
                 KEYS(28 0)                      -                      00043300
                 RECSZ(500 500)                  -                      00043400
                 FSPC(10 10)                     -                      00043500
                 CISZ(4096))                                            00043600
         IF LASTCC = 0 THEN                      -                      00043700
           REPRO IFILE(INPUT)                    -                      00043800
                 ODS(BP13.K740.MATUREBA)                                00043900
//*-------------------------------------------------------------------- 00044000
//*      TO CREATE PATH/ALTX FOR MATUREBA BALLOT FILE                   00045000
//*-------------------------------------------------------------------- 00046000
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                  00047000
//SYSPRINT DD SYSOUT=*                                                  00048000
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR                           00049000
//SYSIN    DD  *                                                        00050000
           DEF AIX (NAME(BP13.K740.MATUREBA.ALTX1)   -                  00060000
               REL(BP13.K740.MATUREBA)               -                  00070000
               REUSE                                 -                  00080000
               KEYS(8 122)                            -                 00090000
               SHR(2 3)                              -                  00100000
               NUNQK)                                -                  00110000
               DATA                                  -                  00120000
               (NAME(BP13.K740.MATUREBA.ALTX1.DATA) -                   00130000
               CYL(10 5)                              -                 00140000
               RECSZ(31 354)                         -                  00150000
               FSPC(10 10)                           -                  00160000
               CISZ(4096))                           -                  00170000
               INDEX                                 -                  00180000
               (NAME(BP13.K740.MATUREBA.ALTX1.INDEX) -                  00190000
               CISZ(4096))                                              00200000
         IF MAXCC = 0 THEN                           -                  00210000
           DEF PATH (NAME(BP13.K740.MATUREBA.PATH1) -                   00220000
               PENT(BP13.K740.MATUREBA.ALTX1))                          00230000
         IF MAXCC = 0 THEN                                              00240000
           BIX IDS(BP13.K740.MATUREBA)               -                  00250000
               ODS(BP13.K740.MATUREBA.ALTX1)                            00260000
//*===============================================================              
//* BACKUP CANCELLED APPLICATIONS                                               
//*===============================================================              
//STEP07   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.F740.MATUREBA.CANCEL,                                    
//         DISP=SHR                                                             
//OUTPUT   DD DSN=BP13.F740.MATUREBA.CANCEL.BKUP(+1),DISP=(NEW,CATLG),          
//         SPACE=(CYL,(10,10),RLSE),                                    00035300
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                       00035400
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT) OFILE(OUTPUT)                                          
//*===============================================================              
