//BP13M408 JOB (BP13P),BP13M408,MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),      00010002
//         NOTIFY=CSD0071                                               00020002
//*                                                                             
//*=====================================================================        
//* FTP SALES FILE TO IRAS                                                      
//*=====================================================================        
//* CHG-NO   BY    ON    - REMARK                                               
//* -------------------------------                                             
//* BP138168 LSB1 050420 - NEW JOB TAKE OVER FROM AB10 SYSTEM                   
//*---------------------------------------------------------------------        
//*                                                                             
//*   JCL TO FTP FILE FROM HDB TO SECURE FTP SERVER FOR IRAS                    
//*                                                                             
//*---------------------------------------------------------------------        
//S01     EXEC FTP,PARM='SGNETSTAGE (EXIT'                              00021003
//NETRC   DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                           00021003
//INPUT   DD *                                                          00080001
  CD PROD/APPN/DATA/BP13/FROM-HDB/IRAS                                          
  DIR                                                                           
  PWD                                                                           
  ASCII                                                                         
  PUT 'BP13.F40A.SALE' newsales.txt                                             
  DIR                                                                           
  QUIT                                                                          
/*                                                                              
