//BP13A726 JOB (BP13P),'BP13A726',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* CHG REF  DATE     BY   DESCRIPTION                                          
//* -------- -------- ---  -----------                                          
//* BP130652 19991018 SRA  EXPAND F500 RECL FROM 300 TO 500                     
//* BP132293 20030210 SK   READ BP13K703 FOR BP13C705                           
//* BP132818 20060126 BA3  TO CHANGE SORTING OF REF NO FROM 6 BYTES             
//*                        TO 8 BYTES.                                          
//******************************************************************            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* REPRO MATURE REQUESTS TO SEQUENCIAL FILE                                    
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F500MNT,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(123,1,CH,EQ,C'Q')                                            
//*-----------------------------------------------------------------            
//* BP13.F500.SEQUENCE - ALREADY UPDATED WITH SEQ-REF-NO                        
//* COMPUTE DTE-BALLOT FOR THE QUARTER                                          
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C705,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500MNT,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=BP13.F500.NT,DISP=OLD                                         
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT REQUEST RECORD BY NT/REF-NO                                            
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.NT,DISP=SHR                                         
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,123,8,A),FORMAT=CH                                      
//*-----------------------------------------------------------------            
//* MATURE NT - TO PRINT REPORT ON APPLICANT WHO RESPOND TO                     
//*             OPENING OF NEW TOWN  FOR REGISTRATION                           
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13C590,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=23')                                                  
//BP13L590 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  REPRO MATURE REQUEST                                                       
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.F500.NT,DISP=SHR                                         
//OUTPUT2  DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*                                                                             
//*-----------------------------------------------------------------            
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F558.UPGOCCP,DISP=OLD                                    
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(131,1,CH,EQ,C'Y',AND,1,1,CH,EQ,C'Q')                            
  OUTREC FIELDS=(1,17,45X,132,8,11X,107,2,131,1,122,8,35X,96,1,272X)            
