//BP13D53F JOB (BP13P),'BP13D53F',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//*                                                                             
//*  THIS JOB IS USE                                                            
//*  1. TO CREATE THE ZIP FILE FOR FTP TO SIM LIAN                              
//*  2. TO FTP THE ZIP FILE TO SIM LIAN. THE ZIP FILE WILL BE POSTFIX           
//*     WITH DATE AND TIME                                                      
//*  3. TO FTP THE APPLICATION DATA                                             
//*                                                                             
//*  IMPORTANT : FOR CONNECTIVITY TESTING, RUN STEP03 ONWARDS.                  
//*              STEP 1 AND 2 WILL READ THE PROD DATASET AND RE-CREATE          
//*              THE FILE TO SEND TO SIM LIAN. DO NOT RUN STEP1 AND 2.          
//*                                                                             
//* NOTE : THIS JCL CONSIST OF FTP FILE FOR E03                                 
//*                                                                             
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP134015 ZDD  080910   NEW JCL FOR FTP FILE - PATTER TO BP13D534            
//* BP134016 IL5  071010   CATER FOR E02                                        
//* BP134059 IL5  301110   CATER FOR E03                                        
//* BP134060 ZDD  060111   INCREASE FB66 LENGTH TO 3000                         
//*                        CATER FOR E04                                        
//* BP134060 IL5  230211   REMOVE T04                                           
//* BP134206 IL5  090511   ADD E06                                              
//* BP134283 IL5  250611   ADD E07                                              
//* BP134284 IL5  120711   ADD E05                                              
//* BP134266 IL5  180811   ADD T08                                              
//* BP134266 IL5  280811   CHANGE T08 TO E08                                    
//* BP134401 IL5  030112   ADD E09                                              
//* BP134443 IL5  170112   ADD K11                                              
//* BP134416 IL5  260112   ADD E10                                              
//* BP134443 IL5  080212   CHANGE K11 TO E11                                    
//* BP134624 IL5  060912   ADD E14                                              
//* BP134639 IL5  250912   ADD E15 AND REMOVE E05                               
//* BP134704 IL5  061112   ADD E18                                              
//* BP134734 IL5  141212   REMOVE E03 AND E06                                   
//*                        ADD E17-BOOK                                         
//* BP134734 IL5  220213   REINSTATE E03 AND E06                                
//* BP134789 IL5  200313   ADD E20                                              
//* BP134929 ZDD1 260613   ADD E19 AND E21                                      
//* BP134949 HH17 20130925 REMOVE E21 TO BP13D53I                               
//* BP135669 ZDD1 130215   REMOVE E04                                           
//* BP135764 ZDD1 240415   REMOVE E03 AND E06                                   
//* BP135738 HH17 230615   REMOVE E01                                           
//* BP135609 HH17 230615   FTP MIGRATION TO LANSFTPP01                          
//* BP137803 ZDD1 131115   REMOVE E11 AND E20                                   
//* BP137352 MRN1 310518   REMOVE E18                                           
//* BP138045 PP11 111119   REMOVE E02,E07 TO E10, E12 TO E15, E17               
//*==================================================================           
//*********************************************************************         
//*NOTE --- DIRECTORY USED /TEST/APPN/DATA/BP13/FROM-HDB/EC/E01/MF    *         
//*NEED TO CHANGE TO - INCLUDE COND=(1,3,CH,EQ,C'E01')                          
//*********************************************************************         
//*                                                                             
//* FTP APPLICATION DATA TO LANSFTPP01 SERVER                                   
//*                                                                             
//******************************************************************            
//*-------------------------------------------------------------------*         
//* STEP0  :  TO DELETE SEQ. DATASETS                                           
//*-------------------------------------------------------------------*         
//D53FS000 EXEC PGM=IDCAMS                                                      
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FB66.FTPUNIT.E19')                                              
     DEL ('BP13.FTP.ZIP.UNIT.E19')                                              
                                                                                
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*------------------------------------------------------------------           
//*------------------------------------------------------------------           
//* FILE FOR PROJECT E19                                                        
//*------------------------------------------------------------------           
//D53FS19A EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FB66.FTPUNIT,DISP=SHR                                    
//SORTOUT  DD DSN=BP13.FB66.FTPUNIT.E19,DISP=(NEW,CATLG),                       
//         DCB=(BLKSIZE=0,LRECL=3000,RECFM=FB),                                 
//         SPACE=(CYL,(2,5),RLSE)                                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(2937,16,A),FORMAT=CH                                            
   INCLUDE COND=(1,3,CH,EQ,C'E19')                                              
//******************************************************************            
//*                                                                             
//* FTP UNITS FILE TO LANSFTPP01 SERVER                                         
//*                                                                             
//******************************************************************            
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS19B EXEC SAS,COND=(8,LT)                                                 
//BP13FTP2 DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,                                     
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP2;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT '-ARCHIVE(BP13.FTP.ZIP.UNIT.E19)';                                     
     STDPUT   ="-ZIPPED_DSN(BP13.FB66.FTPUNIT.E19";                             
     STDPUT7  =",BOOKD"||DTE_CURR||"T"||PRTHH||".TXT)";                         
     STDPUT8  ="BP13.FB66.FTPUNIT.E19";                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//* TO ZIP TXT FILE                                                             
//******************************************************************            
//D53FS19C EXEC PKZIP                                                           
//SYSIN    DD DSN=BP13.SEQ.PUTGET.UNIT2.EC,DISP=SHR                             
/*                                                                              
//******************************************************************            
//* TO PREPARE FTP STATEMENT                                                    
//******************************************************************            
//D53FS19D EXEC SAS,COND=(8,LT)                                                 
//BP13FTP1 DD DSN=BP13.SEQ.PUTGET.UNIT.EC,                                      
//            DISP=SHR                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DATA _NULL_;                                                                  
     FILE BP13FTP1;                                                             
     CURRDAY = TODAY();                                                         
     DTE_CURR= PUT(CURRDAY,MMDDYY4.);                                           
     CURRTME = TIME();                                                          
     DTE_TME = PUT(CURRTME,HHMM5.);                                             
     LENGTH HH 4.;                                                              
     HH=SUBSTR(DTE_TME,1,2)||SUBSTR(DTE_TME,4,2);                               
     PRTHH=PUT(HH,Z4.);                                                         
     PUT    'CD /PROD/APPN/DATA/BP13/FROM-HDB/EC/E19/MF';                       
     PUT    'BINARY';                                                           
     STDPUT   = "PUT 'BP13.FTP.ZIP.UNIT.E19' ";                                 
     STDPUT7  = "BOOKD"||DTE_CURR||"T"||PRTHH||".ZIP";                          
     STDPUT8  = "QUIT";                                                         
     PUT STDPUT STDPUT7;                                                        
     PUT STDPUT8;                                                               
//*                                                                             
//******************************************************************            
//*  FTP TO LANSFTPP01 SERVER                                                   
//******************************************************************            
//D53FS19E EXEC FTP,PARM='LANSFTPP01 (EXIT',COND=(8,LT)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.SEQ.PUTGET.UNIT.EC,DISP=SHR                              
//*                                                                             
//*------------------------------------------------------------------           
