//BP13A634 JOB (BP13P),'BP13A634',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=====================================================================        
//* CHGE REQ  BY  DDMMCCYY DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP134581 SMR2 09072012 NEW JCL                                              
//* BP134679 SMR2 01112012 ADDITIONAL FORMS                                     
//* BP134718 SMR2 14122012 ADD INFILE BP13.K825.REQOCCP.PREV IN BP13CF58        
//* BP135162 SMR2 29012014 ADD NEW FORMS FOR SBF IN BP13CF58                    
//* BP135775 SMR2 11052015 ADD STEPS TO SAVE INTO CD-ROM (CLASS 8)              
//* BP136172 SMR2 03032016 REMOVE FORMS FOR STUDIO APARTMENT                    
//* BP136169 SMR2 13042016 REMOVE FORM - BP13WO                                 
//* BP136360 SMR2 24082016 ADD BP13CF18                                         
//* BP136642 SMR2 06022017 CATER FOR SYSOUT=8,DEST=IOM8                         
//* BP138184 AM25 20102020 CONVERSION TO RAWDATA USING IOMS                     
//*               11122020 CHANGE CLASS 2 TO CLASS 8                            
//* BP138500 IL5  18122020 CHANGE CLASS 8 TO CLASS *                            
//* BP138511               NO NEED FOR CTRL LIST-USE LETTER PDF TO CHK)         
//* BP139376 IL5  12012023 CHANGE IOMS SERVER FROM HDBIOMNFS TO                 
//*                        HDBIOM3NFSP1                                         
//*=====================================================================        
//*---------------------------------------------------------------------        
//* SORT BY NT, FT, QUEUE, REG NO                                               
//*---------------------------------------------------------------------        
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.ETHNIC.A633.NOEMAIL,DISP=SHR                         
//SORTOUT DD DSN=&&BP13F740,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                               
//           SPACE=(CYL,(35,5),RLSE)                                            
//SYSIN   DD *                                                                  
    SORT FIELDS=(187,3,A,211,2,A,235,5,A,123,8,A),FORMAT=CH                     
//*-----------------------------------------------------------------*           
//*  TO BYPASS RECORD THAT FOUND ON BP13K76D                        *           
//*  REC NOT FOUND WILL BE PROCESSED ON BP13CF58                    *           
//*-----------------------------------------------------------------*           
//STEP02   EXEC PGM=BP13CF18,COND=(0,NE)                                        
//BP13F740 DD DSN=&&BP13F740,DISP=(OLD,DELETE)                                  
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                            
//P13F740A DD DSN=&&F740CF6F,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(35,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* GENERATE RESULT LETTERS RAW-DATA USING IOMS - EIP (BTO/SBF)                 
//*--------------------------------------------------------------------         
//STEP03   EXEC PGM=BP13CF6F,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CF6F,DISP=(OLD,DELETE)                                  
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13K82P DD DSN=BP13.K825.REQOCCP.PREV,DISP=SHR                               
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR                                 
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//P13B6FWN DD DSN=BP13.FIOMSB10.A634CF6F.BP13WN,DISP=OLD                        
//P13H6FWN DD DSN=BP13.FIOMSH10.A634CF6F.BP13WN,DISP=OLD                        
//P13B6FW5 DD DSN=BP13.FIOMSB10.A634CF6F.BP13W5,DISP=OLD                        
//P13H6FW5 DD DSN=BP13.FIOMSH10.A634CF6F.BP13W5,DISP=OLD                        
//BP13FTP  DD DSN=BP13.FIOMSFTP.A634CF6F,DISP=OLD                               
//P13LF6FA DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
BP13A634                                                                        
BP13.FIOMSB10.A634CF6F                                                          
BP13.FIOMSH10.A634CF6F                                                          
//*====================================================================         
//* STEP TO FTP SEQUENTIAL FILES TO IOMS SERVER                                 
//*====================================================================         
//*--------------------------------------------------------------------         
//* PRINT EIP RESULT LETTER                                                     
//*--------------------------------------------------------------------         
//PS0900A EXEC FTP,PARM='HDBIOM3NFSP1 (EXIT',COND=(0,NE)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD DSN=BP13.FIOMSFTP.A634CF6F,DISP=SHR                               
//*                                                                             
