//BP13A630 JOB (BP13P),'BP13A630',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),    00010000
//             SCHENV=PKZIP,NOTIFY=CSD0071                              00020000
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                          00030000
//*-------------------------------------------------------------------* 00040000
//* STEP00 :  TO DELETE SEQ. DATASETS                                   00041000
//*-------------------------------------------------------------------* 00042000
//STEP00   EXEC PGM=IDCAMS                                              00043000
//SYSPRINT DD   SYSOUT=*                                                00044000
//SYSIN    DD   *                                                       00045000
     DEL ('BP13.REPORT.D02')                                            00046000
     DEL ('BP13.REPORT.D04')                                            00047000
     DEL ('BP13.REPORT.D05')                                            00048000
     DEL ('BP13.REPORT.D06')                                            00049000
     DEL ('BP13.FTP.DBSS.REJECT.ZIP')                                   00049100
     IF MAXCC < 12 THEN                                                 00049400
        SET MAXCC = 0                                                   00049500
//*-----------------------------------------------------------------    00050000
//*   SORT BY REGISTRATION NUMBER                                       00060000
//*-----------------------------------------------------------------    00070000
//STEP01 EXEC    SORT,COND=(0,NE)                                       00080000
//SORTIN   DD  DSN=BP13.FA40.TRANS.ACCUM,DISP=SHR                       00090000
//SORTOUT  DD  DSN=&&FA40ALL,DISP=(NEW,PASS),                           00100000
//             UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                     00110000
//             DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                   00120000
//SYSIN    DD  *                                                        00130000
    SORT FIELDS=(1,150,A),FORMAT=CH                                     00140000
    SUM FIELDS=NONE                                                     00141000
//*-----------------------------------------------------------------    00150000
//*   SORT REJECTED CASES FOR KWN, TP, TAP AND BH                       00160000
//*-----------------------------------------------------------------    00170000
//STEP02 EXEC    SORT,COND=(0,NE)                                       00180000
//SORTIN   DD  DSN=&&FA40ALL,DISP=(OLD,PASS)                            00190000
//SORTOUT  DD  DSN=&&FA40RI,DISP=(NEW,PASS),                            00200000
//             UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                     00210000
//             DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                   00220000
//SYSIN    DD  *                                                        00230000
    SORT FIELDS=(1,150,A),FORMAT=CH                                     00240000
    INCLUDE COND=((9,2,CH,EQ,C'RI',AND,61,3,CH,EQ,C'TAP'),OR,           00250000
                 (9,2,CH,EQ,C'RI',AND,61,3,CH,EQ,C'TP '),OR,            00260000
                 (9,2,CH,EQ,C'RI',AND,61,3,CH,EQ,C'KWN'),OR,            00261000
                 (9,2,CH,EQ,C'RI',AND,61,3,CH,EQ,C'BH '))               00270000
//*-----------------------------------------------------------------    00280000
//* TO DETERMINE CASES FOR THE REJECTED CASES                           00290000
//*-----------------------------------------------------------------    00300000
//STEP03 EXEC PGM=BP13C02V,COND=(0,NE)                                  00310000
//BP13FA40  DD DSN=&&FA40ALL,DISP=(OLD,PASS)                            00320000
//P13FA40T  DD DSN=&&FA40RI,DISP=(OLD,DELETE)                           00330000
//P13FA40O  DD DSN=&&FA40RI,DISP=(NEW,PASS),                            00340000
//             UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                     00350000
//             DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                   00360000
//SYSOUT   DD SYSOUT=*                                                  00370000
//SYSDBOUT DD SYSOUT=*                                                  00380000
/*                                                                      00381000
//*-----------------------------------------------------------------    00382000
//*   SORT BY REGISTRATION NUMBER                                       00383000
//*-----------------------------------------------------------------    00384000
//STEP04 EXEC    SORT,COND=(0,NE)                                       00385000
//SORTIN   DD  DSN=&&FA40RI,DISP=(OLD,DELETE)                           00386000
//SORTOUT  DD  DSN=&&FA40SAS,DISP=(NEW,PASS),                           00387000
//             UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                     00388000
//             DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                   00389000
//SYSIN    DD  *                                                        00389100
    SORT FIELDS=(61,3,A,1,8,A,135,8,A,48,10,A),FORMAT=CH                00389200
//*-----------------------------------------------------------------    00389300
//* TO GENERATE REPORT                                                  00389400
//*-----------------------------------------------------------------    00389500
//STEP05   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)          00389600
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(10,40),,,ROUND)                    00389700
//BP13FA40  DD DSN=&&FA40SAS,DISP=(OLD,DELETE)                          00389800
//BP13LD02  DD DSN=BP13.REPORT.D02,DISP=(NEW,CATLG),                    00389900
//             UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),                       00390000
//             DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                   00390100
//BP13LD04  DD DSN=BP13.REPORT.D04,DISP=(NEW,CATLG),                    00390200
//             UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),                       00390300
//             DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                   00390400
//BP13LD05  DD DSN=BP13.REPORT.D05,DISP=(NEW,CATLG),                    00390500
//             UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),                       00390600
//             DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                   00390700
//BP13LD06  DD DSN=BP13.REPORT.D06,DISP=(NEW,CATLG),                    00390800
//             UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE),                       00390900
//             DCB=(BLKSIZE=27900,LRECL=150,RECFM=FB)                   00391000
//SYSOUT    DD SYSOUT=*                                                 00391100
//SYSPRINT  DD SYSOUT=*                                                 00391200
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S556),DISP=SHR                    00391300
//*****************************************************************     02140000
//* STEP00: AUTO-GENERATE MAIL HEADER PART I                            02150000
//*         HELO SGPHDBX                                                02160000
//*         MAIL FROM:<XXXXXXXX@SGPHDBX>                                02170000
//*****************************************************************     02180000
//A630S000 EXEC PGM=IRXJCL,PARM='SMTPHDR'                               02190000
//SYSTSPRT DD  SYSOUT=*                                                 02200000
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                           02210000
//SMTPHDR  DD  DSN=&&TEMP1,DISP=(NEW,PASS),                             02220000
//         SPACE=(TRK,(1,1)),DCB=(DSORG=PS,LRECL=259,RECFM=VB)          02230000
//SYSTSIN  DD  DUMMY                                                    02240000
//*                                                                     02250000
//*--------------------------------------------------------------------*02260000
//*  STEP01:        *  ZIP THE REPORT FILE    *                         02270000
//*--------------------------------------------------------------------*02280000
//A630S001  EXEC PKZIP,COND=(0,NE)                                      02290000
-ARCHIVE(BP13.FTP.DBSS.REJECT.ZIP)                                      02300000
-ARCHVOL(DUMMY)                                                         02310000
-METHOD(FAST)                                                           02320000
-ZIPPED_DSN(BP13.REPORT.D02,KWN.TXT)                                    02330000
-ZIPPED_DSN(BP13.REPORT.D04,BH.TXT)                                     02340000
-ZIPPED_DSN(BP13.REPORT.D05,TAP.TXT)                                    02350000
-ZIPPED_DSN(BP13.REPORT.D06,TP.TXT)                                     02360000
-FILE_TERMINATOR()                                                      02370000
 BP13.REPORT.D02                                                        02380000
 BP13.REPORT.D04                                                        02390000
 BP13.REPORT.D05                                                        02400000
 BP13.REPORT.D06                                                        02410000
//*------------------------------------------------------------------*  02420000
//* STEP02:-      CREATE MAIL INFO USING SAS                            02430000
//*        IF ACJOB MAIL FROM = 'ACJOB@SGPHDB1'                         02440000
//*        IF MVS1  MAIL FROM = 'OPCP@SGPHDB1'                          02450000
//*        IF MVS2  MAIL FROM = 'OPC2@SGPHDB1'                          02460000
//*        IF MVS3  MAIL FROM = 'CS91151@SGPHDB3' (EXAMPLE)             02470000
//*------------------------------------------------------------------*  02480000
//A630S002  EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                        02490000
//WORK     DD UNIT=SYSDA,SPACE=(1,(50,50)),AVGREC=M                     02500000
//SYSOUT   DD SYSOUT=*                                                  02510000
//BP13MAIL DD DSN=&&BP13MAIL,DISP=(NEW,PASS),                           02520000
//         LRECL=259,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,              02530000
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                       02540000
//SYSPRINT DD SYSOUT=*                                                  02550000
//SYSIN    DD *                                                         02560000
      DATA _NULL_;                                                      02570000
          FILE BP13MAIL;                                                02571000
          PUT @01 'RCPT TO:<LHI2@HDB.GOV.SG                        >';  02572000
          PUT @01 'DATA                                              '; 02576000
          PUT @01 'TO:LHI2@HDB.GOV.SG';                                 02577000
          PUT @01 'SUBJECT:DBSS REJECTED APPLICATIONS';                 02580000
//*------------------------------------------------------------------*  02590000
//* STEP03:-      CREATE ZIP HEADER FORMAT                              02600000
//*------------------------------------------------------------------*  02610000
//A630S003  EXEC SAS,COND=(0,NE),OPTIONS='MACRO'                        02620000
//WORK     DD UNIT=SYSDA,SPACE=(1,(50,50)),AVGREC=M                     02630000
//SYSOUT   DD SYSOUT=*                                                  02640000
//BP13ZIPH DD DSN=&&BP13ZIPH,DISP=(NEW,PASS),                           02650000
//         LRECL=259,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,              02660000
//         SPACE=(1,(1,1),RLSE),AVGREC=M,DSORG=PS                       02670000
//SYSPRINT DD SYSOUT=*                                                  02680000
//SYSIN    DD *                                                         02690000
  DATA _NULL_;                                                          02700000
      FILE BP13ZIPH;                                                    02710000
      PUT @01 '               NAME="BP13.FTP.DBSS.REJECT.ZIP"';         02720000
      PUT @01 '                                   ';                    02730000
/*                                                                      02740000
//*****************************************************************     02750000
//* STEP04: ENCODE A ZIP DATASET INTO BASE64 FORMAT                     02760000
//*****************************************************************     02770000
//A630S004 EXEC ENCODE,COND=(0,NE)                                      02780000
//ENCODOUT DD DSN=&&BASE64,DISP=(,PASS),                                02790000
//            SPACE=(5,(10,10),RLSE),AVGREC=M                           02800000
//ENCODIN  DD DSN=BP13.FTP.DBSS.REJECT.ZIP,DISP=SHR                     02810000
/*                                                                      02820000
//*****************************************************************     02830000
//* STEP05: CONVERT OUTPUT TO VARIABLE-BLOCKED (VB)                     02840000
//*****************************************************************     02850000
//A630S005 EXEC SORT,COND=(0,NE)                                        02860000
//SORTIN   DD DSN=&&BASE64,DISP=(SHR,DELETE)                            02870000
//FBVB     DD DSN=&&VB64,DISP=(,PASS),                                  02880000
//           SPACE=(TRK,(10,5),RLSE),                                   02890000
//           DCB=(DSORG=PS,LRECL=259,RECFM=VB)                          02900000
//SYSIN    DD *                                                         02910000
 MERGE FIELDS=COPY                                                      02920000
 OUTFIL FNAMES=FBVB,FTOV,VLTRIM=X'40'                                   02930000
/*                                                                      02940000
//*****************************************************************     02950000
//* STEP06: OUTPUT SMTP MAIL WITH CONTENT & ATTACHMENT TO A DATASET     02960000
//*****************************************************************     02970000
//A630S006 EXEC PGM=IEBGENER,COND=(0,NE)                                02980000
//SYSUT1   DD DSN=*.A630S000.SMTPHDR,DISP=(SHR,PASS)                    02990000
//         DD DSN=&&BP13MAIL,DISP=(SHR,DELETE)                          03000000
//         DD DSN=AV05.MIME.HEADERS.VB(MIMEHDR),DISP=SHR                03010000
//         DD DSN=AV05.MIME.HEADERS.VB(APPLHDR),DISP=SHR                03020000
//         DD DSN=&&BP13ZIPH,DISP=(SHR,DELETE)                          03030000
//         DD DSN=&&VB64,DISP=(SHR,DELETE)                              03040000
//SYSUT2   DD DSN=&&BP13DEMO,DISP=(NEW,PASS),                           03050000
//         LRECL=259,RECFM=VB,BLKSIZE=0,DATACLAS=MULTIVOL,              03060000
//         SPACE=(2,(5,5),RLSE),AVGREC=M,DSORG=PS                       03070000
//SYSPRINT DD SYSOUT=*                                                  03080000
//SYSIN    DD DUMMY                                                     03090000
/*                                                                      03100000
//*****************************************************************     03110000
//* STEP07: SEND THE HTML FORMATTED SMTP MAIL                           03120000
//*****************************************************************     03130000
//A630S007 EXEC SENDMAIL,COND=(0,NE)                                    03140000
//INPUT    DD DSN=&&BP13DEMO,DISP=(SHR,DELETE)                          03150000
/*                                                                      03160000
//*****************************************************************     03170000
//* STEP00 :  TO DELETE SEQ. DATASETS                                   03180000
//*****************************************************************     03190000
//STEP00   EXEC PGM=IDCAMS                                              03200000
//SYSPRINT DD   SYSOUT=*                                                03210000
//SYSIN    DD   *                                                       03220000
     DEL ('BP13.REPORT.D02')                                            03230000
     DEL ('BP13.REPORT.D04')                                            03240000
     DEL ('BP13.REPORT.D05')                                            03250000
     DEL ('BP13.REPORT.D06')                                            03260000
     DEL ('BP13.FTP.DBSS.REJECT.ZIP')                                   03270000
     IF MAXCC < 12 THEN                                                 03280000
        SET MAXCC = 0                                                   03290000
