//BP13D219 JOB (BP13P),'BP13D219',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* CHG REF  DATE     BY   DESCRIPTION                                          
//* -------- -------- ---  -----------                                          
//* BP137631 20190610 CC37 CREATE F206 XML FILE FOR OBF                         
//*=================================================================            
//STEP01   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F206.HQMS.OBF,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F206.HQMS.OBF.BACKUP,DISP=OLD                            
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F206 DD  DSN=BP13.F206.HQMS.OBF,                                          
//             DISP=SHR                                                         
//BP13K757 DD  DSN=BP13.K757.BTO,                                               
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K022 DD  DSN=BP13.K022.WISOIC,                                            
//             DISP=SHR                                                         
//BP13K021 DD  DSN=BP13.K022.WISOIC.PATH1,                                      
//             DISP=SHR                                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C222)  PLAN(BP13PCC) -                                        
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
//******************************************************************            
//* FTP EQMS FILE TO HQMSIFSGP01 SERVER (PRODUCTION SERVER)                     
//******************************************************************            
//STEP03   EXEC FTP,PARM='HQMSIFSGP01 (EXIT',COND=(8,LT)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  HQMS\FTP\SOU\IN                                                           
  ASCII                                                                         
  PUT 'BP13.F206.HQMS.OBF' SOU_OB_IN.XML                                        
  QUIT                                                                          
//*                                                                             
//******************************************************************            
