//BP13A267  JOB (BP13P),'BP13A267',CLASS=I,MSGCLASS=N,                          
//      MSGLEVEL=(1,1),NOTIFY=CSD0071                                           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* BTO                                                                         
//*=================================================================            
//* NOTIFICATION LETTER TO INFORM APPLICANT ON DECISION TO PROCEED              
//* WITH BUILDING PROGRAM                                                       
//*                                                                             
//* NOTE: CUSTOMISE PGM BEFORE PRINT (CHK FOR EST/NEIGH/CONTRACT)               
//*                                                                             
//*=================================================================            
//* BP134044 20101014 DW5  TO ADD ACCUM BP13F205                                
//* BP134043 20101215 DW5  TO INCREASE SIZE OF TEMP BP13F800                    
//* BP135171 20140210 RJE1 TO CATER FOR DB2 UPGRADE                             
//*=================================================================            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* FOR LOAN TAG = H                                                            
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POT3,FORM=BP13TB,JDL=BP13,END;                                     
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* FOR LOAN TAG = P                                                            
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POT3,FORM=BP13TB,JDL=BP13,END;                                     
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1C                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* FOR LOAN TAG = N                                                            
//*-----------------------------------------------------------------            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POT3,FORM=BP13TC,JDL=BP13,END;                                     
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1D                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* FOR LOAN TAG = B                                                            
//*-----------------------------------------------------------------            
//PRT05    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13BT08,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* FOR STUDIO APARTMENT                                                        
//*-----------------------------------------------------------------            
//PRT06    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POT3,FORM=BP13TP,JDL=BP13,END;                                     
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1E                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT OUT BP13K800 RECORDS                                                   
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&P13F800A,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(16,8),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(1,1,CH,NE,C'C',AND,                                           
                  155,9,CH,NE,C'         ',AND,                                 
                  924,3,CH,EQ,C'BTO')                                           
//*-----------------------------------------------------------------            
//* SORT OUT BP13F205 RECORD FOR NOTIFICATION LETTER                            
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13F205,DISP=(NEW,PASS),                                    
//            SPACE=(TRK,(1,1),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                 
//SYSIN    DD *                                                                 
    SORT FIELDS=COPY                                                            
    INCLUDE COND=(14,2,CH,EQ,C'NL')                                             
//*-----------------------------------------------------------------            
//* SORT OUT RECORDS WITH SAME NT/DTE APPT/SEL/BALLOT DTE AS F205               
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=BP13C23H,COND=(0,NE)                                        
//BP13F800 DD DSN=&&P13F800A,DISP=(SHR,PASS)                                    
//BP13F205 DD DSN=&&P13F205,DISP=(SHR,PASS)                                     
//P13F800B DD DSN=&&P13F800B,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(16,8),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*=================================================================            
//* FOR HDB LOAN (TAG H) APPLICANTS ONLY                                        
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F800B,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F800C,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(16,8),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(963,1,CH,EQ,C'H',AND,                                         
                  30,2,CH,NE,C'1A',AND,                                         
                  30,2,CH,NE,C'2A')                                             
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&P13F800C,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13P037 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//P13P037A DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//BP13L037 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C037) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*=================================================================            
//* FOR PENDING LOAN (TAG P) APPLICANTS ONLY                                    
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F800B,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F800D,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(16,8),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(963,1,CH,EQ,C'P',AND,                                         
                  30,2,CH,NE,C'1A',AND,                                         
                  30,2,CH,NE,C'2A')                                             
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&P13F800D,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13P037 DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID)                                  
//P13P037A DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID)                                  
//BP13L037 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C037) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*=================================================================            
//* FOR NO LOAN (TAG N) APPLICANTS ONLY                                         
//*-----------------------------------------------------------------            
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F800B,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F800E,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(16,8),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(963,1,CH,EQ,C'N',AND,                                         
                  30,2,CH,NE,C'1A',AND,                                         
                  30,2,CH,NE,C'2A')                                             
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&P13F800E,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13P037 DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID)                                  
//P13P037A DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID)                                  
//BP13L037 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C037) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*=================================================================            
//* FOR BANK LOAN (TAG B) APPLICANTS ONLY                                       
//*-----------------------------------------------------------------            
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F800B,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F800F,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(16,8),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(963,1,CH,EQ,C'B',AND,                                         
                  30,2,CH,NE,C'1A',AND,                                         
                  30,2,CH,NE,C'2A')                                             
//*-----------------------------------------------------------------            
//STEP11   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&P13F800F,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13P000 DD SYSOUT=2,OUTPUT=(*.PRT05.FORMID)                                  
//BP13L000 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C23J) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*=================================================================            
//* FOR STUDIO APARTMENT ONLY                                                   
//*-----------------------------------------------------------------            
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F800B,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F800G,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(16,8),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(4,8,A),FORMAT=CH                                               
    INCLUDE COND=(30,2,CH,EQ,C'1A',OR,                                          
                  30,2,CH,EQ,C'2A')                                             
//*-----------------------------------------------------------------            
//STEP13   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800 DD DSN=&&P13F800G,DISP=(OLD,DELETE)                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13P036 DD SYSOUT=2,OUTPUT=(*.PRT06.FORMID)                                  
//P13P036A DD SYSOUT=2,OUTPUT=(*.PRT06.FORMID)                                  
//BP13L036 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C036) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//*  ACCUMULATE CONTROL REC INTO CTLREC-ACC FILE                                
//*-----------------------------------------------------------------            
//STEP14   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&P13F205,DISP=(SHR,PASS)                                    
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
