//BP13D606 JOB (BP13P),'BP13D606',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* PROCESS BP27F341 (BP27.F341.TRANS.CA1ST)                                    
//*=================================================================            
//* CHG REF  DATE     BY    DESCRIPTION                                         
//* -------- -------- ---   -----------                                         
//* BP135664 08052015 ESA1  NEW JCL FOR 1STCA                                   
//* BP136664 20032017 ESA1  TO EXPAND DISK SPACE FOR STEP 3                     
//* BP136739 17082017 LJL1  TO INCLUDE BP27K200.                                
//*=================================================================            
//*--------------------------------------------------                           
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------                           
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1    DD DSN=BP13.K800.APPLN,DISP=OLD                                     
//INPUT2    DD DSN=BP13.K820.OCCUP,DISP=OLD                                     
//INPUT3    DD DSN=BP13.K640.CA.ACTION,DISP=OLD                                 
//INPUT4    DD DSN=BP13.K848.BKIMAGE,DISP=OLD                                   
//INPUT5    DD DSN=BP27.K800.HLAPPLN,DISP=OLD                                   
//INPUT6    DD DSN=BP27.K900.HLAPPLN.LOG,DISP=OLD                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
//*-----------------------------------------------------------------*           
//*SORT COPY BP27F340 TO ACCUM FILE                                             
//*-----------------------------------------------------------------*           
//STEP01   EXEC SORT                                                            
//SORTIN   DD DSN=BP27.F341.TRANS.CA1ST,DISP=SHR                                
//SORTOUT  DD DSN=BP13.BP27.F341.ACCUM,DISP=MOD                                 
//SYSIN    DD *                                                                 
      SORT FIELDS=COPY                                                          
//*-------------------------------------------------------------------*         
//* TO SORT CASES FROM BP27F341                                       *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP27.F341.TRANS.CA1ST,DISP=SHR                                
//SORTOUT  DD DSN=&&BP27F341,DISP=(NEW,PASS),                                   
//         DCB=(RECFM=FB,LRECL=50,BLKSIZE=0),                                   
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN DD *                                                                    
   SORT FIELDS=(1,9,CH,A)                                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT IN HLA CASES                                                 *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTIN   DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP27F800,DISP=(NEW,PASS),                                   
//         DCB=(RECFM=FB,LRECL=1200,BLKSIZE=0),                                 
//         SPACE=(CYL,(500,100),RLSE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,9,CH,A)                                                       
/*                                                                              
//*-----------------------------------------------------------------            
//*  UPDATE SOC FILES FOR HLA CASES DURING DOWNTIME                             
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13C3A3,COND=(0,NE)                                        
//BP27F341 DD DSN=&&BP27F341,DISP=(OLD,DELETE)                                  
//BP27F800 DD DSN=&&BP27F800,DISP=(OLD,DELETE)                                  
//BP27K200 DD DSN=BP27.K200.RTEHIST,DISP=SHR                                    
//BP27K800 DD DSN=BP27.K800.HLAPPLN,DISP=SHR                                    
//BP27K900 DD DSN=BP27.K900.HLAPPLN.LOG,DISP=SHR                                
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K640 DD DSN=BP13.K640.CA.ACTION,DISP=SHR                                  
//BP13K848 DD DSN=BP13.K848.BKIMAGE,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*EMPTY BP27.F341.TRANS.CA1ST                                                  
//*--------------------------------------------------------------------         
//STEP05  EXEC    PGM=IDCAMS,COND=(0,NE)                                        
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DUMMY                                                            
//OUTPUT1  DD  DSN=BP27.F341.TRANS.CA1ST,DISP=SHR                               
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
