//BP13M203  JOB (BP13P),'BP13M203',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*********************************************************************         
//* OUTPUT FILE FOR MPU REPORTING                                               
//*********************************************************************         
//* CHG-NO    ONN    BY                                                         
//*----------------------------------                                           
//* BP133641 280709 LSB - NEW REPORT                                            
//* BP133641 180809 LSB - TO GET FT,NT,ACCEPTANCE DATE FOR CANCEL CASES         
//* BP133097 201210 LSB - ADD BOOK FILE FOR PREV FY                             
//* BP134495 201207 LSB - ADD REJECT-DATE, REASON FOR CANCEL CASES              
//* BP135171 110214 RJE - TO CATER FOR DB2 UPGRADE                              
//* BP136230 070616 LSB - BYPASS DUPLICATE RECORDS                              
//* BP136252 050716 LSB - ENHANCE BP13CZ26 REPORT                               
//* BP136261 130716 KAM4- INCLUDE REGN FOR SORT FIELDS IN STEP 6 &6A            
//* BP136300 010816 CCC5- REPLACE UNIT=SYSDA WITH UNIT=(SYSDA,10)               
//* BP136901 240717 LSB1- ADD ROF                                               
//* BP137786 230519 KV6 - ADD OBF                                               
//* BP139462 310123 LSB1- DEFINE BP13K80A, DELET JOB BP13M204                   
//*********************************************************************         
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01 : 1 COPY                                                             
//*--------------------------------------------------------------------         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* CANCEL CASES - IN MASTER FILE                                               
//* CANCEL-DATE > YEAR 2008                                                     
//*-----------------------------------------------------------------            
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F800,DISP=(NEW,PASS),                                  
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(350,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=((1,1,CH,EQ,C'C',AND,                                           
                  185,4,CH,GT,C'2012',AND,                                      
                  155,1,CH,EQ,C' '),OR,                                         
                 155,1,CH,NE,C' ')                                              
//*-----------------------------------------------------------------            
//* CANCEL CASES - HISTORY FILE                                                 
//* CANCEL-DATE > YEAR 2008                                                     
//*-----------------------------------------------------------------            
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F800,DISP=(MOD,PASS),                                  
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(350,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=((1,1,CH,EQ,C'C',AND,                                           
                  185,4,CH,GT,C'2012',AND,                                      
                  155,1,CH,EQ,C' '),OR,                                         
                (155,1,CH,NE,C' ',AND,2035,4,CH,GE,C'2012'))                    
   OUTREC FIELDS=(1,2000)                                                       
//*-----------------------------------------------------------------            
//* CANCEL CASES SORT BY REGN                                                   
//*-----------------------------------------------------------------            
//STEP03   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F800,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F800CY60,DISP=(,PASS),                                     
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(150,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   SUM FIELDS=NONE                                                              
   INCLUDE COND=(1,1,CH,EQ,C'C',AND,                                            
                 185,4,CH,GT,C'2012',AND,                                       
                 155,1,CH,EQ,C' ')                                              
//*-----------------------------------------------------------------            
//* SORT BY REGN , RI/RG/RS CASES                                               
//*-----------------------------------------------------------------            
//STEP04   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BM06.K950.FIS.HISTORY,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&F950CY60,DISP=(,PASS),                                     
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(350,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=600)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(280,8,A),FORMAT=CH                                              
   INCLUDE COND=(29,1,CH,EQ,C'R',AND,                                           
                 12,4,CH,GE,C'2012')                                            
//*-----------------------------------------------------------------            
//* MATCH BP13F800 AND BM06F950                                                 
//*-----------------------------------------------------------------            
//STEP05   EXEC  PGM=BP13CY60,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&F800CY60,DISP=(OLD,PASS)                                   
//BM06F950 DD  DSN=&&F950CY60,DISP=(OLD,PASS)                                   
//P13F800A DD  DSN=&&F800CAN,DISP=(,PASS),                                      
//             UNIT=(SYSDA,10),SPACE=(CYL,(50,10),RLSE),                        
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT BY SCH-ACC FOR BOOKED AND KEY-ISSUED CASES                             
//*-----------------------------------------------------------------            
//STEP06   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F800,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F800BK,DISP=(,PASS),                                       
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(280,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
   SORT FIELDS=(155,11,A,4,8,A),FORMAT=CH                                       
   SUM FIELDS=NONE                                                              
   INCLUDE COND=(155,4,CH,NE,C'    ')                                           
//*-----------------------------------------------------------------            
//* SORT BY SCH-ACC                                                             
//*-----------------------------------------------------------------            
//STEP6A   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&F800CAN,DISP=(OLD,PASS)                                    
//         DD  DSN=&&F800BK,DISP=(OLD,PASS)                                     
//SORTOUT  DD  DSN=&&F800SCH,DISP=(,PASS),                                      
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(280,80),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
   SORT FIELDS=(155,11,A,4,8,A),FORMAT=CH                                       
   SUM FIELDS=NONE                                                              
//*-----------------------------------------------------------------            
//* FOR CANCEL CASES, OUTPUT TO BP13.F557.YEAR.CANCEL                           
//* FOR KEY-ISSUED CASES, OUTPUT TO BP13.F557.YEAR.TP                           
//* FOR BOOKED CASES, OUTPUT TO BP13F558 TO GET SMS/RSL INFOR                   
//*-----------------------------------------------------------------            
//STEP07   EXEC  PGM=BP13CY50,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&F800SCH,DISP=(OLD,PASS)                                    
//BM06F120 DD  DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                              
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K821 DD  DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                              
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K893 DD  DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//P13F557A DD  DSN=&&F557CY50,DISP=(,PASS),                                     
//             UNIT=(SYSDA,10),SPACE=(CYL,(200,30),RLSE),                       
//             DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                               
//P13F800A DD  DSN=BP13.F800.APPLN.M203,DISP=OLD                                
//P13F557B DD  DSN=BP13.F557.YEAR.TP,DISP=OLD                                   
//P13F557C DD  DSN=&&F557C,DISP=(,PASS),                                        
//            UNIT=(SYSDA,10),SPACE=(CYL,(120,30),RLSE),                        
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//BP13F558 DD  DSN=&&F558CY50,DISP=(,PASS),                                     
//             DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                          
//             UNIT=(SYSDA,10),SPACE=(CYL,(200,30),RLSE)                        
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT BY SMS-HDB-REF                                                         
//*-----------------------------------------------------------------            
//STEP07A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AB03.F089.PIDB,DISP=SHR                                       
//SORTOUT  DD DSN=&&AB03F089,DISP=(,PASS),                                      
//            UNIT=(SYSDA,10),SPACE=(CYL,(250,50),RLSE),                        
//            DCB=(RECFM=FB,LRECL=250,BLKSIZE=27750)                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,9,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* CANCEL CASES SORT BY SCH ACCT                                               
//*-----------------------------------------------------------------            
//STEP07B  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&F557C,DISP=(OLD,PASS)                                      
//SORTOUT  DD  DSN=&&F557C2,DISP=(,PASS),                                       
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(80,20),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(10,11,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* MATCH BP13F800 AND BM06F950 TO GET FT & NT IF FT OR NT NOT EXIST            
//*-----------------------------------------------------------------            
//STEP07C  EXEC  PGM=BP13CY62,COND=(0,NE)                                       
//BP13F557 DD  DSN=&&F557C2,DISP=(OLD,PASS)                                     
//AB03F089 DD  DSN=&&AB03F089,DISP=(OLD,PASS)                                   
//P13F557A DD  DSN=BP13.F557.YEAR.CANCEL,DISP=SHR                               
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT BY NRIC                                                                
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558CY50,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558NRIC,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=(SYSDA,10),SPACE=(CYL,(180,20),RLSE)                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                            
//* MATCH NRIC IN RESALE FILE, IF MATCH UPDATE AS UPGRADER                      
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13U702,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&F558NRIC,DISP=(OLD,PASS)                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=&&F558U702,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=(SYSDA,10),SPACE=(CYL,(180,20),RLSE)                         
//BP13L702 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST, SOC-OCCUPIER FILE                             
//* MATCH NRIC IN SMS FILE, IF MATCH UPDATE AS UPGRADER                         
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13U706,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&F558U702,DISP=(OLD,PASS)                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=&&F558U706,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=(SYSDA,10),SPACE=(CYL,(50,30),RLSE)                          
//BP13F559 DD DSN=BP13.F559.DUPSMS,DISP=SHR                                     
//BP13L706 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BY                                                                     
//*    REGN NO(A) +                                                             
//*    NRIC(A) +                                                                
//*    DTE-SOLD-FLAT-SMS(D) +                                                   
//*    SALES-TYPE-SMS(D)                                                        
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558U706,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558REGN,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,10),SPACE=(CYL,(150,30),RLSE),                        
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,17,A,53,10,D),FORMAT=CH                                      
//*-----------------------------------------------------------------            
//* SORT BY REGN NO                                                             
//* BOOKED CASES                                                                
//*-----------------------------------------------------------------            
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F557CY50,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F557REGN,DISP=(,PASS),                                      
//            UNIT=(SYSDA,10),SPACE=(CYL,(180,30),RLSE),                        
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
    SORT FIELDS=(2,8,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* MATCH F557 & F558 TO GET RSL F558-DTE-APPR-RSL-LATEST, FT                   
//*                      GET SMS F558-DTE-FLAT-SOLD-SMS, SALES-TYPE             
//* IF F558 HAS DUPLICATE SMS, GET LASTEST F558-DTE-FLAT-SOLD-SMS               
//*-----------------------------------------------------------------            
//STEP13   EXEC  PGM=BP13CY51,COND=(0,NE)                                       
//BP13F558 DD  DSN=&&F558REGN,DISP=(OLD,PASS)                                   
//BP13F557 DD  DSN=&&F557REGN,DISP=(OLD,PASS)                                   
//P13F557A DD  DSN=&&F557CY51,DISP=(,PASS),                                     
//            UNIT=(SYSDA,10),SPACE=(CYL,(180,30),RLSE),                        
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT OUT IN NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558CY50,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716SORT,DISP=(,PASS),                                      
//            UNIT=(SYSDA,10),SPACE=(CYL,(160,15),RLSE),                        
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   OUTREC FIELDS=(1,8,9,9,333X)                                                 
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP15   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=&&F716Q748,DISP=(,PASS),                                      
//            UNIT=(SYSDA,10),SPACE=(CYL,(160,15),RLSE),                        
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
//*-----------------------------------------------------------------            
//* SORT BY REGN                                                                
//*-----------------------------------------------------------------            
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F557CY51,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F557A,DISP=(,PASS),                                         
//            UNIT=(SYSDA,10),SPACE=(CYL,(150,30),RLSE),                        
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
    SORT FIELDS=(2,8,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* SORT BY REGN                                                                
//*-----------------------------------------------------------------            
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716Q748,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716REGN,DISP=(,PASS),                                      
//            UNIT=(SYSDA,10),SPACE=(CYL,(160,15),RLSE),                        
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* MATCH F557 & F716 TO GET SMS HDB-REF & FLAT TYPE & ROLE                     
//*-----------------------------------------------------------------            
//STEP18   EXEC  PGM=BP13CY52,COND=(0,NE)                                       
//BP13F716 DD  DSN=&&F716REGN,DISP=(OLD,PASS)                                   
//BP13F557 DD  DSN=&&F557A,DISP=(OLD,PASS)                                      
//P13F557A DD  DSN=&&F557CY52,DISP=(,PASS),                                     
//            UNIT=(SYSDA,10),SPACE=(CYL,(150,30),RLSE),                        
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT BY SMS-HDB-REF                                                         
//*-----------------------------------------------------------------            
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F557CY52,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F557SCH,DISP=(,PASS),                                       
//            UNIT=(SYSDA,10),SPACE=(CYL,(150,30),RLSE),                        
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
    SORT FIELDS=(192,11,A),FORMAT=CH                                            
//*-----------------------------------------------------------------            
//* MATCH F557 & F089 BY SMS HDB REF(BOOKED)                                    
//*  GET FLAT TYPE & TOWN & ESTATE & SALES TYPE                                 
//*-----------------------------------------------------------------            
//STEP21   EXEC  PGM=BP13CY53,COND=(0,NE)                                       
//AB03F089 DD  DSN=&&AB03F089,DISP=(OLD,PASS)                                   
//BP13F557 DD  DSN=&&F557SCH,DISP=(OLD,PASS)                                    
//P13F557A DD  DSN=BP13.F557.YEAR.BOOK,DISP=SHR                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* FORMAT AND ADD IN HEADER FOR MPU                                            
//*---------------------------------------------------------------------        
//* SORT REGN-NO , OUTPUT CURRENT YEAR RECORDS                                  
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F557.YEAR.BOOK,DISP=SHR                                  
//SORTOUT  DD DSN=&&F557BK,DISP=(NEW,PASS),                                     
//        UNIT=(SYSDA,10),DCB=(RECFM=FB,LRECL=400),                             
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(2,8,A),FORMAT=CH                                                 
  INCLUDE COND=(285,1,CH,EQ,C'Y')                                               
//*-----------------------------------------------------------------            
//* OUTPUT BOOKED FILE WITH REPORT TITLE                                        
//*-----------------------------------------------------------------            
//STEP23   EXEC PGM=BP13CY56,COND=(0,NE)                                        
//BP13F557 DD DSN=&&F557BK,DISP=(OLD,PASS)                                      
//BP13L557 DD DSN=BP13.L557.YEAR.BOOK.REPORT,DISP=OLD                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REGN-NO , OUTPUT PREV YEAR RECORDS                                     
//*---------------------------------------------------------------------        
//STEP23A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F557.YEAR.BOOK,DISP=SHR                                  
//SORTOUT  DD DSN=&&F557BK2,DISP=(NEW,PASS),                                    
//        UNIT=(SYSDA,10),DCB=(RECFM=FB,LRECL=400),                             
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(2,8,A),FORMAT=CH                                                 
  INCLUDE COND=(285,1,CH,EQ,C'N')                                               
//*-----------------------------------------------------------------            
//* OUTPUT BOOKED FILE WITH REPORT TITLE                                        
//*-----------------------------------------------------------------            
//STEP23B  EXEC PGM=BP13CY56,COND=(0,NE)                                        
//BP13F557 DD DSN=&&F557BK2,DISP=(OLD,PASS)                                     
//BP13L557 DD DSN=BP13.L557.PREYEAR.BOOK.REPORT,DISP=OLD                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REGN-NO                                                                
//*---------------------------------------------------------------------        
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F557.YEAR.CANCEL,DISP=SHR                                
//SORTOUT  DD DSN=&&F557CAN,DISP=(NEW,PASS),                                    
//        UNIT=(SYSDA,10),DCB=(RECFM=FB,LRECL=400),                             
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(2,8,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* OUTPUT CANCELLATION FILE WITH REPORT TITLE                                  
//*-----------------------------------------------------------------            
//STEP25   EXEC PGM=BP13CY56,COND=(0,NE)                                        
//BP13F557 DD DSN=&&F557CAN,DISP=(OLD,PASS)                                     
//BP13L557 DD DSN=BP13.L557.YEAR.CANCEL.REPORT,DISP=OLD                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REGN-NO                                                                
//*---------------------------------------------------------------------        
//STEP26   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F557.YEAR.TP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F557TP,DISP=(NEW,PASS),                                     
//        UNIT=(SYSDA,10),DCB=(RECFM=FB,LRECL=400),                             
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(2,8,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* OUTPUT KEY-ISSUED FILE WITH REPORT TITLE                                    
//*-----------------------------------------------------------------            
//STEP27   EXEC PGM=BP13CY56,COND=(0,NE)                                        
//BP13F557 DD DSN=&&F557TP,DISP=(OLD,PASS)                                      
//BP13L557 DD DSN=BP13.L557.YEAR.TP.REPORT,DISP=OLD                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT ALL BOOKED APPLICATIONS FROM THE                                       
//* PREVIOUS MONTH                                                              
//*-----------------------------------------------------------------            
//STEP28   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&P13F800B,DISP=(NEW,PASS),                                  
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(350,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=2000)                                        
//SYSIN    DD  *                                                                
   SORT FIELDS=(4,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,1,CH,NE,C'C',AND,                                            
                 785,6,CH,GE,C'201608',AND,                                     
                 155,1,CH,NE,C' ',AND,                                          
                 (924,3,CH,EQ,C'BTO',OR,                                        
                  924,3,CH,EQ,C'ROF',OR,                                        
                  924,3,CH,EQ,C'OBF',OR,                                        
                  924,3,CH,EQ,C'SBF'))                                          
//*-----------------------------------------------------------------            
//* CREATE DATASET FOR  FLATS BOOKED BY                                         
//* MIXED MARRIAGE APPLICANTS                                                   
//*-----------------------------------------------------------------            
//STEP29 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F800 DD  DSN=&&P13F800B,DISP=(OLD,DELETE)                                 
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR                                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K757 DD  DSN=BP13.KH20.HISTAPPL,                                          
//             DISP=SHR                                                         
//BP13L27D DD  DSN=BP13.L27D.RPT,                                               
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C27D) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//*- RE-FRESH FLAT-PIDB                                                         
//*-----------------------------------------------------------------            
//STEP30  EXEC PGM=SORT,COND=(0,NE)                                     00120011
//SORTIN  DD DSN=AB03.F089.PIDB,DISP=SHR                                00130011
//SORTOUT DD DSN=&&BP13F80A,DISP=(,PASS),                               00140011
//        DCB=(RECFM=FB,LRECL=100),                                     00150011
//        SPACE=(CYL,(10,10),RLSE)                                      00160011
//SYSOUT   DD SYSOUT=*                                                  00170011
//SYSIN    DD *                                                         00180011
  SORT FIELDS=(1,9,A),FORMAT=CH                                         00190011
  OUTREC FIELDS=(1,9,10,5,15,32,47,9,147,3,130,3,                       00200011
                 158,4,162,4,98,2,102,2,140,7,56,6,104,5,9X)            00210011
/*                                                                      00220011
//*-------------------------------------------------------------------- 00230011
//*  TO DELETE/CREATE SOC BOOK FLAT UIN FILE                            00240011
//*-------------------------------------------------------------------- 00250011
//STEP31    EXEC PGM=IDCAMS                                             00260011
//INPUT1    DD DSN=&&BP13F80A,DISP=(SHR,DELETE)                         00270011
//SYSPRINT  DD SYSOUT=*                                                 00280011
//SYSIN     DD  *                                                       00290011
          DEL 'BP13.K80A.FLATINFO' CL PURGE                             00300011
          DEF CLUSTER                               -                   00310011
              (NAME(BP13.K80A.FLATINFO)             -                   00320011
              CYL(50 10)                            -                   00330011
              STORCLAS(PRODRLS)                     -                   00340011
              LOG(NONE)                             -                   00350011
              UNIQUE                                -                   00360011
              SHR(2 3))                             -                   00370011
              DATA                                  -                   00380011
              (NAME(BP13.K80A.FLATINFO.DATA)        -                   00390011
              KEYS(9 0)                             -                   00400011
              RECSZ(100 100)                       -                    00410011
              CISZ(4096)                            -                   00420011
              FSPC(10 10))                          -                   00430011
              INDEX                                 -                   00440011
              (NAME(BP13.K80A.FLATINFO.INDEX)       -                   00450011
              CISZ(4096))                                               00460011
      IF MAXCC = 0  THEN                            -                   00470011
         REPRO IFILE(INPUT1)                        -                   00480011
              ODS(BP13.K80A.FLATINFO)                                   00490011
