//BP13A739 JOB (BP13P),'BP13A739',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//*  PRINT INVITATION LETTER FOR RESERVE LIST                                   
//*=================================================================            
//* CHG REF  BY   DATE       DESCRIPTION                                        
//* -------- ---- --------   -----------                                        
//* BP130837 LSB  20000525 - NEW JCL                                            
//*-----------------------------------------------------------------            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                              
//* PRT01 : COPIES = 1                   ALLOCATION TEAM                        
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13DP,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* BACKUP AND SORT OCCUPIER FILE (BP13K825) BY KEY FLD                         
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F825.ACCMOCCP,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F825,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(100,30),RLSE),                             
//            DCB=(LRECL=200,RECFM=FB)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* CREATE RESERVE LIST OCCUPIER VSAM FILE (BP13.K825)                          
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//SYSIN    DD  *                                                                
          DEF CLUSTER                                -                          
              (NAME(BP13.K825.RESOCCP)              -                           
              CYL(100 50)                            -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K825.RESOCCP.DATA)         -                           
              KEYS(17 0)                             -                          
              RECSZ(200 200)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K825.RESOCCP.INDEX)        -                           
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K825.RESOCCP)                                            
//*-----------------------------------------------------------------            
//* SORT RESERVE FILE BY REGN-NO                                                
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K700.RESERVE,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F700,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(16,3),RLSE),                               
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(211,2,A,123,8,A),FORMAT=CH                                    
     INCLUDE COND=(226,2,CH,NE,C'  ')                                           
//*-----------------------------------------------------------------            
//* PRINT APPENDIX C FOR SELECTION OF FLAT                                      
//*-----------------------------------------------------------------            
//STEP05   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13F700 DD DSN=&&BP13F700,DISP=(OLD,PASS)                                    
//BP13L070 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S070),DISP=SHR                             
//*=================================================================            
//* TO DELETE TEMPORARY BP13K825 VSAM FILE                                      
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
       DEL 'BP13.K825.RESOCCP' CL PURGE                                         
//*-----------------------------------------------------------------            
//* END BP13A739                                                                
//*-----------------------------------------------------------------            
