//BP13A248 JOB (BP13P),'BP13A248',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00000010
//             NOTIFY=CSD0071                                           00000020
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                  00000030
//             DISP=SHR                                                 00000040
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*-------------------------------------------------------------------*-00000050
//* TO PASS DEBARMENT RECORDS "MA" TO DEBARMENT SYSTEM                  00000060
//*-------------------------------------------------------------------* 00000070
//STEP01 EXEC    PGM=BP13C22T,COND=(0,NE)                               00000080
//BP13F310 DD  DSN=BP13.F310.BP13C22Q,                                  00000090
//             DISP=SHR                                                 00000100
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000110
//             DISP=SHR,                                                00000120
//             AMP=('BUFND=23')                                         00000130
//BP13K853 DD  DSN=BP13.K853.MCPS,                                      00000110
//             DISP=SHR,                                                00000120
//             AMP=('BUFND=23')                                         00000130
//P04K010  DD  DSN=BP04.K010.DEBAR,                                     00000140
//             DISP=SHR,                                                00000150
//             AMP=('BUFND=23')                                         00000170
//P04F010  DD  DSN=BP13.BP04.F010.DEBAR.DELETE,                         00000180
//             DISP=SHR                                                 00000190
//BP13FOUT DD  DSN=BP13.FOUT.BP13C22T,                                  00000180
//             DISP=SHR                                                 00000190
//SYSPRINT DD  SYSOUT=*                                                 00000200
//SYSABOUT DD  SYSOUT=*                                                 00000220
//SYSOUT   DD  SYSOUT=*                                                 00000240
//*---------------------------------------------------------------------00001790
//* TO PRINT REPORT ON RELEASE OF THE FLATS BOOKED BY APPLICANTS        00001800
//*---------------------------------------------------------------------00001810
//STEP02 EXEC    SAS,COND=(0,NE)                                        00001820
//WORK     DD  UNIT=SYSDA,                                              00001830
//             SPACE=(CYL,(10,10),,,ROUND)                              00001840
//BP13FOUT DD  DSN=BP13.FOUT.BP13C22T,                                  00001850
//             DISP=SHR                                                 00001860
//FT42F001 DD  SYSOUT=2,                                                00001870
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S220),                            00001880
//             DISP=SHR                                                 00001890
/*                                                                      00001900
//*---------------------------------------------------------------------00001790
//* END OF JOB BP13A248                                                 00001800
//*---------------------------------------------------------------------00001810
