//BP13A615 JOB (BP13P),'BP13A615',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010001
//         NOTIFY=CSD0071                                               00020003
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030001
//**************************************************************        00030301
//* JCL TO SPLIT STUDIO AND NON-STUDIO FLATS (QUARTERLY SALE)           00030402
//*-------------------------------------------------------------        00030701
//* CHGE REQ  BY     DATE    DESCRIPTION                                00030801
//* -------- ---- -------- -----------------------------------------    00030901
//* BP133440  IL5 20102008 NEW                                          00031002
//*-----------------------------------------------------------------    00031401
//**************************************************************        00031501
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT          00031601
//*  DATASET                                                            00031701
//**************************************************************        00031801
//PRT01    EXEC PGM=IEBGENER                                            00031901
//SYSUT1   DD *                                                         00032001
$DJDE$ JDE=13K520,JDL=BP13,END;                                         00032101
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSSS1A                           00032201
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00032301
//SYSPRINT DD SYSOUT=*                                                  00032401
//SYSIN    DD DUMMY                                                     00032501
//**************************************************************        00032601
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT          00032701
//*  DATASET                                                            00032801
//**************************************************************        00032901
//PRT02    EXEC PGM=IEBGENER                                            00033001
//SYSUT1   DD *                                                         00033101
$DJDE$ JDE=13K520,JDL=BP13,END;                                         00033201
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSSS1B                           00033301
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00033401
//SYSPRINT DD SYSOUT=*                                                  00033501
//SYSIN    DD DUMMY                                                     00033601
//*---------------------------------------------------------------------00033701
//* DELETE INTERMEDIATE FILES                                           00033801
//*---------------------------------------------------------------------00033901
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                  00034001
//SYSPRINT DD SYSOUT=*                                                  00034101
//SYSIN    DD *                                                         00034201
         DEL 'BP13.F740.MATUREBA.STUDIO'                                00034301
         DEL 'BP13.F740.MATUREBA.NNSTUDIO'                              00034401
              IF MAXCC < 12 THEN                                        00034504
                 SET MAXCC = 0                                          00034604
//*-------------------------------------------------------------------* 00034701
//* SORT BP13F740 BY REGN NO, RANDOM KEY DESC (STUDIO APT)            * 00034801
//*-------------------------------------------------------------------* 00034901
//STEP02   EXEC SORT,COND=(0,NE)                                        00035003
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                            00035101
//SORTOUT DD DSN=BP13.F740.MATUREBA.STUDIO,DISP=(,CATLG),               00035201
//      SPACE=(CYL,(48,10),RLSE),                                       00035301
//      DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                          00035401
//SYSIN   DD  *                                                         00035501
    SORT FIELDS=(1,28,A),FORMAT=CH                                      00035601
    INCLUDE COND=(211,2,CH,EQ,C'1A')                                    00035701
//*-------------------------------------------------------------------* 00035801
//* SORT BP13F740 BY REGN NO, RANDOM KEY DESC (NON-STUDIO APARTMENT)  * 00035901
//*-------------------------------------------------------------------* 00036001
//STEP03   EXEC SORT,COND=(0,NE)                                        00036103
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                            00036201
//SORTOUT DD DSN=BP13.F740.MATUREBA.NNSTUDIO,DISP=(,CATLG),             00036301
//      SPACE=(CYL,(48,10),RLSE),                                       00036401
//      DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                          00036501
//SYSIN   DD  *                                                         00036601
    SORT FIELDS=(1,28,A),FORMAT=CH                                      00036701
    INCLUDE COND=(211,2,CH,NE,C'1A')                                    00036801
//*---------------------------------------------------------------------00036901
//* DELETE BALLOT FILE                                                  00037001
//*---------------------------------------------------------------------00037101
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                  00037203
//SYSPRINT DD SYSOUT=*                                                  00037301
//SYSIN    DD *                                                         00037401
         DEL (BP13.K740.MATUREBA) CL PURGE                              00037501
//*---------------------------------------------------------------------00041601
//* TO CREATE THE BALLOT FILE & TO ENSURE THAT NO DUPLICATE RANDOM NO   00041701
//* BY USINF DEFINE VSAM BALLOT FILE                                    00041801
//*---------------------------------------------------------------------00041901
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                  00042001
//SYSPRINT DD SYSOUT=*                                                  00042101
//INPUT    DD DSN=BP13.F740.MATUREBA.NNSTUDIO,DISP=SHR                  00042201
//SYSIN    DD *                                                         00042301
         DEF CL (NAME(BP13.K740.MATUREBA)        -                      00042401
                 CYL(36 5)                       -                      00042501
                 UNIQUE                          -                      00042601
                 SPEED                           -                      00042701
                 STORCLAS(PRODRLS)               -                      00042801
                 LOG(NONE)                       -                      00042901
                 SHR(2 3))                       -                      00043001
                 DATA                            -                      00043101
                 (NAME(BP13.K740.MATUREBA.DATA)  -                      00043201
                 KEYS(28 0)                      -                      00043301
                 RECSZ(500 500)                  -                      00043401
                 FSPC(10 10)                     -                      00043501
                 CISZ(4096))                                            00043601
         IF LASTCC = 0 THEN                      -                      00043701
           REPRO IFILE(INPUT)                    -                      00043801
                 ODS(BP13.K740.MATUREBA)                                00043901
//*-------------------------------------------------------------------- 00044002
//*      TO CREATE PATH/ALTX FOR MATUREBA BALLOT FILE                   00045002
//*-------------------------------------------------------------------- 00046002
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                  00047002
//SYSPRINT DD SYSOUT=*                                                  00048002
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR                           00049002
//SYSIN    DD  *                                                        00050002
           DEF AIX (NAME(BP13.K740.MATUREBA.ALTX1)   -                  00060002
               REL(BP13.K740.MATUREBA)               -                  00070002
               REUSE                                 -                  00080002
               KEYS(8 122)                            -                 00090002
               SHR(2 3)                              -                  00100002
               NUNQK)                                -                  00110002
               DATA                                  -                  00120002
               (NAME(BP13.K740.MATUREBA.ALTX1.DATA) -                   00130002
               CYL(10 5)                              -                 00140002
               RECSZ(31 354)                         -                  00150002
               FSPC(10 10)                           -                  00160002
               CISZ(4096))                           -                  00170002
               INDEX                                 -                  00180002
               (NAME(BP13.K740.MATUREBA.ALTX1.INDEX) -                  00190002
               CISZ(4096))                                              00200002
         IF MAXCC = 0 THEN                           -                  00210002
           DEF PATH (NAME(BP13.K740.MATUREBA.PATH1) -                   00220002
               PENT(BP13.K740.MATUREBA.ALTX1))                          00230002
         IF MAXCC = 0 THEN                                              00240002
           BIX IDS(BP13.K740.MATUREBA)               -                  00250002
               ODS(BP13.K740.MATUREBA.ALTX1)                            00260002
