//BP13A983 JOB (BP13P),'BP13A983',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=====================================================================        
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR GENERATING MGPS UNITS FOR CHILD ONLY                        
//* SAME BLOCK AND LEVEL AS THE PARENT                                          
//*=====================================================================        
//* CHGE REQ  BY  DDMMCCYY DESCRIPTION                                          
//* -------- ---- -------- --------------------------------------------         
//* BP135140 SMR2 28102013 NEW JCL                                              
//* BP135394 SMR2 20062014 CATER FOR FLOOR TAG                                  
//* BP135485 IL5  20141106 STOP PRINTING BP13L908                               
//*=====================================================================        
//*    TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                           
//*---------------------------------------------------------------------        
//PRT01  EXEC  PGM=IEBGENER,COND=(0,NE)                                         
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,COPIES=2,JDL=BP13,END;                                         
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* VERIFY FILES BEFORE JOB RUN                                                 
//*---------------------------------------------------------------------        
//STEP00 EXEC  PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD  DSN=BP13.K115.MGPSUNIT,DISP=OLD                                  
//INPUT2   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=OLD                            
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY  FILE(INPUT1)                                                     
          VFY  FILE(INPUT2)                                                     
//*---------------------------------------------------------------------        
//* EXTRACT UNTAGGED PARENT UNITS                                               
//* SORT BY NT, FT, NGHBRD, CNTRCT, BLOCK, RANDOM #                             
//*---------------------------------------------------------------------        
//STEP01 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP13F120,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,3,A,117,2,A,4,4,A,8,4,A,12,5,A,18,28,A),                       
               FORMAT=CH                                                        
  INCLUDE COND=(1,3,CH,NE,C'   ',AND,65,1,CH,EQ,C' ')                           
//*---------------------------------------------------------------------        
//* RUN PROGRAM BP13C91I - TRANSFER UNTAGGED PARENT UNITS TO CHILD UNITS        
//*---------------------------------------------------------------------        
//STEP02 EXEC  PGM=BP13C91I,COND=(0,NE)                                         
//BP13F120 DD  DSN=&&BP13F120,DISP=(OLD,DELETE)                                 
//BP13K120 DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=OLD                            
//BP13F100 DD  DSN=BP13.F100.SLCTUNIT.CHILD,DISP=MOD                            
//SYSIN    DD  *                                                                
P                                                                               
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* OUTREC MGPS PARENT UNITS IN BP13F100                                        
//* SORT BY NT, FT, NGHBRD, CNTRCT, BLOCK, RANDOM #                             
//*---------------------------------------------------------------------        
//STEP03 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=BP13.F100.MGPUNIT.PARENT,DISP=OLD                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,3,A,117,2,A,4,4,A,8,4,A,12,5,A,18,28,A),                       
               FORMAT=CH                                                        
  INCLUDE COND=(1,3,CH,NE,C'   ')                                               
  OUTREC FIELDS=(119,11,7X,18,28,130,1,131,2,133,1,5X,100,3,4,4,                
                 8,4,12,5,117,2,66,2,68,32,56,2,58,4,62,3,103,3,                
                 1,3,106,3,109,6,115,2,65,1,666X)                               
//*---------------------------------------------------------------------        
//* SORT BP13F10P - SORT BY NT, NGHBRD, CNTRCT, BLOCK, LEVEL                    
//*---------------------------------------------------------------------        
//STEP04 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.MGPUNIT.PARENT,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP13F10P,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(120,3,A,59,4,A,63,4,A,67,5,A,108,2,A),                           
               FORMAT=CH                                                        
//*---------------------------------------------------------------------        
//* SORT BP13FLE2 - SORT BY NT, NGHBRD, CNTRCT, BLOCK, LEVEL                    
//*---------------------------------------------------------------------        
//STEP05 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.SLCTUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP13FLE2,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(120,3,A,59,4,A,63,4,A,67,5,A,108,2,A),                           
               FORMAT=CH                                                        
//*---------------------------------------------------------------------        
//* RUN PROGRAM BP13C91H - IDENTIFY UNITS IN NT/NEIGH/CONTRACT                  
//*---------------------------------------------------------------------        
//STEP06 EXEC  PGM=BP13C91H,COND=(0,NE)                                         
//BP13F10P DD  DSN=&&BP13F10P,DISP=(OLD,PASS)                                   
//BP13FLE2 DD  DSN=&&BP13FLE2,DISP=(OLD,DELETE)                                 
//BP13FLE3 DD  DSN=BP13.F100.TEMPUNIT,DISP=OLD                                  
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* RUN PROGRAM BP13C91E - IDENTIFY UNITS IN SAME BLK & LEVEL AS PARENT         
//*---------------------------------------------------------------------        
//STEP07 EXEC  PGM=BP13C91E,COND=(0,NE)                                         
//BP13F10P DD  DSN=&&BP13F10P,DISP=(OLD,DELETE)                                 
//BP13FLE2 DD  DSN=BP13.F100.TEMPUNIT,DISP=SHR                                  
//BP13FLE3 DD  DSN=BP13.F100.CHILD.OPTUNIT,DISP=OLD                             
//BP13FREM DD  DSN=BP13.F100.CHILD.REMUNIT,DISP=OLD                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT BY NT, NGHBRD, CNTRCT, BLOCK, LEVEL, FT, RANDOM #                      
//*---------------------------------------------------------------------        
//STEP08 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.CHILD.OPTUNIT,DISP=SHR                             
//SORTOUT  DD  DSN=&&INPUT1,DISP=(NEW,PASS),                                    
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(120,3,A,59,4,A,63,4,A,67,5,A,108,2,A,72,1,A,19,28,A),            
               FORMAT=CH                                                        
  OUTREC FIELDS=(120,3,59,4,63,4,67,5,108,2,72,1,19,28,1,11,47,1,               
                 48,2,50,1,56,3,72,2,74,2,76,32,108,2,110,4,114,3,              
                 117,3,123,3,126,6,132,2,134,1,75X)                             
//*---------------------------------------------------------------------        
//* DELETE / DEFINE VSAM FILE - BP13K125                                        
//*---------------------------------------------------------------------        
//STEP09 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//INPUT1   DD DSN=&&INPUT1,DISP=(OLD,DELETE)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          DEL 'BP13.K125.MGPSUNIT.CHILD' CL PURGE                               
          DEF CLUSTER                                -                          
              (NAME(BP13.K125.MGPSUNIT.CHILD)        -                          
              CYL(10 5)                              -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K125.MGPSUNIT.CHILD.DATA)   -                          
              KEYS(47 0)                             -                          
              RECSZ(200 200)                         -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K125.MGPSUNIT.CHILD.INDEX)  -                          
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
      REPRO IFILE(INPUT1)                            -                          
            ODS(BP13.K125.MGPSUNIT.CHILD)            -                          
            REUSE                                                               
//*---------------------------------------------------------------------        
//* SORT BY RANDOM #                                                            
//*---------------------------------------------------------------------        
//STEP10 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.MGPUNIT.PARENT,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP13F100,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(19,28,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* RUN PROGRAM BP13C91F - IDENTIFY CHILD UNITS                                 
//*---------------------------------------------------------------------        
//STEP11 EXEC  PGM=BP13C91F,COND=(0,NE)                                         
//BP13F10P DD  DSN=&&BP13F100,DISP=(OLD,DELETE)                                 
//BP13K115 DD  DSN=BP13.K115.MGPSUNIT,DISP=OLD                                  
//BP13K125 DD  DSN=BP13.K125.MGPSUNIT.CHILD,DISP=OLD                            
//BP13K120 DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=OLD                            
//BP13F10C DD  DSN=&&F100C91F,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT BY NT, FT, NEIG, CNTRCT, BLK, PFT, RANDOM#                             
//*-----------------------------------------------------------------            
//STEP12 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&F100C91F,DISP=(OLD,DELETE)                                 
//SORTOUT  DD  DSN=&&F100CHLD,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(120,3,A,72,2,A,59,4,A,63,4,A,67,5,A,132,1,A,19,28,A),            
               FORMAT=CH                                                        
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR CHILD MGPS FLAT LIST                                       
//*-----------------------------------------------------------------            
//STEP13 EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                    
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(10,5))                                    
//BP13F100 DD  DSN=&&F100CHLD,DISP=(OLD,DELETE)                                 
//BP13K115 DD  DSN=BP13.K115.MGPSUNIT,DISP=SHR                                  
//BP13L908 DD  SYSOUT=*                                                         
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S908),DISP=SHR                            
//*---------------------------------------------------------------------        
//* OUTREC PARENT MGPS UNITS FOR REPORT                                         
//*---------------------------------------------------------------------        
//STEP14A EXEC SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP13MGPS,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(1,3,CH,NE,C'   ',AND,65,1,CH,EQ,C'P')                           
  OUTREC FIELDS=(119,11,7X,18,28,130,1,131,2,133,1,5X,100,3,4,4,                
                 8,4,12,5,117,2,66,2,68,32,56,2,58,4,62,3,103,3,                
                 1,3,106,3,109,6,115,2,65,1,666X)                               
//*---------------------------------------------------------------------        
//* OUTREC CHILD (SAME BLK & LVL) MGPS UNITS FOR REPORT                         
//*---------------------------------------------------------------------        
//STEP14B EXEC SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K120.MGPSUNIT.CHILD,DISP=SHR                            
//SORTOUT  DD  DSN=&&BP13MGPS,DISP=(MOD,PASS),                                  
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(1,3,CH,NE,C'   ',AND,65,1,CH,EQ,C'C')                           
  OUTREC FIELDS=(119,11,7X,18,28,130,1,131,2,133,1,5X,100,3,4,4,                
                 8,4,12,5,117,2,66,2,68,32,56,2,58,4,62,3,103,3,                
                 1,3,106,3,109,6,115,2,65,1,C'SF',664X)                         
//*------------------------------------------------------------------           
//* SORT OUT BY RANDOM #                                                        
//*------------------------------------------------------------------           
//STEP15 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F100.MGPUNIT,DISP=SHR                                   
//SORTOUT  DD  DSN=&&P13F100A,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(19,28,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* SORT OUT BY RANDOM #                                                        
//*------------------------------------------------------------------           
//STEP16 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&BP13MGPS,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&P13F100B,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(19,28,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* APPEND UNUSED UNITS FOR THE REPORT                                          
//*------------------------------------------------------------------           
//STEP17 EXEC PGM=SORT,COND=(0,NE)                                              
//SORTJNF1 DD DSN=&&P13F100A,DISP=(OLD,DELETE)                                  
//SORTJNF2 DD DSN=&&P13F100B,DISP=(OLD,DELETE)                                  
//F1ONLY   DD DSN=&&BP13MGPS,DISP=(MOD,PASS),                                   
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN DD *                                                                    
  JOINKEYS FILE=F1,FIELDS=(19,28,A)                                             
  JOINKEYS FILE=F2,FIELDS=(19,28,A)                                             
  JOIN UNPAIRED,F1,ONLY                                                         
  REFORMAT FIELDS=(F1:1,800)                                                    
  OUTFILE FNAMES=F1ONLY                                                         
  OPTION COPY                                                                   
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT BY NT, NGHBRD, CNTRCT, BLOCK, FT, RANDOM #                             
//* REMAINING FLAT LIST AFTER GRO                                               
//*---------------------------------------------------------------------        
//STEP18 EXEC  SORT,COND=(0,NE)                                                 
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&BP13MGPS,DISP=(OLD,DELETE)                                 
//SORTOUT  DD  DSN=BP13.REPORT.BP13A985,DISP=OLD                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(120,3,A,59,4,A,63,4,A,67,5,A,72,2,A,19,28,A),                    
               FORMAT=CH                                                        
  OUTREC FIELDS=(19,28,C';',56,3,C';',59,4,C';',63,4,C';',                      
                 67,5,C';',72,2,C';',108,2,C';',110,4,C';',                     
                 117,3,C';',120,3,C';',123,3,C';',126,6,C';',                   
                 134,1,C';',132,2,C';',135,2,C';',63X)                          
//*---------------------------------------------------------------------        
//* END OF JOB BP13A983                                                         
//*---------------------------------------------------------------------        
