//BP13D809 JOB (BP13P),'BP13D809',MSGCLASS=N,CLASS=I,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                     
//*====================================================================         
//*  BACK-UP SELF-BOOKING FILES BEFORE ONLINE UPDATE (BP13DP14)                 
//*====================================================================         
//* CHG REF  BY   ON        DESCRIPTION                                         
//* -------- ---  ------    -----------                                         
//* BP136561 KSJ3 20170117  NEW JCL                                             
//*====================================================================         
//*--------------------------------------------------------------------         
//* BACKUP FILES AS BEFORE IMAGE                                                
//*--------------------------------------------------------------------         
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KC20.SELFLIST,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.FC20.SELFLIST.I9CK.BFDAILY(+1),                          
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(1,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                       
//*                                                                             
//INPUT2   DD DSN=BP13.KC25.SELFLIST.QUEUE,DISP=SHR,                            
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.FC25.SELFLIST.I9CK.BFDAILY(+1),                          
//            DISP=(NEW,CATLG),                                                 
//            SPACE=(CYL,(20,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                       
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                        
   REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                        
/*                                                                              
