//BP13AHN5 JOB (BP13P),'BP13AHN5',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB00302
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=====================================================================        
//* THIS JCL IS TO GENERATE HNR DETAILS INTO BP13K747 FOR ROF CASES             
//*---------------------------------------------------------------------        
//* STEP100 TO STEP110 - FOR FT CASES                                           
//* STEP200 TO STEP210 - FOR ST CASES                                           
//* STEP300 TO STEP310 - FOR OTH CASES                                          
//*=====================================================================        
//* CHGE REQ  BY    DATE      DESCRIPTION                                       
//* --------  ----  --------  -----------------------------------------         
//* BP136970  SMR2  18082017  NEW JCL                                           
//* BP137215  SMR2  22022018  OMIT HARDLUCK CASES                               
//*=====================================================================        
//* SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                                
//* PRT01 : COPIES = 1, APPLICATION TEAM                                        
//*---------------------------------------------------------------------        
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*=====================================================================        
//* VERIFY FILES BEFORE JOB RUN                                                 
//*---------------------------------------------------------------------        
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K747.HNR.RANGE,DISP=OLD                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*=====================================================================        
//* INCLUDE SUCCESSFUL CASES ONLY                                               
//* SORT BY REGNO                                                               
//*---------------------------------------------------------------------        
//STEP010  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F740CB56,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(260,1,CH,NE,C'U',AND,466,1,CH,EQ,C' ')                        
//*=====================================================================        
//* DETERMINE THE CLASSIFICATION OF EACH ROF CASES                              
//*    FIRST-TIMER (FT) - NON-ELDERLY FT FAMILIES                               
//*                       ELDERLY FT FAMILIES WITH NO PPO                       
//*    SECOND-TIMER (ST) - NON-ELDERLY ST FAMILIES                              
//*                        ELDERLY ST FAMILIES WITH NO PPO                      
//*    OTHERS (OTH) - ALL SINGLES (ELDERLY AND NON-ELDERLY)                     
//*                   ELDERLY FT AND ST FAMILIES WITH PPO                       
//*                   ELDERLY NTIMERS                                           
//* UPDATE THE FIELDS, ALLOC-SCH   HHTY   CATEGORY                              
//*                       FT        H      BLANK                                
//*                       ST        G      BLANK                                
//*                       OTH       H      BLANK                                
//*---------------------------------------------------------------------        
//STEP020  EXEC PGM=BP13CB56,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CB56,DISP=(OLD,DELETE)                                  
//BP13F74A DD DSN=&&F740FT,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),SPACE=(CYL,(50,20),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74B DD DSN=&&F740ST,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),SPACE=(CYL,(50,20),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//BP13F74C DD DSN=&&F740OTH,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),SPACE=(CYL,(50,20),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*=====================================================================        
//* SORT BY ZONE/FT/HHTY/REQ-STATUS/COHORT/RANDOM NO                            
//*---------------------------------------------------------------------        
//STEP100  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740FT,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=&&F740FT2,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(187,3,A,211,2,A,461,1,A,260,1,D,80,2,A,                        
                 1,28,A),FORMAT=CH                                              
//*=====================================================================        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - FT CASES                  
//*---------------------------------------------------------------------        
//STEP110  EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F740FT2,DISP=(OLD,DELETE)                                   
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=OLD                                  
//SYSIN    DD *                                                                 
FT                                                                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*=====================================================================        
//* SORT BY ZONE/FT/HHTY/REQ-STATUS/COHORT/RANDOM NO                            
//*---------------------------------------------------------------------        
//STEP200  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740ST,DISP=(OLD,DELETE)                                    
//SORTOUT  DD DSN=&&F740ST2,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(187,3,A,211,2,A,461,1,A,260,1,D,80,2,A,                        
                 1,28,A),FORMAT=CH                                              
//*=====================================================================        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - ST CASES                  
//*---------------------------------------------------------------------        
//STEP210  EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F740ST2,DISP=(OLD,DELETE)                                   
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=MOD                                  
//SYSIN    DD *                                                                 
ST                                                                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*=====================================================================        
//* SORT BY ZONE/FT/HHTY/REQ-STATUS/COHORT/RANDOM NO                            
//*---------------------------------------------------------------------        
//STEP300  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740OTH,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=&&F740OTH2,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(187,3,A,211,2,A,461,1,A,260,1,D,80,2,A,                        
                 1,28,A),FORMAT=CH                                              
//*=====================================================================        
//* CREATE RANGE OF SUCC RANDOM NO FOR HNR CHECKING - OTH CASES                 
//*---------------------------------------------------------------------        
//STEP310  EXEC PGM=BP13C548,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F740OTH2,DISP=(OLD,DELETE)                                  
//BP13F747 DD DSN=BP13.F747.HNR.RANGE,DISP=MOD                                  
//SYSIN    DD *                                                                 
OTH                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//*=====================================================================        
//* SORT BY DTE-BAL/ZONE/FT/RESULT-STAT/COHORT/PRIO-SCH/CAT/HHTY                
//*---------------------------------------------------------------------        
//STEP900  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F747.HNR.RANGE,DISP=SHR                                  
//SORTOUT  DD DSN=&&F747SCH,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(50,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=150)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,6,A,7,3,A,10,2,A,17,1,A,18,2,A,12,3,D,                       
                 16,1,A,15,1,A),FORMAT=CH                                       
//*=====================================================================        
//* SAS PROGRAM TO PRINT THE RANGE OF SUCCESSFUL RANDOM NO                      
//*---------------------------------------------------------------------        
//STEP910  EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13K747 DD DSN=&&F747SCH,DISP=(OLD,DELETE)                                   
//BP13L710 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S710),DISP=SHR                             
//*=====================================================================        
//* SORT OUT EXISTING CASES IN PRODUCTION                                       
//*---------------------------------------------------------------------        
//STEP920  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K747.HNR.RANGE,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F747.HNR.RANGE.BKUP,DISP=SHR                             
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,20,A),FORMAT=CH                                              
//*=====================================================================        
//* MERGE EXITING CASES AND NEW CASES                                           
//*---------------------------------------------------------------------        
//STEP930  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F747.HNR.RANGE,DISP=SHR                                  
//         DD DSN=BP13.F747.HNR.RANGE.BKUP,DISP=SHR                             
//SORTOUT  DD DSN=&&F747END,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=150),                                         
//            SPACE=(CYL,(50,20),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,20,A),FORMAT=CH                                              
    SUM FIELDS=NONE                                                             
//*=====================================================================        
//* TO DELETE AND DEFINE BP13K747                                               
//*---------------------------------------------------------------------        
//STEP940  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=&&F747END,DISP=(OLD,DELETE)                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  DEL (BP13.K747.HNR.RANGE) CL PURGE                                            
  DEF CLUSTER                                         -                         
        (NAME(BP13.K747.HNR.RANGE)                    -                         
        SHAREOPTIONS(2,3)                             -                         
        KEYS(20 0)                                    -                         
        RECSZ(150 150)                                -                         
        CYL(50 20)                                    -                         
        STORCLAS(PRODRLS)                             -                         
        LOG(NONE)                                     -                         
        FREESPACE(30 30)                              -                         
        CISZ(4096)                                    -                         
        IXD                                           -                         
        UNQ)                                          -                         
      DATA                                            -                         
        (NAME(BP13.K747.HNR.RANGE.DATA))              -                         
      INDEX                                           -                         
        (NAME(BP13.K747.HNR.RANGE.INDEX))                                       
         IF LASTCC = 0 THEN                           -                         
           REPRO IFILE(INPUT1)                        -                         
                 ODS(BP13.K747.HNR.RANGE)                                       
/*                                                                              
//*---------------------------------------------------------------------        
//*                      END OF JOB                                             
//*---------------------------------------------------------------------        
