//BP13A541 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//* CHG-NO   BY    ON   - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP130296 LSB 970423 - ADD NEW FILE BP13F310 TO BP13C835                     
//* BP130323 LSB 970721 - ADD NEW REPORT TO BP13C835                            
//* BP130258 LSB 970815 - PRINT MULTIPLE SMS RECORDS                            
//* BP130410 LSB 971126 - ADD P13L835A/B/C TO BP13C835                          
//* BP130445 SSS 980207 - EXPAND F559 RECL FROM 250 TO 500                      
//* BP130450 LSB 980617 - PRINT  SOM / TYPE 2A REPORT                           
//* BP130542 LSB 980811 - PRINT SALE-TY=6, RESALE-CD=GS,PG,FG IN S719           
//* BP130418 CLT 980922 - Y2K COMPLIANCE CHANGES : BP13K800                     
//* BP130623 LSB 990226 - MOVE C835 REPORT TO BP13A736                          
//* BP130897 AKT 000807 - EXPAND F558 RECL FROM 400 TO 600                      
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : 1 COPY                    APPLICATION TEAM                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  REPRO SEQUENCE FILE TO BALLOT FILE                                         
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F520.BALLOT,DISP=OLD                                     
//INPUT2   DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//OUTPUT2  DD DSN=BP13.F558.UPGOCCP.RFS,DISP=OLD                                
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-----------------------------------------------------------------            
//* SORT OUT NRIC MATCHED WITH MULTIPLE SMS DIRECT PURCHASE FLAT                
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C688,COND=(0,NE)                                        
//BP13F559 DD DSN=BP13.F559.DUPSMS,DISP=SHR                                     
//P13F559A DD DSN=&&F559OM,DISP=(,PASS),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(50,5),RLSE),UNIT=SYSDA                                
//P13F559B DD DSN=&&F559DP,DISP=(,PASS),                                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(50,5),RLSE),UNIT=SYSDA                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* PRINT MULTIPLE SMS RECORDS                                          00410031
//*-----------------------------------------------------------------            
//STEP03   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K            00450031
//BP13L531 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//BP13F559 DD DSN=&&F559DP,DISP=(OLD,PASS)                                      
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S531),DISP=SHR                     00480031
//*                                                                     00490031
//*--------------------------------------------------------------------         
//* SORT OUT RESALE-STATUS=SOM, SALES-TYPE-SMS=2B                               
//*--------------------------------------------------------------------         
//STEP04 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.F558.UPGOCCP.RFS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558SALE,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=600),                                  
//        SPACE=(CYL,(30,20),RLSE)                                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(61,2,A,1,17,A),FORMAT=CH                                        
   INCLUDE COND=(61,2,CH,EQ,C'2B',OR,                                           
                 61,1,CH,EQ,C'6',OR,                                            
                 112,3,CH,EQ,C'SOM',OR,                                         
                 112,2,CH,EQ,C'GS',OR,                                          
                 112,2,CH,EQ,C'PG',OR,                                          
                 112,2,CH,EQ,C'FG')                                             
//*-----------------------------------------------------------------            
//* PRINT REPORT RESALE-STATUS=SOM, SALES-TYPE-SMS=2B                           
//*-----------------------------------------------------------------            
//STEP05   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K            00450031
//BP13L719 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//BP13F558 DD DSN=&&F558SALE,DISP=(OLD,PASS)                                    
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S719),DISP=SHR                     00480031
//*                                                                     00490031
