//BP13D410 JOB (BP13P),'BP13D410',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//*=================================================================*           
//* OBJECTIVE : THIS JOB PROCESSES THE ACKNOWLEDGEMENT FILE FROM    *           
//*             CPF TO HDB THRU IDNET.                              *           
//*-----------------------------------------------------------------*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* ========  ==========  ==== ===========                          *           
//* BP132249  13/01/2003  CLT1 BANK ORIGINATION JOB                 *           
//* BP133820  27/04/2010  LJL1 TO CATER FOR SFTP TO CPFB            *           
//* BP135230  07/03/2014  PCL4 TO READ/PRINT BM06K110 REGN NO IN    *           
//*                            BP13C346                                         
//* BP138865  28/10/2021  KR13 REMOVED BP13C346.                    *           
//* BP139544  03/05/2023  ZAR7 ADD     BP13C346.                    *           
//*=================================================================*           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-------------------------------------------------------------------*         
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETENT                 *         
//* PRT01 : CLASS = 2                                                 *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* PRINT ACKNOWLEDGEMENT REPORT USING CPF SNP FILE                   *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=BP13C346,COND=(0,NE)                                        
//BP13F106 DD DSN=BP13.F106.CPFSNP.RECV.ACK,DISP=SHR                            
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13L346 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F105.SALES.CPF TO DAILY BKUP                          *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F106.CPFSNP.RECV.ACK,DISP=SHR                            
//         DD DSN=BP13.F106.CPFSNP.RECV.REJ,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.F106.CPFSNP.RECV.DBKUP(+1),DISP=(NEW,CATLG),             
//         SPACE=(CYL,(3,2)),                                                   
//         DCB=(BP13.GDG,BLKSIZE=0,LRECL=250,RECFM=FB)                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F105.SALES.CPF TO MTHLY BKUP                          *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F106.CPFSNP.RECV.ACK,DISP=SHR                            
//         DD DSN=BP13.F106.CPFSNP.RECV.REJ,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.F106.CPFSNP.RECV.MTH,DISP=MOD                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* CLEAR BP13F105 FOR NEXT DAY'S RUN                                 *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.F105.CPFSNP.SENT,DISP=SHR                                
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//*   END OF BP13D410                                                 *         
//*-------------------------------------------------------------------*         
