//BP13AMCS  JOB (BP13P),'BP13AMCS',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//      NOTIFY=CSD0071                                                          
//*=================================================================*           
//* CHGE REQ  DATE      BY   DESCRIPTION                            *           
//* --------  ----      ---  -----------                            *           
//* BP131064  22092001  LSB1 NEW JCL                                *           
//* BP132171  31102002  CKK7 CHECK FOR 'R' INSTEAD OF 'N' FOR ORSA  *           
//* BP132200  13112002  CKK7 CHECK FOR 'N' INSTEAD                  *           
//* BP132538  21052002  CKK7 REMOVE CHECKING ON ALLOCATION MODE     *           
//* BP132538  27052004  SK   INCLUDE BP13K767                       *           
//* BP132650  24012005  SK   REMOVE BP13K015 FROM STEP 11           *           
//* BP133610  01062009  ESA1 REPLACE BP13K767 WITH BP13K816         *           
//* BP134906  29042013  SMR2 TRANSFER CF72/CF73/CF74 FROM D50B/D50D *           
//* BP134922  29052013  LSB1 ADD AST STEPS, CF7A, CF7B              *           
//* BP134930  31052013  SMR2 TRANSFER CF72/73/74/7A/7B TO BP13D506  *           
//* BP135171  10022014  RJE1 TO CATER FOR DB2 UPGRADE               *           
//* BP135254  24032014  SMR2 ADD STEPS TO RUN NEW PROGRAM, BP13CF51 *           
//* BP135254  17042014  SMR2 REPLACE BP13K816 WITH BP13K813         *           
//* BP135254  30052014  SMR2 USE DAILY FILE AS INPUT TO BP13CF51    *           
//* BP136239  11052016  IL5  TO INCLUDE ONLY RDB ROLES 003, 004,                
//*                          023,024,025 FOR CHECKING SAME NT.                  
//* BP136505  04112016  IL5  TO INCLUDE RDB ROLES 003,004,023,024,              
//*                          025 FOR CHECKING SAME NT.                          
//* BP138285  05052020  AM25 HARDCOPY REPORTS CONVERSION                        
//*           05062020  AM25 REMOVE DJDE STEPS                                  
//*=================================================================*           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//**************************************************************                
//* DETERMINE RESIDENT PRIORITY FOR MATURE ESTATE                               
//**************************************************************                
//*--------------------------------------------------------------------         
//* DETERMINE OCCPANTS STRUCTURE TO EXTRACT MULTI-TIER CASES                    
//*--------------------------------------------------------------------         
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                              
//SORTOUT DD DSN=&&F730,DISP=(,PASS),                                           
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN   DD  *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(118,1,CH,EQ,C'M')                                               
//*-------------------------------------------------------------------*         
//* SORT BP13K825 REC                                                 *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//   AMP=('BUFND=23')                                                           
//SORTOUT  DD DSN=&&OCCP,DISP=(NEW,PASS),                                       
//            UNIT=(SYSDA,1),                                                   
//            DCB=(LRECL=200,RECFM=FB),                                         
//            SPACE=(CYL,(60,30),RLSE)                                          
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A,107,2,A,9,9,A),FORMAT=CH                                 
//*-------------------------------------------------------------------*         
//* TAG RESIDENT-HA1 FOR MULTI-TIER CASES                                       
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13C837,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730,DISP=(OLD,PASS)                                        
//BP13F825 DD DSN=&&OCCP,DISP=(OLD,PASS)                                        
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//   AMP=('BUFND=23')                                                           
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13L837 DD SYSOUT=*                                                          
//P13L837B DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT CASES FROM BP13K730 FILE                                           
//*------------------------------------------------------------------           
//STEP03A  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730,DISP=(OLD,DELETE)                                      
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* DETERMINE OCCPANTS STRUCTURE TO EXTRACT MULTI-TIER CASES                    
//*--------------------------------------------------------------------         
//STEP03B EXEC SORT,COND=(0,NE)                                                 
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=&&F730SORT,DISP=(OLD,DELETE)                                   
//SORTOUT DD DSN=&&F730CF51,DISP=(,PASS),                                       
//           UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                               
//           DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                 
//SYSIN   DD *                                                                  
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(118,1,CH,EQ,C'M',AND,248,3,CH,EQ,C'NCS')                        
//*-------------------------------------------------------------------*         
//* TAG RESIDENT-HA1 FOR MULTI-TIER CASES                                       
//*-------------------------------------------------------------------*         
//STEP03C  EXEC PGM=BP13CF51,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730CF51,DISP=(OLD,DELETE)                                  
//BP13F825 DD DSN=&&OCCP,DISP=(OLD,DELETE)                                      
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13LF51 DD SYSOUT=*                                                          
//P13LF51B DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* OMIT RECORDS WITH RESIDENT-HA1 ALREADY UPDATED BY BP13C837                  
//* USE PARENT/CHILD NRIC TO DETERMINE MARRIED CHILD PRIORITY SCHEME            
//* OUTREC RES-NRIC FOR IDENTIFY RESIDENT PRIORITY                              
//*--------------------------------------------------------------------         
//STEP04  EXEC SORT,COND=(0,NE)                                                 
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                              
//SORTOUT DD DSN=&&F730MCP,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN   DD  *                                                                 
  SORT FIELDS=(325,9,A),FORMAT=CH                                               
  INCLUDE COND=((325,9,CH,NE,C'         '),AND,                                 
                (118,1,CH,EQ,C'P',OR,                                           
                118,1,CH,EQ,C'C'))                                              
//*--------------------------------------------------------------------         
//* USE PARENT/CHILD NRIC TO DETERMINE MARRIED CHILD PRIORITY SCHEME            
//* OUTREC RES-NRIC FOR IDENTIFY RESEDENT PRIORITY                              
//* REF-NO 'N' REPRESENT ORSA APPLICATION, 'P' FOR INTERNET                     
//*--------------------------------------------------------------------         
//STEP05  EXEC SORT,COND=(0,NE)                                                 
//SYSOUT  DD SYSOUT=*                                                           
//SORTIN  DD DSN=&&F730MCP,DISP=(OLD,PASS)                                      
//SORTOUT DD DSN=&&BP13F716,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=350,RECFM=FB)                                
//SYSIN   DD  *                                                                 
  SORT FIELDS=(325,9,A),FORMAT=CH                                               
  OUTREC FIELDS=(123,8,325,9,10X,261,8,4X,187,3,3X,211,2,303X)                  
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13F716A DD DSN=BP13.F716.A521Q748,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
//*---------------------------------------------------------------------        
//* SORT OUT ONLY LESSEE, CO-LESSEE, OCCUPIER, TENANT, CO-TENANT                
//* CHG ON 940405 - INCLUDE CODE 3 FOR SUB-TENANT                               
//*---------------------------------------------------------------------        
//STEP07 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.F716.A521Q748,DISP=SHR                                   
//SORTOUT  DD DSN=&&F716LSE,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(45,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(51,9,A),FORMAT=CH                                               
//*INCLUDE COND=(89,1,CH,LE,C'3') - REPORT SHOW STATUS IN RDB                   
//*---------------------------------------------------------------------        
//* IF MOVE-IN-DATE NOT FOUND IN RDB                                            
//* FOR SALES FLAT, GET SALES-EFF-DATE FROM SMS                                 
//* FOR RENTAL FLAT, GET TENANT-COMMENCE-DATE FROM CIS                          
//*--------------------------------------------------------------------         
//STEP08   EXEC PGM=BP13C755,COND=(0,NE)                                        
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//AC17K010 DD DSN=AC17.K010.RENTAL,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//BP13F716 DD DSN=&&F716LSE,DISP=(OLD,PASS)                                     
//BP13OUT  DD DSN=&&F716SMS,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(90,30),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                                    
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                        
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716SMS,DISP=(OLD,PASS)                                     
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=BP13.F716.RDBINFO,DISP=OLD                                    
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*---------------------------------------------------------------------        
//*  SORT BY NRIC/DATE-MOVING-IN IN DESCENDING ORDER                            
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.RDBINFO,DISP=SHR                                    
//SORTOUT  DD DSN=&&RDBREF,DISP=(NEW,PASS),                                     
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                           
//            SPACE=(CYL,(60,30),RLSE)                                          
//SYSIN    DD  *                                                                
     SORT FIELDS=(9,9,A,115,8,D),FORMAT=CH                                      
     INCLUDE COND=(75,3,CH,EQ,C'003',OR,                                        
                   75,3,CH,EQ,C'004',OR,                                        
                   75,3,CH,EQ,C'023',OR,                                        
                   75,3,CH,EQ,C'024',OR,                                        
                   75,3,CH,EQ,C'025')                                           
//*---------------------------------------------------------------------        
//* OUTPUT RECORD FROM RDB IF NT REQUESTED = NT CURRENTLY STAYING               
//* FOR MULITIPLE RDB REC, IF LATEST REC NOT IN MATURE NT, DO NOT OUTPUT        
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13C719,COND=(0,NE)                                        
//BP13F716 DD DSN=&&RDBREF,DISP=(OLD,PASS)                                      
//BP13K500 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//BP13OUT  DD DSN=BP13.F716.RESIDENT,DISP=OLD                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* UPDATE RESIDENT-HA1, RESIDENT-HA2 TAG TO REQUEST FILE                       
//*--------------------------------------------------------------------         
//STEP12   EXEC PGM=BP13U757,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F716 DD DSN=BP13.F716.RESIDENT,DISP=SHR                                   
//BP13K500 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  REPRO FROM VSAM TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F500.WEIGHT,DISP=OLD                                     
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*---------------------------------------------------------------------        
//* PRINT REPORT ON NRIC DETERMINE AS RESIDENT                                  
//*---------------------------------------------------------------------        
//STEP16   EXEC  SAS,COND=(0,NE)                                                
//BP13F716 DD DSN=BP13.F716.RESIDENT,DISP=SHR                                   
//BP13L742 DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S742),DISP=SHR                             
//*---------------------------------------------------------------------        
//* PRINT REPORT ON THE MCPS INFORMATION                                        
//*---------------------------------------------------------------------        
//*STEP17   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                  
//*WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                  
//*BP13F716 DD DSN=BP13.F716.RDBINFO,DISP=SHR                                   
//*BP13F725 DD DSN=BP13.F725.MHADATA.ACCUM,DISP=SHR                             
//*BP13F730 DD DSN=BP13.F500.WEIGHT,DISP=SHR                                    
//*P13L764A DD SYSOUT=*                                                         
//*P13L764B DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSIN    DD DSN=BP13.BATCH.SRC(BP13S764),DISP=SHR                            
//*------------------------------------------------------------------           
//*                      END OF JOB                                             
//*------------------------------------------------------------------           
