//BP13A203 JOB (BP13P),'USER:BP13',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),           
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
/*JOBPARM LINECT=0                                                              
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//******************************************************************            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- --- ------   ------------                                          
//* BP130618 SSS 990319 - READ BP13K555                                         
//* BP130857 SSS 000624 - ADD GROUPID                                           
//* BP130883 CLT 271000 - REMOVE BP13C904 AND CALL BP13C913                     
//* BP130956 AKT 231100 - CHG BP13K230/BP13K240 LRECL FROM 130 TO 250           
//* BP131017 LMS 250501 - REMOVE UPDATE TO K222,K230 AND K240.                  
//* BP130970 MBA 010808 - ADD BP13S213,CHG BP13C228, C256                       
//* BP131054 LSB 010906 - ADD BLKSIZE FOR BM06.F900 TEMP FILE                   
//* BP132278 JF4 030328 - CHG BP13F230/F240 LRECL TO 450                        
//* BP132501 SSS 040324 - DELETE BP13C744                                       
//* BP132455 SSS 040326 - ENHANCE BTO CANCELLATION LETTER                       
//* BP132577 SK  040820 - INCL BP13F915 IN BP13C256                             
//* BP132648 SSS 050217 - ADD '/*JOBPARM LINECT=0'                              
//* BP133135 SSS 070903 - CHG DJDE                                              
//* BP134309 DW5 020811 - TO ADD UPDATE OF BM06K810                             
//* BP135171 RJE 140210 - TO CATER FOR DB2 UPGRADE                              
//* BP135281 ESA1300514 - TO REPLACE BP13K816 WITH BP13K813                     
//* BP135415 ESA1210814 - TO ADD B13C24W FOR BP13KH20 HOUSEKEEPING              
//* BP135178 ESA1111114 - TO ROUTE PRINTING TO CLASS 'J'                        
//* BP135664 ESA1120515 - TO ADD CREATION OF BP13K313 UNDER CODE '04'           
//* BP13     CCC 250816 - TO EXPAND DATASET SPACE ALLOCATION                    
//******************************************************************            
//* STEP00   VERIFY FILES BEFORE DAILY PRODUCTION RUN                           
//*-----------------------------------------------------------------            
//STEP00   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=OLD                                                         
//INPUT3   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=OLD                                                         
//INPUT4   DD  DSN=BP13.K313.TRANS.HLE,                                         
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 9 - SUBMISSION                                          
//*--------------------------------------------------------------------         
//STEP0A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.SUBMSREC,DISP=OLD                                   
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'SU')                                              
//*-----------------------------------------------------------------            
//*  BACKUP FILES BEFORE UPDATE                                                 
//*-----------------------------------------------------------------            
//STEP1A   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F200.BKAPPMT.BACKUP(+1),                                
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=300,RECFM=FB)                  
//INPUT2   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.F210.BKWKPLAN.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                  
//INPUT3   DD  DSN=BM06.L720A1.SUBMISS,                                         
//             DISP=SHR                                                         
//OUTPUT3  DD  DSN=BM06.L720A1.SUBMISS.BACKUP,                                  
//             DISP=SHR                                                         
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
     REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                     
/*                                                                              
//*==================================================================           
//* STEP01          - CHECK THAT EACH NT/ZONE AND FT SUBMITTED IS               
//*                   OVER THE BOOKING PERIOD.                                  
//*------------------------------------------------------------------           
//* CHK THAT EACH ZONE/NT AND FT SUBMITTED IS OVER THE BOOKING PERIOD           
//*------------------------------------------------------------------           
//STEP01 EXEC    PGM=BP13C254,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.SUBMSREC,                                          
//             DISP=SHR                                                         
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR                                                         
//P13F205A DD  DSN=&&P13F205A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(LRECL=80,RECFM=FB),                                         
//             DSORG=PS                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* STEP02 - STEP04 - PRINT SELECTION/SUBMISSION REPORT FOR                     
//*                   NON-MATURE NEW TOWNS (BOOKING EXERCISE ON ZONE            
//*                   BASIS).                                                   
//*-----------------------------------------------------------------            
//*  SORT OUT F205 RECORDS FOR ZONE                                             
//*-----------------------------------------------------------------            
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F205B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(5,5),RLSE),                                          
//             DCB=(LRECL=80,RECFM=FB),                                         
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(30,1,CH,EQ,C'Z')                                                
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT FILE ACCORDING TO QUEUE POSITION                                       
//*---------------------------------------------------------------------        
//STEP03   EXEC  SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(30,30),RLSE),                                        
//             DCB=(LRECL=300,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,13,A,57,5,A),FORMAT=CH                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*   -- PRINT ANNEXURE A                                                       
//*   -- THE SUBMISSION REPORT IS DOWNLOAD TO PC, SO THAT USER                  
//*      CAN KEY IN THE REMARKS.                                                
//*---------------------------------------------------------------------        
//STEP04   EXEC  PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=&&P13F205B,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,DELETE)                                                
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH1,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13L232A DD  DSN=BM06.L720A1.SUBMISS,                                         
//             DISP=OLD                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C232) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* STEP05 - STEP07 - PRINT SELECTION/SUBMISSION REPORT FOR                     
//*                   MATURE NEW TOWNS (BOOKING EXERCISE ON NEW                 
//*                   TOWN BASIS).                                              
//*---------------------------------------------------------------------        
//* SORT OUT F205 RECORDS FOR NEW TOWN                                          
//*---------------------------------------------------------------------        
//STEP05   EXEC  SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F205C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(TRK,(1,1),RLSE),                                          
//             DCB=(LRECL=80,RECFM=FB),                                         
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(30,1,CH,EQ,C'T')                                                
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT FILE ACCORDING TO REGISTRATION NUMBER                                  
//*---------------------------------------------------------------------        
//STEP06   EXEC  SORT,COND=(0,NE)                                               
//SYSOUT   DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(TRK,(30,30),RLSE),                                        
//             DCB=(LRECL=300,RECFM=FB),                                        
//             DSORG=PS                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,13,A,57,5,A),FORMAT=CH                                         
/*                                                                              
//*---------------------------------------------------------------------        
//*   -- PRINT ANNEXURE A                                                       
//*   -- THE SUBMISSION REPORT IS DOWNLOAD TO PC, SO THAT USER                  
//*      CAN KEY IN THE REMARKS.                                                
//*---------------------------------------------------------------------        
//STEP07   EXEC  PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=&&P13F205C,                                                  
//             DISP=(SHR,DELETE)                                                
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,DELETE)                                                
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH1,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13L232A DD  DSN=BM06.L720A1.SUBMISS,                                         
//             DISP=MOD                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C232) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*=================================================================            
//* STEP10 - STEP13 - CANCEL APPLICATION UNDER BE AND BTO AND                   
//*                   PRINT CANCELLATION REPORT                                 
//*                   (FOR STUDIO APT, 3-ROOM, 4-ROOM, 5-ROOM AND               
//*                    EXECUTIVE FLAT).                                         
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1A CP-1',END;                                      
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT02    EXEC  PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1B CP-1',END;                                      
1$DJDE$ JDE=13POT1,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL1B                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT03    EXEC  PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1C CP-1',END;                                      
1$DJDE$ JDE=13POTS,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL1C                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//******************************************************************            
//*  SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                     
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT04    EXEC  PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
1$DJDE$ BTEXT='DPT=GRPID-EAAL1D CP-1',END;                                      
1$DJDE$ JDE=13POT2,JDL=BP13,END;                                                
//FORMID   OUTPUT FORMS=1WS1,GROUPID=EAAL1D                                     
//SYSUT2   DD  SYSOUT=J,OUTPUT=(*.FORMID),DEST=IOMJ                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*--------------------------------------------------------------------         
//*  SORT K200 BY ALLOC-DATE, NT/ZONE AND FLAT-TYPE                             
//*--------------------------------------------------------------------         
//STEP10   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200C,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=300,BLKSIZE=23400)                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,13,A),FORMAT=CH                                               
   OMIT COND=(9,3,CH,EQ,C'3R ')                                                 
/*                                                                              
//*--------------------------------------------------------------------         
//*  SORT F205 BY ALLOC-DATE, NT/ZONE AND FLAT-TYPE                             
//*--------------------------------------------------------------------         
//STEP11 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&P13F205D,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(TRK,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=23440)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(6,8,A,1,5,A),FORMAT=CH                                          
   OMIT COND=(1,3,CH,EQ,C'3R ')                                                 
/*                                                                              
//*---------------------------------------------------------------------        
//* UPDATE CANCELLATION TO THOSE SUCCESSFUL BALLOTED CASES BUT NOT              
//* SELECT FLATS AFTER BOOKING EXERCISE                                         
//*---------------------------------------------------------------------        
//STEP12   EXEC  PGM=BP13C256,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&P13F205D,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F200 DD  DSN=&&P13F200C,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=OLD                                                         
//BP13K820 DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH1,                                     
//             DISP=SHR                                                         
//BP13K840 DD  DSN=BP13.K840.APPLHIST,                                          
//             DISP=OLD                                                         
//BP13F310 DD  DSN=BP13.F310.CANCEL,                                            
//             DISP=OLD                                                         
//P13F800S DD  DSN=BP13.F800.SUBMISS.BOOK,                                      
//             DISP=OLD                                                         
//P13F800N DD  DSN=BP13.F800.SUBMISS.NOBOOK,                                    
//             DISP=OLD                                                         
//BP13F915 DD  DSN=BP13.F915.CDBTRANS,DISP=MOD                                  
//BP13L256 DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
//P13L256A DD  SYSOUT=J,                                                        
//             OUTPUT=(*.PRT01.FORMID),DEST=IOMJ                                
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* CREATE BP13F313 FOR HLE UNDER CODE '04'                                     
//*--------------------------------------------------------------------         
//STEP12A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F310.CANCEL,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F313,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0),                               
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   OUTREC FIELDS=(C'04',1,8,90X)                                                
//*--------------------------------------------------------------------         
//* REPRO TO BP13K313                                                           
//*--------------------------------------------------------------------         
//STEP12B  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&BP13F313,DISP=(OLD,DELETE)                                  
//OUTPUT   DD DSN=BP13.K313.TRANS.HLE,DISP=SHR                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT) OUTFILE(OUTPUT) REPLACE                                  
/*                                                                              
//*--------------------------------------------------------------------         
//*  DEFINE FILE BP13.F222.BP13A203                                             
//*--------------------------------------------------------------------         
//STEP23A  EXEC  PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F222.BP13A203,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=(DISK,10),                                                  
//             SPACE=(TRK,(1,1)),                                               
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* STEP22          - DELETE CORRESPONDING BP13K200, BP13K210 &                 
//*                   BP13K222 RECORDS.                                         
//*---------------------------------------------------------------------        
//*  DELETE ALLOCATION AT THE TIME OF SUBMISSION                                
//*---------------------------------------------------------------------        
//STEP23   EXEC  PGM=BP13C244,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K200 DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13KP00 DD  DSN=BP13.KP00.DOC,                                               
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13KQ00 DD  DSN=BP13.KQ00.REGN.APPT,                                         
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13F222 DD  DSN=BP13.F222.BP13A203,                                          
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* STEP23 - STEP24 - TO DELETE BM06F800 RECORDS.                               
//*---------------------------------------------------------------------        
//* SORT RECORDS IN ZONE/NT/FLAT-TYPE/ALLOC-DATE SEQUENCE                       
//*--------------------------------------------------------------------         
//STEP24   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F800,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(559,2,A,546,3,A,544,2,A,291,8,A),FORMAT=CH                      
/*                                                                              
//*---------------------------------------------------------------------        
//* DELETE THE ACCUMULATED FLAT LIST FILE                                       
//*---------------------------------------------------------------------        
//STEP25   EXEC  PGM=BP13C228,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//BM6F800  DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=OLD                                                         
//BM6F800D DD  DSN=BM06.F800.ALLOUNIT.SUBMISS,                                  
//             DISP=OLD                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*====================================================================         
//*  SORT F800 FILE AS TO FLAT TYPE, ALLO-SCHEME STEP25A, STEP25B               
//*-------------------------------------------------------------------          
//STEP25A  EXEC PGM=SORT,COND=(0,NE)                                            
//SYSPRINT DD   SYSOUT=*                                                        
//SORTIN   DD   DSN=BP13.F800.SUBMISS.NOBOOK,DISP=SHR                           
//SORTOUT  DD   DSN=&&F800NOBK,DISP=(NEW,PASS),                                 
//         UNIT=(SYSDA,10),                                                     
//         SPACE=(CYL,(15,5),RLSE),                                             
//         DCB=(LRECL=2000,RECFM=FB)                                            
//SYSOUT   DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
  SORT FIELDS=(30,2,A,57,3,A),FORMAT=CH                                         
/*                                                                              
//*--------------------------------------------------------------------         
//STEP25B  EXEC PGM=SORT,COND=(0,NE)                                            
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BP13.F800.SUBMISS.BOOK,DISP=SHR                              
//SORTOUT  DD  DSN=&&F800BOOK,DISP=(NEW,PASS),                                  
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(20,5),RLSE),                                         
//             DCB=(LRECL=2000,RECFM=FB)                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(30,2,A,57,3,A),FORMAT=CH                                         
/*                                                                              
//*--------------------------------------------------------------------         
//*  WRITE TO FILE BP13F800 RECORDS, NO OF FLATS NOT SELECTED                   
//*  ON A PER ALLOC-SCHEME BASIS.                                               
//*-------------------------------------------------------------------          
//STEP26   EXEC SAS,OPTIONS='MACRO',COND=(0,NE)                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(5,5),,,ROUND)                              
//BP13F800 DD DSN=&&F800NOBK,DISP=(OLD,PASS)                                    
//P13F800O DD DSN=&&F800NOUT,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,10),                                                  
//            SPACE=(CYL,(15,5),RLSE),                                          
//            DCB=(LRECL=13,RECFM=FB)                                           
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S213),DISP=SHR                             
/*                                                                              
//*--------------------------------------------------------------------         
//*  WRITE TO FILE BP13F800 RECORDS, SELECTED                                   
//*  ON A PER ALLOC-SCHEME BASIS.                                               
//*-------------------------------------------------------------------          
//STEP27   EXEC SAS,OPTIONS='MACRO',COND=(0,NE)                                 
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(5,5),,,ROUND)                              
//BP13F800 DD DSN=&&F800BOOK,DISP=(SHR,PASS)                                    
//P13F800O DD DSN=&&F800BOUT,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,10),                                                  
//            SPACE=(CYL,(15,5),RLSE),                                          
//            DCB=(LRECL=13,RECFM=FB)                                           
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S213),DISP=SHR                             
/*                                                                              
//*--------------------------------------------------------------------         
//*  REMOVE DUPLICATE BLOCK RECORDS                                             
//*  SORT AS TO ESTATE, NEIGHBOURHOOD, CONTRACT-NO, BLK-NO                      
//*-------------------------------------------------------------------          
//STEP28   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=BM06.F800.ALLOUNIT.SUBMISS,DISP=SHR                          
//SORTOUT  DD  DSN=&&M06SORT,DISP=(NEW,PASS),                                   
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(20,5),RLSE),                                         
//             DCB=(LRECL=800,RECFM=FB,BLKSIZE=0)                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(12,3,A,15,4,A,19,4,A,23,5,A),FORMAT=CH                           
  SUM FIELDS=NONE                                                               
/*                                                                              
//*--------------------------------------------------------------------         
//*  SORT RECORDS AS TO FLAT-TYPE, NEW-TOWN, BLOCK NO.                          
//*-------------------------------------------------------------------          
//STEP29   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DSN=&&M06SORT,DISP=(OLD,PASS)                                    
//SORTOUT  DD  DSN=&&M06OUT,DISP=(NEW,PASS),                                    
//             UNIT=(SYSDA,10),                                                 
//             SPACE=(CYL,(20,5),RLSE),                                         
//             DCB=(LRECL=800,RECFM=FB,BLKSIZE=0)                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(544,2,A,546,3,A,23,5,A),FORMAT=CH                                
/*                                                                              
//*--------------------------------------------------------------------         
//*  PRINT REPORT ON BOOKING OF FLATS                                           
//*-------------------------------------------------------------------          
//STEP30   EXEC PGM=BP13C289,COND=(0,NE)                                        
//P13F800S DD DSN=&&F800BOUT,DISP=(OLD,PASS)                                    
//P13F800N DD DSN=&&F800NOUT,DISP=(OLD,PASS)                                    
//BM06F800 DD DSN=&&M06OUT,DISP=(OLD,PASS)                                      
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//P13L289A DD DSN=BM06.L720A1.SUBMISS,                                          
//            DISP=MOD                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*  DEFINE FILE BP13.F230.BP13A203                                             
//*--------------------------------------------------------------------         
//STEP31A  EXEC  PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F230.BP13A203,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=(DISK,10),                                                  
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*  DEFINE FILE BP13.F240.BP13A203                                             
//*--------------------------------------------------------------------         
//STEP31B  EXEC  PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F240.BP13A203,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=(DISK,10),                                                  
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//*  DELETE THE INTV FILE                                                       
//*---------------------------------------------------------------------        
//STEP32   EXEC  PGM=BP13C234,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&P13F205A,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13F230 DD  DSN=BP13.F230.BP13A203,                                          
//             DISP=SHR                                                         
//BP13F240 DD  DSN=BP13.F240.BP13A203,                                          
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*//*--------------------------------------------------------------------      
//*//* STEP33 - STEP34 -  DELETE BP13F200 RECORDS.                              
//*//*--------------------------------------------------------------------      
//*//*  SORT F200 BY NT-ZONE, FLAT-TYPE AND DTE-BALLOT                          
//*//*--------------------------------------------------------------------      
//*//STEP33   EXEC  SORT,COND=(0,NE)                                            
//*//SORTIN   DD  DSN=BP13.F200.BKAPPMT,                                        
//*//             DISP=SHR                                                      
//*//SORTOUT  DD  DSN=&&P13F200H,                                               
//*//             DISP=(,PASS),                                                 
//*//             UNIT=(SYSDA,10),                                              
//*//             SPACE=(CYL,(10,5),RLSE),                                      
//*//             DCB=(RECFM=FB,LRECL=300,BLKSIZE=23400)                        
//*//SYSIN    DD  *                                                             
//*   SORT FIELDS=(9,5,A,50,6,A),FORMAT=CH                                      
//*/*                                                                           
//*//*--------------------------------------------------------------------      
//*//*  SORT F205 BY NT-ZONE, FLAT-TYPE AND DTE-BALLOT                          
//*//*--------------------------------------------------------------------      
//*//STEP34   EXEC  SORT,COND=(0,NE)                                            
//*//SORTIN   DD  DSN=&&P13F205A,                                               
//*//             DISP=(SHR,PASS)                                               
//*//SORTOUT  DD  DSN=&&P13F205G,                                               
//*//             DISP=(,PASS),                                                 
//*//             UNIT=(SYSDA,10),                                              
//*//             SPACE=(TRK,(10,5),RLSE),                                      
//*//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=23440)                         
//*//SYSIN    DD  *                                                             
//*   SORT FIELDS=(1,5,A,24,6,A),FORMAT=CH                                      
//*/*                                                                           
//*//*-----------------------------------------------------------------         
//*//*  DELETE F200 RECORDS WITH SAME NT/ZONE, FT AND DTE-BALLOT AS             
//*//*     F205 CONTROL RECORD                                                  
//*//*-----------------------------------------------------------------         
//*//STEP35   EXEC  PGM=BP13C236,COND=(0,NE)                                    
//*//BP13F205 DD  DSN=&&P13F205G,                                               
//*//             DISP=(SHR,DELETE)                                             
//*//BP13F200 DD  DSN=&&P13F200H,                                               
//*//             DISP=(SHR,DELETE)                                             
//*//P13F200O DD  DSN=BP13.F200.BKAPPMT,                                        
//*//             DISP=OLD                                                      
//*//SYSDBG   DD  SYSOUT=*                                                      
//*//SYSDBOUT DD  SYSOUT=*                                                      
//*//SYSUDUMP DD  SYSOUT=*                                                      
//*//SYSABEND DD  SYSOUT=*                                                      
//*//SYSOUT   DD  SYSOUT=*                                                      
//*/*                                                                           
//*-------------------------------------------------------------------- 00001860
//* BP13C24W - BP13KH20 HOUSEKEEPING                                    00001870
//*-------------------------------------------------------------------- 00001880
//STEP36 EXEC    PGM=BP13C24W,COND=(0,NE)                                       
//BP13F205 DD  DSN=&&P13F205A,DISP=(SHR,PASS)                           00001900
//BP13K757 DD  DSN=BP13.KH20.HISTAPPL,DISP=SHR,                         00001900
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* STEP30          - BACKUP CONTROL RECORDS.                                   
//*------------------------------------------------------------------           
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*------------------------------------------------------------------           
//STEP37   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.SUBMSREC,                                          
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
/*                                                                              
//*-------------------------------------------------------------------          
//* TO UPDATE RECORDS IN BM06K810                                               
//*-------------------------------------------------------------------          
//STEP38   EXEC PGM=BP13C10C                                                    
//BM06K810 DD DSN=BM06.K810.UNITOFFR,DISP=SHR                                   
//BM06F800 DD DSN=BM06.F800.ALLOUNIT.SUBMISS,DISP=SHR                           
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* END BP13A203                                                                
//*---------------------------------------------------------------------        
