//BP13A59G JOB (BP13P),'BP13A59G',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//*---------------------------------------------------------------------        
//*=================================================================            
//*                                                                             
//*  THIS JOB IS TO CREATE VFY FILE BP13F203 FOR SMS   SENDING FOR              
//*  ROF CASES                                                                  
//*                                                                             
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---  -------- -----------                                          
//* BP136992 ZDD1 100817   NEW JCL                                              
//*=================================================================            
//* SELECTION 2 CASES FOR PRE EMAIL SENDING VERIFICATION                        
//* SEND SMS   TO CT2 - 96680396                                                
//*---------------------------------------------------------------------        
//*-------------------------------------------------------------------*         
//* EMPTY MONTHLY ACCUMULATED EMAIL FILES                             *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR200,DISP=OLD                                   
//OUTPUT01 DD DSN=BP13.F203.SMS.ROF.R1.VFY,DISP=SHR                             
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT01)                                 
//*-------------------------------------------------------------------*         
//* EMPTY MONTHLY ACCUMULATED EMAIL FILES                             *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR200,DISP=OLD                                   
//OUTPUT01 DD DSN=BP13.F203.SMS.ROF.R2.VFY,DISP=SHR                             
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT01)                                 
//*---------------------------------------------------------------------        
//* R1                                                                          
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=ICETOOL                                                     
//DFSMSG   DD SYSOUT=*                                                          
//TOOLMSG  DD SYSOUT=*                                                          
//IN01 DD DSN=BP13.F203.SMS.ROF.R1,DISP=SHR                                     
//*                                                                             
//OUT01 DD DSN=BP13.F203.SMS.ROF.R1.VFY,DISP=SHR                                
//TOOLIN    DD *                                                                
  COPY FROM(IN01) USING(CT01)                                                   
//*                                                                             
//CT01CNTL  DD *                                                                
  OUTFIL FNAMES=OUT01,OUTREC=(1,117,C'96680396 ',127,74),                       
         ACCEPT=2                                                               
//*---------------------------------------------------------------------        
//* R2                                                                          
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=ICETOOL                                                     
//DFSMSG   DD SYSOUT=*                                                          
//TOOLMSG  DD SYSOUT=*                                                          
//IN01 DD DSN=BP13.F203.SMS.ROF.R2,DISP=SHR                                     
//*                                                                             
//OUT01 DD DSN=BP13.F203.SMS.ROF.R2.VFY,DISP=SHR                                
//TOOLIN    DD *                                                                
  COPY FROM(IN01) USING(CT01)                                                   
//*                                                                             
//CT01CNTL  DD *                                                                
  OUTFIL FNAMES=OUT01,OUTREC=(1,117,C'96680396 ',127,74),                       
         ACCEPT=2                                                               
