//BP13ADPK  JOB (BP13P),'BP13ADPK',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* PRINT REPORT TO COU FOR DBSS APPLICATION BEFORE BOOKING                     
//* UPDATE LOAN-TAG TO 'B' IF FOUND IN PPOS, DECLARE PPO, EC, AGE>65            
//*=================================================================            
//* CHG REF  DATE     BY   DESCRIPTION                                          
//* -------- -------- ---  -----------                                          
//* BP134385 20111030 LSB  LOAN REPORT TO COU, UPDATE LOAN-TAG FOR PPO          
//*=================================================================            
//*  SEND DJDE AHEAD OF THE PRINT DATASET                                       
//*  PRT01                                                                      
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K800.APPLN.DBS,DISP=OLD                                  
//INPUT2   DD DSN=BP13.KB20.DBSBK,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//******************************************************************            
//* SORT OUT DBSS BY BOOKING DATE/TIME/QUEUE-NO                                 
//*------------------------------------------------------------------           
//STEP02  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K800.APPLN.DBS,DISP=SHR                                   
//SORTOUT DD DSN=&&F800COU,DISP=(NEW,PASS),                                     
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=2000),                                            
//        SPACE=(CYL,(40,20),RLSE)                                              
//SYSIN   DD  *                                                                 
   SORT FIELDS=(509,12,A,526,5,A,4,8,A),FORMAT=CH                               
   OMIT COND=(4,8,CH,EQ,C'        ')                                            
//*---------------------------------------------------------------------        
//* MATCH SOC/DEBARMENT/LEAS/EC - IF FOUND PPOS, EC, AGE >65                    
//* UPDATE LOAN-TAG TO B TO BP13K800/BP13KB20                                   
//*---------------------------------------------------------------------        
//STEP03 EXEC    PGM=BP13CE01,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&F800COU,DISP=(OLD,PASS)                                    
//BP13K800 DD  DSN=BP13.K800.APPLN.DBS,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KB20 DD  DSN=BP13.KB20.DBSBK,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD  DSN=BP13.K820.OCCUP.DBS,DISP=SHR,                                
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K730 DD  DSN=BP13.K730.MATURERQ,DISP=SHR,                                 
//            AMP=('BUFND=4','BUFNI=8')                                         
//BR10K010 DD  DSN=BR10.K010.PTEPPTY,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BR10K080 DD  DSN=BR10.K080.PTEPPTY.HIST,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//P04K010  DD  DSN=BP04.K010.DEBAR,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP27K800 DD  DSN=BP27.K800.HLAPPLN,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP27K820 DD  DSN=BP27.K820.HLOCCUP,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP27K821 DD  DSN=BP27.K820.HLOCCUP.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13LE01A DD DSN=BP13.LE01A.BP13CE01,DISP=OLD                                  
//P13LE01B DD DSN=BP13.LE01B.BP13CE01,DISP=OLD                                  
//P13LE01C DD DSN=BP13.LE01C.BP13CE01,DISP=OLD                                  
//P13LE01D DD DSN=BP13.LE01D.BP13CE01,DISP=OLD                                  
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT REPORT TO COU - HDB LOAN                                              
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LE01A.BP13CE01,DISP=SHR                                  
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT REPORT TO COU - BANK LOAN                                             
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LE01B.BP13CE01,DISP=SHR                                  
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT REPORT TO COU - NO LOAN                                               
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LE01C.BP13CE01,DISP=SHR                                  
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT REPORT TO COU - DECLARE PPOS                                          
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=BP13.LE01D.BP13CE01,DISP=SHR                                  
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13ADPK                                                                
//*---------------------------------------------------------------------        
