//BP13D116 JOB (BP13P),'BP13D116',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//*-----------------------------------------------------------------            
//******************************************************************            
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EASSRS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//* STEP01 COPY TO DAILY FILES                                                  
//*---------------------------------------------------------------------        
//STEP01   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=AB02.F935.SOC,DISP=SHR                                       
//SORTOUT  DD  DSN=BP13.AB02.F935.SOC.DAILY,DISP=SHR                            
//SYSIN    DD  *                                                                
        SORT FIELDS=(57,8,A,2,9,A),FORMAT=CH                                    
//*--------------------------------------------------------------------         
//* STEP02 BACKUP FILES TO ACCUM                                                
//*---------------------------------------------------------------------        
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F935.SOC.DAILY,DISP=SHR                            
//SORTOUT  DD  DSN=BP13.AB02.F935.SOC.ACCUM,DISP=MOD                            
//SYSIN    DD  *                                                                
        SORT FIELDS=(57,8,A,2,9,A),FORMAT=CH                                    
//*--------------------------------------------------------------------*        
//* GENERATE REPORT FOR FINANCE                                        *        
//*--------------------------------------------------------------------*        
//STEP03   EXEC PGM=BP13CB4G,COND=(0,NE)                                        
//AB02F935 DD DSN=BP13.AB02.F935.SOC.DAILY,DISP=SHR                             
//BP13L935 DD DSN=BP13.AB02.F935.SOC.FINANCE,DISP=MOD                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------         
//* STEP04 SORT INPUT FILE                                                      
//*---------------------------------------------------------------------        
//STEP04   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F930.DAILY,DISP=SHR                                
//SORTOUT  DD  DSN=&&AB02F930,DISP=(NEW,PASS),                                  
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                              
//             SPACE=(CYL,(10,10),RLSE)                                         
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,64,A),FORMAT=CH                                              
//*--------------------------------------------------------------------         
//* STEP05 SORT RETURN FILE                                                     
//*---------------------------------------------------------------------        
//STEP05   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F935.SOC.DAILY,DISP=SHR                            
//SORTOUT  DD  DSN=&&AB02F935,DISP=(NEW,PASS),                                  
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,64,A),FORMAT=CH                                              
//*--------------------------------------------------------------------*        
//* MATCH SENT AND RETURN FILES                                        *        
//*--------------------------------------------------------------------*        
//STEP06   EXEC PGM=BP13CB4H,COND=(0,NE)                                        
//AB02F930 DD DSN=&&AB02F930,DISP=(OLD,DELETE)                                  
//AB02F935 DD DSN=&&AB02F935,DISP=(OLD,DELETE)                                  
//P13F935A DD DSN=BP13.AB02.F935.SOC.DAILY.MATCH,DISP=SHR                       
//P13F935B DD DSN=BP13.AB02.F935.SOC.DAILY.NMATCH,DISP=SHR                      
//P13F930A DD DSN=BP13.AB02.F930.DAILY.F930A.NMATCH,DISP=SHR                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------         
//* STEP07 SORT ALL ACCEPT CASES                                                
//*---------------------------------------------------------------------        
//STEP07   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F935.SOC.DAILY.MATCH,DISP=SHR                      
//SORTOUT  DD  DSN=BP13.AB02.F935.ACCEPT,DISP=SHR                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(57,8,A,2,9,A),FORMAT=CH                                        
    INCLUDE COND=(65,3,CH,EQ,C'ACC')                                            
//*--------------------------------------------------------------------         
//* STEP08 SORT ALL REJECT CASES                                                
//*---------------------------------------------------------------------        
//STEP08   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F935.SOC.DAILY.MATCH,DISP=SHR                      
//SORTOUT  DD  DSN=BP13.AB02.F935.REJECT,DISP=SHR                               
//SYSIN    DD  *                                                                
    SORT FIELDS=(57,8,A,2,9,A),FORMAT=CH                                        
    INCLUDE COND=(65,3,CH,EQ,C'REJ')                                            
//*--------------------------------------------------------------------         
//* STEP09 BACKUP ACCEPTED CASES TO ACCUM                                       
//*---------------------------------------------------------------------        
//STEP09   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F935.ACCEPT,DISP=SHR                               
//SORTOUT  DD  DSN=BP13.AB02.F935.ACCEPT.ACCUM,DISP=MOD                         
//SYSIN    DD  *                                                                
        SORT FIELDS=(57,8,A,2,9,A),FORMAT=CH                                    
//*--------------------------------------------------------------------         
//* STEP10 BACKUP REJECTED CASES TO ACCUM                                       
//*---------------------------------------------------------------------        
//STEP10   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.AB02.F935.REJECT,DISP=SHR                               
//SORTOUT  DD  DSN=BP13.AB02.F935.REJECT.ACCUM,DISP=MOD                         
//SYSIN    DD  *                                                                
        SORT FIELDS=(57,8,A,2,9,A),FORMAT=CH                                    
//*-----------------------------------------------------------------            
//* EMPTY AB02 FILE                                                   *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AB02.F935.SOC,DISP=OLD                                        
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
//*                                                                             
