//BP13D807 JOB (BP13P),'BP13D807',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//       NOTIFY=CSD0071                                                 00020000
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030000
//*-------------------------------------------------------------------* 00040000
//* DESCRIPTION :  RUN MQ TRIGGER PROGRAM                             * 00050000
//*-------------------------------------------------------------------* 00060000
//* CHG REF  BY  ON        DESCRIPTION                                  00070000
//* -------- --- ------    -----------                                  00080000
//* BP138330 EL27 20200601 OUTREC 'A1' AND 'A2' TO 'A4' FOR CB2020      00090000
//* BP138330 EL27 20200605 OUTREC 'A2' TO 'A5' FOR CB2020               00100000
//* BP139027 PP11 20220421 CATER TO SEND LG CASES                       00101001
//*-------------------------------------------------------------------* 00110000
//******************************************************************    00120000
//* SORT BP13K23A Z1 - APPROVED WITH AHG ONLY                           00130000
//*------------------------------------------------------------------   00140000
//STEP1A  EXEC SORT,COND=(0,NE)                                         00150000
//SORTIN  DD DSN=BP13.F23A.EMAIL.GRANT.ALL,DISP=SHR                     00160000
//SORTOUT DD DSN=BP13.F23A.EMAIL.FZ1,DISP=SHR                           00170000
//SYSIN   DD  *                                                         00180000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00190000
  INCLUDE COND=(11,2,CH,EQ,C'Z1')                                       00200000
//*--------------------------------------------------------------------*00210000
//* STEP1B:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00220000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00230000
//*          APPT TYPE = (Z1)                                          *00240000
//*--------------------------------------------------------------------*00250000
//STEP1B   EXEC MQBATCH,NAME=BP13CS10,COND=(0,NE)                       00260000
//STEPLIB  DD                                                           00270000
//         DD                                                           00280000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00290000
//BP13F23A DD DSN=BP13.F23A.EMAIL.FZ1,DISP=SHR                          00300000
//SYSDBG   DD  SYSOUT=*                                                 00310000
//SYSOUT   DD  SYSOUT=*                                                 00320000
//SYSDBOUT DD  SYSOUT=*                                                 00330000
//SYSABOUT DD  SYSOUT=*                                                 00340000
//SYSPRINT DD  SYSOUT=*                                                 00350000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         00360000
/*                                                                      00370000
//******************************************************************    00380000
//* SORT BP13K23A Z2 - APPROVED WITH SHG ONLY                           00390000
//*------------------------------------------------------------------   00400000
//STEP2A  EXEC SORT,COND=(0,NE)                                         00410000
//SORTIN  DD DSN=BP13.F23A.EMAIL.GRANT.ALL,DISP=SHR                     00420000
//SORTOUT DD DSN=BP13.F23A.EMAIL.FZ2,DISP=SHR                           00430000
//SYSIN   DD  *                                                         00440000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00450000
  INCLUDE COND=(11,2,CH,EQ,C'Z2')                                       00460000
//*--------------------------------------------------------------------*00470000
//* STEP2B:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00480000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00490000
//*          APPT TYPE = (Z2)                                          *00500000
//*--------------------------------------------------------------------*00510000
//STEP2B   EXEC MQBATCH,NAME=BP13CS10,COND=(0,NE)                       00520000
//STEPLIB  DD                                                           00530000
//         DD                                                           00540000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00550000
//BP13F23A DD DSN=BP13.F23A.EMAIL.FZ2,DISP=SHR                          00560000
//SYSDBG   DD  SYSOUT=*                                                 00570000
//SYSOUT   DD  SYSOUT=*                                                 00580000
//SYSDBOUT DD  SYSOUT=*                                                 00590000
//SYSABOUT DD  SYSOUT=*                                                 00600000
//SYSPRINT DD  SYSOUT=*                                                 00610000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         00620000
/*                                                                      00630000
//******************************************************************    00640000
//* SORT BP13K23A Z3 - APPROVED WITH AHG AND SHG                        00650000
//*------------------------------------------------------------------   00660000
//STEP3A  EXEC SORT,COND=(0,NE)                                         00670000
//SORTIN  DD DSN=BP13.F23A.EMAIL.GRANT.ALL,DISP=SHR                     00680000
//SORTOUT DD DSN=BP13.F23A.EMAIL.FZ3,DISP=SHR                           00690000
//SYSIN   DD  *                                                         00700000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00710000
  INCLUDE COND=(11,2,CH,EQ,C'Z3')                                       00720000
//*--------------------------------------------------------------------*00730000
//* STEP3B:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *00740000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *00750000
//*          APPT TYPE = (Z3)                                          *00760000
//*--------------------------------------------------------------------*00770000
//STEP3B   EXEC MQBATCH,NAME=BP13CS10,COND=(0,NE)                       00780000
//STEPLIB  DD                                                           00790000
//         DD                                                           00800000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00810000
//BP13F23A DD DSN=BP13.F23A.EMAIL.FZ3,DISP=SHR                          00820000
//SYSDBG   DD  SYSOUT=*                                                 00830000
//SYSOUT   DD  SYSOUT=*                                                 00840000
//SYSDBOUT DD  SYSOUT=*                                                 00850000
//SYSABOUT DD  SYSOUT=*                                                 00860000
//SYSPRINT DD  SYSOUT=*                                                 00870000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         00880000
/*                                                                      00890000
//******************************************************************    00900000
//* SORT BP13K23A Y1 - REJECTED AHG                                     00910000
//*------------------------------------------------------------------   00920000
//STEP4A  EXEC SORT,COND=(0,NE)                                         00930000
//SORTIN  DD DSN=BP13.F23A.EMAIL.GRANT.ALL,DISP=SHR                     00940000
//SORTOUT DD DSN=BP13.F23A.EMAIL.FY1,DISP=SHR                           00950000
//SYSIN   DD  *                                                         00960000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00970000
  INCLUDE COND=(11,2,CH,EQ,C'Y1')                                       00980000
//*--------------------------------------------------------------------*00990000
//* STEP4B:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *01000000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *01010000
//*          APPT TYPE = (Y1)                                          *01020000
//*--------------------------------------------------------------------*01030000
//STEP4B   EXEC MQBATCH,NAME=BP13CS10,COND=(0,NE)                       01040000
//STEPLIB  DD                                                           01050000
//         DD                                                           01060000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           01070000
//BP13F23A DD DSN=BP13.F23A.EMAIL.FY1,DISP=SHR                          01080000
//SYSDBG   DD  SYSOUT=*                                                 01090000
//SYSOUT   DD  SYSOUT=*                                                 01100000
//SYSDBOUT DD  SYSOUT=*                                                 01110000
//SYSABOUT DD  SYSOUT=*                                                 01120000
//SYSPRINT DD  SYSOUT=*                                                 01130000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         01140000
/*                                                                      01150000
//******************************************************************    01160000
//* SORT BP13K23A Y2 - REJECTED BOTH AHG AND SHG                        01170000
//*------------------------------------------------------------------   01180000
//STEP5A  EXEC SORT,COND=(0,NE)                                         01190000
//SORTIN  DD DSN=BP13.F23A.EMAIL.GRANT.ALL,DISP=SHR                     01200000
//SORTOUT DD DSN=BP13.F23A.EMAIL.FY2,DISP=SHR                           01210000
//SYSIN   DD  *                                                         01220000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        01230000
  INCLUDE COND=(11,2,CH,EQ,C'Y2')                                       01240000
//*--------------------------------------------------------------------*01250000
//* STEP5B:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *01260000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *01270000
//*          APPT TYPE = (Y2)                                          *01280000
//*--------------------------------------------------------------------*01290000
//STEP5B   EXEC MQBATCH,NAME=BP13CS10,COND=(0,NE)                       01300000
//STEPLIB  DD                                                           01310000
//         DD                                                           01320000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           01330000
//BP13F23A DD DSN=BP13.F23A.EMAIL.FY2,DISP=SHR                          01340000
//SYSDBG   DD  SYSOUT=*                                                 01350000
//SYSOUT   DD  SYSOUT=*                                                 01360000
//SYSDBOUT DD  SYSOUT=*                                                 01370000
//SYSABOUT DD  SYSOUT=*                                                 01380000
//SYSPRINT DD  SYSOUT=*                                                 01390000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         01400000
/*                                                                      01410000
//*-----------------------------------------------------------------    01420000
//* CLEAR BP13.F23C.EMAIL.BK                                            01430000
//*-----------------------------------------------------------------    01440000
//STEP06   EXEC  PGM=IDCAMS,COND=(0,NE)                                 01450000
//SYSPRINT DD  SYSOUT=*                                                 01460000
//INPUT1   DD  DUMMY                                                    01470000
//OUTPUT1  DD  DSN=BP13.F23C.EMAIL.BK,                                  01480000
//             DISP=OLD                                                 01490000
//SYSIN    DD  *                                                        01500000
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                             01510000
/*                                                                      01520000
//*-----------------------------------------------------------------    01530000
//* SORT BP13KL00 CDE-EMAIL = A/STAGE = BK/DOC-TYPE = EINV              01540000
//*-----------------------------------------------------------------    01550000
//STEP07   EXEC SORT,CYL=30                                             01560000
//SORTIN   DD DSN=BP13.KL00.LETTER,DISP=SHR                             01570000
//SORTOUT  DD DSN=&&BP13FL00,DISP=(NEW,PASS),                           01580000
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                      01590000
//            SPACE=(CYL,(20,5),RLSE)                                   01600000
//SYSIN    DD *                                                         01610000
  SORT FIELDS=(1,8,A),FORMAT=CH                                         01620000
  INCLUDE COND=(81,1,CH,EQ,C'A',AND,9,2,CH,EQ,C'BK',AND,                01630000
                14,5,CH,EQ,C'EINV ')                                    01640000
//*-------------------------------------------------------------------- 01650000
//*    OUTREC BP13FL00 TO BP13F203 TO BE USE AS INPUT IN BP13C24N       01660000
//*-------------------------------------------------------------------- 01670000
//SORT08   EXEC  SORT,COND=(0,NE)                                       01680000
//SORTIN   DD DSN=&&BP13FL00,DISP=(SHR,PASS)                            01690000
//SORTOUT  DD DSN=&&BP13F203,DISP=(NEW,PASS),                           01700000
//            UNIT=SYSDA,                                               01710000
//            SPACE=(CYL,(8,5),RLSE),                                   01720000
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                        01730000
//SYSIN    DD  *                                                        01740000
    SORT FIELDS=COPY                                                    01750000
    OUTREC FIELDS=(11X,1,8,181X)                                        01760000
//*                                                                     01770000
//*-------------------------------------------------------------------* 01780000
//* FILTER CASES WITH APPMT DATE <= 30 DAYS AFTER THE CURRENT DATE      01790000
//*-------------------------------------------------------------------* 01800000
//STEP09   EXEC PGM=BP13C24N,COND=(0,NE)                                01810000
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                               01820000
//BP13F203 DD DSN=&&BP13F203,DISP=(SHR,PASS)                            01830000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              01840000
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                    01850000
//P13F203A DD DSN=&&P13F203A,DISP=(NEW,PASS),                           01860000
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                         01870000
//         SPACE=(CYL,(8,5),RLSE)                                       01880000
//SYSDBG   DD SYSOUT=*                                                  01890000
//SYSDBOUT DD SYSOUT=*                                                  01900000
//SYSOUT   DD SYSOUT=*                                                  01910000
//*-------------------------------------------------------------------* 01920000
//* CREATION OF BP13F23C TO BE USED AS INPUT TO SEND EMAIL              01930000
//*-------------------------------------------------------------------* 01940000
//STEP10   EXEC PGM=BP13C24O,COND=(0,NE)                                01950000
//BP13F203 DD DSN=&&P13F203A,DISP=(SHR,PASS)                            01960000
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                              01970000
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                              01980000
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                              01990000
//BP13F23C DD DSN=BP13.F23C.EMAIL.BK,DISP=SHR                           02000000
//SYSDBG   DD SYSOUT=*                                                  02010000
//SYSDBOUT DD SYSOUT=*                                                  02020000
//SYSOUT   DD SYSOUT=*                                                  02030000
//*                                                                     02040000
//*------------------------------------------------------------------   02050000
//* SORT BP13F23C A1 - FIRST 100 % OF THE QUEUE RANGE                   02060000
//* FOR CB2020 TO REPLACE A1 WITH A4                                    02070000
//*------------------------------------------------------------------   02080000
//STEP11  EXEC SORT,COND=(0,NE)                                         02090000
//SORTIN  DD DSN=BP13.F23C.EMAIL.BK,DISP=SHR                            02100000
//SORTOUT DD DSN=BP13.F23C.EMAIL.A1,DISP=SHR                            02110000
//SYSIN   DD  *                                                         02120000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        02130000
   INCLUDE COND=(9,2,CH,EQ,C'A1')                                       02140000
   OUTREC FIELDS=(1,8,C'A4',11,240)                                     02150000
//*--------------------------------------------------------------------*02160000
//* STEP12:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *02170000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *02180000
//*          APPT TYPE = (A1)                                          *02190000
//*--------------------------------------------------------------------*02200000
//STEP12   EXEC MQBATCH,NAME=BP13CS0A,COND=(0,NE)                       02210000
//STEPLIB  DD                                                           02220000
//         DD                                                           02230000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           02240000
//BP13F23C DD DSN=BP13.F23C.EMAIL.A1,DISP=SHR                           02250000
//SYSDBG   DD  SYSOUT=*                                                 02260000
//SYSOUT   DD  SYSOUT=*                                                 02270000
//SYSDBOUT DD  SYSOUT=*                                                 02280000
//SYSABOUT DD  SYSOUT=*                                                 02290000
//SYSPRINT DD  SYSOUT=*                                                 02300000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         02310000
/*                                                                      02320000
//*------------------------------------------------------------------   02330000
//* SORT BP13F23C A2 - 2ND 100 % OF THE QUEUE RANGE                     02340000
//* FOR CB2020 TO REPLACE A2 WITH A5                                    02350000
//*------------------------------------------------------------------   02360000
//STEP13  EXEC SORT,COND=(0,NE)                                         02370000
//SORTIN  DD DSN=BP13.F23C.EMAIL.BK,DISP=SHR                            02380000
//SORTOUT DD DSN=BP13.F23C.EMAIL.A2,DISP=SHR                            02390000
//SYSIN   DD  *                                                         02400000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        02410000
   INCLUDE COND=(9,2,CH,EQ,C'A2')                                       02420000
   OUTREC FIELDS=(1,8,C'A5',11,240)                                     02430000
//*--------------------------------------------------------------------*02440000
//* STEP14:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *02450000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *02460000
//*          APPT TYPE = (A2)                                          *02470000
//*--------------------------------------------------------------------*02480000
//STEP14   EXEC MQBATCH,NAME=BP13CS0A,COND=(0,NE)                       02490000
//STEPLIB  DD                                                           02500000
//         DD                                                           02510000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           02520000
//BP13F23C DD DSN=BP13.F23C.EMAIL.A2,DISP=SHR                           02530000
//SYSDBG   DD  SYSOUT=*                                                 02540000
//SYSOUT   DD  SYSOUT=*                                                 02550000
//SYSDBOUT DD  SYSOUT=*                                                 02560000
//SYSABOUT DD  SYSOUT=*                                                 02570000
//SYSPRINT DD  SYSOUT=*                                                 02580000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         02590000
/*                                                                      02600000
//*------------------------------------------------------------------   02610000
//* SORT BP13F23C A3 - FOR SERS CASES                                   02620000
//*------------------------------------------------------------------   02630000
//STEP15  EXEC SORT,COND=(0,NE)                                         02640000
//SORTIN  DD DSN=BP13.F23C.EMAIL.BK,DISP=SHR                            02650000
//SORTOUT DD DSN=BP13.F23C.EMAIL.A3,DISP=SHR                            02660000
//SYSIN   DD  *                                                         02670000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        02680000
  INCLUDE COND=(9,2,CH,EQ,C'A3')                                        02690000
//*--------------------------------------------------------------------*02700000
//* STEP12:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *02710000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *02720000
//*          APPT TYPE = (A3)                                          *02730000
//*--------------------------------------------------------------------*02740000
//STEP12   EXEC MQBATCH,NAME=BP13CS0A,COND=(0,NE)                       02750000
//STEPLIB  DD                                                           02760000
//         DD                                                           02770000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           02780000
//BP13F23C DD DSN=BP13.F23C.EMAIL.A3,DISP=SHR                           02790000
//SYSDBG   DD  SYSOUT=*                                                 02800000
//SYSOUT   DD  SYSOUT=*                                                 02810000
//SYSDBOUT DD  SYSOUT=*                                                 02820000
//SYSABOUT DD  SYSOUT=*                                                 02830000
//SYSPRINT DD  SYSOUT=*                                                 02840000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         02850000
/*                                                                      02860000
//******************************************************************    02870000
//* SORT BP13K23A EG - APPROVED WITH EHG                                02880000
//*------------------------------------------------------------------   02890000
//STEP16  EXEC SORT,COND=(0,NE)                                         02900000
//SORTIN  DD DSN=BP13.F23A.EMAIL.GRANT.ALL,DISP=SHR                     02910000
//SORTOUT DD DSN=BP13.F23A.EMAIL.FEG,DISP=SHR                           02920000
//SYSIN   DD  *                                                         02930000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        02940000
  INCLUDE COND=(11,2,CH,EQ,C'EG')                                       02950000
//*--------------------------------------------------------------------*02960000
//* STEP17:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *02970000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *02980000
//*          APPT TYPE = (EG)                                          *02990000
//*--------------------------------------------------------------------*03000000
//STEP17   EXEC MQBATCH,NAME=BP13CS10,COND=(0,NE)                       03010000
//STEPLIB  DD                                                           03020000
//         DD                                                           03030000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           03040000
//BP13F23A DD DSN=BP13.F23A.EMAIL.FEG,DISP=SHR                          03050000
//SYSDBG   DD  SYSOUT=*                                                 03060000
//SYSOUT   DD  SYSOUT=*                                                 03070000
//SYSDBOUT DD  SYSOUT=*                                                 03080000
//SYSABOUT DD  SYSOUT=*                                                 03090000
//SYSPRINT DD  SYSOUT=*                                                 03100000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         03110000
/*                                                                      03120000
//******************************************************************    03130000
//* SORT BP13K23A LG - APPROVED WITH LHG                                03140000
//*------------------------------------------------------------------   03150000
//STEP18  EXEC SORT,COND=(0,NE)                                         03160000
//SORTIN  DD DSN=BP13.F23A.EMAIL.GRANT.ALL,DISP=SHR                     03170000
//SORTOUT DD DSN=BP13.F23A.EMAIL.FLG,DISP=SHR                           03180000
//SYSIN   DD  *                                                         03190000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        03200000
  INCLUDE COND=(11,2,CH,EQ,C'LG')                                       03210000
//*--------------------------------------------------------------------*03220000
//* STEP19:  RUN PROGRAM TO CREATE NOTIFICATION MESSAGE TO SEND        *03230000
//*          TO THE MESSAGE QUEUE (BY EMAIL)                           *03240000
//*          APPT TYPE = (LG)                                          *03250000
//*--------------------------------------------------------------------*03260000
//STEP19   EXEC MQBATCH,NAME=BP13CS10,COND=(0,NE)                       03270000
//STEPLIB  DD                                                           03280000
//         DD                                                           03290000
//         DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           03300000
//BP13F23A DD DSN=BP13.F23A.EMAIL.FLG,DISP=SHR                          03310000
//SYSDBG   DD  SYSOUT=*                                                 03320000
//SYSOUT   DD  SYSOUT=*                                                 03330000
//SYSDBOUT DD  SYSOUT=*                                                 03340000
//SYSABOUT DD  SYSOUT=*                                                 03350000
//SYSPRINT DD  SYSOUT=*                                                 03360000
//SYSIN    DD  DSN=MQSERIES.ALIAS.QMGR,DISP=SHR                         03370000
/*                                                                      03380000
