//BP13A232 JOB (BP13P),'BP13A232',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//*********************************************************************         
//* CHG REF  ON       BY   DESCRIPTION                                          
//* -------- -------- ---- -----------                                          
//* BP132278 20030328 JF4  CHGE BP13F230/F240 LRECL TO 450.                     
//* BP133610 20090529 ESA1 TO REPLACE BP13K767 WITH BP13K816                    
//* BP135281 20140530 ESA1 TO REPLACE BP13K816 WITH BP13K813                    
//*********************************************************************         
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 18 - DEL BK RECS - NO SUBMISSION                        
//*--------------------------------------------------------------------         
//STEP00   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.DELREC,DISP=OLD                                     
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'DB')                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F222.BP13A232                                        
//*--------------------------------------------------------------------         
//STEP01 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F222.BP13A232,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(1,1)),                                               
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* STEP02          - TO DELETE CORRESPONDING BP13K200, BP13K210 &              
//*                   BP13K222 RECORDS.                                         
//*---------------------------------------------------------------------        
//*   TO DELETE ALLOCATION AT THE TIME OF SUBMISSION                            
//*---------------------------------------------------------------------        
//STEP02 EXEC    PGM=BP13C244,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.DELREC,                                            
//             DISP=SHR                                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K200 DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K222 DD  DSN=BP13.K222.SUMALLOC,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13KP00 DD  DSN=BP13.KP00.DOC,                                               
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13KQ00 DD  DSN=BP13.KQ00.REGN.APPT,                                         
//             DISP=OLD,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13F222 DD  DSN=BP13.F222.BP13A232,                                          
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* STEP03 - 04      TO DELETE BM06F800 RECORDS.                                
//*---------------------------------------------------------------------        
//* TO SORT RECORDS IN ZONE/NT/FLAT-TYPE/ALLOC-DATE SEQUENCE                    
//*--------------------------------------------------------------------         
//STEP03 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F800,                                                  
//             DISP=(,PASS),                                                    
//             UNIT=(SYSDA,1),                                                  
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(RECFM=FB,LRECL=800,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(559,2,A,546,3,A,544,2,A,291,8,A),FORMAT=CH                      
/*                                                                              
//*---------------------------------------------------------------------        
//* DELETE THE ACCUMULATED FLAT LIST FILE                                       
//*---------------------------------------------------------------------        
//STEP04 EXEC    PGM=BP13C228,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.DELREC,                                            
//             DISP=SHR                                                         
//BM06F800 DD  DSN=&&BM06F800,                                                  
//             DISP=(SHR,PASS)                                                  
//BM6F800  DD  DSN=BM06.F800.ALLOUNIT,                                          
//             DISP=OLD                                                         
//BM6F800D DD  DSN=BM06.F800.ALLOUNIT.SUBMISS,                                  
//             DISP=OLD                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F230.BP13A232                                        
//*--------------------------------------------------------------------         
//STEP05  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F230.BP13A232,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F240.BP13A232                                        
//*--------------------------------------------------------------------         
//STEP06  EXEC   PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F240.BP13A232,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(CYL,(1,1)),                                               
//             RECFM=FB,LRECL=450,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//* DELETE THE INTV FILE                                                        
//*---------------------------------------------------------------------        
//STEP07 EXEC    PGM=BP13C234,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.DELREC,                                            
//             DISP=SHR                                                         
//BP13K060 DD  DSN=BP13.K060.CODETAB,                                           
//             DISP=SHR                                                         
//BP13K230 DD  DSN=BP13.K230.FLATLIST,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13K240 DD  DSN=BP13.K240.HEADFLAT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=23')                                                 
//BP13F230 DD  DSN=BP13.F230.BP13A232,                                          
//             DISP=SHR                                                         
//BP13F240 DD  DSN=BP13.F240.BP13A232,                                          
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*//*--------------------------------------------------------------------      
//*//* STEP08 - STEP10 - TO DELETE BP13F200 RECORDS.                            
//*//*--------------------------------------------------------------------      
//*//*  SORT F200 BY NT-ZONE, FLAT-TYPE AND DTE-BALLOT                          
//*//*--------------------------------------------------------------------      
//*//STEP08 EXEC    SORT,COND=(0,NE)                                            
//*//SORTIN   DD  DSN=BP13.F200.BKAPPMT,                                        
//*//             DISP=SHR                                                      
//*//SORTOUT  DD  DSN=&&P13F200H,                                               
//*//             DISP=(,PASS),                                                 
//*//             UNIT=(SYSDA,1),                                               
//*//             SPACE=(CYL,(10,5),RLSE),                                      
//*//             DCB=(RECFM=FB,LRECL=300,BLKSIZE=23400)                        
//*//SYSIN    DD  *                                                             
//*   SORT FIELDS=(9,5,A,50,6,A),FORMAT=CH                                      
//*/*                                                                           
//*//*--------------------------------------------------------------------      
//*//*  SORT F205 BY NT-ZONE, FLAT-TYPE AND DTE-BALLOT                          
//*//*--------------------------------------------------------------------      
//*//STEP09 EXEC    SORT,COND=(0,NE)                                            
//*//SORTIN   DD  DSN=BP13.F205.DELREC,                                         
//*//             DISP=SHR                                                      
//*//SORTOUT  DD  DSN=&&P13F205G,                                               
//*//             DISP=(,PASS),                                                 
//*//             UNIT=(SYSDA,1),                                               
//*//             SPACE=(TRK,(10,5),RLSE),                                      
//*//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=23440)                         
//*//SYSIN    DD  *                                                             
//*   SORT FIELDS=(1,5,A,24,6,A),FORMAT=CH                                      
//*/*                                                                           
//*//*--------------------------------------------------------------------      
//*//*  TO DELETE F200 RECORDS WITH SAME NT/ZONE, FT AND DTE-BALLOT AS          
//*//*     F205 CONTROL RECORD                                                  
//*//*--------------------------------------------------------------------      
//*//STEP10 EXEC    PGM=BP13C236,COND=(0,NE)                                    
//*//BP13F205 DD  DSN=&&P13F205G,                                               
//*//             DISP=(SHR,DELETE)                                             
//*//BP13F200 DD  DSN=&&P13F200H,                                               
//*//             DISP=(SHR,DELETE)                                             
//*//P13F200O DD  DSN=BP13.F200.BKAPPMT,                                        
//*//             DISP=OLD                                                      
//*//SYSDBG   DD  SYSOUT=*                                                      
//*//SYSDBOUT DD  SYSOUT=*                                                      
//*//SYSUDUMP DD  SYSOUT=*                                                      
//*//SYSABEND DD  SYSOUT=*                                                      
//*//SYSOUT   DD  SYSOUT=*                                                      
//*/*                                                                           
//*---------------------------------------------------------------------        
//* STEP11          - TO BACKUP CONTROL RECORDS.                                
//*---------------------------------------------------------------------        
//*     ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE             *           
//*---------------------------------------------------------------------        
//STEP11 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.DELREC,                                            
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A232                                                                
//*---------------------------------------------------------------------        
