//BP13D102  JOB (BP13P),'BP13D102',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*==================================================================           
//* DAILY JOB DBSS FLAT                                                         
//* 1) EFFECT MORTGAGE INTEREST AMOUNT ON THE DUE-DATE                          
//* 2) UPDATE AMOUNT PAID TO DEVELOPER AF PAYS-EWPC COMPLETED VOUCHER           
//*==================================================================           
//* BP132772 020506 LSB DBSS JOB                                                
//* BP133052 090607 LSB TAKE OUT JV FOR CC06                                    
//* BP133314 170607 LSB TAKE OUT JVP FOR CC06                                   
//* BP133480 261208 JB8 NEW PGM BP13CCA5                                        
//* BP133545 230209 LSB TAKE IN SYS-CODE=33 (SCD3) SMS LOAN ACCNT               
//* BP133398 180509 JB8 EXPAND KD10 LENGTH FR 450 TO 1400                       
//* BP133638 300609 LSB DELETE REPORT BP13LC05                                  
//* BP133638 300609 LSB JVP WRITE TO BP13K130                                   
//* BP133662 120809 JB8 TO CATER FOR SUB-TRANSFER                               
//* BP133612 160909 JB8 OUTPUT NEW REPORT IN BP13CC06                           
//* BP133682 280909 JB8 UPDATE BP13KD00 DIRECTLY IN BP13CC02,REMOVE FD00        
//* BP134154 180411 LSB GET IBG-NO, IBG-DATE IN BP13D112, NO NEED TO            
//*                     WAIT FOR AG07D636 JOB FOR AG07F640                      
//*                     ONLY WAIT FOR AG07D620 FOR AG07F630                     
//* BP134067 110511 LSB ADD STEP11A,11B, SORT COL 46                            
//* BP134483 070512 LSB SHIFT CD48 FROM BP13D111 TO BP13D102                    
//* BP135171 100214 RJE TO CATER FOR DB2 UPGRADE                                
//* BP135530 141114 LSB TO PASS LAST-PP TO SMS BP13FD38                         
//*-----------------------------------------------------------------            
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*-----------------------------------------------------------------            
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.KD00.DBSMAST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.KD38.PPTRANS,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY                           (MA&B TEAM)                        
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1A CP-1',END;                                    
1$DJDE$ JDE=BP13S,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT02 : 2 COPIES                         (MA&B TEAM)                        
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS2A CP-2',END;                                    
1$DJDE$ JDE=BP13S,JDL=BP13,COPIES=2,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* LOAN LETTER  (MA&B)                                                         
//*-----------------------------------------------------------------            
//PRT03    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1B CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13D1,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* LOAN LETTER  - DISBURSEMENT USING CASH (MA&B)                               
//*-----------------------------------------------------------------            
//PRT04    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1C CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13D6,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1C                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*=================================================================            
//*  BACKUP BP13KD38 FILE                                                       
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.KD38.PPTRANS,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.FD38.PPTRANS.DAILY(+1),DISP=(NEW,CATLG),                 
//            SPACE=(CYL,(8,3)),                                                
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)                   
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* INCLUDE AMT-LOAN-NEW > ZEROS                                                
//*-----------------------------------------------------------------            
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.KD38.PPTRANS,DISP=SHR                                   
//SORTOUT  DD  DSN=&&FD38LOAN,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=400,BLKSIZE=4000)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,13,A),FORMAT=CH                                               
   INCLUDE COND=(9,3,CH,EQ,C'DUE',AND,49,9,CH,GT,C'000000000')                  
//*-----------------------------------------------------------------            
//* WHEN SYSTEM DATE = DUE-DATE, EFFECT NEW LOAN, NEW-LOAN-INTEREST             
//* COMPUTE NEW INSTAMNET, INSTAL-EFF-DATE                                      
//*-----------------------------------------------------------------            
//STEP03   EXEC  PGM=BP13CC02,COND=(0,NE)                                       
//BP13FD38 DD  DSN=&&FD38LOAN,DISP=(OLD,DELETE)                                 
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD35 DD  DSN=BP13.KD35.APPSCHDL,DISP=SHR                                  
//BP13KD65 DD  DSN=BP13.KD65.PDATE,DISP=SHR                                     
//AB03K050 DD  DSN=AB03.K050.INTTABLE,DISP=SHR                                  
//BP13KD38 DD  DSN=BP13.KD38.PPTRANS,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13KD99 DD  DSN=BP13.KD99.DBSMAST.LOG,DISP=SHR,                              
//             AMP=('BUFND=4','BUFNI=8')                                        
//P13FD38A DD  DSN=BP13.FD38.PPTRANS.DUEDTE,DISP=OLD                            
//BP13F125 DD  DSN=BP13.F125.PPDUE,DISP=MOD                                     
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT DUE CASES SHOW NEW LOAN/INSTEREST, O/S, REVISED INSTALMENT            
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13CC20,COND=(0,NE)                                        
//BP13FD38 DD DSN=BP13.FD38.PPTRANS.DUEDTE,DISP=SHR                             
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13LC20 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* ACCUM DUE-DATE FILE                                                         
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.FD38.PPTRANS.DUEDTE,DISP=SHR                             
//OUTPUT1  DD DSN=BP13.FD38.PPTRANS.DUEDTE.ACCUM,DISP=MOD                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     REPRO IFILE(INPUT1) OFILE(OUTPUT1)                                         
//*-----------------------------------------------------------------            
//* INCLUDE PAYMENT TO DEVELOPER ON PP FROM VOUCHER SYSTEM                      
//* AG07.F630.SOC = BACKUP IN BP13D100                                          
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//*SORTIN   DD DSN=AG07.F630.SOC,DISP=SHR                                       
//SORTIN   DD DSN=BP13.F102.VOUCHER,DISP=SHR                                    
//SORTOUT  DD DSN=&&AG07F630,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
    SORT FIELDS=(35,11,A),FORMAT=CH                                             
    INCLUDE COND=(20,4,CH,EQ,C'SCD1',OR,                                        
                  20,4,CH,EQ,C'SCD2',OR,                                        
                  20,4,CH,EQ,C'SCD3')                                           
//*                                                                             
//*---------------------------------------------------------------------        
//* DROP DUPLICATE VOUCHER-NO                                                   
//* SORT VOUCHER RECORD BY BATCH-NO/VR-NO                                       
//*---------------------------------------------------------------------        
//STEP07   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&AG07F630,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F630VOUR,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(27,19,A,1,8,A),FORMAT=CH                                         
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* SORT VOUCHER RECORD BY BATCH-NO/VR-NO WITH IBG DATA                         
//*-----------------------------------------------------------------            
//* SORT VOUCHER OIC FILE BY VOUCHER NO                                         
//*-----------------------------------------------------------------            
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13FD10,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=1400,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=(24,11,A),FORMAT=CH                                               
  INCLUDE COND=((1,3,CH,EQ,C'DEV',OR,1,3,CH,EQ,C'OPT',OR,                       
                 1,3,CH,EQ,C'SAL'),AND,                                         
               (24,3,CH,EQ,C'MAB'))                                             
//*-----------------------------------------------------------------            
//* SORT BY VR-NO, DROP DUPLICATE VOUCHER-NO                                    
//*-----------------------------------------------------------------            
//STEP11A  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&F630VOUR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F630TEMP,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(35,11,A,46,2,A),FORMAT=CH                                       
   INCLUDE COND=(27,1,CH,EQ,C'B')                                               
//*-----------------------------------------------------------------            
//* SORT BY VR-NO, DROP DUPLICATE VOUCHER-NO                                    
//*-----------------------------------------------------------------            
//STEP11B  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&F630TEMP,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F630DEVP,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(35,11,A),FORMAT=CH                                              
   SUM FIELDS=NONE                                                              
//*-----------------------------------------------------------------            
//* UPDATE PAYMENT TO DEVELOPER WHEN CHEQUE/IBG IS READY                        
//*-----------------------------------------------------------------            
//STEP12   EXEC PGM=BP13CC06,COND=(0,NE)                                        
//P13FD10A DD DSN=&&BP13FD10,DISP=(OLD,DELETE)                                  
//AG07F630 DD DSN=&&F630DEVP,DISP=(OLD,PASS)                                    
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD10 DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F125 DD DSN=BP13.F125.PAYDEVLP,DISP=SHR                                   
//P13FD10B DD DSN=BP13.FD10.VOUCHOIC.PROCESS,DISP=OLD                           
//BP13LC06 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13LC06B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* ACCUM PAYEMENT TO DEVELOPER TO DBSS MONTH FILE FOR BP13D104                 
//*-----------------------------------------------------------------            
//STEP18   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.F125.PAYDEVLP,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F125.PAYDEVLP.ACCUM,DISP=MOD                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
     REPRO IFILE(INPUT1) OFILE(OUTPUT1)                                         
//*-----------------------------------------------------------------            
//* OMIT PP =1                                                                  
//*-----------------------------------------------------------------            
//STEP19   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.FD38.PPTRANS.DUEDTE,DISP=SHR                             
//SORTOUT  DD  DSN=&&FD38LETT,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=400,BLKSIZE=4000)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   OMIT COND=(12,2,CH,EQ,C'01')                                                 
//*-----------------------------------------------------------------            
//* PRINT LOAN DISBURSEMENT LETTERS                                             
//* P13PC50A - DISB SUBSEQUENT LOAN                                             
//* P13PC50B - 1ST LOAN DISB USING CASH                                         
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13FD38 DD  DSN=&&FD38LETT,DISP=(OLD,PASS)                                   
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//         AMP=('BUFND=8','BUFNI=4')                                            
//P13PC50A DD  SYSOUT=W,OUTPUT=(*.PRT03.FORMID),DEST=IOMW                       
//P13PC50B DD  SYSOUT=W,OUTPUT=(*.PRT04.FORMID),DEST=IOMW                       
//BP13LC50 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CC50) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
     END                                                                        
//*-----------------------------------------------------------------            
//* SORT JV REC BY VOUCHER NO                                                   
//*-----------------------------------------------------------------            
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR                                   
//SORTOUT  DD DSN=&&FD10JV,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=1400,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
  SORT FIELDS=(24,11,A,4,8,A),FORMAT=CH                                         
  INCLUDE COND=(1,3,CH,EQ,C'JV ',AND,24,3,CH,EQ,C'MAB')                         
//*-----------------------------------------------------------------            
//* SORT BY VR-NO, DROP DUPLICATE VOUCHER-NO                                    
//*-----------------------------------------------------------------            
//STEP21A  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&F630VOUR,DISP=(OLD,PASS)                                    
//         DD DSN=BP13.AG07.F630.KIVJV,DISP=SHR                                 
//SORTOUT  DD DSN=&&F630JV,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(35,11,A,1,8,A),FORMAT=CH                                        
   INCLUDE COND=(27,1,CH,EQ,C'J')                                               
   SUM FIELDS=NONE                                                              
//*-----------------------------------------------------------------            
//* IF SUB-TRANSFER CASES , CHECK KD00-DTE-EFF-TRANSFER                         
//*-----------------------------------------------------------------            
//STEP21B  EXEC PGM=BP13CCA5,COND=(0,NE)                                        
//AG07F630 DD DSN=&&F630JV,DISP=(OLD,PASS)                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//AG7F630A DD DSN=&&F630JV2,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=27950,LRECL=130,RECFM=FB)                            
//AG7F630B DD DSN=BP13.AG07.F630.KIVJV,DISP=OLD                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* UPDATE JOURNAL ADJUSTMENT WHEN JV PROCESSED BY PAYS                         
//*-----------------------------------------------------------------            
//STEP22   EXEC PGM=BP13CC83,COND=(0,NE)                                        
//P13FD10A DD DSN=&&FD10JV,DISP=(OLD,PASS)                                      
//AG07F630 DD DSN=&&F630JV2,DISP=(OLD,PASS)                                     
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13KD10 DD DSN=BP13.KD10.VOUCHOIC,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F125 DD DSN=BP13.F125.DBSSJV,DISP=OLD                                     
//P13FD10B DD DSN=BP13.FD10.VOUCHOIC.JV,DISP=OLD                                
//BP13LC83 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* OMIT TRANS-CODE = JVP                                                       
//*-----------------------------------------------------------------            
//STEP22A  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.F125.DBSSJV,DISP=SHR                                     
//SORTOUT  DD DSN=&&F125JVP,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=0,LRECL=150,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   OMIT COND=(99,3,CH,EQ,C'JVP')                                                
//*---------------------------------------------------------------------        
//* UPDATE DAILY PAYMENT TO FINANCIAL TRANSACTION HIST                          
//* FOR ENQUIRY FIN HISTORY ON LOAN INFOR (OPTION 27)                           
//*---------------------------------------------------------------------        
//STEP23   EXEC PGM=BP13CC07,COND=(0,NE)                                        
//BP13F125 DD DSN=&&F125JVP,DISP=(OLD,PASS)                                     
//BP13KD63 DD DSN=BP13.KD63.TXHIST,DISP=SHR                                     
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* ACCUMULATE DAILY PAYMENT TRANS TO MTHLY PAYMENT TRANS             *         
//* NO GL POSTING, BYPASS BP13D103, BP13D104                          *         
//*-------------------------------------------------------------------*         
//STEP24   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F125.DBSSJV,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-----------------------------------------------------------------            
//* INCLUDE TRANS-CODE = JVP                                                    
//*-----------------------------------------------------------------            
//STEP25   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.F125.DBSSJV,DISP=SHR                                     
//SORTOUT  DD DSN=&&F125HIST,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=0,LRECL=150,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(99,3,CH,EQ,C'JVP')                                             
//*-----------------------------------------------------------------            
//* INCLUDE TRANS-CODE = JVP                                                    
//*-----------------------------------------------------------------            
//STEP26   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&F125HIST,DISP=(OLD,PASS)                                    
//         DD DSN=BP13.F125.PAYDEVLP,DISP=SHR                                   
//SORTOUT  DD DSN=&&F125K130,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(8,5),RLSE),                                
//            DCB=(BLKSIZE=0,LRECL=150,RECFM=FB)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//*  WRITE FINANCIAL TRANS FOR DAY TO TRANS LOG FILE                            
//*-----------------------------------------------------------------            
//STEP27   EXEC PGM=BP13C107,COND=(0,NE)                                        
//BP13F125 DD DSN=&&F125K130,DISP=(OLD,PASS)                                    
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT OUT BUY 1ST CASES (TRANS CODE = 'U2')                                  
//*-----------------------------------------------------------------            
//STEP28   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K310.TRANS,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13FD55,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(9,2,CH,EQ,C'U2')                                               
//*-----------------------------------------------------------------            
//*- REPORT FOR 2ND CON LOAN BUY 1ST CASES                                      
//*-----------------------------------------------------------------            
//STEP29   EXEC  PGM=BP13CD73,COND=(0,NE)                                       
//BP13F310 DD  DSN=&&BP13FD55,DISP=(OLD,PASS)                                   
//BP13KD55 DD  DSN=BP13.KD55.LOF.BFSL,DISP=SHR                                  
//SY08K010 DD  DSN=SY08.K010.USERID,DISP=SHR                                    
//BP13LD73 DD  SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT BY REGN , PP SCHDULE >= 09 (NORMAL SCHEME)                             
//*                PP SCHDULE >= 04 (DEFER PAYMENT)                             
//* LAST-TAG = A FOR PP=09, PP=03                                               
//* LAST-TAG = Y FOR PP=10, PP=04 (LAST RECORD WITH LOAN FOR SMS SYSTEM)        
//*---------------------------------------------------------------------        
//STEP30   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.KD38.PPTRANS,DISP=SHR                                    
//SORTOUT  DD DSN=&&FD38DUE,DISP=(,PASS),                                       
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0),                               
//            SPACE=(CYL,(10,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,13,A),FORMAT=CH                                                
  INCLUDE COND=(9,3,CH,EQ,C'DUE',AND,                                           
                24,8,CH,NE,C'        ')                                         
//*---------------------------------------------------------------------        
//* FOR NOT DUE CASES, REVISED INSTAL NOT YET EFFECTIVE                         
//* PASS NEW REVISE INSTALMENT TO SMS                                           
//*---------------------------------------------------------------------        
//STEP31    EXEC PGM=BP13CD48,COND=(0,NE)                                       
//BP13FD38  DD DSN=&&FD38DUE,DISP=(OLD,PASS)                                    
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD00  DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KD03  DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13KD35  DD DSN=BP13.KD35.APPSCHDL,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13FD38A  DD DSN=BP13.FD38.ADDLOAN,DISP=MOD                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT OUT PPDUE FILE                                                         
//*---------------------------------------------------------------------        
//STEP32   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.KD30.PPDUEDTE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13FD30,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                              
//            SPACE=(CYL,(20,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  OMIT COND=(1,8,CH,EQ,C'        ')                                             
//*-------------------------------------------------------------------*         
//*  OUTPUT LAST-PP TO SMS WITH LOAN AND NO LOAN                      *         
//*-------------------------------------------------------------------*         
//STEP33   EXEC PGM=BP13C29A,COND=(0,NE)                                        
//SY02F001  DD DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13FD30 DD DSN=&&BP13FD30,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K893 DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13FD38 DD DSN=BP13.FD38.LASTPP,DISP=MOD                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  BACKUP BP13FD38 FILE                                                       
//*-----------------------------------------------------------------            
//STEP34   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FD38.LASTPP,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.FD38.LASTPP.BKUP,DISP=MOD                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
