//BP13D539 JOB (BP13P),'BP13D539',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* JCL MODELLED AFTER BP13A562                                                 
//* OBJECTIVE : ADD WIA/B/C, 3R PHASE 2 AND OBF CASES TO SOC MASTER             
//*             ADD RECORD TO BP13K595 WITH STATUS = 'V'                        
//*             DELETE RECORDS FROM BP13K730 AND BP13K825.                      
//*             JOB TO BE RUN DAILY                                             
//*                                                                             
//* CHG REF  DATE     BY   DESCRIPTION                                          
//* -------- -------- ---  -----------                                          
//* BP133017 20070428 CKK  NEW JCL TO UPLOAD PHASE2 CASES TO K800               
//* BP133056 20070520 CKK  ADD BP13CB08                                         
//* BP133568 20090305 IL5  ADD BP13C71Q / REMOVE DELETE DEFINE BP13K595         
//* BP133527 20090331 YCH2 INCLUDE UPDATE OF RESALE LEVY 'LN' OR 'LNS'          
//* BP134024 20100930 ZDD1 INCLUDE BP13K813 TO BP13C528                         
//* BP137924 20190716 IL5  UPLOAD OBF RECORDS TO BP13K800                       
//*                        DELETE FROM BP13K730 AND WRITE BP13K595              
//*          20190806 IL5  ADD BP13C145 TO ASSIGN OIC TO OBF APPL               
//* BP138345 20200618 MRR5 ADD NEW STEP FOR BP13C537                            
//* BP138201 20200703 KR13 UPDTED SYSOUT=* FOR BP13C537.                        
//*=================================================================            
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=OLD                                    
//INPUT2   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT3   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//INPUT4   DD DSN=BP13.K840.APPLHIST,DISP=OLD                                   
//INPUT5   DD DSN=BP13.K648.BANKLOAN,DISP=OLD                                   
//INPUT6   DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//INPUT7   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//INPUT8   DD DSN=BP13.K595.BALLOT.LOG,DISP=OLD                                 
//INPUT9   DD DSN=BP13.K828.HISTOCCP,DISP=OLD                                   
//INPUT10  DD DSN=BP13.K290.QUEUE,DISP=OLD                                      
//INPUT11  DD DSN=BP13.KQ00.REGN.APPT,DISP=OLD                                  
//INPUT12  DD DSN=BP13.KQ10.DOC.TBL,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
          VFY FILE(INPUT10)                                                     
          VFY FILE(INPUT11)                                                     
          VFY FILE(INPUT12)                                                     
//*-----------------------------------------------------------------            
//*- BEFORE ADDING NEW PHASE 2 RECORDS TO SOC MASTER,                           
//*- BACKUP SOC MASTER                                                          
//*-----------------------------------------------------------------            
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=13')                                                  
//OUTPUT1  DD DSN=BP13.F800.APPLN.BP13D539,DISP=OLD                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*- BEFORE DELETING PHASE 2 RECORDS FROM REQUEST FILE,                         
//*- BACKUP REQUEST FILE                                                        
//*-----------------------------------------------------------------            
//STEP0B   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=13')                                                  
//OUTPUT1  DD DSN=BP13.F730.MATURERQ.BP13D539,DISP=OLD                          
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*- BEFORE DELETING PHASE 2 RECORDS FROM OCCUPIER FILE,                        
//*- BACKUP OCCUPIER FILE                                                       
//*-----------------------------------------------------------------            
//STEP0C   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=13')                                                  
//OUTPUT1  DD DSN=BP13.F825.REQOCCP.BP13D539,DISP=OLD                           
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP01A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&F730CB9D,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(213,3,CH,EQ,C'FTS',OR,213,3,CH,EQ,C'STS',OR,                      
              376,3,CH,NE,C'OBF')                                               
//*---------------------------------------------------------------------        
//* TO UPDATE CITIZENSHIP HOUSEHOLD                                             
//*---------------------------------------------------------------------        
//STEP01B  EXEC PGM=BP13CB9D,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730CB9D,DISP=(OLD,DELETE)                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13F500 DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT OUT ALL THE CASES WITH BOOKING DATE NOT EQUAL TO SPACES                
//* CASES WITH BOOKING DATE MEANS PHASE 2 CASES                                 
//* ONCE UPLOADED TO SOC MASTER, CASE WILL BE ADDED TO BP13K595 WITH            
//* STATUS = 'V' AND DELETED FROM BP13K730 AND BP13K825.                        
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&BP13F730,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(376,3,CH,EQ,C'OBF')                                            
//*INCLUDE COND=(447,8,CH,NE,C' ',AND,                                          
//*              116,1,CH,NE,C' ')                                              
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP03A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                               
  OUTREC FIELDS=(1,200,200X)                                                    
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP03B  EXEC PGM=BP13C577,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,DELETE)                                  
//BP13F558 DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY NRIC SEQUENCE                                                       
//*---------------------------------------------------------------------        
//STEP03C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&P13F558B,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27600,LRECL=600,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST, SOC-OCCUPIER FILE                             
//* MATCH NRIC IN SMS FILE, IF MATCH UPDATE AS UPGRADER                         
//*---------------------------------------------------------------------        
//STEP03D  EXEC PGM=BP13U706,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&P13F558B,DISP=(OLD,PASS)                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=&&P13F558C,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//BP13F559 DD DUMMY                                                             
//BP13L706 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* MATCH NRIC WITH TRANSFER HISTORY ONLY FOR TRF-APPLN-DTE  AFTER              
//* '19970901' OR FOR DIVORCE CASES TRF-APPLN-DATE > 19970709                   
//* AND TRF-SCH-ACC IS NOT THE SAME AS SMS-SCH-ACC                              
//* AS ONE NRIC TRANSFER, ALL FOUR LESSEE WILL BE FOUND IN TRANSFER             
//* BP13.F558.UPGOCCP CONTAINS TRANSFER HISTORY DATA                            
//*-----------------------------------------------------------------            
//STEP03D  EXEC PGM=BP13C619,COND=(0,NE)                                        
//BB13K510 DD DSN=BB13.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB13K500 DD DSN=BB13.K500.HISTORY,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F558 DD DSN=&&P13F558C,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT IN SCH-ACC-NI ORDER FOR RETRIEVING FLAT TYPE FROM PBF                  
//*---------------------------------------------------------------------        
//STEP03E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(101,11,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* FLAT TYPE  IS NOT AVAILABLE IN SMS                                          
//* BASED ON THE SCHEME ACCOUNT FR SMS EXTRACT FLAT TYPE FROM PBF               
//*---------------------------------------------------------------------        
//STEP03F  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F558 DD DSN=&&F558SORT,DISP=(OLD,PASS)                                    
//BP13OUT  DD DSN=&&F558PBF,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C742) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT BP13F558 IN NRIC ORDER, IF ONE NRIC WITH MULTIPLE SMS REC          
//* PROGRAM WILL SELECT THE BIGGER FLAT TYPE                                    
//*---------------------------------------------------------------------        
//STEP03G  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558PBF,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F558SMSF,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SELECT THE LEAST PRIORITY IF FOUND TO HAVE MULTIPLE SMS RECORDS             
//* SELECT BIGGER FLAT TYPE, DIRENT PURCHASE OVER OPEN MARKET                   
//*---------------------------------------------------------------------        
//STEP03H  EXEC PGM=BP13C734,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558SMSF,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558FLAT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT BY NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP03I  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558FLAT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558RESL,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                            
//* MATCH NRIC IN RESALE FILE, IF MATCH UPDATE AS UPGRADER                      
//*---------------------------------------------------------------------        
//STEP03J  EXEC PGM=BP13U702,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&F558RESL,DISP=(OLD,PASS)                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//BP13L702 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REQUEST OCCUPIER BY NRIC                                               
//*---------------------------------------------------------------------        
//STEP04A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558NRIC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(9,9,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* SORT DEBARMENT FILE BY PRIMARY KEY                                          
//*---------------------------------------------------------------------        
//STEP04B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&BP04K010,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(1000,150),RLSE),                       
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,44,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//* MATCH SOC OCCUPIER REC WITH DEBARMENT REC FD IN                             
//*---------------------------------------------------------------------        
//STEP04C  EXEC PGM=BP13C690,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558NRIC,DISP=(OLD,PASS)                                    
//P04K010  DD DSN=&&BP04K010,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//P13F558B DD DUMMY                                                             
//P13F558C DD DUMMY                                                             
//P13F558D DD DUMMY                                                             
//P13F558E DD DUMMY                                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY REGN NO                                                             
//*-----------------------------------------------------------------            
//STEP04D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558RDB,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
//*=====================================================================        
//* RDB INFO                                                                    
//*=====================================================================        
//*---------------------------------------------------------------------        
//* SPLIT F558 FILE FROM THE OUTPUT OF DETERMINE THE HOUSEHOLD TYPE             
//* IF - HHTYPE='G' OR '3' OR                                                   
//*      (HHTYPE='H' AND FILE-STATUS-SMS OR FILE-STATUS-RSL = 'OM')             
//*          OUTPUT TO BP13F716                                                 
//* ELSE                                                                        
//*      OUTPUT TO BP13F716 TO CHECK RDB                                        
//*---------------------------------------------------------------------        
//* 1)  P13F716A - TO FURTHER CHECK WITH RDB                                    
//* 2)  BP13F716 - INFO ALREADY FOUND IN SMS & RESALE                           
//*---------------------------------------------------------------------        
//STEP04E  EXEC PGM=BP13C788,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558RDB,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=&&P13F716A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT IN NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP04F  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F716A,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP04G  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                                   
//P13F716A DD DSN=&&F716Q748,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                                    
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                        
//*---------------------------------------------------------------------        
//STEP04H  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716Q748,DISP=(OLD,PASS)                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=&&F716C754,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT IN REGN NO SEQUENCE                                                
//*---------------------------------------------------------------------        
//STEP04I  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//         DD DSN=&&F716C754,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//*  TO DETERMINE SMS FT/STATUS, RSL FT/STATUS, RDB FT/STATUS                   
//*---------------------------------------------------------------------        
//STEP04J   EXEC PGM=BP13C519,COND=(0,NE)                                       
//BP13F716  DD DSN=&&F716REGN,DISP=(OLD,PASS)                                   
//BP13F520  DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//P13F520A  DD DSN=&&F520C519,DISP=(NEW,PASS),                                  
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP04K  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520C519,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//*  TO DETERMINE LOAN TAG & PREMIUM CODE                                       
//*---------------------------------------------------------------------        
//STEP04L   EXEC PGM=BP13C520,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520SORT,DISP=(OLD,PASS)                                   
//BP13F558  DD DSN=&&F558RDB,DISP=(OLD,PASS)                                    
//BR10K010  DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13F520A  DD DSN=&&BP13F520,DISP=(NEW,PASS),                                  
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//             UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                              
//BP13L520  DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT F520 IN REGN NO ORDER                                                  
//* OUTREC FT=4 FOR UPLOAD TO SOC MASTER                                        
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F520A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* TO ADD RECORDS TO SOC MASTER AND SOC OCCUPIER FILE                          
//* TO PASS RECORDS TO CFS FOR PRE-ELIGIBILITY CHECK                            
//*---------------------------------------------------------------------        
//STEP06    EXEC PGM=BP13C528,COND=(0,NE)                                       
//BP13F520  DD DSN=&&P13F520A,DISP=(OLD,PASS)                                   
//BP13K530  DD DSN=BP13.K530.ISSUENO,DISP=SHR                                   
//BP13K825  DD DSN=BP13.K825.REQOCCP,DISP=SHR                                   
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K840  DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13F310  DD DUMMY                                                            
//BP13F800  DD DSN=BP13.F800.APPLN.BP13D539.OBF,DISP=OLD                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* CREATE OBM RECORDS IN K290, KQ00, KQ10                                      
//*--------------------------------------------------------------------         
//STEP06A  EXEC PGM=BP13C537,COND=(0,NE)                                        
//BP13F800 DD DSN=BP13.F800.APPLN.BP13D539.OBF,DISP=SHR                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K290 DD DSN=BP13.K290.QUEUE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KQ00 DD DSN=BP13.KQ00.REGN.APPT,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KQ10 DD DSN=BP13.KQ10.DOC.TBL,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* ASSIGN OIC FOR OBF CASES NOT ASSIGNED                                       
//*-----------------------------------------------------------------            
//STEP06B  EXEC PGM=BP13C145,COND=(0,NE)                                        
//BP13F800 DD DSN=BP13.F800.APPLN.BP13D539.OBF,DISP=SHR                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                                 
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR                           
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR                           
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR                           
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR                           
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                             
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                             
//P13L145A DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BALLOT FILE BY REG-NO ORDER                                            
//*---------------------------------------------------------------------        
//STEP07A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F500,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//*  MATCH BALLOT FILE WITH REQUEST FILE FOR LOADING TO HIST FILE               
//*  FOR MATCHED CASES, OUTPUT THE REC TO HISTORY FILE BP13F595                 
//*  FOR UNMATCHED CASES, OUTPUT THE REC BACK TO REQUEST FILE                   
//*---------------------------------------------------------------------        
//STEP07B  EXEC PGM=BP13C546,COND=(0,NE)                                        
//BP13F520 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,DELETE)                                  
//BP13F595 DD DSN=BP13.F595.BALLOT.LOG.BP13D539,DISP=SHR                        
//BP13F510 DD DSN=BP13.F730.MATURERQ.P2.UNMTCH,DISP=OLD                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  SORT NEW RECORDS TO BE WRITTEN INTO BP13K595                               
//*---------------------------------------------------------------------        
//STEP08A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F595.BALLOT.LOG.BP13D539,DISP=SHR                        
//SORTOUT  DD DSN=&&F595HIST,DISP=(,PASS),                                      
//            UNIT=(SYSDA,2),SPACE=(CYL,(320,20),RLSE),                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(476,25,A),FORMAT=CH                                             
//*----------------------------------------------------------------*            
//* TO UPDATE BP13K595                                             *            
//*----------------------------------------------------------------*            
//STEP08B  EXEC PGM=BP13C71Q,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595HIST,DISP=(OLD,DELETE)                                  
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=OLD                                 
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT SOC OCCUPIER FILE INTO SEQUENTIAL FILE                                 
//* IN KEY-FLD ORDER.                                                           
//* SORT ONLY THOSE MATCHED CASES                                               
//*---------------------------------------------------------------------        
//STEP09A  EXEC  PGM=BP13C192,COND=(0,NE)                                       
//BP13F740 DD  DSN=&&BP13F730,DISP=(SHR,PASS)                                   
//BP13K825 DD  DSN=BP13.K825.REQOCCP,DISP=SHR                                   
//BP13F825 DD  DSN=&&F825OUT,DISP=(NEW,PASS),                                   
//             UNIT=(SYSDA,1),                                                  
//             DCB=(BLKSIZE=23400,LRECL=200,RECFM=FB),                          
//             SPACE=(CYL,(50,10),RLSE)                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT SOC OCCUPIER FILE INTO SEQUENTIAL FILE FOR MATURE ESTATE ONLY          
//* KEY-FLD = REF-NO + 2 SPACES/NRIC                                            
//*---------------------------------------------------------------------        
//STEP09B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F825OUT,DISP=(SHR,DELETE)                                   
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=23400,LRECL=200,RECFM=FB),                           
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN   DD *                                                                  
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* DEFINE SOC OCCUP FILE BP13K828 FOR HISTORY REFERENCE IN NEXT QTR            
//* INSERT RECORD/S FROM F825 TO K828                                           
//* IF KEY-FLD ALREADY EXISTS IN K828, DO NOT INSERT (BYPASS)                   
//*---------------------------------------------------------------------        
//STEP09C  EXEC PGM=BP13CB24,COND=(0,NE)                                        
//BP13F825 DD DSN=&&BP13F825,DISP=(OLD,DELETE)                                  
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* TO UPDATE RESALE STATUS = 'LN' OR 'LNS' TO MASTER                           
//* AFTER DETAIL UPDATED TO MASTER                                              
//*---------------------------------------------------------------------        
//STEP09D   EXEC PGM=BP13C71N,COND=(0,NE)                                       
//BP13F520  DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//BP13K825  DD DSN=BP13.K825.REQOCCP,DISP=SHR                                   
//BB24K510  DD DSN=BB24.K510.UINHIST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BB24K500  DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------00040004
//* UNCLUDE ELDERLY-TAG = F, S                                          00041004
//*---------------------------------------------------------------------00042004
//STEP10A  EXEC SORT,COND=(0,NE)                                        00050004
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730ELD,DISP=(NEW,PASS),                            00070004
//            UNIT=SYSDA,                                               00080004
//            DCB=(RECFM=FB,LRECL=500),                                 00090004
//            SPACE=(CYL,(10,5),RLSE)                                   00100004
//SYSIN    DD *                                                         00110004
  SORT FIELDS=(123,8,A),FORMAT=CH                                       00120004
  INCLUDE COND=((210,1,CH,EQ,C'F',OR,210,1,CH,EQ,C'S'),AND,             00130004
                376,3,CH,EQ,C'OBF')                                             
//*---------------------------------------------------------------------00169200
//* UPDATE BP13K800 WITH ELDERLY PREMIUM TAG                            00169300
//*---------------------------------------------------------------------00169500
//STEP10B  EXEC PGM=BP13CZ2J,COND=(0,NE)                                00169604
//BP13F740 DD DSN=&&F730ELD,DISP=(OLD,PASS)                             00169704
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                             00169804
//         AMP=('BUFND=4','BUFNI=8')                                    00169904
//P13LZ2JA DD SYSOUT=*                                                  00211003
//P13LZ2JB DD SYSOUT=*                                                  00220003
//SYSPRINT DD SYSOUT=*                                                  00230000
//SYSDBG   DD SYSOUT=*                                                  00240000
//SYSDBOUT DD SYSOUT=*                                                  00250000
//SYSOUT   DD SYSOUT=*                                                  00260000
//*---------------------------------------------------------------------        
//* DELETE BP13K825 AND BP13K730 RECORDS                                        
//*-------------------------------------------------------------------*         
//STEP10C EXEC PGM=BP13C51C,COND=(0,NE)                                         
//BP13F740 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* END BP13D539                                                                
//*---------------------------------------------------------------------        
