//BP13REVE JOB (BP13P),'BP13K893',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//        NOTIFY=CSD0071,TYPRUN=HOLD                                            
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//* CHG-NO  BY    ON     - DESCRIPTION                                          
//*--------------------------------------------                                 
//*BP133740 LSB 04012011 - EXPAND SPACE TO 2000 CYL                             
//**************************************************************                
//* RESTORE APPLN.HISTORY FILE FROM BACKUP FILE                                 
//*---------------------------------------------------------------------------  
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F893.APPLN.HISTORY.YEAR(0),DISP=SHR,                     
//         UNIT=CART,LABEL=(1,SL)                                       00000800
//SORTOUT  DD DSN=&&BP13F893,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=2050,BLKSIZE=0),                              
//            SPACE=(CYL,(1000,30),RLSE)                                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(2027,24,A),FORMAT=CH                                            
   SUM FIELDS=NONE                                                              
//*--------------------------------------------------------------------         
//*  TO DELETE/CREATE SOC MASTER FILE (BP13.K893.APPLN.HISTORY)                 
//*--------------------------------------------------------------------         
//STEP02    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=&&BP13F893,DISP=(OLD,PASS)                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL 'BP13.K893.APPLN.HISTORY' CL PURGE                        00810000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K893.APPLN.HISTORY)         -                  00810000
              CYL(2000 100)                           -                 00830000
              DATACLAS(MULTIVOL)                     -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K893.APPLN.HISTORY.DATA)    -                  00870000
              KEYS(24 2026)                          -                  00880000
              RECSZ(2050 2050)                       -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K893.APPLN.HISTORY.INDEX)   -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K893.APPLN.HISTORY)                              00720000
