//BP13D519 JOB (BP13P),'BP13D519',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//*  THIS JOB IS USE ONLY FOR BUILD-TO-ORDER/ BALLOTING EXERCISE      *         
//*  TO UPDATE INTERNET APPLICATION FILE                              *         
//*                                                                   *         
//*===================================================================*         
//* CHG REF  BY  ON       DESCRIPTION                                 *         
//* -------- --- -------- -----------                                 *         
//* BP132254 CLT 111202   BTO                                         *         
//* BP132368 CLT 070803   AUG 2003 BTO                                *         
//* BP132454 SK  101203   ADD REPORT BP13L830 FOR BP13C830            *         
//* BP132583 CKK 280804   ADD REPORT P13L830B FOR BP13C830            *         
//* BP132599 CLT 220904   UPDATE DDNAME FOR BP13C816                  *         
//* BP132628 CLT 121204   ADD PRT5 FOR SERS                           *         
//* BP132674 CKK 050405   ADD 2 NEW LETTERS                           *         
//* BP132728 CLT 280705   AUG 2005 BTO                                *         
//* BP132886 CKK 280706   ADD NEW STEP FOR UPDATING BP13KB00          *         
//* BP132886 CKK 280706   REMOVE PRINTING OF APPLN AND LOAN LETTER    *         
//* BP132953 CLT 081106   REMOVE BP13K825 FROM BP13C830               *         
//* BP133050 CKK 240407   INCLUDE NEW DD FOR BP13C186                 *         
//* BP133155 CLT 211107   DELETE BP13C880                             *         
//* BP133354 LSB 160608   ADD CH01, UPDATE NEW/REPEAT(COFN/CHG PART)  *         
//* BP133601 CCC 170609   REMOVE REDUNDANT PRINTING STEPS             *         
//* BP134164 JB8 040311   TO REMOVE STEP13 (BACKUP FB00)              *         
//* BP134428 CCC 100112   ADD STEPS TO UPDATE                         *         
//*                       - ONLINE CANCELLATION CASES                 *         
//*                       - BOOKED FLAT APPLICANTS - BP13K76E         *         
//* BP134530 CCC 280512   ADD STEPS TO UPDATE                         *         
//*                       - BOOKED FLAT CANCELLATION CASES (FR KH25)  *         
//* BP134711 CCC 201112   REMOVE STEPS TO UPDATE                      *         
//*                       - BOOKED FLAT CANCELLATION CASES (FR KH25)  *         
//* BP13     CCC 201307   ENHANCED STEPS FOR ONLINE CANCELLATION CASES*         
//*                       - INCLUDE K757-NUM-CANCEL='Y' CASES         *         
//* BP135196 CCC 201401   ENHANCED STEPS FOR ONLINE CANCELLATION CASES*         
//*                       - PROCESS USING BP13CF25                    *         
//* BP135373 SMR 100614   INCLUDE BP13K590 WHEN RUNNING BP13CF25      *         
//* BP135497 LSB 190516   IAMEND UPDATE K575 DTE-SOC-UPDATE, IAMEND-TAG         
//* BP137920 IL5 190913   UPDATE SORT CONDITION IN STEP19 TO TIE WITH           
//*                       CHANGES MADE TO BP13K757 COPYCOB UNDER                
//*                       BP137966                                              
//* BP139280 EAA207112023 EXPAND FROM 3000 TO 4000 IN STEP STEP08     *         
//*===================================================================*         
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K757.BTO,DISP=OLD                                        
//INPUT2   DD DSN=BP13.K752.OTBUIN,DISP=OLD                                     
//INPUT3   DD DSN=BP13.KB00.BEBTO,DISP=OLD                                      
//INPUT4   DD DSN=BP13.K76E.BOOKED.UIN,DISP=OLD                                 
//INPUT5   DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//INPUT6   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//INPUT7   DD DSN=BP13.K590.CANOCCP,DISP=OLD                                    
//INPUT8   DD DSN=BP13.K595.BALLOT.LOG,DISP=OLD                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
//*                                                                             
//*-------------------------------------------------------------------*         
//* UPDATE INTERNET APPLICATION FILE WITH SOC PROCESSED CASES         *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC PGM=BP13C816,COND=(0,NE)                                        
//BP13F757 DD DSN=BP13.F757.BTO.DAILY,DISP=SHR                                  
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* MERGE ALL EXCEPTIONAL REPORT                                                
//*-------------------------------------------------------------------*         
//STEP02  EXEC SORT,CYL=50,COND=(0,NE)                                          
//SORTIN  DD DSN=BP13.F730.DAILY.REPORT.SORT,DISP=SHR                           
//        DD DSN=BP13.F730.DAILY.REPORT.SORT.BTO,DISP=SHR                       
//        DD DSN=BP13.F730.DAILY.REPORT.SORT.RM3,DISP=SHR                       
//        DD DSN=BP13.F730.DAILY.REPORT.SORT.RM4,DISP=SHR                       
//SORTOUT DD DSN=BP13.F730.DAILY.REPORT.OUT,DISP=SHR                            
//SYSIN   DD *                                                                  
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
//*                                                                             
//*-------------------------------------------------------------------*         
//* MERGE BOTH BE AND BTO LETTERS                                               
//*-------------------------------------------------------------------*         
//STEP03  EXEC SORT,CYL=50,COND=(0,NE)                                          
//SORTIN  DD DSN=BP13.F730.FILELESS.LETTER.BE,DISP=SHR                          
//        DD DSN=BP13.F730.FILELESS.LETTER.BTO,DISP=SHR                         
//SORTOUT DD DSN=BP13.F730.FILELESS.LETTER,DISP=SHR                             
//SYSIN   DD *                                                                  
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
//*                                                                             
//*-------------------------------------------------------------------*         
//* MERGE BOTH BE AND BTO LETTERS                                               
//*-------------------------------------------------------------------*         
//STEP04  EXEC SORT,CYL=50,COND=(0,NE)                                          
//SORTIN  DD DSN=BP13.KB00.BEBTO,DISP=SHR                                       
//SORTOUT DD DSN=&&P13FB00C,DISP=(NEW,PASS),                                    
//           UNIT=SYSDA,SPACE=(CYL,(10,5,),RLSE),                               
//           DCB=(RECFM=FB,LRECL=200)                                           
//SYSIN   DD *                                                                  
  SORT FIELDS=(15,8,A),FORMAT=CH                                                
  INCLUDE COND=(68,6,CH,NE,C'      ')                                           
//*-------------------------------------------------------------------*         
//* UPDATE BP13KB00 WITH EXCEPTION REPORT - P13F730A                  *         
//* UPDATE BP13KB00 WITH LETTERS PRINTED - BP13F730                   *         
//* UPDATE BP13KB00 WITH LOCK ID NOT = SPACES - BP13FB00              *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13C186,COND=(0,NE)                                        
//P13F730A DD DSN=BP13.F730.DAILY.REPORT.OUT,DISP=SHR                           
//BP13F730 DD DSN=BP13.F730.FILELESS.LETTER,DISP=SHR                            
//BP13FB00 DD DSN=&&P13FB00C,DISP=(SHR,DELETE)                                  
//BP13KB00 DD DSN=BP13.KB00.BEBTO,DISP=SHR                                      
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* UPDATE NEW/REPEATED(COFN/CHG PARTICULAR) FOR SALES PORTAL                   
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=BP13CH01,COND=(0,NE)                                        
//BP13F757 DD DSN=BP13.F757.BTO.DAILY,DISP=SHR                                  
//BP13KH00 DD DSN=BP13.KH00.HISTOCCP,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13KB00 DD DSN=BP13.KB00.BEBTO,DISP=SHR,                                     
//            AMP=('BUFND=23')                                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13K757                                                   *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K757.BTO,DISP=SHR                                00512000
//OUTPUT1  DD DSN=BP13.F757.BTO,DISP=SHR                                        
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1) REPLACE                              
//*                                                                             
//*-------------------------------------------------------------------*         
//*  REPRO BP13F757 FOR BACKUP                                        *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F757.BTO.DAILY,DISP=SHR                                  
//OUTPUT1  DD DSN=BP13.F757.BTO.DAILY.BKUP(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(50,25)),                                              
//            DCB=(BP13.GDG,BLKSIZE=24000,LRECL=4000,RECFM=FB)                  
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13K751                                                   *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K751.OTBDATE,DISP=SHR                            00512000
//OUTPUT1  DD DSN=BP13.F751.BTODATE,DISP=SHR                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1) REPLACE                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13K752                                                   *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K752.OTBUIN,DISP=SHR                             00512000
//OUTPUT1  DD DSN=BP13.F752.BTOUIN,DISP=SHR                                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1) REPLACE                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13K753                                                   *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K753.OTBREF,DISP=SHR                             00512000
//OUTPUT1  DD DSN=BP13.F753.BTOREF,DISP=SHR                                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1) REPLACE                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13K759                                                   *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K759.BTO,DISP=SHR                                00512000
//OUTPUT1  DD DSN=BP13.F759.BTO,DISP=SHR                                        
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1) REPLACE                              
//*                                                                             
//*--------------------------------------------------------------------         
//STEP13  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K800.APPLN,DISP=SHR                                       
//SORTOUT DD DSN=BP13.F76E.BOOKED.UIN,                                          
//           DISP=OLD                                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,NE,C'    ',AND,                                        
                1,1,CH,NE,C'C',AND,4,1,CH,LT,C'5',AND,                          
                924,3,CH,NE,C'NPL',AND,924,3,CH,NE,C'SER')                      
  OUTREC FIELDS=(88,9,4,8,13X)                                                  
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*  EXTRACT HA2 UIN FOR BOOKED FLAT CASES                                      
//*--------------------------------------------------------------------         
//STEP14  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K800.APPLN,DISP=SHR                                       
//SORTOUT DD DSN=BP13.F76E.BOOKED.UIN,                                          
//           DISP=MOD                                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,NE,C'    ',AND,97,9,CH,NE,C'         ',AND,            
                1,1,CH,NE,C'C',AND,4,1,CH,LT,C'5',AND,                          
                924,3,CH,NE,C'NPL',AND,924,3,CH,NE,C'SER')                      
  OUTREC FIELDS=(97,9,4,8,13X)                                                  
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*  EXTRACT HA3 UIN FOR BOOKED FLAT CASES                                      
//*--------------------------------------------------------------------         
//STEP15  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K800.APPLN,DISP=SHR                                       
//SORTOUT DD DSN=BP13.F76E.BOOKED.UIN,                                          
//           DISP=MOD                                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,NE,C'    ',AND,106,9,CH,NE,C'         ',AND,           
                1,1,CH,NE,C'C',AND,4,1,CH,LT,C'5',AND,                          
                924,3,CH,NE,C'NPL',AND,924,3,CH,NE,C'SER')                      
  OUTREC FIELDS=(106,9,4,8,13X)                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*  EXTRACT HA4 UIN FOR BOOKED FLAT CASES                                      
//*--------------------------------------------------------------------         
//STEP16  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K800.APPLN,DISP=SHR                                       
//SORTOUT DD DSN=BP13.F76E.BOOKED.UIN,                                          
//           DISP=MOD                                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(155,4,CH,NE,C'    ',AND,115,9,CH,NE,C'         ',AND,           
                1,1,CH,NE,C'C',AND,4,1,CH,LT,C'5',AND,                          
                924,3,CH,NE,C'NPL',AND,924,3,CH,NE,C'SER')                      
  OUTREC FIELDS=(115,9,4,8,13X)                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*  EXTRACT UIN FOR BOOKED FLAT CANCELLED CASES (FROM KH25)                    
//*--------------------------------------------------------------------         
//*STEP16A EXEC PGM=SORT,COND=(0,NE)                                            
//*SORTIN  DD DSN=BP13.KH25.REJBOOK,DISP=SHR                                    
//*SORTOUT DD DSN=BP13.F76E.BOOKED.UIN,                                         
//*           DISP=MOD                                                          
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSIN    DD *                                                                
//*  SORT FIELDS=(1,8,A),FORMAT=CH                                              
//*  INCLUDE COND=(1,2,CH,NE,C'  ')                                             
//*  OUTREC FIELDS=(9,9,1,8,13X)                                                
//*  END                                                                        
//*                                                                             
//*--------------------------------------------------------------------         
//*  SORT F76E                                                                  
//*--------------------------------------------------------------------         
//STEP17  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.F76E.BOOKED.UIN,DISP=SHR                                  
//SORTOUT DD DSN=&&BP13F76E,                                                    
//           DISP=(NEW,PASS),                                                   
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(50,50),RLSE),                                          
//           DCB=(RECFM=FB,LRECL=30,BLKSIZE=0)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
/*                                                                              
//*--------------------------------------------------------------------         
//*  TO DELETE/CREATE SOC BOOK FLAT UIN FILE                                    
//*--------------------------------------------------------------------         
//STEP18    EXEC PGM=IDCAMS                                                     
//INPUT1    DD DSN=&&BP13F76E,DISP=(SHR,DELETE)                                 
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
          DEL (BP13.K76E.BOOKED.UIN) CL PURGE                                   
          DEF CLUSTER                                -                          
              (NAME(BP13.K76E.BOOKED.UIN)     -                                 
              CYL(500 50)                               -                       
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              UNIQUE                                 -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K76E.BOOKED.UIN.DATA)       -                          
              KEYS(09 0)                              -                         
              RECSZ(30 30)                         -                            
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K76E.BOOKED.UIN.INDEX)      -                          
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K76E.BOOKED.UIN)                                         
//*--------------------------------------------------------------------         
//* UPDATE ONLINE CANCELLATION CASES                                            
//*--------------------------------------------------------------------         
//STEP19  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K757.BTO,DISP=SHR                                         
//SORTOUT DD DSN=&&CANREGN,                                                     
//*          DISP=OLD                                                           
//           DISP=(NEW,PASS),                                                   
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(5,5),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                 
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(2985,8,CH,GE,C'20130530',AND,2891,1,CH,EQ,C'Y',AND,             
                2918,3,CH,NE,C'NPL',AND,2806,8,CH,NE,C'        ')               
  OUTREC FIELDS=(122X,1,8,370X)                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* DELETE BP13K825 REQUEST AFTER BALLOTING                                     
//*-------------------------------------------------------------------*         
//STEP20 EXEC PGM=BP13CF25,COND=(0,NE)                                          
//BP13F740 DD DSN=&&CANREGN,DISP=(OLD,PASS)                                     
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13K590 DD DSN=BP13.K590.CANOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* UPDATE IAMEND TAG TO 'Y', BLANK OFF DTE-SOC-UPDATE                          
//*-------------------------------------------------------------------*         
//STEP21   EXEC PGM=BP13C75B,COND=(0,NE)                                        
//BP13F757 DD DSN=BP13.F757.IAMEND.DAILY,DISP=SHR                               
//BP13K757 DD DSN=BP13.K757.BTO,DISP=SHR,                                       
//            AMP=('BUFND=23')                                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC WTOG,COND=(0,NE)                                                
   ----> ######################################################                 
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13D519                             
   ---->    PLEASE OPEN BP13K752, BP13K757, BP13K76E, BP13KB00                  
   ----> ######################################################                 
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
