//BP13DR01 JOB (BP13P),'BP13DR01',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         SCHENV=PKZIP,NOTIFY=CSD0071                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//        DD DSN=AV02.LOAD.SUBR,DISP=SHR                                        
//*-------------------------------------------------------------------*         
//* CHG-NO    ON    BY  - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP135678 050615 IL  - CHANGE SERVER NAME FR SGISFTP TO SGNETSTAGE           
//* BP139082 280322 LJL - AUTO TRIGGER OF INCOMING SCRIPT VIA TEXT FILE         
//* BP139082 140422 CCC - CHANGE PARM FROM 30 TO 40 FOR STEP0B                  
//* BP139082 260422 LJL - TO CATER FOR CPF ACKNOWLEDMENT FILE ONLY              
//*-------------------------------------------------------------------*         
//*=================================================================            
//*  ------------------------------------                                       
//* CREATE DUMMY STEP TO CHECK DATA FROM SERVER                                 
//*=================================================================            
//*----------------------------------------------------------------             
//*  CREATE A DUMMY TXT TO CHECK ON DATA FROM SERVER                            
//*----------------------------------------------------------------             
//STEP0A   EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD  /PROD/APPN/DATA/BP13/TO-HDB/CPF                                           
  DIR                                                                           
  ASCII                                                                         
  PUT 'BP13.BLANK.CHAR100'  BP13DR01.TRIGGER.TXT                                
  DIR                                                                           
  QUIT                                                                          
//*----------------------------------------------------------------             
//*  DELAY JOB IN 30 SECONDS (BASE FILE SIZE)                                   
//*----------------------------------------------------------------             
//STEP0B   EXEC PGM=AV02WAIT,COND=(0,NE),PARM='40'                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*=====================================================================        
//*  RECEIVE S&P FILE FROM CPFB                                                 
//*  DELETE ZIP FILE FOR REJECTION FILE                                         
//*=====================================================================        
//S01      EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL (BP13.F106.CPFSNP.RECV1.ZIP)                                           
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*                                                                             
//*=====================================================================        
//* DEFINE ZIP DATASET FOR REJECTION FILE                                       
//*=====================================================================        
//S02      EXEC PGM=IEFBR14,COND=(0,NE)                                         
//OUTPUT   DD DSN=BP13.F106.CPFSNP.RECV1.ZIP,                                   
//         DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                                  
//         SPACE=(1,(200,50),RLSE),AVGREC=M,DSORG=PS,                           
//         RECFM=U,LRECL=0,BLKSIZE=27998                                        
/*                                                                              
//*=====================================================================        
//*  RECEIVE S&P FILE FROM CPFB                                                 
//*  DELETE ZIP FILE FOR ACKNOWLEDGEMENT FILE                                   
//*=====================================================================        
//S03      EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL (BP13.F106.CPFSNP.RECV2.ZIP)                                           
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
//*                                                                             
//*=====================================================================        
//*                                                                             
//* DEFINE ZIP DATASET                                                          
//*                                                                             
//*=====================================================================        
//S04      EXEC PGM=IEFBR14,COND=(0,NE)                                         
//OUTPUT   DD DSN=BP13.F106.CPFSNP.RECV2.ZIP,                                   
//         DISP=(NEW,CATLG),DATACLAS=MULTIVOL,                                  
//         SPACE=(1,(200,50),RLSE),AVGREC=M,DSORG=PS,                           
//         RECFM=U,LRECL=0,BLKSIZE=27998                                        
//*=====================================================================        
//*   GET DATASET FROM FTP SERVER ACKNOWLEDGMENT FILE                           
//*   PROD PATH --> /PROD/APPN/DATA/BP13/FROM-HDB/CPF/MF                        
//*   TEST PATH --> /TEST/APPN/DATA/BP13/FROM-HDB/CPF/MF                        
//*=====================================================================        
//S05      EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD /PROD/APPN/DATA/BP13/TO-HDB/CPF                                            
  BINARY                                                                        
  GET HBLSALEACK.TXT.ZIP 'BP13.F106.CPFSNP.RECV2.ZIP' (REPLACE                  
  QUIT                                                                          
/*                                                                              
//*=====================================================================        
//*   UNZIP FILE ACCEPT  FILE                                                   
//*=====================================================================        
//S06      EXEC PKUNZIP,COND=(0,NE)                                             
-ARCHIVE(BP13.F106.CPFSNP.RECV2.ZIP)                                            
-UNZIPPED_DSN(**,BP13.F106.CPFSNP.RECV.ACK)                                     
-TEXT                                                                           
-OVERWRITE                                                                      
/*                                                                              
//*=====================================================================        
//*   DELETE DATASET FROM FTP SERVER FOR ACKNOWLEDGMENT                         
//*=====================================================================        
//S07      EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD /PROD/APPN/DATA/BP13/TO-HDB/CPF                                            
  DIR                                                                           
  BINARY                                                                        
  MDEL HBLSALEACK.TXT.ZIP                                                       
  DIR                                                                           
  QUIT                                                                          
/*                                                                              
//*=====================================================================        
//*   DELETE ENCRYPTED DATASET FROM FTP SERVER FOR ACKNOWLEDGEMENT              
//*=====================================================================        
//S08      EXEC FTP,PARM='SGNETSTAGE (EXIT',COND=(0,NE)                         
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
  CD /PROD/APPN/DATA/BP13/TO-HDB/CPF                                            
  DIR                                                                           
  BINARY                                                                        
  MDEL HBLSALEACK.TXT.ZIP.P7                                                    
  DIR                                                                           
  QUIT                                                                          
/*                                                                              
//*=================================================================            
