//BP13D223 JOB (BP13P),'BP13D223',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    JOB01423
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*-------------------------------------------------------------------*         
//*- THIS JOB IS SIMILAR TO BP13AY0F                                            
//*- BP13AY0A - GIVE PRIOROTY TO FIRST TIMER (FT) >=4 UNSUCC ATTEMPT            
//*- BP13AY0H - GIVE PRIOROTY TO FIRST TIMER (FT) >=4 UNSUCC ATTEMPT            
//*- BP13AY0F - GIVE PRIOROTY TO FT/2T COMBINATION>=6 UNSUCC ATTEMPT            
//*- BP13AY0J - GIVE PRIOROTY TO FT/2T COMBINATION>=6 UNSUCC ATTEMPT            
//*=================================================================            
//*-CHG-NO   BY   ON    DESCRIPTION                                             
//*------------------------------------                                         
//*-BP134277 LSB 110711 UPDATE HARDLUCK TAG                                     
//*-BP134306 ZDD 050811 ADD FIELDS ON THE OUTREC   - STEP 03                    
//*-BP134598 LSB 130812 ADD K895 TO CY90, UNSUCC ATTEMPT CHG TO 03              
//*-BP134930 LSB 280513 ADD K595 PATH2 TO CY90, DELETE CALL C913                
//*-BP135002 LSB 130813 BYPASS FTS                                              
//*-BP135237 LSB 290214 REER K595.BP13D220 INSTEAD K595.BALLOT.LOG              
//*-BP135635 SMR 130215 DO NOT BYPASS FTS                                       
//*-BP136160 SMR 110316 OUTREC HOUSEHOLD, BALLOT-HH & FT2T TO BP13F007          
//*-------------------------------------------------------------------*         
//* 1) DETERMINE APPLICATION WITH COMBINATION OF FIRST TIMER AND                
//* SECOND TIMER, HUSBAND + SPOUSE OR FS CASES                                  
//* 2) >= 6 UNSUCC ATTEMPTS                                                     
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K730.MATURERQ,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------            
//* SORT CASE BY REGISTRATION NUMBER                                            
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                             
//             DCB=(LRECL=500,RECFM=FB)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(334,6,CH,GE,C'201401',AND,                                      
                211,1,CH,NE,C'1A',AND,                                          
                376,3,CH,EQ,C'BTO')                                             
//*--------------------------------------------------------------------         
//* TAG HARDLUCK APPLICATION AND OUTPUT BP13F500                                
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=BP13CF33,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//BP13K585 DD DSN=BP13.K585.HARDLUCK,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13LF33A DD DSN=BP13.LF33A.HARDLUCK,DISP=OLD                                  
//P13LF33B DD DSN=BP13.LF33B.HARDLUCK,DISP=OLD                                  
//P13F500A DD DSN=BP13.F500.HARDLUCK,DISP=OLD                                   
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*---------------------------------------------------------------------        
//* OUTREC NRIC FOR HARDLUCK CASES                                              
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F007,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(LRECL=200,RECFM=FB)                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  OUTREC FIELDS=(41,9,123,8,82,9,376,3,187,3,211,2,213,3,                       
                 248,3,334,6,225,1,116,1,461,1,475,1,150X)                      
  INCLUDE COND=(376,3,CH,EQ,C'BTO',AND,                                         
                466,1,CH,NE,C' ')                                               
//*-----------------------------------------------------------------    00170000
//* PRINT PROFILE OF HARDLUCK CASES                                     00180000
//*-----------------------------------------------------------------    00210000
//STEP04   EXEC PGM=BP13CY90,COND=(0,NE)                                        
//BP13F007 DD  DSN=&&BP13F007,DISP=(OLD,PASS)                           00230001
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                              00240000
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                          00250000
//             AMP=('BUFND=4','BUFNI=8')                                00260000
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                            00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K585 DD  DSN=BP13.K585.HARDLUCK,DISP=SHR,                         00270000
//             AMP=('BUFND=4','BUFNI=8')                                00280000
//BP13K828 DD  DSN=BP13.K828.HISTOCCP,DISP=SHR,                         00330002
//             AMP=('BUFND=4','BUFNI=8')                                00340000
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00350002
//             AMP=('BUFND=4','BUFNI=8')                                00360002
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                    00350002
//             AMP=('BUFND=4','BUFNI=8')                                00360002
//BP13K593 DD  DSN=BP13.K593.UNSUCCNT,DISP=SHR,                         00370008
//             AMP=('BUFND=4','BUFNI=8')                                00380006
//BP13K595 DD  DSN=BP13.K595.BP13D220,DISP=SHR,                                 
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K591 DD  DSN=BP13.K595.BP13D220.PATH1,DISP=SHR,                           
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K110 DD  DSN=BM06.K110.FLATINV,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13F008 DD  DSN=BP13.F008.D223.OUTPUT,DISP=OLD                       00450005
//SUMMARY   DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSABOUT  DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSTSPRT  DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSTSIN   DD *                                                                
