//BP13A956 JOB (BP13P),'BP13A956',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//        DD DSN=BR12.BATCH.LOADCOB,DISP=SHR                                    
//*--------------------------------------------------------------------         
//* QUARTERLY REPORT FOR 10-YEAR CHECK                                          
//*--------------------------------------------------------------------         
//* JOB RUN : BP13A730 - CHECK SMS, SUBLET, RESALE HISTORY                      
//*         : BP13A736 - CHECK RELATIONSHIP  TO RE-UPDATE 10-YR TAG             
//*                    - CHECK TRANSFER HISTORY                                 
//* WEEKLY    REPORT FOR 10-YEAR CHECK                                          
//* JOB RUN : BP13A535 - CHECK SMS, SUBLET, RESALE HISTORY                      
//*         : BP13A737 - CHECK RELATIONSHIP  TO RE-UPDATE 10-YR TAG             
//*                    - CHECK TRANSFER HISTORY                                 
//* EXEC CONDO COMPUTE FOR 5-YEAR CHECK                                         
//* JOB RUN : BP13A955 - CHECK SMS, SUBLET, RESALE HISTORY                      
//*         : BP13A956 - CHECK RELATIONSHIP  TO RE-UPDATE 10-YR TAG             
//*                      CHECK TRANSFER HISTORY                                 
//*********************************************************************         
//* 1) TO RE-UPDATE 5YR=YES FOR FURTHER DETERMINATION OF PARENT/CHILD           
//*    HUSBAND/WIFE/SINGLE CHILD CASES                                          
//* 2) FOR TYEP 8 CASES, TAKE LONGER MTH-RESIDE, IF ONE > 60, THE OTHER         
//*    < 60, UPDATE AS 10-YR=YES, ONE <60, THE OTHER > 60, 10-YR=NO             
//*********************************************************************         
//* CHG-NO    ON    BY  - DESCRIPTION                                           
//*----------------------------------                                           
//* BP130373 970912 LSB -NEW JOB                                                
//* BP130377 971015 LSB - C639/C640 CHG F800 TO F500                            
//* BP130445 980207 SSS - EXPAND F558 RECL FROM 150 TO 600                      
//* BP130458 980303 LSB - CHECK TRANSFER HISTORY                                
//*                     - ADD BP13.F713.PIGEON.ECOPEN                           
//* BP130455 980325 LSB - DELETE C639,C640, MOVE TO BP13A955                    
//* BP130542 980821 LSB - CHECK TRF-HIST AFTER 19970901                         
//* BP130630 990703 YCH - READ RDB2 AND CHGE F715 TO F716                       
//* BP130715 990728 LSB - CHG Q748 TO Q747, SORT FOR C160                       
//* BP130715 990913 LSB - ADD C036(SUBLET), C795(HSE-GRANT)                     
//* BP130652 991011 SRA - EXPAND F500, F520 RECL FROM 300 TO 500                
//* BP130789 000216 AKT - INCL BP13K060,BP13K510,BP13K820 IN STEP22             
//* BP130825 000606 SRA -ADD DTE-REGN IN THE OUTREC FIELD.                      
//* BP132589 040914 SK  - REMOVED BP13C036                                      
//*                       REPLACE AB03K300 BY AB03K030 IN C062 & C090           
//* BP132603 050307 JF4 - CHG 10 YR CHECK TO 5 YR                               
//* BP135171 140210 RJE - TO CATER FOR DB2 UPGRADE                              
//* BP135370 100614 YCH2  ADD BR12 LOAD DUE TO BR12C902 MODULE NOT FOUND        
//******************************************************************            
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                             
//*  PRT01 : 1 COPY                      EC TEAM                                
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALEC                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* SORT BY REGN/NRIC ORDER                                                     
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                                
//SORTOUT  DD DSN=&&BP13F558,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
/*                                                                              
//*-----------------------------------------------------------------            
//* OUTREC REGNO,NRIC FOR CASES FOUND IN TRANSFER HISTORY TO GET RDB            
//* MOVE-IN DATE                                                                
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F558,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716TRF,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(150,90),RLSE),                             
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
   OUTREC FIELDS=(1,8,9,9,10X,63,8,315X)                                        
   OMIT COND=(203,8,CH,LT,C'19970901')                                          
//*-----------------------------------------------------------------            
//* SORT BY NRIC ORDER                                                          
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716TRF,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&P13F716,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(150,90),RLSE),                             
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&P13F716,DISP=(OLD,PASS)                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13F716A DD DSN=BP13.F716.RDB5YR.TRF.CONDO,DISP=OLD                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q747) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY REGN/NRIC ORDER                                                     
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.RDB5YR.TRF.CONDO,DISP=SHR                           
//SORTOUT  DD DSN=&&BP13F716,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=350),                              
//            SPACE=(CYL,(90,30),RLSE)                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A,51,9,A,115,8,D,123,8,A),FORMAT=CH                        
//*-----------------------------------------------------------------            
//* WRITE RDB-MOVE-IN-DATE FORM BP13F716 TO BP13F558                            
//* COMPUTE TRF-MTH-RESIDE BASED ON RDB-MOVE-IN-DATE                            
//*-----------------------------------------------------------------            
//STEP06   EXEC  PGM=BP13C160,COND=(0,NE)                                       
//BP13F713 DD DSN=BP13.F713.PIGEON.ECOPEN,DISP=SHR                              
//BP13F716 DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=&&BP13F558,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=BP13.F558.UPGOCCP.ECS,DISP=OLD                                
//BP13L160 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY REGN-NO/NRIC DATA WITH MOVE-IN-DATE AND TRF-MTHB-RESIDE             
//* INCLUDE TRF-MTH-RESIDE < 060                                                
//*-----------------------------------------------------------------            
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558LESS,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(100,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(200,3,CH,GT,C'000',AND,200,3,CH,LT,C'060')                     
//*-----------------------------------------------------------------            
//* SORT BY REGN-NO/NRIC DATA WITH MOVE-IN-DATE AND TRF-MTHB-RESIDE             
//*-----------------------------------------------------------------            
//STEP08   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558FULL,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
/*                                                                              
//*-----------------------------------------------------------------            
//* MATCH TO EXTRACT FULL BP13F558 RECORDS                                      
//* FOR TRANSFER-MTH-RESIDE < 60 MTH                                            
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=BP13C637,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558FULL,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558LESS,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=&&F558TRF,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(100,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT REQUEST FILE IN REGNO ORDER FOR RESALE MATCHING REC                    
//*-----------------------------------------------------------------            
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                               
//SORTOUT  DD DSN=&&F500TRF,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(160,20),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* UPDATE 5-YR/10YR-OCCUPN TAG TO SOC REQUEST AS (N) TO 10-YR-OCCUPN           
//* FOR TRANSFER CASES                                                          
//*-----------------------------------------------------------------            
//STEP11   EXEC PGM=BP13U739,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F713 DD DSN=BP13.F713.PIGEON.ECOPEN,DISP=SHR                              
//BP13F500 DD DSN=&&F500TRF,DISP=(OLD,PASS)                                     
//BP13F558 DD DSN=&&F558TRF,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=BP13.F500.SEQUENCE.ECS,DISP=OLD                               
//BP13L739 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                            
//* MATCH NRIC IN MAMS FILE, IF MATCH UPDATE WITH HDB-REF,SALES-TYPE,           
//* ALLO-SCH,DTE-EFF,MTH-RES,SUBLET,FLAT-TYPE OF MAMS,HHTYPE & 10YR.            
//*---------------------------------------------------------------------        
//STEP11A  EXEC  PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K              
//BP13F713 DD DSN=BP13.F713.PIGEON.ECOPEN,DISP=SHR                              
//BP13F558 DD DSN=&&F558FULL,DISP=(OLD,PASS)                                    
//BC03K010 DD DSN=BC03.K010.CAHIST,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BC03K020 DD DSN=BC03.K020.UINACC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFNI=8','BUFND=4')                                            
//P13F558A DD DSN=&&F558S11A,DISP=(,PASS),                                      
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(100,20),RLSE)                              
//P13F558B DD DSN=&&F558MAM,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(20,20),RLSE)                               
//BP13L090 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C090) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* BASED ON THE REGN,UPD WITH MTH-RESIDE,HHTYPE & 10YR-OCCUP OVERALL.          
//*---------------------------------------------------------------------        
//STEP11B  EXEC  PGM=BP13C078,COND=(0,NE)                                       
//BP13F520 DD  DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                              
//BP13F558 DD  DSN=&&F558MAM,DISP=(OLD,PASS)                                    
//P13F520A DD  DSN=&&F520S11B,DISP=(,PASS),                                     
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(100,20),RLSE)                              
//BP13L078 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                            
//* MATCH NRIC IN SLS FILE, IF MATCH UPDATE WITH HDB-REF,SALES-TYPE,            
//* NUM_SRNDR,DTE-EFF,MTH-RES,SUBLET,FLAT-TYPE OF SLS,HHTYPE & 10YR.            
//*---------------------------------------------------------------------        
//STEP11C  EXEC  PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K              
//BP13F713 DD DSN=BP13.F713.PIGEON.ECOPEN,DISP=SHR                              
//BP13F558 DD DSN=&&F558S11A,DISP=(OLD,PASS)                                    
//BR05K100 DD DSN=BR05.K100.SLSSOC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFNI=8','BUFND=4')                                            
//P13F558A DD DSN=BP13.F558.UPGOCCP.ECS,DISP=OLD                                
//P13F558B DD DSN=&&F558SLS,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(20,20),RLSE)                               
//BP13L062 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C062) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* BASED ON THE REGN,UPD WITH MTH-RESIDE,HHTYPE & 10YR-OCCUP OVERALL.          
//*---------------------------------------------------------------------        
//STEP11D  EXEC  PGM=BP13C064,COND=(0,NE)                                       
//BP13F520 DD  DSN=&&F520S11B,DISP=(OLD,PASS)                                   
//BP13F558 DD  DSN=&&F558SLS,DISP=(OLD,PASS)                                    
//P13F520A DD  DSN=BP13.F500.SEQUENCE.ECS,DISP=OLD                              
//BP13L064 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT ELIGIBLE FOR 10-YR CASE                                            
//*-----------------------------------------------------------------            
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                               
//SORTOUT  DD DSN=&&F500NOTE,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(160,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(175,1,CH,EQ,C'N')                                              
//*-----------------------------------------------------------------            
//* PRINT REPORT OF REQUEST NOT  ELIGIBLE FOR 5YR CHECK                         
//* BY NT/FT/REG-NO                                                             
//*-----------------------------------------------------------------            
//STEP13   EXEC  SAS,COND=(0,NE)                                                
//BP13K520 DD DSN=&&F500NOTE,DISP=(OLD,PASS)                                    
//BP18K310 DD DSN=BP18.K310.OCCUPIER,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L900 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S900),DISP=SHR                             
//*-----------------------------------------------------------------            
//*  REPRO SEQUENCE FILE TO BALLOT FILE                                         
//*-----------------------------------------------------------------            
//STEP14 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT2    DD DSN=BP13.F500.SEQUENCE.ECS,DISP=SHR                              
//OUTPUT2   DD DSN=BP13.F500.SEQUENCE.CONDO,DISP=OLD                            
//INPUT3    DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                               
//OUTPUT3   DD DSN=BP13.F558.UPGOCCP.CONDO,DISP=OLD                             
//*                                                                             
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*-----------------------------------------------------------------            
//* SORT OUT IN REG-NO/NRIC SEQUENCE                                            
//*-----------------------------------------------------------------            
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F716.RDB5YR.CONDO,DISP=SHR                               
//         DD DSN=BP13.F716.RDB5YR.TRF.CONDO,DISP=SHR                           
//SORTOUT  DD DSN=&&F716STAY,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A,9,9,A),FORMAT=CH                                          
//*-----------------------------------------------------------------            
//* PRT MONTHLY MASTER FILE REPORT BY ROOM-TYPE ON TEMPORARY FILE               
//*-----------------------------------------------------------------            
//STEP16   EXEC PGM=BP13C685,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F500NOTE,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                                
//BP13F716 DD DSN=&&F716STAY,DISP=(OLD,PASS)                                    
//BP13L685 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT SUMMARY REPORT ON INELIGIBLE FOR 10-YR BY ZN/FT/AL-SCH/CAT            
//*-----------------------------------------------------------------            
//STEP17   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13F520 DD DSN=&&F500NOTE,DISP=(OLD,PASS)                                    
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//FT42F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S525),DISP=SHR                             
//*-----------------------------------------------------------------            
//* SORT OUT DIVORCED CASES                                                     
//*-----------------------------------------------------------------            
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.ECS,DISP=SHR                                
//SORTOUT  DD DSN=&&F558DIVR,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(128,1,CH,EQ,C'4',AND,203,8,CH,NE,C'        ')                  
//*-----------------------------------------------------------------            
//* PRINT REPORT ON DIVORCED APPLICANTS FOUND TRANSFERRED FLAT                  
//*-----------------------------------------------------------------            
//STEP19   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                    
//BP13F558 DD DSN=&&F558DIVR,DISP=(OLD,PASS)                                    
//BP13L716 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S716),DISP=SHR                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BY REGN/NRIC ORDER FOR HOUSING GRANT CASES                             
//*-----------------------------------------------------------------            
//STEP21   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.F558.UPGOCCP.CONDO,DISP=SHR                              
//SORTOUT  DD DSN=&&F558HSE,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(100,15),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(61,2,CH,EQ,C'6 ',OR,61,2,CH,EQ,C'6J',OR,                        
                61,2,CH,EQ,C'8C',OR,61,2,CH,EQ,C'8D',OR,                        
               112,2,CH,EQ,C'GS',OR,112,2,CH,EQ,C'FG',OR,                       
               112,2,CH,EQ,C'PG')                                               
/*                                                                              
//*-----------------------------------------------------------------            
//* PRINT DETAIL REPORT TO SHOW CASES FOUND WITH SMS, RSL WITH HSE-GRANT        
//*-----------------------------------------------------------------            
//STEP22   EXEC  PGM=BP13C954,COND=(0,NE)                                       
//P13F558A DD DSN=&&F558HSE,DISP=(OLD,PASS)                                     
//BP13F558 DD DSN=BP13.F558.UPGOCCP.CONDO,DISP=SHR                              
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP18K310 DD DSN=BP18.K310.OCCUPIER,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K510 DD DSN=BP13.K510.QRBALLOT,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L954 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* TO CLEAR FILES                                                              
//*-----------------------------------------------------------------            
//STEP23   EXEC  PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DSN=NULLFILE,                                                     
//            DCB=BP18.BP13.F500.ECS                                            
//SYSUT2   DD DSN=BP18.BP13.F500.ECS,                                           
//            DISP=OLD                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//* TO CLEAR FILES                                                              
//*-----------------------------------------------------------------            
//STEP24   EXEC    PGM=IEBGENER,COND=(0,NE)                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DSN=NULLFILE,                                                     
//            DCB=BP18.BP13.F558.ECS                                            
//SYSUT2   DD DSN=BP18.BP13.F558.ECS,                                           
//            DISP=OLD                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  END JOB BP13A956                                                           
//*-----------------------------------------------------------------            
