//BP13AY08 JOB (BP13P),'BP13AY08',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//* REPORT ON SUMMARY OF NON-SELECTION BY DTE-BALLOT/MODE/FT                    
//*---------------------------------------------------------------------        
//* CHG REQ   DATE     BY   DETAIL                                              
//* ========  ======== ==== ============================================        
//* BP133614  23/06/09 JB8  NEW JCL                                             
//* BP133954  11/08/10 JB8  SAME JOB FOR BP13KH12                               
//* BP135171  10/02/14 RJE1 TO CATER FOR DB2 UPGRADE                            
//* BP135251  12/05/14 LSB1 TO CHANGE BP13K816 TO BP13K813                      
//* BP137460  12/09/18 IL5  INCREASE SPACE ALLOCATED TO TEMP DATASETS           
//*===================================================================          
//*  PRT01 : 1 COPY                      MPU UNIT                               
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAMPPA1A                                   
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*---------------------------------------------------------------------        
//*- SORT BY REGN                                                               
//*- INCLUDE UIN NOT = SPACES                                                   
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FH10,DISP=(NEW,PASS),                                   
//        UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=2000),                             
//        SPACE=(CYL,(250,200),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(104,8,A),FORMAT=CH                                               
  INCLUDE COND=(1,9,CH,NE,C'         ')                                         
//*---------------------------------------------------------------------        
//* FOR NON-SELECTION > 0 , GET LASTEST APPT DATE (LIMIT = Y) TO                
//* POSITION OCCUR 01 FOR SAS REPORT BP13S910                                   
//* FOR NON-SELECTION = 0 , GET LASTEST APPT DATE (LIMIT = N,STATUS=WF)         
//*---------------------------------------------------------------------        
//STEP02    EXEC PGM=BP13CY55,COND=(0,NE)                                       
//BP13FH10  DD DSN=&&BP13FH10,DISP=(OLD,PASS)                                   
//P13FH10A  DD DSN=&&FH10SORT,DISP=(,PASS),                                     
//          UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=2000),                           
//          SPACE=(CYL,(250,200),RLSE)                                          
//BP13F555 DD DSN=&&BP13F555,DISP=(,PASS),                                      
//          UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=600),                            
//          SPACE=(CYL,(250,200),RLSE)                                          
//BP13F716 DD DSN=&&BP13F716,DISP=(,PASS),                                      
//          UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=350),                            
//          SPACE=(CYL,(250,200),RLSE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* GENERATE NON-SELECTION REPORT, GLOBAL FIGURE BY DTE-BALLOT                  
//*-------------------------------------------------------------------*         
//STEP03   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD UNIT=(SYSDA,5),SPACE=(CYL,(60,20))                                
//BP13FH10 DD DSN=&&FH10SORT,DISP=(OLD,PASS)                                    
//P13FH10A DD DSN=BP13.FH10.REPORT,DISP=OLD                                     
//BP13L910 DD DSN=BP13.L910.BP13L910,DISP=SHR                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S910),DISP=SHR                             
//*-----------------------------------------------------------------            
//* SORT BP13F555 BY UIN (WHICH IS EQUAL TO NRIC1(1))                           
//* OMIT FIRST REGN = SPACES                                                    
//*-----------------------------------------------------------------            
//STEP04   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F555,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F555NRIC,DISP=(NEW,PASS),                                  
//             UNIT=(SYSDA,5),SPACE=(CYL,(50,50),RLSE),                         
//             DCB=(RECFM=FB,LRECL=600)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,9,A),FORMAT=CH                                                
   INCLUDE COND=(28,8,CH,NE,C'        ')                                        
//*-----------------------------------------------------------------            
//* SORT BY KEY FIELD                                                           
//*-----------------------------------------------------------------            
//STEP05   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F820,DISP=(NEW,PASS),                                  
//             UNIT=(SYSDA,5),SPACE=(CYL,(250,80),RLSE),                        
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* SORT BY REGN + NRIC                                                         
//*-----------------------------------------------------------------            
//STEP06   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F820,DISP=(MOD,PASS),                                  
//             UNIT=(SYSDA,5),SPACE=(CYL,(2000,100),RLSE),                      
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(418,17,A),FORMAT=CH                                             
   OUTREC FIELDS=(1,400)                                                        
//*-----------------------------------------------------------------            
//* SORT BY REGN + NRIC , OMIT DUPLICATE REC                                    
//*-----------------------------------------------------------------            
//STEP07   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&BP13F820,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F820KEY,DISP=(,PASS),                                      
//             UNIT=(SYSDA,5),                                                  
//             SPACE=(CYL,(2000,100),RLSE),                                     
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*-----------------------------------------------------------------            
//* SORT BY NRIC                                                                
//*-----------------------------------------------------------------            
//STEP07A  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&F820KEY,DISP=(OLD,PASS)                                    
//SORTOUT  DD  DSN=&&F820NRIC,DISP=(,PASS),                                     
//             UNIT=(SYSDA,5),                                                  
//             SPACE=(CYL,(2000,100),RLSE),                                     
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* GET DETAIL OF LATEST APPLN AND NEW APPLNS                                   
//*-----------------------------------------------------------------            
//STEP08   EXEC  PGM=BP13CY57,COND=(0,NE)                                       
//BP13F820 DD  DSN=&&F820NRIC,DISP=(OLD,PASS)                                   
//BP13F555 DD  DSN=&&F555NRIC,DISP=(OLD,PASS)                                   
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K893 DD  DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//P13F555A DD  DSN=&&F555CY57,DISP=(,PASS),                                     
//             UNIT=(SYSDA,5),SPACE=(CYL,(50,50),RLSE),                         
//             DCB=(RECFM=FB,LRECL=600)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT OUT IN NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716NRIC,DISP=(,PASS),                                      
//            UNIT=(SYSDA,5),SPACE=(CYL,(60,15),RLSE),                          
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716NRIC,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=&&F716Q748,DISP=(,PASS),                                      
//            UNIT=(SYSDA,5),SPACE=(CYL,(60,15),RLSE),                          
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
//*-----------------------------------------------------------------            
//* SORT BY LATEST REGN                                                         
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F555CY57,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F555REGN,DISP=(,PASS),                                      
//            UNIT=(SYSDA,5),SPACE=(CYL,(50,50),RLSE),                          
//            DCB=(RECFM=FB,LRECL=600)                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(28,8,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* SORT BY REGN                                                                
//*-----------------------------------------------------------------            
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716Q748,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716REGN,DISP=(,PASS),                                      
//            UNIT=(SYSDA,5),SPACE=(CYL,(60,15),RLSE),                          
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* MATCH F555 & F716 TO GET CURRENT FLAT STATUS FOR LATEST APPLN               
//*-----------------------------------------------------------------            
//STEP13   EXEC  PGM=BP13CY58,COND=(0,NE)                                       
//BP13F716 DD  DSN=&&F716REGN,DISP=(OLD,PASS)                                   
//BP13F555 DD  DSN=&&F555REGN,DISP=(OLD,PASS)                                   
//P13F555A DD  DSN=&&F555CY58,DISP=(,PASS),                                     
//            UNIT=(SYSDA,5),SPACE=(CYL,(50,50),RLSE),                          
//            DCB=(RECFM=FB,LRECL=600)                                          
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* READ BB24K020 TO CHECK RESALE CASES                                         
//*   IF FOUND , GET CASE NUMBER & ALLOC-SCH-BYR                                
//*--------------------------------------------------------------------         
//STEP14 EXEC PGM=BP13CY59,COND=(0,NE)                                          
//BP13F555 DD DSN=&&F555CY58,DISP=(OLD,PASS)                                    
//BB24K010 DD DSN=BB24.K010.MASTER,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K020 DD DSN=BB24.K020.OCCUPIER,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K021 DD DSN=BB24.K020.OCCUPIER.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F555A DD DSN=BP13.F555.NONSELTN,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* FORMAT REPORT HEADER FOR MPU                                                
//*--------------------------------------------------------------------         
//STEP15 EXEC PGM=BP13CY61,COND=(0,NE)                                          
//BP13F555 DD DSN=BP13.F555.NONSELTN,DISP=SHR                                   
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13L555 DD DSN=BP13.L555.NONSELTN.REPORT,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*- SORT BY NRIC                                                               
//*---------------------------------------------------------------------        
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&FH10SORT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FH10NRIC,DISP=(NEW,PASS),                                   
//        UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=2000),                             
//        SPACE=(CYL,(250,200),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* COMPUTE NON-SELECTION BY STATUS LF/BF/WF BY BTO/BE                          
//*---------------------------------------------------------------------        
//STEP17   EXEC PGM=BP13CH21,COND=(0,NE)                                        
//BP13FH10 DD DSN=&&FH10NRIC,DISP=(OLD,PASS)                                    
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KH12 DD DSN=BP13.KH12.NOTBKCNT.HISTORY,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13FH10A DD DSN=BP13.FH10.LFWF,DISP=OLD                                       
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* REPORT NON-SELECTION BY STATUS LF/BF/WF BY BTO/BE                           
//*---------------------------------------------------------------------        
//STEP18   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD UNIT=(SYSDA,5),SPACE=(CYL,(60,20))                                
//BP13FH10 DD DSN=BP13.FH10.LFWF,DISP=SHR                                       
//BP13L824 DD DSN=BP13.L824.BP13L824,DISP=SHR                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S824),DISP=SHR                             
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FH10.LFWF,DISP=SHR                                       
//SORTOUT  DD DSN=&&FH10LFWF,DISP=(,PASS),                                      
//        UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=2000),                             
//        SPACE=(CYL,(4,20),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
  OMIT COND=(76,2,CH,EQ,C'01')                                                  
//*---------------------------------------------------------------------        
//* PRINT DETAIL REPORT ON BP13FH10                                             
//*---------------------------------------------------------------------        
//STEP24   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=(SYSDA,5),SPACE=(CYL,(60,20))                                
//BP13FH10 DD DSN=&&FH10LFWF,DISP=(OLD,PASS)                                    
//BP13L830 DD DSN=BP13.L830.BP13L830,DISP=SHR                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S830),DISP=SHR                             
//*---------------------------------------------------------------------        
//*- RUN FOR HISTORY FILE BP13KH12                                              
//*---------------------------------------------------------------------        
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KH12.NOTBKCNT.HISTORY,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FH12,DISP=(NEW,PASS),                                   
//        UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=2000),                             
//        SPACE=(CYL,(250,200),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(104,8,A),FORMAT=CH                                               
  INCLUDE COND=(1,9,CH,NE,C'         ')                                         
//*---------------------------------------------------------------------        
//* FOR NON-SELECTION > 0 , GET LASTEST APPT DATE (LIMIT = Y) TO                
//* POSITION OCCUR 01 FOR SAS REPORT BP13S910                                   
//* FOR NON-SELECTION = 0 , GET LASTEST APPT DATE (LIMIT = N,STATUS=WF)         
//*---------------------------------------------------------------------        
//STEP02    EXEC PGM=BP13CY55,COND=(0,NE)                                       
//BP13FH10  DD DSN=&&BP13FH12,DISP=(OLD,PASS)                                   
//P13FH10A  DD DSN=&&FH12SORT,DISP=(,PASS),                                     
//          UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=2000),                           
//          SPACE=(CYL,(250,200),RLSE)                                          
//BP13F555 DD DSN=&&F555CY55,DISP=(,PASS),                                      
//          UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=600),                            
//          SPACE=(CYL,(250,200),RLSE)                                          
//BP13F716 DD DSN=&&F716CY55,DISP=(,PASS),                                      
//          UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=350),                            
//          SPACE=(CYL,(250,200),RLSE)                                          
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//* GENERATE NON-SELECTION REPORT, GLOBAL FIGURE BY DTE-BALLOT                  
//*-------------------------------------------------------------------*         
//STEP03   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD UNIT=(SYSDA,5),SPACE=(CYL,(60,20))                                
//BP13FH10 DD DSN=&&FH12SORT,DISP=(OLD,PASS)                                    
//P13FH10A DD DSN=BP13.FH10.REPORT.HIST,DISP=OLD                                
//BP13L910 DD DSN=BP13.L910.BP13L910.HIST,DISP=SHR                              
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S910),DISP=SHR                             
//*-----------------------------------------------------------------            
//* SORT BP13F555 BY UIN (WHICH IS EQUAL TO NRIC1(1))                           
//* OMIT FIRST REGN = SPACES                                                    
//*-----------------------------------------------------------------            
//STEP04   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&F555CY55,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F555FH12,DISP=(NEW,PASS),                                  
//             UNIT=(SYSDA,5),SPACE=(CYL,(50,50),RLSE),                         
//             DCB=(RECFM=FB,LRECL=600)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,9,A),FORMAT=CH                                                
   INCLUDE COND=(28,8,CH,NE,C'        ')                                        
//*-----------------------------------------------------------------            
//* SORT BY KEY FIELD                                                           
//*-----------------------------------------------------------------            
//STEP05   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&F820FH12,DISP=(NEW,PASS),                                  
//             UNIT=(SYSDA,5),SPACE=(CYL,(2000,100),RLSE),                      
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* SORT BY REGN + NRIC                                                         
//*-----------------------------------------------------------------            
//STEP06   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&F820FH12,DISP=(MOD,PASS),                                  
//             UNIT=(SYSDA,5),SPACE=(CYL,(2000,100),RLSE),                      
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(418,17,A),FORMAT=CH                                             
   OUTREC FIELDS=(1,400)                                                        
//*-----------------------------------------------------------------            
//* SORT BY REGN + NRIC , OMIT DUPLICATE REC                                    
//*-----------------------------------------------------------------            
//STEP07   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&F820FH12,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F820HIST,DISP=(,PASS),                                     
//             UNIT=(SYSDA,5),                                                  
//             SPACE=(CYL,(2000,100),RLSE),                                     
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*-----------------------------------------------------------------            
//* SORT BY NRIC                                                                
//*-----------------------------------------------------------------            
//STEP07A  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&F820HIST,DISP=(OLD,PASS)                                   
//SORTOUT  DD  DSN=&&F820UIN,DISP=(,PASS),                                      
//             UNIT=(SYSDA,5),                                                  
//             SPACE=(CYL,(2000,100),RLSE),                                     
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* GET DETAIL OF LATEST APPLN AND NEW APPLNS                                   
//*-----------------------------------------------------------------            
//STEP08   EXEC  PGM=BP13CY57,COND=(0,NE)                                       
//BP13F820 DD  DSN=&&F820UIN,DISP=(OLD,PASS)                                    
//BP13F555 DD  DSN=&&F555FH12,DISP=(OLD,PASS)                                   
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K893 DD  DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//P13F555A DD  DSN=&&CY57HIST,DISP=(,PASS),                                     
//             UNIT=(SYSDA,5),SPACE=(CYL,(50,50),RLSE),                         
//             DCB=(RECFM=FB,LRECL=600)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT OUT IN NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716CY55,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716UIN,DISP=(,PASS),                                       
//            UNIT=(SYSDA,5),SPACE=(CYL,(60,15),RLSE),                          
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716UIN,DISP=(OLD,PASS)                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=&&Q748HIST,DISP=(,PASS),                                      
//            UNIT=(SYSDA,5),SPACE=(CYL,(60,15),RLSE),                          
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
//*-----------------------------------------------------------------            
//* SORT BY LATEST REGN                                                         
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&CY57HIST,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F555APPL,DISP=(,PASS),                                      
//            UNIT=(SYSDA,5),SPACE=(CYL,(50,50),RLSE),                          
//            DCB=(RECFM=FB,LRECL=600)                                          
//SYSIN    DD  *                                                                
    SORT FIELDS=(28,8,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* SORT BY REGN                                                                
//*-----------------------------------------------------------------            
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&Q748HIST,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716APPL,DISP=(,PASS),                                      
//            UNIT=(SYSDA,5),SPACE=(CYL,(60,15),RLSE),                          
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* MATCH F555 & F716 TO GET CURRENT FLAT STATUS FOR LATEST APPLN               
//*-----------------------------------------------------------------            
//STEP13   EXEC  PGM=BP13CY58,COND=(0,NE)                                       
//BP13F716 DD  DSN=&&F716APPL,DISP=(OLD,PASS)                                   
//BP13F555 DD  DSN=&&F555APPL,DISP=(OLD,PASS)                                   
//P13F555A DD  DSN=&&CY58HIST,DISP=(,PASS),                                     
//            UNIT=(SYSDA,5),SPACE=(CYL,(50,50),RLSE),                          
//            DCB=(RECFM=FB,LRECL=600)                                          
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* READ BB24K020 TO CHECK RESALE CASES                                         
//*   IF FOUND , GET CASE NUMBER & ALLOC-SCH-BYR                                
//*--------------------------------------------------------------------         
//STEP14 EXEC PGM=BP13CY59,COND=(0,NE)                                          
//BP13F555 DD DSN=&&CY58HIST,DISP=(OLD,PASS)                                    
//BB24K010 DD DSN=BB24.K010.MASTER,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K020 DD DSN=BB24.K020.OCCUPIER,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K021 DD DSN=BB24.K020.OCCUPIER.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F555A DD DSN=BP13.F555.NONSELTN.HIST,DISP=OLD                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* FORMAT REPORT HEADER FOR MPU                                                
//*--------------------------------------------------------------------         
//STEP15 EXEC PGM=BP13CY61,COND=(0,NE)                                          
//BP13F555 DD DSN=BP13.F555.NONSELTN.HIST,DISP=SHR                              
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13L555 DD DSN=BP13.L555.NONSELTN.REPORT.HIST,DISP=OLD                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*- SORT BY NRIC                                                               
//*---------------------------------------------------------------------        
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&FH12SORT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&FH12UIN,DISP=(NEW,PASS),                                    
//        UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=2000),                             
//        SPACE=(CYL,(250,200),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* COMPUTE NON-SELECTION BY STATUS LF/BF/WF BY BTO/BE                          
//*---------------------------------------------------------------------        
//STEP17   EXEC PGM=BP13CH21,COND=(0,NE)                                        
//BP13FH10 DD DSN=&&FH12UIN,DISP=(OLD,PASS)                                     
//BP13KH10 DD DSN=BP13.KH10.NOTBKCNT,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KH12 DD DSN=BP13.KH12.NOTBKCNT.HISTORY,DISP=SHR,                          
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13FH10A DD DSN=BP13.FH12.LFWF,DISP=OLD                                       
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* REPORT NON-SELECTION BY STATUS LF/BF/WF BY BTO/BE                           
//*---------------------------------------------------------------------        
//STEP18   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD UNIT=(SYSDA,5),SPACE=(CYL,(60,20))                                
//BP13FH10 DD DSN=BP13.FH12.LFWF,DISP=SHR                                       
//BP13L824 DD DSN=BP13.L824.BP13L824.HIST,DISP=SHR                              
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S824),DISP=SHR                             
//*---------------------------------------------------------------------        
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FH12.LFWF,DISP=SHR                                       
//SORTOUT  DD DSN=&&FH10LFWF,DISP=(,PASS),                                      
//        UNIT=(SYSDA,5),DCB=(RECFM=FB,LRECL=2000),                             
//        SPACE=(CYL,(60,20),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,9,A),FORMAT=CH                                                 
  OMIT COND=(76,2,CH,EQ,C'01')                                                  
//*---------------------------------------------------------------------        
//* PRINT DETAIL REPORT ON BP13FH10                                             
//*---------------------------------------------------------------------        
//STEP24   EXEC SAS,COND=(0,NE)                                                 
//WORK     DD UNIT=(SYSDA,5),SPACE=(CYL,(60,20))                                
//BP13FH10 DD DSN=&&FH10LFWF,DISP=(OLD,PASS)                                    
//BP13L830 DD DSN=BP13.L830.BP13L830.HIST,DISP=SHR                              
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S830),DISP=SHR                             
