//BP13D113  JOB (BP13P),'BP13D113',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* DAILY JOB TO CHECK TRANSACTION DR/CR OF CD/SOC/FEE TALLY                    
//*=================================================================            
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&F137SA,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(99,3,A,91,8,A),FORMAT=CH                                      
     INCLUDE COND=(1,2,CH,EQ,C'29',AND,99,2,CH,EQ,C'CD')                        
     OUTREC FIELDS=(1,98,C'CD*',102,49)                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT SA TRANS BY PAYMENT TYPE,                                              
//* INCLUDE OTHERS TRANS-CODE                                                   
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.MTHTRAN,DISP=SHR                                    
//SORTOUT  DD DSN=&&F137OTH,DISP=(,PASS,DELETE),                                
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(99,3,A,91,8,A),FORMAT=CH                                      
     OMIT COND=(1,2,CH,EQ,C'34',OR,                                             
                1,2,CH,EQ,C'40',OR,                                             
                1,2,CH,EQ,C'60',OR,                                             
               (1,2,CH,EQ,C'29',AND,99,2,CH,EQ,C'CD'),OR,                       
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'LSE'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'CON'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'CST'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'LRF'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'SRV'),OR,                    
              (66,4,CH,EQ,C'BANK',AND,99,3,CH,EQ,C'SST'),OR,                    
              (99,3,CH,EQ,C'SOL'))                                              
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT SA TRANS BY PAYMENT TYPE, DATE                                         
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F137SA,DISP=(OLD,PASS)                                      
//         DD DSN=&&F137OTH,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&BP13F136,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=150,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(5,8,A,99,3,A,91,8,A),FORMAT=CH                                
     INCLUDE COND=(1,2,CH,EQ,C'19',OR,1,2,CH,EQ,C'21',OR,                       
                   1,2,CH,EQ,C'22',OR,1,2,CH,EQ,C'23',OR,                       
                   1,2,CH,EQ,C'29',OR,1,2,CH,EQ,C'30',OR,                       
                   1,2,CH,EQ,C'31',OR,1,2,CH,EQ,C'32')                          
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT CHECKING ON DR/CR, IF NOT TALLY MOVE '99' TO RETURN CODE              
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=BP13C12C,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F120 DD DSN=&&BP13F136,DISP=(OLD,PASS)                                    
//BP13L12C DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
