//BP13A517 JOB (BP13P),'BP13OIC5',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* RE-ASSIGN OIC                                                               
//*=================================================================            
//*--------------------------------------------------------------------         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K022.WISOIC,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K028.OICHIST,DISP=OLD                                    
//INPUT3   DD DSN=BP13.K025.CSM.DBSS,DISP=OLD                                   
//INPUT4   DD DSN=BP13.KB25.DBSELIG,DISP=OLD                                    
//INPUT5   DD DSN=BP13.K024.WISLAST,DISP=OLD                                    
//INPUT6   DD DSN=BP13.K026.ASGNOIC,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
//*-------------------------------------------------------------------*         
//*  BACKUP FILE BEFORE RUN                                                     
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F022.WISOIC.DAILY(+1),DISP=(NEW,CATLG),                  
//            UNIT=CART,LABEL=(1,SL),                                           
//            SPACE=(CYL,(200,30)),                                             
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//INPUT2   DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F024.WISLAST.DAILY(+1),DISP=(NEW,CATLG),                 
//            UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                         
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//INPUT3   DD DSN=BP13.K025.CSM.DBSS,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F025.CSM.DBSS.DAILY(+1),DISP=(NEW,CATLG),                
//            UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                         
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*                                                                             
//*------------------------------------------------------------------           
//* EXTRACT HA1 UIN FROM BP13K800                                               
//* 2192256J - START REGN-NO FROM YEAR 2009                                     
//* 1533708G - START REGN-NO FOR SERS CASES                                     
//*--------------------------------------------------------------------         
//STEP03  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K800.APPLN,DISP=SHR,                                      
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT DD DSN=&&BP13F034,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=30),                                          
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=((4,8,CH,GE,C'1533708G',AND,                                     
                 4,8,CH,LT,C'19999999'),OR,                                     
                 4,8,CH,GE,C'2192256J')                                         
  OUTREC FIELDS=(4,8,88,9,4X,1,1,8X)                                            
/*                                                                              
//*--------------------------------------------------------------------         
//* EXTRACT HA1 UIN FROM BP13K595                                               
//*--------------------------------------------------------------------         
//STEP04  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                 
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT DD DSN=&&BP13F034,DISP=(MOD,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=30),                                          
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(123,8,CH,GE,C'2192256J')                                        
  OUTREC FIELDS=(123,8,41,9,4X,260,1,8X)                                        
/*                                                                              
//*--------------------------------------------------------------------         
//* EXTRACT HA1 UIN FROM BP13K730                                               
//*--------------------------------------------------------------------         
//STEP05  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                   
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT DD DSN=&&BP13F034,DISP=(MOD,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=30),                                          
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(123,8,CH,GE,C'2192256J')                                        
  OUTREC FIELDS=(123,8,41,9,4X,260,1,8X)                                        
/*                                                                              
//*--------------------------------------------------------------------         
//* EXTRACT HA1 UIN FROM BP13KB78 , DBSS/EC                                     
//*--------------------------------------------------------------------         
//STEP06  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                     
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT DD DSN=&&BP13F034,DISP=(MOD,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=30),                                          
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(6,8,A),FORMAT=CH                                                 
  OUTREC FIELDS=(6,8,29,9,13X)                                                  
/*                                                                              
//*--------------------------------------------------------------------         
//* DROP DUPLICATE REGN/NRIC1                                                   
//*--------------------------------------------------------------------         
//STEP07  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=&&BP13F034,DISP=(OLD,PASS)                                     
//SORTOUT DD DSN=BP13.F034.REGNNRIC,DISP=OLD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
/*                                                                              
//*--------------------------------------------------------------------         
//* DELETE/DEFINE BP13K034                                                      
//*--------------------------------------------------------------------         
//STEP08    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1   DD DSN=BP13.F034.REGNNRIC,DISP=SHR                                   
//SYSIN     DD  *                                                               
          DEL 'BP13.K034.REGNNRIC' CL PURGE                             00810000
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K034.REGNNRIC)              -                  00810000
              CYL(40 10)                           -                    00830000
              DATACLAS(MULTIVOL)                     -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SPEED                                  -                          
              UNIQUE                                 -                  00840000
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K034.REGNNRIC.DATA)         -                  00870000
              KEYS(17 0)                             -                  00880000
              RECSZ(30 30)                         -                    00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K034.REGNNRIC.INDEX)        -                  00930000
              CISZ(4096))                                               00940000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K034.REGNNRIC)                                   00720000
      IF MAXCC = 0  THEN                             -                  00970000
           DEF AIX (NAME(BP13.K034.REGNNRIC.ALTX1)   -                  00980000
               REL(BP13.K034.REGNNRIC)               -                  00990000
               REUSE                                 -                  01010000
               KEYS(9 8)                             -                  01020000
               SHR(2 3)                              -                  01040000
               NUNQK)                                -                  01050000
               DATA                                  -                  01060000
               (NAME(BP13.K034.REGNNRIC.ALTX1.DATA)  -                  01070000
               CYL(30 20)                          -                    01080000
               RECSZ(500 2000)                       -                  01090000
               FSPC(10 10)                           -                  01100000
               CISZ(4096))                           -                  01110000
               INDEX                                 -                  01120000
               (NAME(BP13.K034.REGNNRIC.ALTX1.INDEX) -                  01130000
               CISZ(4096))                                              01140000
         IF MAXCC = 0 THEN                           -                  01150000
           DEF PATH (NAME(BP13.K034.REGNNRIC.PATH1)  -                  01160000
               PENT(BP13.K034.REGNNRIC.ALTX1))                          01170000
         IF MAXCC = 0 THEN                                              01180000
           BIX IDS(BP13.K034.REGNNRIC)               -                  01190000
               ODS(BP13.K034.REGNNRIC.ALTX1)                            01200000
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 1                                                         
//*--------------------------------------------------------------------         
//STEP11  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026M01,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=(23,1,CH,EQ,C'1')                                                
//*-------------------------------------------------------------------*         
//* METHOD 1                                                                    
//* FOR BTO/SBF                                                                 
//* GET ALL THE CASES UNDER THE OIC THAT NEED GO FOR REASSIGNMENT               
//*-------------------------------------------------------------------*         
//STEP12A  EXEC PGM=BP13CH27,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026M01,DISP=(OLD,PASS)                                     
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=OLD                             
//BP13F022 DD DSN=BP13.F022.WISOIC.REGN,DISP=OLD                                
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//* SORT BY OIC REGN                                                            
//*-------------------------------------------------------------------*         
//STEP12B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F022.WISOIC.REGN,DISP=SHR                                
//SORTOUT  DD DSN=&&S12CH27,DISP=(NEW,PASS),                                    
//        DCB=(RECFM=FB,LRECL=100),                                             
//        SPACE=(CYL,(30,10),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(6,8,A),FORMAT=CH                                                 
//*-------------------------------------------------------------------*         
//* GET NRIC FOR RE-ASSIGNED OIC                                                
//* DELETE BP13K022 IF REGN-NO NOT FOUND IN BP13K034                            
//*-------------------------------------------------------------------*         
//STEP12C  EXEC PGM=BP13CH28,COND=(0,NE)                                        
//BP13F022 DD DSN=&&S12CH27,DISP=(OLD,PASS)                                     
//BP13F034 DD DSN=BP13.F034.REGNNRIC,DISP=SHR                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//P13F022A DD DSN=&&S12CH28,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(30,10),RLSE)                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//* SORT BY NRIC AND REGN IN DECENDING ORDER                                    
//*-------------------------------------------------------------------*         
//STEP12D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&S12CH28,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&S12NDUP,DISP=(,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(27,9,A,6,8,D),FORMAT=CH                                          
//*-------------------------------------------------------------------*         
//* RETAIN THE BIGGEST REG-NO, REMOVE DUP NRIC/REGN                             
//*-------------------------------------------------------------------*         
//STEP12E  EXEC PGM=BP13CH32,COND=(0,NE)                                        
//BP13F022 DD DSN=&&S12NDUP,DISP=(OLD,PASS)                                     
//P13F022A DD DSN=BP13.F022.WISOIC.NRIC,DISP=OLD                                
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//* SORT BY OIC/REGN/NRIC                                                       
//*-------------------------------------------------------------------*         
//STEP12F  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F022.WISOIC.NRIC,DISP=SHR                                
//SORTOUT  DD DSN=&&S12CH33,DISP=(,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,13,A,27,9,A),FORMAT=CH                                         
//*-------------------------------------------------------------------*         
//* RE-ASSIGNMENT USING OIC-LIST,                                               
//* ALSO UPDATE FOR ALL NRIC WITH NEW OIC                                       
//* UPDATE PRE-OIC AND POS OIC, BYPASS DBSS/EC                                  
//*-------------------------------------------------------------------*         
//STEP12G  EXEC PGM=BP13CH30,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026M01,DISP=(OLD,PASS)                                     
//BP13F022 DD DSN=&&S12CH33,DISP=(OLD,DELETE)                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K034 DD DSN=BP13.K034.REGNNRIC,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K031 DD DSN=BP13.K034.REGNNRIC.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=MOD                             
//P13LH33A DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*=====================================================================        
//*    SORT ALL CASES IN BP13K022     BASE ON BP13F026                          
//*--------------------------------------------------------------------         
//STEP12H  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F026M01,DISP=(OLD,PASS)                                     
//SORTJNF2 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//MATCH    DD DSN=&&S12CH44,DISP=(,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(1,5,A)                                              
   JOINKEYS FILE=F2,FIELDS=(21,5,A)                                             
   REFORMAT FIELDS=(F2:1,100)                                                   
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* TO REASSIGN OIC-APPL                                                        
//*-------------------------------------------------------------------*         
//STEP12I  EXEC PGM=BP13CH44,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026M01,DISP=(OLD,DELETE)                                   
//BP13F022 DD DSN=&&S12CH44,DISP=(OLD,DELETE)                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=OLD                             
//P13LH44A DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 2 FOR DBSS/EC                                             
//*--------------------------------------------------------------------         
//STEP20  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026M02,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=(23,1,CH,EQ,C'2',AND,                                            
                31,1,CH,EQ,C'Y',AND,                                            
                24,1,CH,EQ,C'N')                                                
//*---------------------------------------------------------------------        
//* METHOD 2 - REASSIGN DBSS/EC OIC BASED ON THE LIST IN BP13KB25               
//*---------------------------------------------------------------------        
//STEP21   EXEC PGM=BP13CH31,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026M02,DISP=(OLD,PASS)                                     
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K025 DD DSN=BP13.K025.CSM.DBSS,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13KB25 DD DSN=BP13.KB25.DBSELIG,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13KB21 DD DSN=BP13.KB25.DBSELIG.PATH1,DISP=SHR,                             
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13KB78 DD DSN=BP13.KB78.DBSREQ,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13F022  DD DSN=BP13.F022.WISOIC.UPDATE,DISP=MOD                             
//BP13FB25 DD DSN=BP13.FB25.DBSELIG,DISP=OLD                                    
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=MOD                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 2 FOR BTO/SBF                                             
//*--------------------------------------------------------------------         
//STEP30  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026BTO2,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=(23,1,CH,EQ,C'2',AND,                                            
                31,1,CH,EQ,C'N',AND,                                            
                24,1,CH,EQ,C'N')                                                
//*-------------------------------------------------------------------*         
//* FOR BTO/SBF                                                                 
//* GET ALL THE CASES UNDER THE OIC THAT NEED GO FOR REASSIGNMENT               
//*-------------------------------------------------------------------*         
//STEP31   EXEC PGM=BP13CH27,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026BTO2,DISP=(OLD,PASS)                                    
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=MOD                             
//BP13F022 DD DSN=BP13.F022.WISOIC.REGN,DISP=OLD                                
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//* FOR BTO/SBF                                                                 
//* GET ALL THE CASES UNDER THE OIC MATCH WITH OIC-APPL                         
//*-------------------------------------------------------------------*         
//*---------------------------------------------------------------------        
//STEP31B  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTJNF1 DD DSN=&&F026BTO2,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F022.WISOIC.REGN,DISP=MOD                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   JOINKEYS FILES=F1,FIELDS(1,5,A)                                              
   JOINKEYS FILES=F2,FIELDS(21,5,A)                                             
   SORT FIELDS=COPY                                                             
   REFORMAT FIELDS=(F2:1,100)                                                   
/* JOIN PAIRED,F2,ONLY                                                          
//*-------------------------------------------------------------------*         
//* SORT BY OIC REGN                                                            
//*-------------------------------------------------------------------*         
//STEP32   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F022.WISOIC.REGN,DISP=SHR                                
//SORTOUT  DD DSN=&&F022CH27,DISP=(NEW,PASS),                                   
//        DCB=(RECFM=FB,LRECL=100),                                             
//        SPACE=(CYL,(30,10),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(6,8,A),FORMAT=CH                                                 
//*-------------------------------------------------------------------*         
//* GET NRIC FOR RE-ASSIGNED OIC                                                
//* DELETE BP13K022 IF REGN-NO NOT FOUND IN BP13K034                            
//*-------------------------------------------------------------------*         
//STEP33   EXEC PGM=BP13CH28,COND=(0,NE)                                        
//BP13F022 DD DSN=&&F022CH27,DISP=(OLD,PASS)                                    
//BP13F034 DD DSN=BP13.F034.REGNNRIC,DISP=SHR                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//P13F022A DD DSN=&&F022CH28,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(30,10),RLSE)                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//* SORT BY NRIC AND REGN IN DECENDING ORDER                                    
//*-------------------------------------------------------------------*         
//STEP34   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F022CH28,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F022NDUP,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(27,9,A,6,8,D),FORMAT=CH                                          
//*-------------------------------------------------------------------*         
//* RETAIN THE BIGGEST REG-NO, REMOVE DUP NRIC/REGN                             
//*-------------------------------------------------------------------*         
//STEP35   EXEC PGM=BP13CH32,COND=(0,NE)                                        
//BP13F022 DD DSN=&&F022NDUP,DISP=(OLD,PASS)                                    
//P13F022A DD DSN=BP13.F022.WISOIC.NRIC,DISP=OLD                                
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//* SORT BY OIC/REGN/NRIC                                                       
//*-------------------------------------------------------------------*         
//STEP36   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F022.WISOIC.NRIC,DISP=SHR                                
//SORTOUT  DD DSN=&&F022CH33,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,13,A,27,9,A),FORMAT=CH                                         
//*-------------------------------------------------------------------*         
//* RE-ASSIGNMENT USING OIC-LIST,                                               
//* ALSO UPDATE FOR ALL NRIC WITH NEW OIC                                       
//* UPDATE PRE-OIC ONLY, BYPASS DBSS/EC                                         
//*-------------------------------------------------------------------*         
//STEP37   EXEC PGM=BP13CH33,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026BTO2,DISP=(OLD,PASS)                                    
//BP13F022 DD DSN=&&F022CH33,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K034 DD DSN=BP13.K034.REGNNRIC,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K031 DD DSN=BP13.K034.REGNNRIC.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=MOD                             
//P13LH33A DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 2 FOR BTO/SBF POS-OIC = 'Y'                               
//*--------------------------------------------------------------------         
//STEP38  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026CH43,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=(23,1,CH,EQ,C'2',AND,                                            
                31,1,CH,EQ,C'N',AND,                                            
                24,1,CH,EQ,C'Y')                                                
//*=====================================================================        
//*    SORT F022 BASE ON F026                                                   
//*--------------------------------------------------------------------         
//STEP38   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F026CH43,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//MATCH    DD DSN=&&F022CH43,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(1,5,A)                                              
   JOINKEYS FILE=F2,FIELDS=(1,5,A)                                              
   REFORMAT FIELDS=(F2:1,100)                                                   
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* RE-ASSIGNMENT USING OIC-LIST,                                               
//* UPDATE POS-OIC ONLY, BYPASS DBSS/EC                                         
//*-------------------------------------------------------------------*         
//STEP40A  EXEC PGM=BP13CH43,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026CH43,DISP=(OLD,PASS)                                    
//BP13F022 DD DSN=&&F022CH43,DISP=(OLD,PASS)                                    
//BP13K034 DD DSN=BP13.K034.REGNNRIC,DISP=SHR                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=MOD                             
//P13LH43A DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 3 OR 4 (WITH MAX-NO) - POS OIC = 'Y'                      
//*--------------------------------------------------------------------         
//STEP40  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026M4A,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  SUM FIELDS=NONE                                                               
  INCLUDE COND=((23,1,CH,EQ,C'3',OR,23,1,CH,EQ,C'4'),AND,                       
               (24,1,CH,EQ,C'Y'))                                               
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 3 OR 4 (WITH MAX-NO) POS OIC = 'Y'                        
//*--------------------------------------------------------------------         
//STEP41  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026M04,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=((23,1,CH,EQ,C'3',OR,23,1,CH,EQ,C'4'),AND,                       
               (24,1,CH,EQ,C'Y'))                                               
//*********************************************************************         
//* METHOD 3 OR 4 - GET ALL CASES THAT CAN BE REASSIGNED                        
//*********************************************************************         
//STEP42   EXEC PGM=BP13CH35,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026M4A,DISP=(OLD,PASS)                                     
//BP13K034 DD DSN=BP13.K034.REGNNRIC,DISP=SHR                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F022A DD DSN=BP13.F022.COMPFLT,DISP=OLD                                    
//P13F022B DD DSN=BP13.F022.NOHANDD,DISP=OLD                                    
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT OIC/FROM 3RD BYTE OF REG NUM - UN-COMPLETED FLAT                       
//*---------------------------------------------------------------------        
//STEP43   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F022.NOHANDD,DISP=SHR                                    
//SORTOUT  DD DSN=&&F022NCMP,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,5,A,8,5,A),FORMAT=CH                                           
//*********************************************************************         
//* METHOD 4 - ALTERNATE REASSIGNMENT WITH MAX NUMBER OF CASE                   
//*********************************************************************         
//STEP44   EXEC PGM=BP13CH36,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026M04,DISP=(OLD,PASS)                                     
//BP13F022 DD DSN=&&F022NCMP,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F022A  DD DSN=BP13.F022.WISOIC.UPDATE,DISP=MOD                             
//BP13RPT1 DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT OIC/FROM 3RD BYTE OF REG NUM - COMPLETED FLAT                          
//*---------------------------------------------------------------------        
//STEP45   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F022.COMPFLT,DISP=SHR                                    
//SORTOUT  DD DSN=&&F022COMP,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,5,A,8,5,A),FORMAT=CH                                           
//*---------------------------------------------------------------------        
//* METHOD 3 OR 4 - ALTERNATE REASSIGNMENT WITH MAX NUMBER OF CASE              
//*---------------------------------------------------------------------        
//STEP46   EXEC PGM=BP13CH36,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026M04,DISP=(OLD,PASS)                                     
//BP13F022 DD DSN=&&F022COMP,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F022A DD DSN=BP13.F022.WISOIC.UPDATE,DISP=MOD                              
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=MOD                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 3 WITH POS OIC = 'N'                                      
//*--------------------------------------------------------------------         
//STEP46A EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026POSA,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  SUM  FIELDS=NONE                                                              
  INCLUDE COND=(23,1,CH,EQ,C'3',AND,                                            
                24,1,CH,EQ,C'N')                                                
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 3 WITH POS OIC = 'N'                                      
//*--------------------------------------------------------------------         
//STEP46B EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026POSB,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=(23,1,CH,EQ,C'3',AND,                                            
                24,1,CH,EQ,C'N')                                                
//*********************************************************************         
//* METHOD 3 OR 4 - GET ALL CASES THAT CAN BE REASSIGNED                        
//*********************************************************************         
//STEP46D  EXEC PGM=BP13CH35,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026POSA,DISP=(OLD,PASS)                                    
//BP13K034 DD DSN=BP13.K034.REGNNRIC,DISP=SHR                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F022A DD DSN=&&F022CH45,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(50,10),RLSE)                                          
//P13F022B DD DUMMY                                                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT OIC/FROM 3RD BYTE OF REG NUM                                           
//*---------------------------------------------------------------------        
//STEP46E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F022CH45,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F022CH4A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,5,A,8,5,A),FORMAT=CH                                           
//*---------------------------------------------------------------------        
//* METHOD 3      - ALTERNATE REASSIGNMENT WITH MAX NUMBER OF CASE              
//*---------------------------------------------------------------------        
//STEP46F  EXEC PGM=BP13CH45,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026POSB,DISP=(OLD,PASS)                                    
//BP13F022 DD DSN=&&F022CH4A,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K034 DD DSN=BP13.K034.REGNNRIC,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K031 DD DSN=BP13.K034.REGNNRIC.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F022A DD DSN=BP13.F022.WISOIC.UPDATE,DISP=MOD                              
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=MOD                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*=====================================================================        
//*    SORT ALL CASES IN BP13K022     BASE ON BP13F026                          
//*--------------------------------------------------------------------         
//STEP46G  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F026POSA,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//MATCH    DD DSN=&&S46CH46,DISP=(,PASS),                                       
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN DD *                                                                    
   JOINKEYS FILE=F1,FIELDS=(1,5,A)                                              
   JOINKEYS FILE=F2,FIELDS=(21,5,A)                                             
   REFORMAT FIELDS=(F2:1,100)                                                   
   OUTFILE FNAMES=MATCH                                                         
   OPTION COPY                                                                  
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* METHOD 3 - ALTERNATE REASSIGNMENT WITH MAX NUMBER OF CASE                   
//*            TO UPDATE K022-NUM-OIC-APPL ONLY                                 
//*---------------------------------------------------------------------        
//STEP46H  EXEC PGM=BP13CH46,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026POSB,DISP=(OLD,PASS)                                    
//BP13F022 DD DSN=&&S46CH46,DISP=(OLD,DELETE)                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K034 DD DSN=BP13.K034.REGNNRIC,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K031 DD DSN=BP13.K034.REGNNRIC.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F022A DD DSN=BP13.F022.WISOIC.UPDATE,DISP=MOD                              
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=MOD                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 4 WITH POS OIC = 'N'                                      
//*--------------------------------------------------------------------         
//STEP46I EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026POS4,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  SUM  FIELDS=NONE                                                              
  INCLUDE COND=(23,1,CH,EQ,C'4',AND,                                            
                24,1,CH,EQ,C'N')                                                
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 4 WITH POS OIC = 'N'                                      
//*--------------------------------------------------------------------         
//STEP46J EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026POS5,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=(23,1,CH,EQ,C'4',AND,                                            
                24,1,CH,EQ,C'N')                                                
//*********************************************************************         
//* METHOD  4 - GET ALL CASES THAT CAN BE REASSIGNED                            
//*********************************************************************         
//STEP46K  EXEC PGM=BP13CH35,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026POS4,DISP=(OLD,PASS)                                    
//BP13K034 DD DSN=BP13.K034.REGNNRIC,DISP=SHR                                   
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR,                             
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F022A DD DSN=&&F22CH45A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(50,10),RLSE)                                          
//P13F022B DD DUMMY                                                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*---------------------------------------------------------------------        
//* SORT OIC/FROM 3RD BYTE OF REG NUM                                           
//*---------------------------------------------------------------------        
//STEP46L  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F22CH45A,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F022CH4B,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(50,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,5,A,8,5,A),FORMAT=CH                                           
//*---------------------------------------------------------------------        
//* METHOD 4      - ALTERNATE REASSIGNMENT WITH MAX NUMBER OF CASE              
//*---------------------------------------------------------------------        
//STEP46M  EXEC PGM=BP13CH45,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026POS5,DISP=(OLD,PASS)                                    
//BP13F022 DD DSN=&&F022CH4B,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K034 DD DSN=BP13.K034.REGNNRIC,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K031 DD DSN=BP13.K034.REGNNRIC.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F022A DD DSN=BP13.F022.WISOIC.UPDATE,DISP=MOD                              
//BP13RPT1 DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=MOD                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*------------------------------------------------------------------           
//* SORT OUT METHOD = 5 FOR DBSS/EC                                             
//*--------------------------------------------------------------------         
//STEP47  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K026.ASGNOIC,DISP=SHR                                     
//SORTOUT DD DSN=&&F026PRJ,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(2,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=(23,1,CH,EQ,C'5',AND,                                            
                31,1,CH,EQ,C'Y')                                                
//*-------------------------------------------------------------------*         
//* GET ALL THE CASES UNDER THE OIC THAT NEED GO FOR REASSIGNMENT               
//*-------------------------------------------------------------------*         
//STEP48   EXEC PGM=BP13CH40,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026PRJ,DISP=(OLD,PASS)                                     
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K025 DD DSN=BP13.K025.CSM.DBSS,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13KB25 DD DSN=BP13.KB25.DBSELIG,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13KB21 DD DSN=BP13.KB25.DBSELIG.PATH1,DISP=SHR,                             
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13F022 DD DSN=&&BP13F022,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=100),                                         
//            SPACE=(CYL,(50,10),RLSE)                                          
//P13F022A  DD DSN=BP13.F022.WISOIC.UPDATE,DISP=MOD                             
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//* REASIGN CASES USING OIC LIST ON BP13K025 ACCORDING TO PROJECT               
//*-------------------------------------------------------------------*         
//STEP49   EXEC PGM=BP13CH41,COND=(0,NE)                                        
//BP13F026 DD DSN=&&F026PRJ,DISP=(OLD,PASS)                                     
//BP13F022 DD DSN=&&BP13F022,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K025 DD DSN=BP13.K025.CSM.DBSS,DISP=SHR,                                  
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K028 DD DSN=BP13.K028.OICHIST,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13KB25 DD DSN=BP13.KB25.DBSELIG,DISP=SHR,                                   
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13KB21 DD DSN=BP13.KB25.DBSELIG.PATH1,DISP=SHR,                             
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13FB25  DD DSN=BP13.FB25.DBSELIG,DISP=OLD                                   
//P13F022A  DD DSN=BP13.F022.WISOIC.UPDATE,DISP=MOD                             
//BP13RPT1  DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=MOD                            
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*-------------------------------------------------------------------*         
//*  BACKUP FILE                                                                
//*-------------------------------------------------------------------*         
//STEP98   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F022.WISOIC.UPDATE,DISP=SHR                              
//OUTPUT1  DD DSN=BP13.F022.WISOIC.REASSIGN.BKUP(+1),DISP=(NEW,CATLG),          
//            UNIT=CART,LABEL=(1,SL),                                           
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//INPUT2   DD DSN=BP13.F026.ASGNOIC.REPORT,DISP=SHR                             
//OUTPUT2  DD DSN=BP13.F026.REPORT(+1),DISP=(NEW,CATLG),                        
//            UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                         
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//INPUT3   DD DSN=BP13.K026.ASGNOIC,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F026.ASGNOIC.BKUP(+1),DISP=(NEW,CATLG),                  
//            UNIT=CART,LABEL=(3,SL),VOL=REF=*.OUTPUT1,                         
//            SPACE=(CYL,(30,10)),                                              
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=100,RECFM=FB)                       
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*                                                                             
//*---------------------------------------------------------------------        
//* TO DELETE & REDEFINE BP13K026                                       00020004
//*---------------------------------------------------------------------        
//STEP99   EXEC PGM=IDCAMS,COND=(0,NE)                                  00030000
//SYSPRINT DD SYSOUT=*                                                  00040000
//INPUT    DD DSN=BP13.BLANK.CHAR100,DISP=SHR                                   
//SYSIN    DD *                                                         00050000
  DEL 'BP13.K026.ASGNOIC' CLUSTER PURGE                                 001     
  DEF CLUSTER                                          -                001     
        (NAME(BP13.K026.ASGNOIC)                        -                 001   
        SHAREOPTIONS(2,3)                              -                  001   
        KEYS(11 0)                                      -                 001   
        TRK(5 3)                                       -                  001   
        RECSZ(100 100)                                 -                  001   
        FREESPACE(10 10)                               -                  001   
        CISZ(4096)                                     -                  001   
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                  001   
        UNQ)                                           -                  001   
      DATA                                             -                      00
        (NAME(BP13.K026.ASGNOIC.DATA))                  -                 001   
      INDEX                                            -                      00
        (NAME(BP13.K026.ASGNOIC.INDEX))                                   001   
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K026.ASGNOIC)                                         
/*                                                                              
