//BP13A270 JOB (BP13P),'BP13A270',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR UPDATING OF BOOKING APPMT DATE AND TIME FOR                 
//* NON-MATURE NEW TOWNS ONLY (BOOKING EXERCISE ON ZONE BASIS).                 
//* FOR RESERVED LIST ONLY.                                                     
//******************************************************************            
//*CHG REQ  OIC   DATE    DESCRIPTION                                           
//*=====================================                                        
//*BP133392 LMS1 28/07/08 NEW JCL FOR UPDATING OF BOOKING APPOINTMENT           
//*                       FOR RESERVED LIST                                     
//*BP133610 ESA1 02/06/09 TO REPLACE BP13K767 WITH BP13K816                     
//*BP133851 ESA1 22/02/10 TO ADD BP13K800 IN BP13C241                           
//*BP133896 ESA1 07/05/10 TO EXPAND SIZE OF BACK-UP DATA                        
//*BP134253 ESD1 07/05/11 ESD1 CATER TO CHANGE F222 FILE.                       
//*BP134513 ESA1 12/04/12 TO ADD BP13K200 ALT FILE IN BP13C241                  
//*BP134681 ESA1 19/09/12 TO REPLACE BP13K816 WITH BP13K813                     
//*BP135171 RJE1 10/02/14 TO CATER FOR DB2 UPGRADE                              
//*BP135404 ESA1 03/07/14 TO REMOVE CNTRL REPORT PRINTING FOR BP13C240          
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP01 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=OLD                                                         
//INPUT2   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=OLD                                                         
//INPUT3   DD  DSN=BP13.K278.OCSBLK,                                            
//             DISP=OLD                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 6 - SCHEDULE BOOKING APPMT (ZONE)                       
//*--------------------------------------------------------------------         
//STEP1A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=BP13.F205.APZNREC,DISP=OLD                                    
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'UZ',AND,63,1,CH,EQ,C'Y')                          
//*--------------------------------------------------------------------*        
//*  TO BACKUP FILES BEFORE UPDATE                                              
//*--------------------------------------------------------------------*        
//STEP02 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F200.BKAPPMT.BACKUP(+1),                                
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=300,RECFM=FB)                  
//INPUT2   DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR                                                         
//OUTPUT2  DD  DSN=BP13.F210.BKWKPLAN.BACKUP(+1),                               
//             DISP=(NEW,CATLG),                                                
//             SPACE=(CYL,(5,2),RLSE),                                          
//             DCB=(BP13.GDG,BLKSIZE=23400,LRECL=100,RECFM=FB)                  
//SYSIN    DD  *                                                                
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
/*                                                                              
//*--------------------------------------------------------------------*        
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO                       
//*--------------------------------------------------------------------*        
//STEP03 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F200.BKAPPMT,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F200A,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(9,3,A,12,2,A,50,6,A,57,5,A),FORMAT=CH                          
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CANCELLATION CASES                                                          
//*--------------------------------------------------------------------*        
//STEP04 EXEC    PGM=BP13C240,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.APZNREC,                                           
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,DELETE)                                                
//P13F200O DD  DSN=&&P13F200B,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//P13F240O DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE              
//* CASES WITH SHORTLIST-QTR NOT THE SAME AS BALLOT-QTR.                        
//*--------------------------------------------------------------------*        
//STEP05 EXEC    PGM=BP13C273,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200B,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=BP13.F205.APZNREC,                                           
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L273 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO CHECK SOC MASTER FILE FOR CASES ALREADY ACCEPTED A FLAT.                 
//*--------------------------------------------------------------------*        
//STEP06 EXEC    PGM=BP13C285,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200C,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13F205 DD  DSN=BP13.F205.APZNREC,                                           
//             DISP=SHR                                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//P13F200O DD  DSN=&&P13F200D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//BP13L285 DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*00000690
//* TO CHECK BOOKING APPOINTMENT FILE AGAINST SOC MASTER TO REMOVE      00000700
//* CASES WITH DIFFERENT ZONE/NT/FT.                                    00000710
//*--------------------------------------------------------------------*00000720
//STEP6A EXEC    PGM=BP13C27A,COND=(0,NE)                               00000730
//BP13F200 DD  DSN=&&P13F200D,                                          00000740
//             DISP=(SHR,PASS)                                          00000750
//BP13F205 DD  DSN=BP13.F205.APZNREC,                                   00000760
//             DISP=SHR                                                 00000770
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000780
//             DISP=SHR                                                 00000790
//P13F200O DD  DSN=&&P13F200E,                                          00000800
//             DISP=(NEW,PASS),                                         00000810
//             UNIT=SYSDA,                                              00000820
//             SPACE=(CYL,(10,5),RLSE),                                 00000830
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00000840
//BP13L27A DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSDBG   DD  SYSOUT=*                                                 00000870
//SYSDBOUT DD  SYSOUT=*                                                 00000880
//SYSOUT   DD  SYSOUT=*                                                 00000890
/*                                                                      00000900
//*--------------------------------------------------------------------*        
//*  TO SCHEDULE BOOKING APPOINTMENT BY NT/FT/REGN-NO BASED ON THE     *        
//*  BOOKING WORK PLAN                                                 *        
//*--------------------------------------------------------------------*        
//STEP07 EXEC    PGM=BP13C241,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200E,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                     00000780
//             DISP=SHR                                                 00000790
//BP13K200 DD  DSN=BP13.K200.BKAPPMT,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K201 DD  DSN=BP13.K200.BKAPPMT.PATH1,                                     
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
/*                                                                              
//*--------------------------------------------------------------------         
//*       DEFINE FILE BP13.F222.BP13A270                                        
//*--------------------------------------------------------------------         
//STEP10 EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUT1   DD  DSN=NULLFILE,                                                    
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSUT2   DD  DSN=BP13.F222.BP13A270,                                          
//             DISP=(NEW,CATLG),                                                
//             UNIT=DISK,                                                       
//             SPACE=(TRK,(1,1)),                                               
//             RECFM=FB,LRECL=100,                                              
//             BLKSIZE=0                                                        
//SYSIN    DD  DUMMY                                                            
//*---------------------------------------------------------------------        
//*     TO CREATE ALLOCATION SUMMARY FILE (BP13K222)                            
//*---------------------------------------------------------------------        
//STEP10A   EXEC PGM=BP13C24F,COND=(0,NE)                                       
//BP13F205 DD  DSN=BP13.F205.APZNREC,                                           
//             DISP=(SHR,PASS)                                                  
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR                                                         
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR                                                         
//BP13F222 DD  DSN=BP13.F222.BP13A270,                                          
//             DISP=SHR                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=2                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
/*                                                                              
//*---------------------------------------------------------------------        
//*     TO CREATE ALLOCATION SUMMARY FILE (BP13K222)                            
//*---------------------------------------------------------------------        
//STEP11 EXEC    PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13F205 DD  DSN=BP13.F205.APZNREC,                                           
//             DISP=SHR                                                         
//BP13K210 DD  DSN=BP13.K210.BKWKPLAN,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K270 DD  DSN=BP13.K270.BOOKPGM,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFNI=8','BUFND=4')                                        
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//CP27K090 DD  DSN=CP27.K090.HOLIDAY,                                           
//             DISP=SHR                                                         
//BP13K278 DD  DSN=BP13.K278.OCSBLK,                                            
//             DISP=OLD                                                         
//BP13K813 DD  DSN=BP13.K813.BTOBE,                                             
//             DISP=SHR                                                         
//SYSOUT   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.PRT01.FORMID)                                          
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C248) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//*  ACCUMULATE THE CONTROL REC INTO CTLREC-ACC FILE                            
//*---------------------------------------------------------------------        
//STEP24 EXEC    PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.F205.APZNREC,                                           
//             DISP=SHR                                                         
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
      REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13A270                                                                
//*---------------------------------------------------------------------        
