//BP13D533 JOB (BP13P),'BP13D533',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*==================================================================           
//* EXTRACT THE CASES FROM BP13KD20 ON AN HOURLY BASIS ON NEW AND               
//* UPDATE DBSS BOOKED CASES, FTP TO DEVELOPER SERVER                           
//*==================================================================           
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP133388 IL5  040908   NEW JCL FOR FTP FILE TO DBSS DEVELOPER               
//*                        (STEPS WERE PREVIOUSLY UNDER BP13D534)               
//* BP133530 RB12 180409   ADD BP13CA14 TO CHECK 2ND TIMER COUNT                
//* BP134211 IL5  060611   CATER FOR D08                                        
//* BP134211 IL5  010212   TO ENSURE CASES BOOKED AFTER 10 PM ARE               
//*                        SENT TO DEVELOPERS                                   
//* BP134624 IL5  20912    ALLOCATE MORE SPACE FOR DATASET                      
//* BP134639 IL5  121012   ADD KA30 AS INPUT FILES FOR BP13C02Y                 
//*=================================================================            
//*  BACKUP FTP FILE TO DEVELOPER                                               
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FB61.FTPBLK.LOG,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.FB61.FTPBLK.BACKUP(+1),DISP=(NEW,CATLG),                 
//            SPACE=(CYL,(3,2)),                                                
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=42,RECFM=FB)                        
//INPUT2   DD DSN=BP13.FB62.FTPUNIT.LOG,DISP=SHR                                
//OUTPUT2  DD DSN=BP13.FB62.FTPUNIT.BACKUP(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(5,10)),                                               
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=180,RECFM=FB)                       
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-----------------------------------------------------------------            
//* SORT BP13KA20 RECORD IN PROJ/BLOCK ORDER                                    
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KA20.BLOCK,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FA20,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                                  
//         SPACE=(CYL,(20,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* SORT BP13KA30 RECORD IN PROJ/BLK/MAIN/SUB/LEVEL ORDER                       
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KA80.UPDLOG,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FA30,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                                  
//         SPACE=(CYL,(20,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(501,17,A,544,1,D),FORMAT=CH                                     
   INCLUDE COND=(34,1,CH,EQ,C'O',AND,493,8,CH,EQ,C'BP13KA30')                   
   OUTREC FIELDS=(501,200)                                                      
//*------------------------------------------------------------------           
//* EXTRACT BOOKED UNIT FOR THE DAY, FORMAT DATA FOR FTP TO DEVELOPER           
//*------------------------------------------------------------------           
//STEP04   EXEC PGM=BP13C02K,COND=(0,NE)                                        
//BP13FA20 DD DSN=&&BP13FA20,DISP=(OLD,DELETE)                                  
//BP13FA30 DD DSN=&&BP13FA30,DISP=(OLD,DELETE)                                  
//P13FA20A DD DSN=&&FA20BOOK,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                                  
//         SPACE=(CYL,(20,10),RLSE)                                             
//P13FA30A DD DSN=&&FA30BOOK,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                                  
//         SPACE=(CYL,(20,10),RLSE)                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* FORMAT RECORD FOR DEVELOPER FORMAT (BP13FB61)                               
//*------------------------------------------------------------------           
//STEP05   EXEC PGM=BP13C02F,COND=(0,NE)                                        
//BP13FA20 DD DSN=&&FA20BOOK,DISP=(OLD,DELETE)                                  
//BP13FB61 DD DSN=BP13.FB61.FTPBLK,DISP=OLD                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* FORMAT RECORD FOR DEVELOPER FORMAT (BP13FB61)                               
//*------------------------------------------------------------------           
//STEP06   EXEC PGM=BP13C02G,COND=(0,NE)                                        
//BP13FA30 DD DSN=&&FA30BOOK,DISP=(OLD,DELETE)                                  
//BP13KB20 DD DSN=BP13.KB20.DBSBK,DISP=SHR                                      
//BP13FB62 DD DSN=BP13.FB62.FTPUNIT,DISP=OLD                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* BACKUP FILE                                                                 
//*--------------------------------------------------------------------         
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FB61.FTPBLK,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.FB61.FTPBLK.LOG,DISP=MOD                                 
//*                                                                             
//INPUT2   DD DSN=BP13.FB62.FTPUNIT,DISP=SHR                                    
//OUTPUT2  DD DSN=BP13.FB62.FTPUNIT.LOG,DISP=MOD                                
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*--------------------------------------------------------------------         
//* ACCUM TO DAILY FILE                                                         
//*--------------------------------------------------------------------         
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.FB61.FTPBLK,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.FB61.FTPBLK.DAILY,DISP=OLD                               
//*                                                                             
//INPUT2   DD DSN=BP13.FB62.FTPUNIT,DISP=SHR                                    
//OUTPUT2  DD DSN=BP13.FB62.FTPUNIT.DAILY,DISP=OLD                              
//*                                                                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*-----------------------------------------------------------------            
//* SORT OUT DBSS CASES BY SYSTEM-DATE/TIME                                     
//*-----------------------------------------------------------------            
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KA80.UPDLOG,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13FA80,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=4000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
   INCLUDE COND=(506,1,CH,EQ,C'5',AND,493,8,CH,EQ,C'BP13KB20')                  
//*-----------------------------------------------------------------            
//* SORT OUT DBSS CASES BY SYSTEM-DATE/TIME                                     
//*-----------------------------------------------------------------            
//STEP16A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.FA80.UPDLOG.ACCUM,DISP=SHR                               
//         DD DSN=BP13.FA80.UPDLOG.MONTH(0),DISP=SHR                            
//SORTOUT  DD DSN=&&BP13FA80,DISP=(MOD,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=4000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
   INCLUDE COND=(506,1,CH,EQ,C'5',AND,493,8,CH,EQ,C'BP13KB20')                  
   SUM FIELDS=NONE                                                              
//*-----------------------------------------------------------------            
//* SORT OUT DBSS CASES BY SYSTEM-DATE/TIME                                     
//*------------------------------------------------------------------           
//* SORT BP13KB20 BY SYSTEM DATE/TIME                                           
//* BP13IR9M- BOOK PROGRAM                                                      
//* BP13IR96- REEJCTION PROGRAM                                                 
//*-----------------------------------------------------------------            
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13FA80,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&FA80BOOK,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(BLKSIZE=0,LRECL=4000,RECFM=FB),                                 
//         SPACE=(CYL,(50,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
   INCLUDE COND=(26,9,CH,EQ,C'BP13IR9MO',OR,                                    
                 26,9,CH,EQ,C'BP13IR96I')                                       
//*------------------------------------------------------------------           
//* FORMAT RECORD FOR DEVELOPER FORMAT (BP13FB66)                               
//*------------------------------------------------------------------           
//STEP18   EXEC PGM=BP13C02Y,COND=(0,NE)                                        
//BP13FA80 DD DSN=&&FA80BOOK,DISP=(OLD,DELETE)                                  
//BP13KA30 DD DSN=BP13.KA30.UNIT,DISP=SHR                                       
//BP13KA31 DD DSN=BP13.KA30.UNIT.PATH1,DISP=SHR                                 
//BP13FB66 DD DSN=BP13.FB66.FTPUNIT.DBSS,DISP=OLD                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//*=================================================================            
//* SEND EMAIL ON UNBALANCE                                                     
//*-----------------------------------------------------------------            
//STEP09   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.KA20.BLOCK,                                             
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&FA20BLK,                                                   
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,8,CH,NE,C'        ')                                         
//*-----------------------------------------------------------------            
//STEP10   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.KA30.UNIT,                                              
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&FA30UNIT,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(CYL,(20,10),RLSE),                                        
//             DCB=(BLKSIZE=0,LRECL=200,RECFM=FB)                               
//SYSOUT   DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(1,8,CH,NE,C'        ',AND,1,1,CH,NE,C'E')                      
//*-----------------------------------------------------------------            
//STEP11   EXEC PGM=BP13CA10,COND=(0,NE)                                        
//BP13FA20 DD DSN=&&FA20BLK,DISP=(OLD,DELETE)                                   
//BP13FA30 DD DSN=&&FA30UNIT,DISP=(OLD,DELETE)                                  
//BP13MAIL DD DSN=BP13.MAILOUT.CA10,DISP=OLD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP12   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.CA10,DISP=SHR                                    
/*                                                                              
