//BP13D517 JOB (BP13P),'BP13D517',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//*  FOR BUILD-TO-ORDER EXERCISE                                      *         
//*  TO UPDATE DEMAND/SUPPLY                                          *         
//*                                                                   *         
//*===================================================================*         
//* CHG REF  BY  ON       DESCRIPTION                                 *         
//* -------- --- -------- -----------                                 *         
//* BP132368 CLT 060803   SAME AS BP13D516                            *         
//* BP132454 CLT 091203   INCLUDE CANCELLED CASE IN BP13K595          *         
//* BP132494 CLT 220304   AMEND APPLICATION PERIOD                    *         
//* BP132533 CLT 130504   AMEND APPLICATION PERIOD FOR MAY04 BTO      *         
//* BP132573 CLT 030804   AMEND APPLICATION PERIOD FOR AUG04 BTO      *         
//* BP132599 CLT 240904   ESTATE/ZONE EXPANDS TO 3 CHAR               *         
//* BP132628 CLT 011204   AMEND APPLICATION PERIOD FOR DEC04 BTO      *         
//* BP132673 CLT 120305   AMEND APPLICATION PERIOD FOR MAR05 BTO      *         
//* BP132709 CLT 070605   AMEND APPLICATION PERIOD FOR JUN05 BTO      *         
//* BP132748 CLT 170905   AMEND APPLICATION PERIOD FOR SEP05 BTO      *         
//* BP132809 CLT 230106   AMEND APPLICATION PERIOD FOR FEB06 BTO      *         
//* BP132885 CLT 120706   AMEND APPLICATION PERIOD FOR JUL06 BTO      *         
//* BP132915 CLT 010906   AMEND APPLICATION PERIOD FOR SEP06 BTO      *         
//* BP132868 CLT 181006   AMEND APPLICATION PERIOD FOR OCT06 BTO      *         
//* BP132955 CLT 131106   AMEND APPLICATION PERIOD FOR NOV06 BTO      *         
//* BP133068 CLT 170507   AMEND APPLICATION PERIOD FOR MAY07 BTO      *         
//* BP133103 CLT 270707   AMEND APPLICATION PERIOD FOR AUG07 BTO      *         
//* BP133149 CLT 110907   AMEND APPLICATION PERIOD FOR SEP07 BTO      *         
//* BP133176 CLT 181007   AMEND APPLICATION PERIOD FOR OCT07 BTO      *         
//* BP133190 CLT 181107   AMEND APPLICATION PERIOD FOR NOV07 BTO      *         
//* BP133225 CLT 121207   AMEND APPLICATION PERIOD FOR DEC07 BTO      *         
//* BP133265 CLT 050208   AMEND APPLICATION PERIOD FOR FEB08 BTO      *         
//* BP133291 CLT 150308   AMEND APPLICATION PERIOD FOR MAR08 BTO      *         
//* BP133304 CCC 250408   AMEND APPLICATION PERIOD FOR MAY08 BTO      *         
//* BP133354 CCC 060608   AMEND APPLICATION PERIOD FOR JUN08 BTO      *         
//* BP133354 CCC 060608   AMEND APPLICATION PERIOD FOR 30JUN08 BTO    *         
//* BP133411 CCC 200808   AMEND APPLICATION PERIOD FOR AUG08 BTO      *         
//* BP133467 CCC 200811   AMEND APPLICATION PERIOD FOR NOV08 BTO      *         
//* BP133485 CCC 200812   AMEND APPLICATION PERIOD FOR DEC08 BTO      *         
//* BP133487 CCC 200812   AMEND APPLICATION PERIOD FOR 2ND DEC08 BTO  *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP133487 CCC 200812   AMEND APPLICATION PERIOD TO STOP UPDATE FOR *         
//*                       1ST DEC08 BTO.                              *         
//* BP133539 CCC 200902   AMEND APPLICATION PERIOD FOR FEB09 BTO      *         
//* BP133539 CCC 200902   TO UPDATE DEMAND FOR RM 1B FOR HOMELINK     *         
//* BP133539 CCC 200902   TO INCLUDE CANCELLED CASES IN NO. OF APPLN  *         
//* BP133559 CCC 200903   AMEND APPLICATION PERIOD FOR MAR09 BTO      *         
//* BP133608 CCC 200905   AMEND APPLICATION PERIOD FOR JUN09 BTO      *         
//* BP133655 CCC 200907   AMEND APPLICATION PERIOD FOR JUL09 BTO      *         
//* BP133677 CCC 200908   AMEND APPLICATION PERIOD FOR AUG09 BTO      *         
//* BP133732 CCC 200910   AMEND APPLICATION PERIOD FOR OCT09 BTO      *         
//* BP133759 CCC 200911   AMEND APPLICATION PERIOD FOR NOV09 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP133758 CCC 200912   AMEND APPLICATION PERIOD FOR DEC09 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP133805 CCC 201001   AMEND APPLICATION PERIOD FOR JAN10 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP133815 CCC 201002   AMEND APPLICATION PERIOD FOR FEB10 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP133844 CCC 201003   AMEND APPLICATION PERIOD FOR MAR10 BTO      *         
//* BP133874 CCC 201004   AMEND APPLICATION PERIOD FOR APR10 BTO      *         
//* BP133892 CCC 201005   AMEND APPLICATION PERIOD FOR MAY10 BTO      *         
//* BP133915 CCC 201006   AMEND APPLICATION PERIOD FOR JUN10 BTO      *         
//* BP133960 CCC 201007   AMEND APPLICATION PERIOD FOR JUL10 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP133984 CCC 201008   AMEND APPLICATION PERIOD FOR AUG10 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP134013 CCC 201009   AMEND APPLICATION PERIOD FOR SEP10 BTO      *         
//* BP134046 CCC 201010   AMEND APPLICATION PERIOD FOR OCT10 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP134068 CCC 201011   AMEND APPLICATION PERIOD FOR NOV10 BTO      *         
//* BP134093 CCC 201012   AMEND APPLICATION PERIOD FOR DEC10 BTO      *         
//* BP134120 CCC 201101   AMEND APPLICATION PERIOD FOR JAN11 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP134120 CCC 201101   AMEND APPLICATION PERIOD FOR JAN11 BTO      *         
//*                       - TO UPDATE START DATE                      *         
//* BP134144 CCC 201102   AMEND APPLICATION PERIOD FOR FEB11 BTO      *         
//*                       - TO UPDATE START DATE                      *         
//* BP134173 CCC 201103   AMEND APPLICATION PERIOD FOR MAR11 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP134196 CCC 201104   AMEND APPLICATION PERIOD FOR APR11 BTO      *         
//* BP134239 CCC 201105   AMEND APPLICATION PERIOD FOR MAY11 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP134239 CCC 201105   AMEND APPLICATION PERIOD FOR MAY11 BTO      *         
//*                       - CHANGE IN LAUNCH DATE                     *         
//* BP134291 CCC 201107   AMEND APPLICATION PERIOD FOR JUL11 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP134316 CCC 201109   AMEND APPLICATION PERIOD FOR SEP11 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP134405 CCC 201111   AMEND APPLICATION PERIOD FOR NOV11 BTO      *         
//*                       - TO UPDATE DEMAND FOR RM 1B FOR HOMELINK   *         
//* BP134405 CCC 201111   INCLUDE FIRST-TIMER STATISTICS              *         
//* BP135385 KAM 240614   ADDED STEP TO SORT K762 TO SEQUENTIAL FILE  *         
//* BP135543 CCC 211114   AMEND STEP08 TO MOD K762 TO F762.                     
//* BP135748 IL5 040515   OMIT 1B FROM BP13F762                                 
//* BP136007 IL5 181115   NEW FILES BP13.FF02.SUPPLY.DEMAND.BTO AND             
//*                       BP13.FF02.SUPPLY.DEMAND.SBF                           
//* BP136140 IL5 250215   CHANGE DISP TO OLD STEP08                             
//*                       BP13.F762.BTO.DEMAND                                  
//* BP136239 IL5 240516   MOVE BP13.FF02.SUPPLY.DEMAND.SBF TO BP13D516          
//* BP138163 CCC 170220   UPDATE FF02 FIELDS                                    
//* BP139207 PP11 160622  AUTO OPENING FILE                                     
//*===================================================================*         
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD  DSN=BP13.K762.BTO.DEMAND,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------* 00001330
//* TO UPDATE DEMAND / SUPPLY OF BTO EXERCISE                          *        
//*--------------------------------------------------------------------*        
//STEP03 EXEC  PGM=BP13C73A,COND=(0,NE)                                         
//BP13FF01 DD  DSN=BP13.FF01.SALES.DEMAND,DISP=SHR                              
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K762 DD  DSN=BP13.K762.BTO.DEMAND,DISP=OLD,                               
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13L730 DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------*00000850
//*--------------------------------------------------------------------         
//* TO EXTRACT DEMAND FOR 1B ROOM TYPE (SA WITH 45 SQM)                         
//*--------------------------------------------------------------------         
//STEP04  EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K762.BTO.DEMAND,DISP=SHR                                  
//SORTOUT DD DSN=&&BP13K762,                                                    
//           DISP=(,PASS),                                                      
//           UNIT=SYSDA,                                                        
//           SPACE=(CYL,(5,5),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                 
//SORTWK01 DD UNIT=SYSDA,SPACE=(CYL,(100,100),RLSE)                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  INCLUDE COND=(4,2,CH,EQ,C'1A')                                                
  OUTREC FIELDS=(1,3,C'1B',6,15,C'00000000000000',35,66)                        
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*   TO UPDATE 1B SA WITH THE SAME DEMAND AS 1A SA                             
//*--------------------------------------------------------------------         
//STEP05  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&BP13K762,DISP=(OLD,PASS)                                   
//OUTPUT1   DD DSN=BP13.K762.BTO.DEMAND,DISP=OLD                                
//SYSIN     DD *                                                                
  REPRO INFILE(INPUT1) OUTFILE(OUTPUT1) REPLACE                                 
//*-------------------------------------------------------------------*         
//* SORT K762 TO SEQUENTIAL FILE                                      *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K762.BTO.DEMAND,DISP=SHR                                 
//SORTOUT  DD DSN=BP13.F762.BTO.DEMAND,DISP=OLD                                 
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,14,A),FORMAT=CH                                               
   OMIT COND=(4,2,CH,EQ,C'1B')                                                  
//*-------------------------------------------------------------------*         
//* DELETE FILE BP13.F762.SALES.DEMAND                                          
//*-------------------------------------------------------------------*         
//STEP09A  EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD   SYSOUT=*                                                        
//SYSIN    DD   *                                                               
     DEL ('BP13.FF02.SUPPLY.DEMAND.BTO')                                        
     IF MAXCC < 12 THEN                                                         
        SET MAXCC = 0                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//*  GENERATE BP13.FF02.SUPPLY.DEMAND.BTO FOR USER DOWNLOAD                     
//*--------------------------------------------------------------------         
//STEP09B EXEC PGM=SORT,COND=(0,NE)                                             
//SORTIN  DD DSN=BP13.K762.BTO.DEMAND,DISP=SHR                                  
//SORTOUT DD DSN=BP13.FF02.SUPPLY.DEMAND.BTO,DISP=(NEW,CATLG),                  
//           SPACE=(CYL,(2,1),RLSE),                                            
//           DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                  
//SYSOUT  DD SYSOUT=*                                                           
//SYSIN   DD *                                                                  
  SORT FIELDS=(1,5,A),FORMAT=CH                                                 
  OUTREC FIELDS=(1,3,C';',4,2,C';',6,5,C';',11,4,C';',75,4,C';',                
                45,4,C';',36,5,C';',79,4,C';',53,4,C';',49,4,C';',              
                83,4,C';',71,4,C';',67,4,C';',16X)                              
/*                                                                              
//*--------------------------------------------------------------------         
//********************** E N D  O F  J O B *************************            
//*-------------------------------------------------------------------*         
//* AUTO-OPEN FILES                                                   *         
//*-------------------------------------------------------------------*         
//STEP09Z  EXEC PGM=IKJEFT01,PARM='OPNFILE',COND=(0,NE)                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSEXEC  DD  DSN=SYS3.SYSTEM.CLIST,DISP=SHR                                   
//GETJOBNW DD  SYSOUT=*                                                         
//SYSTSIN  DD  DUMMY                                                            
//*-------------------------------------------------------------------*         
//* SEND MESSAGE TO OPERATOR TO OPEN FILES                            *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC WTOG,COND=(0,NE)                                                
   ---->    BP13D517 COMPLETED, PLEASE CHECK BP13K762 IS AUTO-OPEN.             
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
