//BP13M004 JOB (BP13P),'BP13HY01',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=====================================================================        
//*  MONTHLY BACKUP                                                             
//*  CREATE DROP CASES                                                          
//*  DROP RECORDS OTHER THAN BP13 AND BP27 AND BB24                             
//*=====================================================================        
//*  CR-NO     DATE   OIC   DESCRIPTION                                         
//*  ------- -------- ----  -----------                                         
//* BP133347 14062011 YCH2  TRANSFER BP13K040 & BP13K042 BACKUP TO BP08         
//*                         ** DO NOT DELETE FILE LAYOUT FROM BP13              
//* BP133347 31082011 YCH2  CHANGE FR91 BACKUP FROM DASD TO CARTRIDGES          
//* BP136188 08042016 YCH2  INCLUDE WTOG STEP TO OPEN BP13KR91                  
//* BP138339 18082020 YCH2  EXPAND DASD                                         
//*=====================================================================        
//*      VERIFY FILES BEFORE BACKUP                                             
//*--------------------------------------------------------------------         
//PS0010   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.KR91.LOGFILE,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          IF LASTCC=12 THEN                                                     
             DO                                                                 
                SET MAXCC=0                                                     
                VFY FILE(INPUT1)                                                
             END                                                                
//*-----------------------------------------------------------------            
//*  BACKUP BP13KR91                                                            
//*--------------------------------------------------------------------         
//PS0100  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT01   DD DSN=BP13.KR91.LOGFILE,DISP=SHR,                                  
//          AMP=('BUFND=23')                                                    
//OUTPUT01  DD DSN=BP13.FR91.LOGFILE.MBKP(+1),DISP=(NEW,CATLG),                 
//          UNIT=CART,                                                          
//          DCB=(BP13.GDG,RECFM=FB,LRECL=9000,BLKSIZE=27000)                    
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT01)  OUTFILE(OUTPUT01)                                     
//*********************************************************************         
//*  TO RE-DEFINE THE VSAM FILE BP13KR91 LOGFILE                                
//******************************************************************            
//PS0110    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR9000,DISP=SHR                                 
//SYSIN     DD  *                                                               
            DEL (BP13.KR91.LOGFILE) CL PURGE                            00800000
            DEF CLUSTER                                     -           00800000
                (NAME(BP13.KR91.LOGFILE)                   -            00810000
                 CYL(250 100)                             -             00830000
                 UNIQUE                                     -           00840000
                 STORCLAS(PRODRLS)                           -                  
                 DATACLAS(MULTIVOL)                     -                       
                 LOG(NONE)                                  -                   
                 SHR(2 3))                                  -           00850000
                DATA                                        -           00860000
                (NAME(BP13.KR91.LOGFILE.DATA)              -            00870000
                 KEYS(22 0)                                 -           00880000
                 RECSZ(9000 9000)                         -             00890000
                 CISZ(4096)                                 -           00900000
                 FSPC(10 10))                               -           00910000
                INDEX                                       -           00920000
                (NAME(BP13.KR91.LOGFILE.INDEX)             -            00930000
                 CISZ(4096))                                            00940000
            IF MAXCC = 0  THEN                              -           00950000
               REPRO IFILE(INPUT1)                          -           00960000
               ODS(BP13.KR91.LOGFILE)                                   00720000
//*--------------------------------------------------------------------         
//*  BACKUP DAILY PREE TO MONTH                                                 
//*--------------------------------------------------------------------         
//PS0120   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F730.REQPREE.MBKP,DISP=SHR                               
//OUTPUT1  DD DSN=BP13.F730.REQPREE.MTHBKP(+1),                                 
//          DISP=(NEW,CATLG),                                                   
//          SPACE=(CYL,(100,80),RLSE),                                          
//          DCB=(BP13.GDG,RECFM=FB,LRECL=500,BLKSIZE=27500)                     
//INPUT2   DD DSN=BP13.F825.REQOCCP.MBKP,DISP=SHR                               
//OUTPUT2  DD DSN=BP13.F825.REQOCCP.MTHBKP(+1),                                 
//          DISP=(NEW,CATLG),                                                   
//          SPACE=(CYL,(120,80),RLSE),                                          
//          DCB=(BP13.GDG,RECFM=FB,LRECL=200,BLKSIZE=27800)                     
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*--------------------------------------------------------------------         
//*-INITIALIZE                                                                  
//*--------------------------------------------------------------------         
//PS0290   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F730.REQPREE.MBKP,DISP=OLD                               
//OUTPUT2  DD DSN=BP13.F825.REQOCCP.MBKP,DISP=OLD                               
//SYSIN DD *                                                                    
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                       
//*=====================================================================        
//*  SEND MESSAGE TO OPERATOR TO OPEN FILES                                     
//*=====================================================================        
//PS0900   EXEC WTOG,COND=(0,NE)                                                
   ----> ##########################################################             
   ---->    AFTER SUCCESSFUL COMPLETION OF BP13M004                             
   ---->    PLEASE OPEN BP13KR91                                                
   ----> ##########################################################             
