//BP13Y300 JOB (BP13P),'BP13Y300',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//*---------------------------------------------------------------------        
//*  BACKUP COPYCOB                                                             
//*---------------------------------------------------------------------        
//STEP01 EXEC PGM=IEBCOPY,COND=(0,NE)                                           
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DSN=BP13.BATCH.COPYCOB,DISP=SHR                                   
//SYSUT2   DD DSN=BP13.COPYCOB.FY.OFFSITE(+1),                                  
//            DISP=(NEW,PASS),                                                  
//            UNIT=CART,                                                        
//            LABEL=(1,SL),                                                     
//            DCB=(BP13.GDG,BLKSIZE=0,LRECL=80,RECFM=FB)                        
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* BACKUP EC FILES                                                             
//*---------------------------------------------------------------------        
//STEP02   EXEC  PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=8')                                                  
//OUTPUT1  DD  DSN=BP13.F800.APPLN.FY.OFFSITE(+1),                              
//             DISP=(NEW,PASS),                                                 
//             UNIT=CART,                                                       
//             LABEL=(2,SL),                                                    
//             VOL=REF=*.STEP01.SYSUT2,                                         
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=2000,RECFM=FB)                     
//INPUT2   DD  DSN=BP13.K820.OCCUP,                                             
//             DISP=SHR,                                                        
//             AMP=('BUFND=8')                                                  
//OUTPUT2  DD  DSN=BP13.F820.OCCUP.FY.OFFSITE(+1),                              
//             DISP=(NEW,PASS),                                                 
//             UNIT=CART,                                                       
//             LABEL=(3,SL),                                                    
//             VOL=REF=*.OUTPUT1,                                               
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=400,RECFM=FB)                      
//INPUT3   DD  DSN=BP13.K410.ACCUMSO,                                           
//             DISP=SHR,                                                        
//             AMP=('BUFND=8')                                                  
//OUTPUT3  DD  DSN=BP13.F410.ACCUMSO.FY.OFFSITE(+1),                            
//             DISP=(NEW,PASS),                                                 
//             UNIT=CART,                                                       
//             LABEL=(4,SL),                                                    
//             VOL=REF=*.OUTPUT2,                                               
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=2000,RECFM=FB)                     
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//*  CATALOG GDG                                                                
//*---------------------------------------------------------------------        
//STEP03   EXEC  PGM=IEFBR14,COND=(0,NE)                                        
//INPUT1   DD  DSN=BP13.COPYCOB.FY.OFFSITE(+1),                                 
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//INPUT2   DD  DSN=BP13.F800.APPLN.FY.OFFSITE(+1),                              
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//INPUT3   DD  DSN=BP13.F820.OCCUP.FY.OFFSITE(+1),                              
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//INPUT4   DD  DSN=BP13.F410.ACCUMSO.FY.OFFSITE(+1),                            
//             DISP=(OLD,CATLG),                                                
//             UNIT=(,,DEFER)                                                   
//*---------------------------------------------------------------------        
//*  END BP13Y300                                                               
//*---------------------------------------------------------------------        
