//BP13A510 JOB (BP13P),'BP13A510',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* THE OJECTIVE OF THIS JCL IS TO ASSIGN REGN NO AND QUEUE NO TO               
//* RESERVED BE CASES.                                                          
//* THIS JCL IS MODELLED AFTER BP13A505 AND TO RUN AFTER BP13A505               
//*=================================================================            
//* CHG REF  BY   ON     DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP132463 CKK 291203  NEW JCL TO ASSIGN REGN NO TO RESERVED BE CASES         
//* BP132496 CKK 040504  TO UPDATE FILE LAYOUT FOR BP13C745                     
//* BP132555 CKK 190704  TO CHECK FOR SUCC-NT FIELD DURING SORTING              
//* BP133056 CKK 190507  TO REMOVE BP13C512                                     
//* BP133147 IL5 031007  TO REMOVE VERIFY FOR BP13K825 AND BP13K830             
//* BP133730 IL5 100318  TO CEASE PRINTING BP13L536 (BP13S536)                  
//* BP133913 IL5 100605  TO CEASE PRINTING BP13L535 (BP13S535)                  
//* BP134371 IL5 111023  TO QUEUE APPLICATION BY HH                             
//* BP134400 IL5 111101  REVERSE CHANGES DONE FOR BP134371                      
//* BP134688 IL5 021112  STEP02 - SORT FROM K595 (CHG POS FROM                  
//*                      (CHG POSITION FROM 300 TO 352)                         
//* BP135064 IL5 111013  REMOVE REPORT BP13L745                                 
//* BP135708 SMR 310315  CHANGE CLASS=2 TO CLASS=J                              
//* BP138301 AM2 140520  HARDCOPY REPORTS CONVERSION                            
//*=================================================================            
//*-----------------------------------------------------------------            
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//*INPUT2   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                   
//*INPUT3   DD DSN=BP13.K830.ADDR,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*       VFY FILE(INPUT2)                                                      
//*       VFY FILE(INPUT3)                                                      
//*---------------------------------------------------------------------        
//* SORT OUT THE RECORDS OUTPUT FROM THE ONLINE UPDATE AFTER BALLOT             
//* PANEL OR UPDATE AFTER ASSIGNED WEIGHTAGE PANEL                              
//* INCLUDE UPDATE DATE >= 950101                                               
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F595,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(13,5),RLSE)                                           
//SYSIN    DD *                                                                 
   SORT FIELDS=(477,8,A),FORMAT=CH                                              
   INCLUDE COND=(352,1,CH,EQ,C'T',AND,485,8,CH,GE,C'19950101',AND,              
                 123,1,CH,NE,C'6')                                              
//*---------------------------------------------------------------------        
//*-  REPRO BALLOT FILE TO SEQ FILE                                             
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT3   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//OUTPUT3  DD DSN=BP13.F740.MATUREBA.DAILY(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(48,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* SORT OUT RESERVED BE CASES                                                  
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740MAT,DISP=(NEW,PASS),                                    
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,213,2,A,10,19,A),FORMAT=CH                            
     INCLUDE COND=(260,1,CH,EQ,C'R',AND,                                        
                   226,2,CH,NE,C'  ')                                           
//*-----------------------------------------------------------------            
//* OUTPUT FILES FOR SEPARATE PIGEONHOLING PROCESS, PRIORITY,                   
//* TRANSITION NHH > 7 MTH, AND COHORTS ( MAX 5 )                               
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=BP13C741,COND=(0,NE),ADDRSPC=VIRT,REGION=4096K              
//BP13F520 DD  DSN=&&F740MAT,DISP=(OLD,PASS)                                    
//BP13MGP  DD  DUMMY                                                            
//BP13PR   DD  DSN=&&F740PRO,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13GRO  DD  DSN=&&F740GR1,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//BP13PUB  DD DSN=&&F740PUB,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//SYSDBG   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* OUTREC AAA TO ALLOC-SCH FOR ALL GRO CASES                                   
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740GR1,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(,PASS),                                       
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(35,2),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,373,3,A,163,2,A,10,19,A),FORMAT=CH                       
  OUTREC FIELDS=(1,212,C'AAA',216,284)                                          
//*---------------------------------------------------------------------        
//* OUTREC SPACES TO WARD AND GRO-RANKING FOR NON-GRO CASES                     
//* OUTREC PA TO ALLOC-SCH FOR NON-GRO CASES                                    
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&F740PUB,DISP=(OLD,PASS)                                     
//         DD DSN=&&F740PRO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740GRO,DISP=(MOD,PASS),                                    
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                 
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(226,3,A,10,19,A),FORMAT=CH                                       
  OUTREC FIELDS=(1,162,C'  ',165,48,C'PA ',216,157,C'   ',376,124)              
//*---------------------------------------------------------------------        
//* SORT BY NT, FT, WARD, GRO-RANK AND 10TH BYTE OF RANDOM NUMBER               
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F740GRO,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(48,5),RLSE),                           
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSIN    DD *                                                                 
     SORT FIELDS=(226,3,A,211,2,A,213,3,A,373,3,A,163,2,A,                      
                  10,19,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//*  TO PRINT RESERVED BE CASES ASSIGNED WITH REGISTRATION NO.                  
//*  TO ASSIGN QUEUE NO BASED ON NT,FT,REG NO.                                  
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13C514,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L514 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
