//BP13Q502 JOB (BP13P),'BP13Q502',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//      NOTIFY=CSD0071                                                  00020000
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                            00030000
//*=================================================================            
//* QUARTERLY DELETE SOC WAITING LIST HISTORY CASES THAT NOT FD IN              
//* SOC MASTER BP13K800 DUE TO ::                                               
//* 1) TAKE POSSESSION                                                          
//* 2) CANCELLED                                                                
//*-----------------------------------------------------------------            
//* RUN ON 1ST SAT OF JAN, APR, JULY, OCT                                       
//*=================================================================            
//* CHG REF  BY  ON         DESCRIPTION                                 00571021
//* -------- --- --------   -----------                                 00571021
//* BP130857 SSS 20000513   REMOVE DJDE STATEMENT                               
//* BP132546 YCH 11062004 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)               
//*-----------------------------------------------------------------            
//*  VERIFY FILES BEFORE DAILY BACKUP RUN                                       
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K810.WAITHIST,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*-----------------------------------------------------------------            
//*  BACKUP BP13 WAITING LIST HISTORY                                   00250000
//*  - 8 GDG                                                            00250000
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K810.WAITHIST,DISP=SHR,                          00512000
//            AMP=('BUFND=13')                                                  
//OUTPUT1  DD DSN=BP13.F810.WAITHIST.QTR(+1),DISP=(,PASS),              00513000
//            UNIT=CART,LABEL=(1,SL),                                   00513100
//            DCB=(BP13.GDG,BLKSIZE=27600,LRECL=400,RECFM=FB)           00514200
//*                                                                             
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
//*-----------------------------------------------------------------            
//*  CATALOG GDG                                                        03280004
//*-----------------------------------------------------------------            
//STEP03    EXEC PGM=IEFBR14,COND=(0,NE)                                03300004
//INPUT1    DD DSN=BP13.F810.WAITHIST.QTR(+1),DISP=(OLD,CATLG),         03351101
//             UNIT=(,,DEFER)                                           03351201
//*-----------------------------------------------------------------            
//* SORT BP13K810 BY REGN                                                       
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K810.WAITHIST,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F810,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(200,30),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,23,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* MATCH F810 WITH F800, IF FD RETAINED, ELSE DELETE                           
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=BP13C696,COND=(0,NE)                                        
//BP13F810 DD DSN=&&BP13F810,DISP=(OLD,PASS)                                    
//BP13F800 DD DSN=BP13.F800.APPLN,DISP=SHR                                      
//P13F810A DD DSN=&&F810HIST,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(100,20),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//P13F810B DD DSN=BP13.F810.WAITHIST.DELETE,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*   SORT BP13K800 BY REGN                                                     
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F810HIST,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F810SORT,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(200,20),RLSE),                                        
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,23,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* DEFINE BPO13K810                                                            
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=&&F810SORT,DISP=(OLD,PASS)                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL 'BP13.K810.WAITHIST' CL PURGE                                      
         DEF CL (NAME(BP13.K810.WAITHIST)              -                        
                 CYL(220 30)                             -                      
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K810.WAITHIST.DATA)        -                        
                 KEYS(23 0)                            -                        
                 RECSZ(400 400)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K810.WAITHIST)                                        
