//BP13D411 JOB (BP13P),'BP13D411',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================*           
//* OBJECTIVE : THIS JOB PROCESSES THE IBG FILE FROM CPFB.          *           
//*             FILE IS PASSED TO SOC VIA RESALE SYSTEM AND SMS.    *           
//*             IF HBL1 FORM IS USED - RESALE SYSTEM                *           
//*             IF HBL2 FORM IS USED - SMS                          *           
//*                                                                 *           
//* DEPENDENCY: DAILY RUN AFTER BB24D125.                           *           
//*-----------------------------------------------------------------*           
//* CHG REF   DATE        BY   DESCRIPTION                          *           
//* ========  ==========  ==== ===========                          *           
//* BP132291  15/03/2003  CLT1 BANK ORIGINATION JOB                 *           
//* BP132341  26/05/2003  CLT1 CATER FOR HBL2 INTERFACE WITH SMS    *           
//* BP132347  26/06/2003  LSB1 ADD SY02F001, BP13F121, BP13F120     *           
//*                            TO BP13C348, BP13C354                *           
//* BP132398  08/09/2003  MCC  ADD STEP6A                           *           
//* BP132526  18/06/2004  SK   CHANGE BP13K671 LENGTH TO 3000       *           
//*           21/06/2004  SK   INCLUDE BP13C328                     *           
//* BP132707  22/06/2005  JF4  SEND EMAIL FOR LUMPSUM NOT TALLY CASE*           
//* BP138865  28/10/2021  KR13 STOP PRINTING L348,L328,L354 & L335. *           
//*=================================================================*           
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETENT               *           
//* PRT01 : CLASS = 2                                               *           
//*-----------------------------------------------------------------*           
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//*  BACKUP BP13K671 BEFORE RUN                                       *         
//*-------------------------------------------------------------------*         
//STEP01 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT     DD DSN=BP13.K671.BO.FIN,DISP=SHR                                    
//OUTPUT    DD DSN=BP13.F671.BO.FIN.BFDAILY(+1),DISP=(NEW,CATLG),               
//          SPACE=(CYL,(20,10)),                                                
//          DCB=(BP13.GDG,BLKSIZE=0,LRECL=3000,RECFM=FB)                        
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                         
//*-------------------------------------------------------------------*         
//*      PROCESS HBL1 RECORDS                                         *         
//*-------------------------------------------------------------------*         
//* UPDATE AMT PAID FROM CPF IBG FILE (BY PASS SUB-TRANSFER CASE)     *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=BP13C348,COND=(0,NE)                                        
//BB24F04A DD DSN=BB24.F04A.IBGCPF.SOC,DISP=SHR                                 
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13F121 DD DSN=BP13.F121.BANKIBG,DISP=MOD                                    
//BP13F120 DD DSN=BP13.F121.BANKIBG.NEXTMTH,DISP=MOD                            
//BP13L348 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE AMT PAID FROM CPF IBG FILE (SUB-TRANSFER CASE)             *         
//*-------------------------------------------------------------------*         
//STEP02A  EXEC PGM=BP13C328,COND=(0,NE)                                        
//BB24F04A DD DSN=BB24.F04A.IBGCPF.SOC,DISP=SHR                                 
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13F121 DD DSN=BP13.F121.BANKIBG,DISP=MOD                                    
//BP13F120 DD DSN=BP13.F121.BANKIBG.NEXTMTH,DISP=MOD                            
//BP13L328 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP BB24.F04A.IBGCPF.SOC TO DAILY BKUP                         *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BB24.F04A.IBGCPF.SOC,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.BB24.F04A.IBGCPF.DBKUP(+1),DISP=(NEW,CATLG),             
//         SPACE=(CYL,(2,1)),                                                   
//         DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP BB24.F04A.IBGCPF.SOC TO MTHLY BKUP                         *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BB24.F04A.IBGCPF.SOC,DISP=SHR                                 
//OUTPUT1  DD DSN=BP13.BB24.F04A.IBGCPF.MTH,DISP=MOD                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* CLEAR BB24F04A FOR NEXT DAY'S RUN                                 *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BB24.F04A.IBGCPF.SOC,DISP=SHR                                 
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//*      PROCESS HBL2 RECORDS                                         *         
//*-------------------------------------------------------------------*         
//*-------------------------------------------------------------------*         
//* UPDATE AMT PAID FROM CPF IBG FILE - HBL2                          *         
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=BP13C354,COND=(0,NE)                                        
//AB03F845 DD DSN=AB03.F845.SALES,DISP=SHR                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13F121 DD DSN=BP13.F121.BANKIBG,DISP=MOD                                    
//BP13F120 DD DSN=BP13.F121.BANKIBG.NEXTMTH,DISP=MOD                            
//BP13F354 DD DSN=&&BP13F354,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(5,2),RLSE),                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=32000)                             
//BP13L354 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE AMT PAID FROM CPF IBG FILE - FOR FS HBL2 CASE              *         
//*-------------------------------------------------------------------*         
//STEP6A   EXEC PGM=BP13C335,COND=(0,NE)                                        
//AB03F845 DD DSN=AB03.F845.SALES,DISP=SHR                                      
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13F121 DD DSN=BP13.F121.BANKIBG,DISP=MOD                                    
//BP13F120 DD DSN=BP13.F121.BANKIBG.NEXTMTH,DISP=MOD                            
//BP13L335 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* BACKUP AB03.F845.SALES TO DAILY BKUP                              *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AB03.F845.SALES,DISP=SHR                                      
//OUTPUT1  DD DSN=BP13.AB03.F845.SALES.DBKUP(+1),DISP=(NEW,CATLG),              
//         SPACE=(CYL,(2,1)),                                                   
//         DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP AB03.F845.SALES TO MTHLY BKUP                              *         
//*-------------------------------------------------------------------*         
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AB03.F845.SALES,DISP=SHR                                      
//OUTPUT1  DD DSN=BP13.AB03.F845.SALES.MTH,DISP=MOD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* CLEAR AB03F845 FOR NEXT DAY'S RUN                                 *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=AB03.F845.SALES,DISP=SHR                                      
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//*  BACKUP BP13K671 BEFORE RUN                                       *         
//*-------------------------------------------------------------------*         
//STEP10 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT     DD DSN=BP13.K671.BO.FIN,DISP=SHR                                    
//OUTPUT    DD DSN=BP13.F671.BO.FIN.AFDAILY(+1),DISP=(NEW,CATLG),               
//          SPACE=(CYL,(20,10)),                                                
//          DCB=(BP13.GDG,BLKSIZE=0,LRECL=3000,RECFM=FB)                        
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//*  TO SORT BP13F354 BY REGN                                         *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F354,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&P13F354A,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(5,2),RLSE),                                
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=32000)                             
//SYSIN   DD *                                                                  
          SORT FIELDS=(1,8,A),FORMAT=CH                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//*  TO CREATE EMAIL FILE                                             *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC  PGM=BP13C417,COND=(0,NE)                                       
//BP13F354 DD DSN=&&P13F354A,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13MAIL DD DSN=BP13.MAILOUT.C417,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                             *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.C417,DISP=SHR                                    
/*                                                                              
//*-------------------------------------------------------------------*         
//*   END OF BP13D411                                                 *         
//*-------------------------------------------------------------------*         
