//BP13D521 JOB (BP13P),'BP13D521',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//     NOTIFY=CSD0071                                                           
//JOBLIB    DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*==================================================================           
//*                     D A I L Y   J O B                                       
//*==================================================================           
//*1. UPDATE CDB TABLE : ADD ROLE, END ROLE,UPDATE/DELETE PERSONAL INFO         
//*2. CREATE APPLN, CO-APPLN TO SPIN                                            
//*--------------------------------------------------------------------         
//* CHG-NO   BY    ON      - DESCRIPTION                                        
//*--------------------------------------------------------------------         
//* BP130850 LSB  20011107 - ADD OCCUPIER'S PERSONAL INFO. INTO CDB             
//*                          AND PASS THE END OF ROW TO CDB                     
//* BP132283 JF4  20020114 - TO CATER FOR 'AH' CASES IN STEPS 11 AND 12         
//* BP132546 YCH  11062004 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)              
//* BP133177 ED1  20071114 - ADD VERIFY BEFORE RUN                              
//* BP133285 LSB1 20080514 - C915 INPUT BP13F310                                
//* BP133494 IL5  20081218 - INCLUDE BE01K030 FOR UEN IMPLM                     
//* BP133494 CCC5 20081218 - UPDATE DISP FOR BE01K030 FROM SHR TO OLD           
//* BP133494 IL5  20090120 - REMOVE BE01K030 FOR CDB UEN PH2 IMPL               
//* BP133858 PCL3 20100723 - REMOVE PGM BP13C915 (STEP13)                       
//* BP134481 CCC5 20120420 - CHANGE DISP=MOD TO DISP=OLD FOR P13F820A           
//* BP135171 RJE1 20140211 - TO CATER FOR DB2 UPGRADE                           
//* BP135448 LSB1 20140820 - DO NOT PRINT L986, L970 REPORT                     
//*=================================================================            
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*-----------------------------------------------------------------            
//STEPA    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*********************************************************************         
//*  TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                            
//*  PRT01 : CLASS = M, COPIES = 1 ** (SALES - AGREEMENT TEAM)                  
//*********************************************************************         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALST1A CP-1',END;                                    
1$DJDE$ JDE=BP13S,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALST1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* INCLUDE 'AR' - ADD CDB RECORDS                                              
//* INCLUDE 'AM' - ADD MARRIAGE RECORD                                          
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F915.CDBTRANS,DISP=SHR                                   
//SORTOUT  DD DSN=&&F915TRN1,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=18400,LRECL=800,RECFM=FB),                           
//            SPACE=(CYL,(5,5),RLSE)                                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(3,25,A,1,2,D),FORMAT=CH                                        
    INCLUDE COND=(1,2,CH,EQ,C'AR',OR,                                           
                  1,2,CH,EQ,C'AM')                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* ADD 'AR' / 'AM' CASES TO CDB BASED ON SOC-TRANSACTION FILE FROM             
//* ONLINE/BATCH UPDATE                                                         
//*--------------------------------------------------------------------         
//STEP02  EXEC   PGM=IKJEFT01,COND=(0,NE),DYNAMNBR=20                           
//*=================================================================*           
//*CALLING SUBROUTINE BE01C808 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F003 DD DSN=BE01.F003.CUSTUPD.LOGB.BP13,DISP=OLD                          
//BE01F903 DD DSN=BE01.F903.INVUPD.BP13,DISP=OLD                                
//BE01F400 DD DSN=BE01.F400.SENDID.NEWID.BP13,DISP=OLD                          
//*=================================================================*           
//*CALLING SUBROUTINE BE01C809 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F004 DD DSN=BE01.F004.MRGUPD.LOGB.BP13,DISP=OLD                           
//BE01F904 DD DSN=BE01.F904.INVMRG.BP13,DISP=OLD                                
//BE01F401 DD DSN=BE01.F401.SENDID.MRG.BP13,DISP=OLD                            
//BE01F620 DD DSN=BE01.F620.SRCUPD.LOG.BP13,DISP=OLD                            
//*=================================================================*           
//BP13F915 DD DSN=&&F915TRN1,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BE01KMSG DD DSN=BE01.KMSG.ONLINE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F820 DD DSN=BP13.F820.OCCUP.CDBTRANS,DISP=OLD                             
//P13F915A DD DSN=BP13.F915.CDBTRANS.INVALID,DISP=OLD                           
//P13F915B DD DSN=BP13.F915.CDBTRANS.ALL,DISP=OLD                               
//P13L986A DD SYSOUT=*                                                          
//BP13L986 DD SYSOUT=*                                                          
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C986) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* INCLUDE 'UA' - UPDATE CDB RECORDS                                           
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F915.CDBTRANS,DISP=SHR                                   
//SORTOUT  DD DSN=&&F915TRN2,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=18400,LRECL=800,RECFM=FB),                           
//            SPACE=(CYL,(5,5),RLSE)                                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(3,25,A,1,2,D),FORMAT=CH                                        
    INCLUDE COND=(1,2,CH,EQ,C'UA')                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* UPDATE 'UA' CASES TO CDB BASED ON SOC-TRANSACTION FILE FROM                 
//* ONLINE/BATCH UPDATE                                                         
//*--------------------------------------------------------------------         
//STEP04  EXEC   PGM=IKJEFT01,COND=(0,NE),DYNAMNBR=20                           
//*=================================================================*           
//*CALLING SUBROUTINE BE01C808 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F003 DD DSN=BE01.F003.CUSTUPD.LOGB.BP13,DISP=MOD                          
//BE01F903 DD DSN=BE01.F903.INVUPD.BP13,DISP=MOD                                
//BE01F400 DD DSN=BE01.F400.SENDID.NEWID.BP13,DISP=MOD                          
//*=================================================================*           
//*CALLING SUBROUTINE BE01C809 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F004 DD DSN=BE01.F004.MRGUPD.LOGB.BP13,DISP=MOD                           
//BE01F904 DD DSN=BE01.F904.INVMRG.BP13,DISP=MOD                                
//BE01F401 DD DSN=BE01.F401.SENDID.MRG.BP13,DISP=MOD                            
//BE01F620 DD DSN=BE01.F620.SRCUPD.LOG.BP13,DISP=MOD                            
//*=================================================================*           
//BP13F915 DD DSN=&&F915TRN2,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BE01KMSG DD DSN=BE01.KMSG.ONLINE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F820 DD DSN=BP13.F820.OCCUP.CDBTRANS,DISP=MOD                             
//P13F915A DD DSN=BP13.F915.CDBTRANS.INVALID,DISP=MOD                           
//P13F915B DD DSN=BP13.F915.CDBTRANS.ALL,DISP=MOD                               
//P13L986A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//BP13L986 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C986) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-------------------------------------------------------------------*         
//* INCLUDE 'DE' - DELETE CDB RECORDS                                           
//* INCLUDE 'TE' - TERMINATE CDB RECORDS                                        
//*-------------------------------------------------------------------*         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F915.CDBTRANS,DISP=SHR                                   
//SORTOUT  DD DSN=&&F915TRN3,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=18400,LRECL=800,RECFM=FB),                           
//            SPACE=(CYL,(5,5),RLSE)                                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(3,25,A,1,2,D),FORMAT=CH                                        
    INCLUDE COND=(1,2,CH,EQ,C'DE',OR,                                           
                  1,2,CH,EQ,C'TE')                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* DELETE 'DE'/ END OF ROW 'TE' CASES FROM CDB BASED ON SOC-TRANSACTION        
//* FILE                                                                        
//*--------------------------------------------------------------------         
//STEP06  EXEC   PGM=IKJEFT01,COND=(0,NE),DYNAMNBR=20                           
//*=================================================================*           
//*CALLING SUBROUTINE BE01C808 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F003 DD DSN=BE01.F003.CUSTUPD.LOGB.BP13,DISP=MOD                          
//BE01F903 DD DSN=BE01.F903.INVUPD.BP13,DISP=MOD                                
//BE01F400 DD DSN=BE01.F400.SENDID.NEWID.BP13,DISP=MOD                          
//*=================================================================*           
//*CALLING SUBROUTINE BE01C809 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F004 DD DSN=BE01.F004.MRGUPD.LOGB.BP13,DISP=MOD                           
//BE01F904 DD DSN=BE01.F904.INVMRG.BP13,DISP=MOD                                
//BE01F401 DD DSN=BE01.F401.SENDID.MRG.BP13,DISP=MOD                            
//BE01F620 DD DSN=BE01.F620.SRCUPD.LOG.BP13,DISP=MOD                            
//*=================================================================*           
//BP13F915 DD DSN=&&F915TRN3,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BE01KMSG DD DSN=BE01.KMSG.ONLINE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F820 DD DSN=BP13.F820.OCCUP.CDBTRANS,DISP=MOD                             
//P13F915A DD DSN=BP13.F915.CDBTRANS.INVALID,DISP=MOD                           
//P13F915B DD DSN=BP13.F915.CDBTRANS.ALL,DISP=MOD                               
//P13L986A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//BP13L986 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C986) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* EXTRACT THE "CR" CASES FROM BP13.K915.CDBTRANS FILE  WHICH IS               
//* UPDATED IN THE ONLINE PROGRAM BP13B561.                                     
//*--------------------------------------------------------------------         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K915.CDBTRANS,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F915TRN4,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=18400,LRECL=800,RECFM=FB),                           
//            SPACE=(CYL,(5,5),RLSE)                                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(3,25,A,1,2,A),FORMAT=CH                                        
    INCLUDE COND=(1,2,CH,EQ,C'CR')                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* IF CUSTOMER ID ALREADY EXISTS IN CDB , DELETE OLD ROLE AND ADD THE          
//* NEW ROLE IN CDB.                                                            
//*--------------------------------------------------------------------         
//STEP08  EXEC   PGM=IKJEFT01,COND=(0,NE),DYNAMNBR=20                           
//*=================================================================*           
//*CALLING SUBROUTINE BE01C808 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F003 DD DSN=BE01.F003.CUSTUPD.LOGB.BP13,DISP=MOD                          
//BE01F903 DD DSN=BE01.F903.INVUPD.BP13,DISP=MOD                                
//BE01F400 DD DSN=BE01.F400.SENDID.NEWID.BP13,DISP=MOD                          
//*=================================================================*           
//*CALLING SUBROUTINE BE01C809 TO ADD THE FOLLOWING FLAT FILES                  
//*=================================================================*           
//BE01F004 DD DSN=BE01.F004.MRGUPD.LOGB.BP13,DISP=MOD                           
//BE01F904 DD DSN=BE01.F904.INVMRG.BP13,DISP=MOD                                
//BE01F401 DD DSN=BE01.F401.SENDID.MRG.BP13,DISP=MOD                            
//BE01F620 DD DSN=BE01.F620.SRCUPD.LOG.BP13,DISP=MOD                            
//*=================================================================*           
//BP13F915 DD DSN=&&F915TRN4,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BE01KMSG DD DSN=BE01.KMSG.ONLINE,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F820 DD DSN=BP13.F820.OCCUP.CDBTRANS,DISP=MOD                             
//P13F915A DD DSN=BP13.F915.CDBTRANS.INVALID,DISP=MOD                           
//P13F915B DD DSN=BP13.F915.CDBTRANS.ALL,DISP=MOD                               
//P13L970A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//BP13L970 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C970) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* UPDATE THE CSTMR ID INTO BP13K820 FROM BP13F820                *            
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=BP13C991,COND=(0,NE)                                        
//BP13F820 DD DSN=BP13.F820.OCCUP.CDBTRANS,DISP=SHR                             
//BP13F915 DD DSN=BP13.F915.CDBTRANS.INVALID,DISP=SHR                           
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F820A DD DSN=BP13.F820.OCCUP.CSTID,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* TAKE THE BACK UP OF BP13F915 FOR SUCCESSFULLY COMMITTEDCASES IN CDB         
//*--------------------------------------------------------------------         
//STEP10   EXEC PGM=BP13C992,COND=(0,NE)                                        
//P13F915A DD DSN=BP13.F915.CDBTRANS.INVALID,DISP=SHR                           
//P13F915B DD DSN=BP13.F915.CDBTRANS.ALL,DISP=SHR                               
//BP13F915 DD DSN=BP13.F915.CDBTRANS.CUSTID,DISP=OLD                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* EXTRACT THE "AR", "AH" CASES FROM BP13.K915.CDBTRANS FILE  WHICH IS         
//* UPDATED IN THE ONLINE PROGRAM BP13B561.                                     
//* BACKUP BP13.K915.CDBTRANS TO BP13.F915.CDBTRANS.DAILY                       
//*--------------------------------------------------------------------         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K915.CDBTRANS,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=BP13.F915.CDBTRANS.DAILY,DISP=OLD                             
//SYSIN    DD *                                                                 
    SORT FIELDS=(3,25,A,1,2,A),FORMAT=CH                                        
    INCLUDE COND=(1,2,CH,EQ,C'AR',OR,                                           
                  1,2,CH,EQ,C'AH')                                              
/*                                                                              
//*--------------------------------------------------------------------         
//* BACKUP BP13.F915.CDBTRANS TO BP13.F915.CDBTRANS.ACCUM                       
//*--------------------------------------------------------------------         
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F915.CDBTRANS,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F915.CDBTRANS.DAILY,DISP=MOD                             
//INPUT2   DD DSN=BP13.F915.CDBTRANS.CUSTID,DISP=SHR                            
//OUTPUT2  DD DSN=BP13.F915.CDBTRANS.ACCUM,DISP=MOD                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*--------------------------------------------------------------------         
//* MOVE BLANK SPACES   TO  BP13.F915.CDBTRANS                                  
//*--------------------------------------------------------------------         
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.F915.CDBTRANS,DISP=SHR                                   
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
//*--------------------------------------------------------------------         
//* DEFINE BP13K915 FILE                                                        
//*--------------------------------------------------------------------         
//STEP16    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR800,DISP=SHR                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD  *                                                               
             DEL 'BP13.K915.CDBTRANS' CL PURGE                                  
             DEF CLUSTER                              -                         
               (NAME(BP13.K915.CDBTRANS)              -                         
               CYL(5 5)                             -                           
               UNIQUE                                 -                         
               STORCLAS(PRODRLS)                      -                         
               LOG(NONE)                              -                         
               SHR(2 3))                              -                         
               DATA                                   -                         
               (NAME(BP13.K915.CDBTRANS.DATA)         -                         
               KEYS(37 0)                             -                         
               RECSZ(800 800)                         -                         
               CISZ(4096)                             -                         
               FSPC(10 10))                           -                         
               INDEX                                  -                         
               (NAME(BP13.K915.CDBTRANS.INDEX)        -                         
               CISZ(4096))                                                      
           IF MAXCC = 0  THEN                         -                         
               REPRO IFILE(INPUT1)                    -                         
               ODS(BP13.K915.CDBTRANS)                -                         
               REUSE                                                            
//*--------------------------------------------------------------------         
//* PRINT ERROR LOG                                                             
//*--------------------------------------------------------------------         
//STEP17    EXEC SAS,COND=(0,NE)                                                
//BE01F903  DD DSN=BE01.F903.INVUPD.BP13,DISP=SHR                               
//BP13LAR   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13LNAR  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S811),DISP=SHR                            
