//BP13DP02 JOB (BP13P),'PRECHK',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),              
//      NOTIFY=CSD0071,USER=BP13SURP,SCHENV=HICPU                               
//*=====================================================================        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=====================================================================        
//*  BATCH JOB TRIGGER ONLINE PROGRAM (RUN AFTER BP13D500 & BP13DP01)           
//*---------------------------------------------------------------------        
//*  CR NO   OIC   DATE    DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP135279 YCH2 24032014 INCLUDE BACKUP AND CHECK ON BLANK HHTYPE             
//*---------------------------------------------------------------------        
//*  IF COND CODE 99 TO CHECK L9CI LOG BECAUSE PRE-E CHK NOT COMPLETE           
//*=====================================================================        
//PS010    EXEC PGM=BP13C9CI,COND=(0,NE),PARM='CI1TORP,BP13SURP'                
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//         DD DSN=CICS.ALIAS.SDFHEXCI,DISP=SHR                                  
//BP13F730 DD DSN=BP13.F730.REQPREE.DAY,DISP=SHR                                
//BP13L9CI DD DSN=BP13.L9CI.ERRLOG,DISP=OLD                                     
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* BACKUP DETERMINED HOUSEHOLD AND                                             
//* FLAG 97 IF HOUSEHOLD TYPE BLANK                                             
//* FLAG 98 IF FOUND IN F730 NOT IN K730                                        
//*---------------------------------------------------------------------        
//PS0020   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,80))                                   
//BP13F730 DD DSN=BP13.F730.REQPREE.DAY,DISP=SHR                                
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//P13F730O DD DSN=BP13.F730.REQPREE.DAY.HHTY,DISP=OLD                           
//P13F730E DD DSN=BP13.F730.REQPREE.DAY.HHBLANK,DISP=OLD                        
//P13F730F DD DSN=BP13.F730.REQPREE.DAY.F730NFND,DISP=OLD                       
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S692),DISP=SHR                             
//*-------------------------------------------------------------------*         
//* ACCUMULATE DAILY FILES                                            *         
//*-------------------------------------------------------------------*         
//PS0030    EXEC PGM=IDCAMS                                                     
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1  DD DSN=BP13.F730.REQPREE.DAY.HHTY,DISP=SHR                            
//OUTPUT1 DD DSN=BP13.F730.REQPREE.ACCUM.HHTY,DISP=MOD                          
//INPUT2  DD DSN=BP13.F730.REQPREE.DAY.HHBLANK,DISP=SHR                         
//OUTPUT2 DD DSN=BP13.F730.REQPREE.ACCUM.HHBLANK,DISP=MOD                       
//INPUT3  DD DSN=BP13.F730.REQPREE.DAY.F730NFND,DISP=SHR                        
//OUTPUT3 DD DSN=BP13.F730.REQPREE.ACCUM.F730NFND,DISP=MOD                      
//SYSIN    DD *                                                                 
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
      REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                    
      REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                    
