//BP13AY0E JOB (BP13P),'BP13S595',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//* GENERATE UNIQUE APPLICATION FROM YEAR 2009                                  
//* NOTE:                                                                       
//* JOB TO DETERMINE NEW BTO APPLICATION, DROP MULTIPLE APPLICATION TAKE        
//* LASTEST APPLICATION, DROP FOUND IN SMS, RESALE APPLICATION.                 
//*=================================================================            
//* CHG-NO   BY    ON   - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP133961 LSB 030810 - NEW JCL                                               
//* BP133921 LSB 090910 - EXPAND BP13F55A                                       
//* BP134247 LSB 100711 - ADD PPOS, EC, K893 MATCHING, EXPAND F55A              
//* BP134304 LSB 300711 - CHG K813 IN BP13CB95                                  
//* BP134931 IMC 170713 - ADD BP13F730 OUTPUT FROM BP13CB95                     
//* BP135089 IMC 011013 - ADD NEW BP13L55B OUTPUT FOR BP13CY67                  
//* BP135251 LSB 120514 - CHANGE BP13K816 TO BP13K813, CY67 TO CY5D             
//* BP135338 LSB 19062014 - ADD BP13F55Y, F55Z                                  
//* BP135615 LSB 26122014 - EXPAND BP13F557                                     
//* BP135921 LSB 01102015 - ADD BP13K730 TO BP13CD86                            
//* BP137358 FNP 30052018 - EXPAND BP13F55A FROM 800 TO 1200                    
//* BP137872 KR13 15112019 - CHANGE CY67 TO CY5D                                
//*=================================================================            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = YE                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YE')                                               
//*------------------------------------------------------------------           
//* INCLUDE BALLOT-QTR GE 2009, BTO                                             
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&BP13F595,DISP=(,PASS),                                     
//             UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                            
//             DCB=(RECFM=FB,LRECL=500)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  INCLUDE COND=(1,1,CH,NE,C' ',AND,                                             
           260,1,CH,NE,C'C',AND,                                                
           334,6,CH,GE,C'200901',AND,                                           
           376,3,CH,EQ,C'BTO')                                                  
//*---------------------------------------------------------------------        
//* SORT BP13F730 FOR LATEST BTO LAUNCH                                         
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F595,DISP=(MOD,PASS),                                   
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(250,100),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(376,3,CH,EQ,C'BTO')                                             
//*---------------------------------------------------------------------        
//* SORT BP13F730 FOR LATEST BTO LAUNCH ( FROM INTERNET FILE)                   
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ.SBF,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&BP13F595,DISP=(MOD,PASS),                                   
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(250,100),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(376,3,CH,EQ,C'BTO')                                             
//*-----------------------------------------------------------------            
//* MATCH F205 TO GET QTR AS REQUESTED IN SOCY                                  
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13CY64,COND=(0,NE)                                        
//BP13F595 DD DSN=&&BP13F595,DISP=(OLD,PASS)                                    
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//P13F595A DD DSN=&&F595NT,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//P13F595B DD DSN=&&F595BALT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                              
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* OMIT CANCELLED CASES, BTO MATURE ESTATE (BM)                                
//* NO RANDOM-NO, UPGRADER                                                      
//*-----------------------------------------------------------------            
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595NT,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=BP13.F500.AY0E,DISP=OLD                                       
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    SUM FIELDS=NONE                                                             
//*---------------------------------------------------------------------        
//* SORT BP13F595 BY NRIC1/DTE-BALLOT DECENDING ORDER                           
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F595NT,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&F595CY70,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(250,100),RLSE)                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(41,9,A,334,6,D),FORMAT=CH                                        
//*-----------------------------------------------------------------            
//* FOUND NRIC WITH MULTIPLE APPLICATION, GET THE LATEST APPLN                  
//*-----------------------------------------------------------------            
//STEP08   EXEC  PGM=BP13CY70,COND=(0,NE)                                       
//BP13F595 DD  DSN=&&F595CY70,DISP=(OLD,PASS)                                   
//P13F595A DD  DSN=&&F595CY68,DISP=(,PASS),                                     
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                                  
//        SPACE=(CYL,(250,100),RLSE)                                            
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* CHECK BOOKED FLAT IN SOC MASTER/HISTORY                             00000280
//*---------------------------------------------------------------------00000290
//STEP09   EXEC  PGM=BP13CB78,COND=(0,NE)                               00000300
//BP13F595 DD  DSN=&&F595CY68,DISP=(OLD,PASS)                           00000310
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                            00000310
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K821 DD  DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                      00000310
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                            00000310
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K895 DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                    00000310
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K891 DD  DSN=BP13.K895.OCCUP.HISTORY.PATH1,DISP=SHR,              00000310
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K893 DD  DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                    00000310
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595F DD  DSN=&&F595FBK,DISP=(,PASS),                              00000310
//             UNIT=SYSDA,                                              00034406
//             DCB=(RECFM=FB,LRECL=500),                                00034406
//             SPACE=(CYL,(50,10),RLSE)                                 00034506
//P13F595N DD  DSN=&&F595NOTB,DISP=(,PASS),                             00000310
//             UNIT=SYSDA,                                              00034406
//             DCB=(RECFM=FB,LRECL=500),                                00034406
//             SPACE=(CYL,(120,10),RLSE)                                00034506
//SYSPRINT DD  SYSOUT=*                                                 00000470
//SYSDBG   DD  SYSOUT=*                                                 00000470
//SYSDBOUT DD  SYSOUT=*                                                 00000480
//SYSOUT   DD  SYSOUT=*                                                 00000480
//*--------------------------------------------------------------------         
//* READ BB24K020 TO CHECK RESALE CASES                                         
//* OUTPUT FOUND AND NOT FOUND FILE                                             
//*--------------------------------------------------------------------         
//STEP10   EXEC  PGM=BP13CY68,COND=(0,NE)                                       
//BP13F595 DD DSN=&&F595NOTB,DISP=(OLD,PASS)                                    
//BB24K010 DD DSN=BB24.K010.MASTER,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K020 DD DSN=BB24.K020.OCCUPIER,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K021 DD DSN=BB24.K020.OCCUPIER.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F557 DD DSN=&&F557,DISP=(,PASS),                                          
//         DCB=(RECFM=FB,LRECL=400),                                            
//         SPACE=(CYL,(100,50),RLSE)                                            
//P13F595F DD DSN=&&F595C68F,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(20,8),RLSE)                                              
//P13F595N DD DSN=&&F595C68N,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(80,20),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* READ AB03K080,AB03K030 TO BOUGHT FLAT AFTER NEW BE/BTO APPLICATION          
//* OUTPUT FOUND AND NOT FOUND FILE                                             
//*--------------------------------------------------------------------         
//STEP11   EXEC  PGM=BP13CY69,COND=(0,NE)                                       
//BP13F595 DD DSN=&&F595C68N,DISP=(OLD,PASS)                                    
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F557 DD DSN=&&F557A,DISP=(,PASS),                                         
//         UNIT=SYSDA,                                                  00034406
//         DCB=(RECFM=FB,LRECL=400),                                            
//         SPACE=(CYL,(100,50),RLSE)                                            
//P13F595F DD DSN=&&F595C69F,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                  00034406
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(20,8),RLSE)                                              
//P13F595N DD DSN=&&F595C69N,DISP=(,PASS),                                      
//         UNIT=SYSDA,                                                  00034406
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(80,20),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------00031706
//* CHECK FOUND BOUGHT EC                                               00031706
//*---------------------------------------------------------------------00031706
//STEP12    EXEC PGM=BP13CD87,COND=(0,NE)                               00031806
//BP13F595  DD DSN=&&F595C69N,DISP=(OLD,PASS)                           00031906
//BP18K310  DD DSN=BP18.K310.OCCUPIER,DISP=SHR,                         00032006
//             AMP=('BUFND=4','BUFNI=8')                                00032106
//BP18K311  DD DSN=BP18.K310.OCCUPIER.PATH1,DISP=SHR,                   00032206
//             AMP=('BUFND=4','BUFNI=8')                                00032306
//BP18K300  DD DSN=BP18.K300.MASTER,DISP=SHR,                           00032406
//             AMP=('BUFND=4','BUFNI=8')                                00032506
//BP18K440  DD DSN=BP18.K440.APLCTN.HIST.TP,DISP=SHR,                   00032406
//             AMP=('BUFND=4','BUFNI=8')                                00032506
//BP18K450  DD DSN=BP18.K450.OCPR.HIST.TP,DISP=SHR,                     00032006
//             AMP=('BUFND=4','BUFNI=8')                                00032106
//BP18K451  DD DSN=BP18.K450.OCPR.HIST.TP.PATH1,DISP=SHR,               00032206
//             AMP=('BUFND=4','BUFNI=8')                                00032306
//P13F595F  DD DSN=&&F595ECFD,DISP=(,PASS),                             00032606
//             UNIT=SYSDA,                                              00034406
//             SPACE=(CYL,(20,10),RLSE),                                00032706
//             DCB=(RECFM=FB,LRECL=500)                                 00032806
//P13F595N  DD DSN=&&F595ECNO,DISP=(,PASS),                             00032906
//             UNIT=SYSDA,                                              00034406
//             SPACE=(CYL,(80,30),RLSE),                                00033006
//             DCB=(RECFM=FB,LRECL=500)                                 00033106
//SYSPRINT  DD SYSOUT=*                                                 00033206
//SYSDBG    DD SYSOUT=*                                                 00033306
//SYSDBOUT  DD SYSOUT=*                                                 00033406
//SYSOUT    DD SYSOUT=*                                                 00033506
//*-------------------------------------------------------------------* 00033606
//* MATCH PPOS BYPASS PPOS CODE                                         00033606
//*-------------------------------------------------------------------* 00033606
//STEP13   EXEC PGM=BP13CD86,COND=(0,NE)                                00033706
//BP13F595  DD DSN=&&F595ECNO,DISP=(OLD,PASS)                           00033806
//BR10K010 DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                           00033906
//            AMP=('BUFND=4','BUFNI=8')                                 00034006
//BR10K080 DD DSN=BR10.K080.PTEPPTY.HIST,DISP=SHR,                      00034106
//            AMP=('BUFND=4','BUFNI=8')                                 00034206
//BP13K730 DD DUMMY                                                     00034106
//P13F595F DD DSN=&&F595PPOF,DISP=(,PASS),                              00034306
//            UNIT=SYSDA,                                               00034406
//            DCB=(RECFM=FB,LRECL=500),                                 00034406
//            SPACE=(CYL,(20,10),RLSE)                                  00034506
//P13F595N DD DSN=BP13.F595.AY0E,DISP=OLD                               00034606
//SYSOUT   DD SYSOUT=*                                                  00034906
//SYSTSPRT DD SYSOUT=*                                                  00035006
//SYSPRINT DD SYSOUT=*                                                  00035106
//SYSDBG   DD SYSOUT=*                                                  00035206
//SYSDBOUT DD SYSOUT=*                                                  00035306
//*-------------------------------------------------------------------*         
//* PRINT REPORT                                                                
//*-------------------------------------------------------------------*         
//STEP15   EXEC  SAS,COND=(0,NE)                                                
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(260,20))                                   
//BP13F595 DD DSN=BP13.F595.AY0E,DISP=SHR                                       
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13L083 DD DSN=BP13.L083.BP13S083,DISP=OLD                                   
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S083),DISP=SHR                             
//*-----------------------------------------------------------------            
//* SORT BY REGN ON REQUEST WITH NEW BTO APPLICATION ( COUNT 1)                 
//* DROP MULTIPLE BTO APPLICATION                                               
//*-----------------------------------------------------------------            
//STEP16   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F595.AY0E,DISP=SHR                                      
//SORTOUT  DD  DSN=&&F595CB95,DISP=(,PASS),                                     
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(100,50),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=500)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* FOR CANCEL CASES, OUTPUT TO BP13T.F557.YEAR.CANCEL                          
//* FOR KEY-ISSUED CASES, OUTPUT TO BP13T.F557.YEAR.TP                          
//* FOR BOOKED CASES, OUTPUT TO BP13F558 TO GET SMS/RSL INFOR                   
//*-----------------------------------------------------------------            
//STEP17   EXEC  PGM=BP13CB95,COND=(0,NE)                                       
//BP13F730 DD  DSN=&&F595CB95,DISP=(OLD,PASS)                                   
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K060 DD  DSN=BP13.K060.CODETAB,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K813 DD  DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K825 DD  DSN=BP13.K825.REQOCCP,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K828 DD  DSN=BP13.K828.HISTOCCP,DISP=SHR,                                 
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR,                            
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR,                          
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR,                          
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR,                          
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR,                          
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K585 DD DSN=BP13.K585.HARDLUCK,DISP=SHR,                                  
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13K587 DD DSN=BP13.K587.HARDLUCK.HIST,DISP=SHR,                             
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13F55A DD  DSN=BP13.F55A.AY0E,DISP=OLD                                      
//BP13F55Y DD  DUMMY                                                            
//BP13F55Z DD  DUMMY                                                            
//P13F730A DD  DUMMY                                                            
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* SORT REGN-NO                                                                
//*---------------------------------------------------------------------        
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F55A.AY0E,DISP=SHR                                       
//SORTOUT  DD DSN=&&F55ACY5D,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1200),                                 
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* FORMAT AND ADD IN HEADER FOR MPU. NET BTO APPLICATION                       
//*-----------------------------------------------------------------            
//STEP19   EXEC PGM=BP13CY5D,COND=(0,NE)                                        
//BP13F55A DD DSN=&&F55ACY5D,DISP=(OLD,DELETE)                                  
//BP13L55A DD DSN=BP13.L55A.AY0E,DISP=OLD                                       
//BP13L55B DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT REGN-NO                                                                
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F55A.AY0E,DISP=SHR                                       
//SORTOUT  DD DSN=&&F55ACY81,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1200),                                 
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(23,9,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//*- TO READ UNSUCC ATTEMPT                                                     
//*-----------------------------------------------------------------            
//STEP21   EXEC PGM=BP13CY81,COND=(0,NE)                                        
//BP13F55A DD  DSN=&&F55ACY81,DISP=(OLD,PASS)                                   
//BP13K593 DD  DSN=BP13.K593.UNSUCCNT,DISP=SHR,                                 
//             AMP=('BUFND=8','BUFNI=4')                                        
//P13F55AA DD  DSN=BP13.F55A.AY0E.LATEST,DISP=OLD                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REGN-NO                                                                
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F55A.AY0E.LATEST,DISP=SHR                                
//SORTOUT  DD DSN=&&CY81CY5D,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=1200),                                 
//        SPACE=(CYL,(80,30),RLSE)                                              
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* FORMAT AND ADD IN HEADER FOR MPU.                                           
//*-----------------------------------------------------------------            
//STEP23   EXEC PGM=BP13CY5D,COND=(0,NE)                                        
//BP13F55A DD DSN=&&CY81CY5D,DISP=(OLD,DELETE)                                  
//BP13L55A DD DSN=BP13.L55A.AY0E.LATEST,DISP=OLD                                
//BP13L55B DD DUMMY                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
