//BP13A217 JOB (BP13P),'BP13',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*---------------------------------------------------------------------        
//* CHGE REQ   DATE      BY    DESCRIPTION                                      
//* --------   --------  ----  ------------                                     
//* BP130055   24/04/96  OCT4 ONLINE PROGRAM THAT CALLED THIS JCL WILL          
//*                           BE CHANGED FROM BP13B274 TO BP13B288.             
//* BP130418   15/10/98  LSB  Y2K CHANGES                                       
//* BP135127   08/11/13  ESA1 REPLACE BP13K275 WITH BP13K277                    
//*---------------------------------------------------------------------        
//**********************************************************************        
//*    SORT OUT RECORDS UPDATED THROUGH M274 PANEL                              
//**********************************************************************        
//STEP1    EXEC  SORT                                                           
//SORTIN   DD  DSN=BM06.K190.LOG,                                               
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BM06F190,                                                  
//             DISP=(NEW,PASS),                                                 
//             SPACE=(TRK,(5,5),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=650,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,16,A),FORMAT=CH                                               
   INCLUDE COND=(637,6,CH,EQ,C'B28800')                                         
   SUM FIELDS=NONE                                                              
/*                                                                              
//**********************************************************************        
//*    TO PRINT BM06K211 RECORDS WITH UPDATED SELLING PRICE                     
//**********************************************************************        
//STEP2    EXEC  PGM=BP13C261,COND=(0,NE)                                       
//BM06F190 DD  DSN=&&BM06F190,                                                  
//             DISP=(SHR,PASS)                                                  
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                            
//             DISP=SHR                                                         
//BM06K110 DD  DSN=BM06.K110.FLATINV,                                           
//             DISP=SHR                                                         
//BM06K111 DD  DSN=BM06.K110.FLATINV.PATH2,                                     
//             DISP=SHR                                                         
//P13L261A DD  SYSOUT=A,DEST=L434                                               
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//**********************************************************************        
//*    TO PRINT REPORT                                                          
//**********************************************************************        
//STEP3    EXEC  PGM=BP13C262,COND=(0,NE)                                       
//BP13K277 DD  DSN=BP13.K277.OCSCOST,                                           
//             DISP=SHR                                                         
//BM06F190 DD  DSN=&&BM06F190,                                                  
//             DISP=(SHR,DELETE)                                                
//BM06K510 DD  DSN=BM06.K510.ESTCDE,                                            
//             DISP=SHR                                                         
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,                                          
//             DISP=SHR                                                         
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//P13L262A DD  SYSOUT=A,DEST=L434                                               
//SYSOUT   DD  SYSOUT=*                                                         
//                                                                              
