//BP13D510 JOB (BP13P),'BP13D510',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*===================================================================*         
//*                                                                   *         
//* OBJECTIVE : PRINT LETTER ON REGN-FEEHHTY CHECK                    *         
//*             LOAD NEW REQUESTS TO SOC MASTER/OCCPUIER              *         
//*             CHECK FOR DUPLICATE NRICS                             *         
//*             BACKUP REQUEST/OCCUPIER FILES AND RE-DEFINE FILE      *         
//*             RESIDENT ADDRESS = MAILING ADDRESS                    *         
//*                                                                   *         
//*===================================================================*         
//* CHG REF  BY  DATE     DESCRIPTION                                           
//* -------- --- ------   -----------                                           
//* BP130233 LSB 970130   BP13C528 DO NOT PASS REC TO CFS FOR PRE-E             
//* BP130264 LSB 970315   DO NOT PRINT MULTIPLE REPORT BP13C858                 
//* BP130386 LSB 971017   PRINT ERROR ON MARITAL STATUS BP13L541                
//* BP130487 SSS 980507   CHG UNIT=3480 TO UNIT=CARTTO BP13D507                 
//* BP130598 LSB 981120   STORE BP13K558, BP13K510 FOR ENQ OPT 25               
//* BP130652 SRA 991016   EXPAND F520, K500 RECL FROM 300 TO 500                
//* BP130718 CLT 011999   E-FAST IMPLEMENTATION                                 
//*                       JOB NAME CHG FR BP13W103 TO BP13D508                  
//* BP130871 SSS 090600   LISTING FOR EAALSS                                    
//* BP130879 LSB 030700   ADD STEP TO VERIFY FILE                               
//* BP130749 SB  150800   INCL STEPS FOR ORSA-APPLICATIONS                      
//*                       BY PASS K510/K558 RECS BEFORE STEP19.                 
//* BP13D510 AKT 290800   EXPAND F558 RECL FROM 400 TO 600.                     
//* BP130749 SB  060900   BYPASS ORSA CASES FOR BP13C528                        
//* BP130749 SB  280900   ADD BP13K840 TO BP13C088                              
//* BP131064 CKK 150202   REPLACE STEP3A & 3B WITH 3C & 3D AFTER BE'02          
//* BP132154 LSB 070602   OMIT 'M' WIS WHEN DEFINE BP13K825                     
//* BP132200 CKK 111102   REPLACE STEP3A & 3B BACK FOR BE                       
//* BP132352 SK  260603   ADD BP13C145                                          
//* BP132432 MJ16211003   REMOVE PROCESSING OF NON BANK LOAN CASES              
//* BP132546 YCH 110604 - INCL STORCLAS(PRODRLS) & LOG(NONE)                    
//* BP132862 CKK 150606 - INCL BP13K648 IN BP13C528                             
//* BP133227 SSS 220108 - DEL 3 LISTINGS                                        
//* BP133527 YCH 310309 - INCLUDE UPDATE OF RESALE LEVY 'LN' OR 'LNS'           
//* BP133639 ZDD 080709 - INCLUDE BP13K595 ON BP13C145                          
//*                       INCLUDE OTHER ALTERNATE FILES OF BP13K595             
//*          ZDD 090809 - INCLUDE BP13K730 ON BP13C145                          
//* BP134024 ZDD 300910 - INCLUDE BP13K813 ON BP13C528                          
//* BP137994 SMP 271119 - REMOVE REPRO/REPLACE INTO BP13.K558.UPGOCCP           
//* BP138285 AM2 050520 - HARDCOPY REPORTS CONVERSION                           
//*              050620 - REMOVE DJDE STEPS                                     
//*===================================================================*         
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K800.APPLN,DISP=OLD                                      
//INPUT2   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//INPUT3   DD DSN=BP13.K840.APPLHIST,DISP=OLD                                   
//INPUT4   DD DSN=BP13.K530.ISSUENO,DISP=OLD                                    
//INPUT5   DD DSN=BP13.K022.WISOIC,DISP=OLD                                     
//INPUT6   DD DSN=BP13.K024.WISLAST,DISP=OLD                                    
//INPUT7   DD DSN=BP13.K500.PREREGN,DISP=OLD                                    
//INPUT8   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
//*-------------------------------------------------------------------*         
//* SORT WHERE RESALE STATUS = CL, CN, CP, CM                         *         
//*-------------------------------------------------------------------*         
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F558PAU,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(50,10),RLSE),                              
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
   INCLUDE COND=(112,2,CH,EQ,C'CL',OR,                                          
                 112,2,CH,EQ,C'CN',OR,                                          
                 112,2,CH,EQ,C'CM',OR,                                          
                 112,2,CH,EQ,C'CP',OR,                                          
                 112,2,CH,EQ,C'2L',OR,                                          
                 112,2,CH,EQ,C'2N',OR,                                          
                 112,2,CH,EQ,C'2P')                                             
   SUM FIELDS=NONE                                                              
//*-------------------------------------------------------------------*         
//* UPDATE ELIG-SCH=PAU TO BP13F500                                   *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=BP13C040,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558PAU,DISP=(OLD,DELETE)                                   
//BP13F520 DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BY REGISTRATION NUMBER                                                 
//*-------------------------------------------------------------------*         
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F500,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,3),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* OMIT COUNTER/MAILED (ORSA) APPLNS TO CREATE SOC MASTER, OCCUPIER            
//* FOR MATURE ESTATE BALLOTING                                                 
//*-------------------------------------------------------------------*         
//STEP3A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&F500OTHR,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,3),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=((372,1,CH,EQ,C'C',OR,372,1,CH,EQ,C'M',OR,                         
               372,1,CH,EQ,C'S'),OR,                                            
             (372,1,CH,EQ,C'I',AND,187,3,CH,NE,C'   '))                         
//*-------------------------------------------------------------------*         
//* SORT OUT COUNTER/MAILED (ORSA) APPLICATION TO UPDATE PERSON INFO. *         
//* FOR MATURE ESTATE BALLOTING                                       *         
//*-------------------------------------------------------------------*         
//STEP3B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                   
//SORTOUT  DD DSN=&&F500CNTR,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,3),RLSE),                               
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=((372,1,CH,EQ,C'C',OR,372,1,CH,EQ,C'M',OR,                      
                  372,1,CH,EQ,C'S'),OR,                                         
                (372,1,CH,EQ,C'I',AND,187,3,CH,NE,C'   '))                      
//*-------------------------------------------------------------------*         
//* OMIT COUNTER/MAILED (ORSA) APPLNS TO CREATE SOC MASTER, OCCUPIER            
//* FOR NORMAL EXERCISE                                                         
//*-------------------------------------------------------------------*         
//*STEP3C   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                  
//*SORTOUT  DD DSN=&&F500OTHR,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,SPACE=(CYL,(80,3),RLSE),                              
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                           
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(123,8,A),FORMAT=CH                                           
//*   OMIT COND=(372,1,CH,EQ,C'C',OR,372,1,CH,EQ,C'M',OR,                       
//*              372,1,CH,EQ,C'S')                                              
//*-------------------------------------------------------------------*         
//* SORT OUT COUNTER/MAILED (ORSA) APPLICATION TO UPDATE PERSON INFO.*          
//* FOR NORMAL EXERCISE                                              *          
//*-------------------------------------------------------------------*         
//*STEP3D   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F500.SEQUENCE,DISP=SHR                                  
//*SORTOUT  DD DSN=&&F500CNTR,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,SPACE=(CYL,(80,3),RLSE),                              
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                           
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(123,8,A),FORMAT=CH                                           
//*   INCLUDE COND=(372,1,CH,EQ,C'C',OR,372,1,CH,EQ,C'M',OR,                    
//*                 372,1,CH,EQ,C'S')                                           
//*-------------------------------------------------------------------*         
//* TO EXTRACT THE NEW REQUEST & OCCUPIER INFOR                       *         
//* TO UPDATE THE SOC MASTER AND SOC OCCUPIER FILE                    *         
//* TO PASS RECORDS TO CFS FOR PRE-ELIGIBILITY CHECK                  *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=BP13C528,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F500OTHR,DISP=(OLD,PASS)                                    
//BP13K530 DD DSN=BP13.K530.ISSUENO,DISP=SHR                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13F800 DD DSN=BP13.F800.APPLN.NEW,DISP=MOD                                  
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K648 DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13F310 DD DSN=BP13.F310.APPOINT,DISP=MOD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&&        
//* TO UPDATE RESALE STATUS = 'LN' OR 'LNS' TO MASTER                           
//* AFTER DETAIL UPDATED TO MASTER                                              
//*---------------------------------------------------------------------        
//STEP041   EXEC PGM=BP13C71N,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F500OTHR,DISP=(OLD,PASS)                                   
//BP13K825  DD DSN=BP13.K825.REQOCCP,DISP=SHR                                   
//BB24K510  DD DSN=BB24.K510.UINHIST,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BB24K500  DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SKIP F800 CASES WHERE DTE-REGN IS NOT = F001-CURR-DTE                       
//*-----------------------------------------------------------------            
//STEP04A  EXEC PGM=BP13C145,COND=(0,NE)                                        
//BP13F800 DD DSN=BP13.F800.APPLN.NEW,DISP=SHR                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//         AMP=('BUFNI=8','BUFND=4')                                            
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K024 DD DSN=BP13.K024.WISLAST,DISP=SHR                                    
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR                                 
//BP13K591 DD DSN=BP13.K595.BALLOT.LOG.PATH1,DISP=SHR                           
//BP13K592 DD DSN=BP13.K595.BALLOT.LOG.PATH2,DISP=SHR                           
//BP13K593 DD DSN=BP13.K595.BALLOT.LOG.PATH3,DISP=SHR                           
//BP13K594 DD DSN=BP13.K595.BALLOT.LOG.PATH4,DISP=SHR                           
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K731 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                             
//BP13K732 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                             
//P13L145A DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* UPDATED PERSON INFO FROM BP13K825 WHICH ARE NOT UPDATED IN ORSA             
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=BP13C088,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500CNTR,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K840 DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13L088 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* INCLUDE MARRIED APPLN/OCCUP                                       *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F825MARR,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=23400)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   INCLUDE COND=(96,1,CH,EQ,C'2')                                               
//*                                                                             
//*-------------------------------------------------------------------*         
//* PRINT REPORT ON ERROR IN MARRITAL STATUS                          *         
//*-------------------------------------------------------------------*         
//STEP09   EXEC PGM=BP13C541,COND=(0,NE)                                        
//BP13F825 DD DSN=&&F825MARR,DISP=(OLD,DELETE)                                  
//BP13F500 DD DSN=&&BP13F500,DISP=(OLD,PASS)                                    
//P13L541A DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* REPRO BALLOT FILE TO CARTRIDGE                                    *         
//*-------------------------------------------------------------------*         
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K500.PREREGN,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F500.PREREGN.AFDAILY(+1),DISP=(NEW,PASS),                
//            UNIT=CART,LABEL=(1,SL),                                           
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//INPUT2   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT2  DD DSN=BP13.F825.REQOCCP.AFDAILY(+1),DISP=(NEW,PASS),                
//            UNIT=CART,LABEL=(2,SL),VOL=REF=*.OUTPUT1,                         
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=200,RECFM=FB)                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* CATALOG GDG                                                       *         
//*-------------------------------------------------------------------*         
//STEP11   EXEC PGM=IEFBR14,COND=(0,NE)                                         
//INPUT1   DD DSN=BP13.F500.PREREGN.AFDAILY(+1),DISP=(OLD,CATLG),               
//             UNIT=(,,DEFER)                                                   
//INPUT2   DD DSN=BP13.F825.REQOCCP.AFDAILY(+1),DISP=(OLD,CATLG),               
//             UNIT=(,,DEFER)                                                   
//*                                                                             
//*-------------------------------------------------------------------*         
//* INCLUDE MATURE NT CASES                                           *         
//*-------------------------------------------------------------------*         
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F825OCCP,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=23400)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   OMIT COND=((1,1,CH,EQ,C'1',AND,132,8,CH,NE,C'        '),OR,                  
              (1,1,CH,EQ,C'M'))                                                 
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT BP13F825                                                     *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F825OCCP,DISP=(OLD,DELETE)                                  
//         DD DSN=BP13.BLANK.CHAR200,DISP=SHR                                   
//SORTOUT  DD DSN=&&F825SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,3),RLSE),                               
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=23400)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//* DEFINE SOC OCCUP FILE BP13K825                                    *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&F825SORT,DISP=(OLD,PASS)                                    
//SYSIN    DD *                                                                 
  DEL (BP13.K825.REQOCCP) CLUSTER PURGE                                         
  DEF CLUSTER                                          -                        
        (NAME(BP13.K825.REQOCCP)                       -                        
        SHR(2,3)                                       -                        
        KEYS(17 0)                                     -                        
        CYL(40 5)                                      -                        
        RECSZ(200 200)                                 -                        
        FREESPACE(30 30)                               -                        
        CISZ(4096)                                     -                        
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K825.REQOCCP.DATA))                 -                        
      INDEX                                            -                        
        (NAME(BP13.K825.REQOCCP.INDEX))                                         
      IF LASTCC = 0 THEN                               -                        
        REPRO IFILE(INPUT)                             -                        
              ODS(BP13.K825.REQOCCP)                                            
      IF MAXCC = 0 THEN                                -                        
        DEF AIX (NAME(BP13.K825.REQOCCP.ALTX1)         -                        
            REL(BP13.K825.REQOCCP)                     -                        
            CYL(20 2)                                  -                        
            UNIQUE                                     -                        
            SHR(2 3))                                  -                        
            DATA                                       -                        
            (NAME(BP13.K825.REQOCCP.ALTX1.DATA)        -                        
            KEYS(9 8)                                  -                        
            CISZ(4096)                                 -                        
            RECSZ(60 300)                              -                        
            NUNQK)                                                              
      IF MAXCC = 0 THEN                                -                        
        DEF PATH(NAME(BP13.K825.REQOCCP.PATH1)         -                        
            PENT(BP13.K825.REQOCCP.ALTX1))                                      
      IF MAXCC = 0 THEN                                -                        
        BIX IDS(BP13.K825.REQOCCP)                     -                        
            ODS(BP13.K825.REQOCCP.ALTX1)                                        
//*                                                                             
//*-------------------------------------------------------------------*         
//* REPRO PREREGN BACKUP                                              *         
//*-------------------------------------------------------------------*         
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K500.PREREGN,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F500.PREREGN(+1),DISP=(NEW,CATLG),                       
//            SPACE=(CYL,(50,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//*                                                                             
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* DELETE AND DEFINE BP13K500 - PREREGN FILE                         *         
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT    DD DSN=BP13.BLANK.CHAR500,DISP=SHR                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
         DEL (BP13.K500.PREREGN) CLUSTER PURGE                                  
         DEF CL (NAME(BP13.K500.PREREGN)               -                        
                 CYL(50 5)                             -                        
                 UNIQUE                                -                        
                 SPEED                                 -                        
                 STORCLAS(PRODRLS)                     -                        
                 LOG(NONE)                             -                        
                 SHR(2 3))                             -                        
                 DATA                                  -                        
                 (NAME(BP13.K500.PREREGN.DATA)         -                        
                 KEYS(8 122)                            -                       
                 RECSZ(500 500)                        -                        
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K500.PREREGN)                                         
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K500.PREREGN.ALTX1) -                             
               REL(BP13.K500.PREREGN)                  -                        
               CYL(8 3)                               -                         
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K500.PREREGN.ALTX1.DATA) -                            
               KEYS(9 40)                              -                        
               CISZ(4096)                              -                        
               RECSZ(60 500)                           -                        
               NUNQK)                                                           
         IF LASTCC = 0 THEN                            -                        
           DEF PATH(NAME(BP13.K500.PREREGN.PATH1) -                             
               PENT(BP13.K500.PREREGN.ALTX1))                                   
         IF LASTCC = 0 THEN                            -                        
           BIX IDS(BP13.K500.PREREGN)                  -                        
               ODS(BP13.K500.PREREGN.ALTX1)                                     
         IF MAXCC = 0 THEN                             -                        
           DEF AIX (NAME(BP13.K500.PREREGN.ALTX2) -                             
               REL(BP13.K500.PREREGN)                  -                        
               CYL(8 5)                               -                         
               UNIQUE                                  -                        
               SHR(2 3))                               -                        
               DATA                                    -                        
               (NAME(BP13.K500.PREREGN.ALTX2.DATA) -                            
               KEYS(9 81)                              -                        
               CISZ(4096)                              -                        
               RECSZ(500 5000)                         -                        
               NUNQK)                                                           
         IF LASTCC = 0 THEN                            -                        
           DEF PATH(NAME(BP13.K500.PREREGN.PATH2) -                             
               PENT(BP13.K500.PREREGN.ALTX2))                                   
         IF LASTCC = 0 THEN                            -                        
           BIX IDS(BP13.K500.PREREGN)                  -                        
               ODS(BP13.K500.PREREGN.ALTX2)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* REPRO FILE FOR BACKUP PURPOSE                                               
//* AFTER BE SELECTION REPLACE BY &&F500OTHR                                    
//* REPLACE BY &&BP13F500 BEFORE MATURE ESTATE BALLOTING                        
//*-------------------------------------------------------------------*         
//STEP17   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&F500OTHR,DISP=(OLD,DELETE)                                  
//OUTPUT1  DD DSN=BP13.K510.QRBALLOT,DISP=OLD,                                  
//            AMP=('BUFNI=8','BUFND=4')                                         
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*-------------------------------------------------------------------*         
//*                      END OF JOB                                   *         
//*-------------------------------------------------------------------*         
