//BP13D22A JOB (BP13P),'BP13D22A',MSGCLASS=N,CLASS=I,                           
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* DETERMINE HARDLUCK, CUT-OFF POINT CHANGE TO 201101                          
//* JOB FOR FT = BP13D220, D22A, D22B, D22C, D22D                               
//* JOB FOR FT2 = BP13D22E, D22F, D22G, D22H                                    
//* JOB FOR PURE 2T = BP13D221                                                  
//* JOB RUN = BP13D222, DEFINE BP13K585                                         
//* JOB RUN = BP13D223, UPDATE HARDLUCK TO BP13K730, PRINT PROFILE              
//* JOB RUN = BP13D224, PRINT REPORT FOR FT                                     
//* JOB RUN = BP13D225, PRINT REPORT FOR FT2T                                   
//* JOB RUN = BP13D226, PRINT REPORT FOR PURE HARDLUCK                          
//* JCL REFER TO BP13.K595.BP13D220 INSTEAD OF BP13.K595.BALLOT.LOG             
//*=================================================================            
//* PREPARE FILE FOR HARDLUCK, ARRANGE FILE BY NRIC1 ORDER                      
//*=================================================================            
//* CHG-NO   BY    ON   - DESCRIPTION                                           
//*--------------------------------------                                       
//* BP133835 LSB 160410 - ADD SBF ALLOC-CAT                                     
//* BP133835 LSB 010710 - DELETE OMIT HH=G, BTO MATURE EST                      
//* BP133891 LSB 070810 - NEW REPORT BYPASS NE                                  
//* BP133921 LSB 240810 - BYPASS JUN BTO FOR AFTER SOC, AFTER QUEUE             
//* BP133840 LSB 010910 - BYPASS JUN BTO PG FOR AFTER QUEUE REPORT              
//* BP134205 LSB 110511 - ADD BP13K813 TO BP13CB91 BYPASS HARDLUCK              
//*                       BP13CY82 REPLACE CY64                                 
//* BP134247 LSB 110611 - CB78 ADD K893,CY82 CHK MATURE-TAG,ADD PPO/EC          
//* BP134247 LSB 110711 - DELETE CB90, ENHANCE CB71, CB91                       
//* BP134388 LSB 210212 - ADD OCCUPIER SPOUSE/FS IN CB80 GET FR K828            
//* BP134598 LSB 100712 - CUT-FF DATE 2011 ATTEMPT FT= FROM 4 TO 3              
//*                                             FT/2T= FROM 6 TO 3              
//* BP134766 IMC 090113 ADD CY45, CY46, RESET COUNT FOR SBF                     
//* BP134780 IMC 270113 ADD DEFINE OF FILE BP13K803                             
//* BP135002 LSB 120813 BYPASS FTS SINGLE SCHEME FROM K595                      
//* BP135237 LSB 180214 STEP01-03 START DATE CHG FROM 200703 TO 201101          
//*                     CHG TO BP13.K595.BP13D220 WITH CASES FROM 2011          
//* BP135635 LSB 280115 ADD FTS FILE                                            
//* BP135635 SMR 100215 ADD NEW OUTPUT FILE FOR BP13CB80                        
//* BP139512 LSB 280223 ADD DATACLAS=MULTIVOL                                   
//*=================================================================            
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y1                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K20H.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'YH')                                               
//*------------------------------------------------------------------           
//* SORT OUT NRIC1, BYPASS DUPLICATE                                            
//*------------------------------------------------------------------           
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F500.AY0H,DISP=SHR                                        
//SORTOUT DD DSN=&&F595HA2,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(180,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*------------------------------------------------------------------           
//* CHECK NRIC1 FOUND AS NRIC2/NRIC3/NRIC4 IN OTHER APPLICATION                 
//* UPDATE NRIC2/3/4 TO COL 41 (NRIC1), TAG BP13K500, SO THAT                   
//* REGN UNDER NRIC2/3/4 WILL BE DELETED                                        
//* JCL REFER TO BP13.K595.BP13D220 INSTEAD OF BP13.K595.BALLOT.LOG             
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13CB80,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595HA2,DISP=(OLD,PASS)                                     
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13K500 DD DSN=BP13.K500.BP13AY0H,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K501 DD DSN=BP13.K500.BP13AY0H.PATH1,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BP13D220,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K591 DD DSN=BP13.K595.BP13D220.PATH2,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K592 DD DSN=BP13.K595.BP13D220.PATH3,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K593 DD DSN=BP13.K595.BP13D220.PATH4,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K821 DD DSN=BP13.K828.HISTOCCP.PATH1,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F500 DD DSN=BP13.F500.CB80.PA,DISP=OLD                                    
//BP13F50A DD DSN=BP13.F500.CB80.PA.NRIC1UPD,DISP=OLD                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT NRIC1, NRIC2=# ( NO NRIC2)                                         
//*------------------------------------------------------------------           
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F500.AY0H,DISP=SHR                                        
//SORTOUT DD DSN=&&F595PA1,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(200,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
   INCLUDE COND=(82,1,CH,EQ,C'#',OR,                                            
                 82,1,CH,EQ,C' ')                                               
   SUM FIELDS=NONE                                                              
//*------------------------------------------------------------------           
//* FOR PA-JSS   - HA1, HA2                                                     
//*                HA1,                                                         
//*                HA2,                                                         
//*  OUTPUT HA1, HA2                                                            
//*         HA1                                                                 
//*  OUTPUT HA2, HA2                                                            
//*         HA2                                                                 
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13CB8A,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595PA1,DISP=(OLD,PASS)                                     
//BP13F500 DD DSN=BP13.F500.CB80.PA,DISP=SHR                                    
//BP13F50A DD DSN=BP13.F595.CB8A.AY0H.PA,DISP=OLD                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT NRIC1                                                              
//*------------------------------------------------------------------           
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F500.CB80.PA.NRIC1UPD,DISP=SHR                            
//SORTOUT DD DSN=&&F500PA,DISP=(,PASS),                                         
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(180,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* FOR PA-JSS   - HA1, HA2                                                     
//*                HA1,                                                         
//*                HA2,                                                         
//*  OUTPUT HA1, HA2                                                            
//*         HA1                                                                 
//*  OUTPUT HA2, HA2                                                            
//*         HA2                                                                 
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13CB8A,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595PA1,DISP=(OLD,PASS)                                     
//BP13F500 DD DSN=&&F500PA,DISP=(OLD,PASS)                                      
//BP13F50A DD DSN=BP13.F595.CB8A.AY0H.PAHA1,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*==================================================================           
//* PROCESS FTS                                                                 
//*==================================================================           
//*------------------------------------------------------------------           
//* SORT OUT NRIC1, BYPASS DUPLICATE                                            
//*------------------------------------------------------------------           
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F500.AY0H.FTS,DISP=SHR                                    
//SORTOUT DD DSN=&&F595FTS,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(180,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
   SUM FIELDS=NONE                                                              
//*------------------------------------------------------------------           
//* CHECK NRIC1 FOUND AS NRIC2/NRIC3/NRIC4 IN OTHER APPLICATION                 
//* UPDATE NRIC2/3/4 TO COL 41 (NRIC1), TAG BP13K500, SO THAT                   
//* REGN UNDER NRIC2/3/4 WILL BE DELETED                                        
//* JCL REFER TO BP13.K595.BP13D220 INSTEAD OF BP13.K595.BALLOT.LOG             
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=BP13CB80,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595FTS,DISP=(OLD,PASS)                                     
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13K500 DD DSN=BP13.K500.BP13AY0H.FTS,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K501 DD DSN=BP13.K500.BP13AY0H.FTS.PATH1,DISP=SHR,                        
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K595 DD DSN=BP13.K595.BP13D220.FTS,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K591 DD DSN=BP13.K595.BP13D220.FTS.PATH2,DISP=SHR,                        
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K592 DD DSN=BP13.K595.BP13D220.FTS.PATH3,DISP=SHR,                        
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K593 DD DSN=BP13.K595.BP13D220.FTS.PATH4,DISP=SHR,                        
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K821 DD DSN=BP13.K828.HISTOCCP.PATH1,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13F500 DD DSN=BP13.F500.CB80.FTS,DISP=OLD                                   
//BP13F50A DD DSN=BP13.F500.CB80.FTS.NRIC1UPD,DISP=OLD                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT NRIC1, NRIC2=# ( NO NRIC2)                                         
//*------------------------------------------------------------------           
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F500.AY0H.FTS,DISP=SHR                                    
//SORTOUT DD DSN=&&F595IC1,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(200,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
   INCLUDE COND=(82,1,CH,EQ,C'#',OR,                                            
                 82,1,CH,EQ,C' ')                                               
   SUM FIELDS=NONE                                                              
//*------------------------------------------------------------------           
//* FOR FTS-JSS  - HA1, HA2                                                     
//*                HA1,                                                         
//*                HA2,                                                         
//*  OUTPUT HA1, HA2                                                            
//*         HA1                                                                 
//*  OUTPUT HA2, HA2                                                            
//*         HA2                                                                 
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13CB8A,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595IC1,DISP=(OLD,PASS)                                     
//BP13F500 DD DSN=BP13.F500.CB80.FTS,DISP=SHR                                   
//BP13F50A DD DSN=BP13.F595.CB8A.AY0H.FTS,DISP=OLD                              
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT NRIC1                                                              
//*------------------------------------------------------------------           
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F500.CB80.FTS.NRIC1UPD,DISP=SHR                           
//SORTOUT DD DSN=&&F500FTS,DISP=(,PASS),                                        
//        UNIT=(SYSDA,3),                                                       
//        DCB=(RECFM=FB,LRECL=500),DATACLAS=MULTIVOL,                           
//        SPACE=(CYL,(180,50),RLSE)                                             
//SYSIN   DD  *                                                                 
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* FOR FTS-JSS  - HA1, HA2                                                     
//*                HA1,                                                         
//*                HA2,                                                         
//*  OUTPUT HA1, HA2                                                            
//*         HA1                                                                 
//*  OUTPUT HA2, HA2                                                            
//*         HA2                                                                 
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13CB8A,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595IC1,DISP=(OLD,PASS)                                     
//BP13F500 DD DSN=&&F500FTS,DISP=(OLD,PASS)                                     
//BP13F50A DD DSN=BP13.F595.CB8A.AY0H.FTSHA1,DISP=OLD                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
