//BP13D520 JOB (BP13P),'BP13D520',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB    DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*-------------------------------------------------------------------- 00000030
//* CHG-NO   BY    ON      - DESCRIPTION                                        
//*--------------------------------------------------------------------         
//* BP130850 LSB  20011107 - CREATE CUSTOMER ID , MARRIAGE RECORD AND           
//*                          UPDATE THE SPOUSE NAME                             
//* BP133177 ED1  20071114 - ADD VERIFY BEFORE RUN                              
//* BP135171 RJE1 20140211 - TO CATER FOR DB2 UPGRADE                           
//*=================================================================            
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*-----------------------------------------------------------------            
//STEPA    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K820.OCCUP,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*--------------------------------------------------------------------         
//*SORT K820 FILE ,INCLUDE ONLY SPOUSE IC FOUND BUT SPOUSE NAME IS BLANK        
//*--------------------------------------------------------------------         
//STEP01    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//SORTOUT   DD DSN=&&BP13F820,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,20),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN     DD *                                                                
     SORT FIELDS=(1,17,A),FORMAT=CH                                             
    INCLUDE COND=(211,9,CH,NE,C'         ',AND,                                 
                  254,5,CH,EQ,C'     ')                                         
/*                                                                              
//*--------------------------------------------------------------------         
//* EXTRACT SPOUSE NAME FROM BP13K820                                           
//*--------------------------------------------------------------------         
//STEP01A   EXEC PGM=BP13C943,COND=(0,NE)                                       
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13F820  DD DSN=&&BP13F820,DISP=(OLD,PASS)                                   
//P13F820O  DD DSN=&&BP13SNME,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,20),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//P13F820E  DD DSN=&&BP13NNME,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(150,20),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSUDUMP  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSABOUT  DD SYSOUT=*                                                         
//SYSTSIN   DD *                                                                
//*-------------------------------------------------------------                
//*  UPDATE SPOUSE NAME BACK TO BP13K820                                        
//*-------------------------------------------------------------                
//STEP01B   EXEC PGM=BP13C944,COND=(0,NE)                                       
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13F820  DD DSN=&&BP13SNME,DISP=(OLD,PASS)                                   
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*--------------------------------------------------------------------         
//*SPOUSE NAME IS UPDATED IN BP13K820 BY USING THE PROGRAM BP13C985             
//*--------------------------------------------------------------------         
//STEP02    EXEC PGM=IKJEFT01,COND=(0,NE)                                       
//BP13F820  DD DSN=&&BP13NNME,DISP=(OLD,PASS)                                   
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13L985 DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSUDUMP DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C985) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT OUT NEW SOC APPL/OCCUP WITHOUT CUST0MER-ID                             
//*--------------------------------------------------------------------         
//STEP03    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//SORTOUT   DD DSN=&&P13F820A,DISP=(NEW,PASS),UNIT=SYSDA,                       
//             SPACE=(CYL,(150,20),RLSE),                                       
//             DCB=(RECFM=FB,LRECL=400)                                         
//SYSIN     DD *                                                                
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(245,9,CH,EQ,C'         ')                                     
//*--------------------------------------------------------------------         
//* FORMAT NEW SOC CASES INTO TRANSACTION FILE FOR ADDING TO CDB                
//*--------------------------------------------------------------------         
//STEP04    EXEC PGM=BP13C989,COND=(0,NE)                                       
//BP13F820  DD DSN=&&P13F820A,DISP=(OLD,PASS)                                   
//BP13K800  DD DSN=BP13.K800.APPLN,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13F915  DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//* OUTPUT TRANSACTION TO END-ROLE IN CDB                                       
//*--------------------------------------------------------------------         
//STEP05    EXEC PGM=BP13C987,COND=(0,NE)                                       
//BP13F410  DD DSN=BP13.F410.DAILYSO,DISP=SHR                                   
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//          AMP=('BUFND=4','BUFNI=8')                                           
//BP13F915  DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
