//BP13W001 JOB (BP13P),'BP13W001',CLASS=I,MSGCLASS=N,                   00010003
//         MSGLEVEL=(1,1),NOTIFY=CSD0071                                00020003
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                           00030003
//*=================================================================    00040003
//* GENERATE EMAIL TO INFORM CSM AND TEAM HEAD ON OUTSTANDING           00050003
//* PROVISIONAL ACCEPTANCE CASES > 14 DAYS                              00060003
//*=================================================================    00070003
//* BP137076 20180605 LHY7 IGNORE PROV REASON '12'                      00080003
//* BP137076 20180731 LHY7 IGNORE ALLOC MODE 'SER'                      00090003
//* BP138331 20200715 KR13 ADD EMAIL FSH, SERS PORT CASES               00091005
//*=================================================================    00100003
//* SORT OUT PROV-TAG = 'Y'                                             00110003
//*-----------------------------------------------------------------    00120003
//STEP01   EXEC SORT,COND=(0,NE)                                        00130003
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                              00140003
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                           00150003
//            UNIT=SYSDA,                                               00160004
//            DCB=(RECFM=FB,LRECL=2000),                                00161004
//            SPACE=(CYL,(250,10),RLSE)                                 00170003
//SYSIN    DD  *                                                        00180003
   SORT FIELDS=(155,11,A),FORMAT=CH                                     00190003
   INCLUDE COND=(1267,1,CH,EQ,C'Y',AND,                                 00200003
                 1268,2,CH,NE,C'12',AND,                                00210003
                 1268,2,CH,NE,C'24',AND,                                00220003
                 1268,2,CH,NE,C'28',AND,                                00230003
                 924,3,CH,NE,C'SER')                                    00240003
//*----------------------------------------------------------------     00250003
//* EXTRACT DETAILS FOR EMAIL FORMATING                                 00260003
//*----------------------------------------------------------------     00270003
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00271004
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                          00272004
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                             00273004
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                       00274004
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                            00275004
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                            00276004
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR,                             00277004
//            AMP=('BUFND=4','BUFNI=8')                                 00278004
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR,                          00279004
//            AMP=('BUFND=4','BUFNI=8')                                 00279104
//BP13OUT  DD DSN=BP13.FOUT.BP13C065,DISP=OLD                           00279304
//BP13OUTA DD DSN=&&P13C065A,DISP=(,PASS),                              00279404
//            UNIT=SYSDA,                                               00279504
//            DCB=(RECFM=FB,LRECL=130,BLKSIZE=27950),                   00279604
//            SPACE=(CYL,(3,5),RLSE)                                    00279704
//BP13OUTB DD DSN=&&P13C065B,DISP=(,PASS),                              00279804
//            UNIT=SYSDA,                                               00279904
//            DCB=(RECFM=FB,LRECL=130,BLKSIZE=27950),                   00280004
//            SPACE=(CYL,(3,5),RLSE)                                    00280104
//SYSTSPRT DD SYSOUT=*                                                  00280204
//SYSPRINT DD SYSOUT=*                                                  00280304
//SYSUDUMP DD SYSOUT=*                                                  00280404
//SYSDBG   DD SYSOUT=*                                                  00280504
//SYSDBOUT DD SYSOUT=*                                                  00280604
//SYSOUT   DD SYSOUT=*                                                  00280704
//SYSTSIN  DD *                                                         00280804
  DSN SYSTEM(DSN)                                                       00280904
  RUN PROGRAM(BP13C065) PLAN(BP13PCC) -                                 00281005
      LIB    ('BP13.BATCH.LOADCOB')                                     00281104
  END                                                                   00282004
//*-----------------------------------------------------------------    00390003
//* SUM FIELD BY CSM                                                    00400003
//*-----------------------------------------------------------------    00410003
//STEP03   EXEC SORT,COND=(0,NE)                                        00420003
//SORTIN   DD DSN=BP13.FOUT.BP13C065,DISP=SHR                           00430003
//SORTOUT  DD DSN=&&BP13CSM,DISP=(NEW,PASS),                            00440003
//            DCB=(RECFM=FB,LRECL=50),                                  00450003
//            SPACE=(CYL,(5,5),RLSE)                                    00460003
//SYSIN    DD  *                                                        00470003
   SORT FIELDS=(9,5,A),FORMAT=CH                                        00480003
   SUM FIELDS=NONE                                                      00490003
//*-----------------------------------------------------------------    00500003
//* SORT BY DAYS OUTSTANDING                                            00510003
//*-----------------------------------------------------------------    00520003
//STEP04   EXEC SORT,COND=(0,NE)                                        00530003
//SORTIN   DD DSN=BP13.FOUT.BP13C065,DISP=SHR                           00540003
//SORTOUT  DD DSN=&&BP13OUT,DISP=(NEW,PASS),                            00550003
//            DCB=(RECFM=FB,LRECL=50),                                  00560003
//            SPACE=(CYL,(10,5),RLSE)                                   00570003
//SYSIN    DD  *                                                        00580003
   SORT FIELDS=(9,5,A,22,3,D),FORMAT=CH                                 00590003
//*----------------------------------------------------------------     00600003
//* FORMAT EMAIL                                                        00610003
//*----------------------------------------------------------------     00620003
//STEP05   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00630003
//BP13CSM  DD DSN=&&BP13CSM,DISP=(OLD,DELETE)                           00640003
//BP13TEMP DD DSN=&&BP13OUT,DISP=(OLD,DELETE)                           00650003
//BP13MAIL DD DSN=BP13.MAILOUT.C066,DISP=OLD                            00660003
//SYSTSPRT DD SYSOUT=*                                                  00670003
//SYSPRINT DD SYSOUT=*                                                  00680003
//SYSUDUMP DD SYSOUT=*                                                  00690003
//SYSDBG   DD SYSOUT=*                                                  00691003
//SYSDBOUT DD SYSOUT=*                                                  00692003
//SYSOUT   DD SYSOUT=*                                                  00693003
//SYSTSIN  DD *                                                         00694003
  DSN SYSTEM(DSN)                                                       00695003
  RUN PROGRAM(BP13C066) PLAN(BP13PCC) -                                 00696003
      LIB    ('BP13.BATCH.LOADCOB')                                     00697003
  END                                                                   00698003
//*                                                                     00699003
//*-----------------------------------------------------------------    00710003
//*  SEND MAINFRAME EMAIL TO SOU                                        00720003
//*-----------------------------------------------------------------    00730003
//STEP06   EXEC SENDMAIL,COND=(0,NE)                                    00740003
//INPUT    DD DSN=BP13.MAILOUT.C066,DISP=SHR                            00750003
/*                                                                      00760003
//*-----------------------------------------------------------------    00761004
//*  SEND MAINFRAME EMAIL TO SOU (FSH CASES)                            00762004
//*-----------------------------------------------------------------    00763004
//STEP07   EXEC SENDMAIL,COND=(0,NE)                                    00764004
//INPUT    DD DSN=&&P13C065A,DISP=(OLD,PASS)                            00765004
/*                                                                      00766004
//*-----------------------------------------------------------------    00767004
//*  SEND MAINFRAME EMAIL TO SOU (SERS PORT CASES)                      00768004
//*-----------------------------------------------------------------    00769004
//STEP08   EXEC SENDMAIL,COND=(0,NE)                                    00769104
//INPUT    DD DSN=&&P13C065B,DISP=(OLD,PASS)                            00769204
/*                                                                      00769304
//*=================================================================    00770003
//*  END OF JOB                                                         00780003
//*=================================================================    00790003
