//BP13ASUS JOB (BP13P),'BP13ASUS',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*================================================================*            
//* UPDATE RESULT STATUS AFTER 100% SHORTLISTING                                
//*================================================================*            
//* CHG-NO  BY   ON      DESCRIPTION                                            
//* --------------------------------                                            
//*BP136169 IL5 060416 - NEW                                                    
//*BP137052 SMR 251017 - SAVE RECORDS THAT WERE SHORTLISTED UNDER APPZ          
//*BP137173 SMR 190118 - ADD NEW PROGRAM, BP13CB66                              
//*BP137173 JF7 190418 - ADD FILE BP13K813 FOR PROGRAM BP13CB65                 
//*BP137173 IL5 190418 - BACKUP BP13.K740.MATUREBA                              
//*BP137455 LSB 280818 - ADD FW3H/FW3I                                          
//*BP137549 IL5 030119 - TO DELETE BP13.K010.TENDER.BFADJUST                    
//*BP138214 AM2 110320 - ADD STEP FOR BP13CB65 NEW INPUT FILE                   
//*BP138511 IL5 221220 - INCLUDE 'E' FLAT INTO REPORT BP13LB66                  
//*================================================================*            
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE PRODUCTION RUN                                     
//*--------------------------------------------------------------------         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.SUCC100,DISP=SHR                           
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*------------------------------------------------------------------           
//* SORT SUCC WITHIN 100% FLAT SUPPLY                                           
//*------------------------------------------------------------------           
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN  DD DSN=BP13.F740.MATUREBA.SUCC100,DISP=SHR                            
//SORTOUT DD DSN=&&F740SUCC,DISP=(,PASS),                                       
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=500),                                             
//        SPACE=(CYL,(20,10),RLSE)                                              
//SYSIN   DD  *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT COND=(226,3,CH,EQ,C'   ')                                               
//*---------------------------------------------------------------------00000030
//* UPDATE CDE-REQUEST-STATUS = S (SUCC WITHIN 100%)                    00000030
//*---------------------------------------------------------------------00000030
//STEP03   EXEC  PGM=BP13C717,COND=(0,NE)                               00002680
//BP13F740 DD  DSN=&&F740SUCC,DISP=(OLD,PASS)                           00002710
//BP13K740 DD  DSN=BP13.K740.MATUREBA,DISP=SHR,                                 
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
//*--------------------------------------------------------------------         
//* F1 : ALL CASES (SHORTLISTED & NOT SHORTLISTED)                              
//* F2 : CASES SHORTLISTED IN BP13APPZ                                          
//* MATCH BY RANDOM NUMBER                                                      
//* REUSE THE FIELD F740-CDE-NT5 COL 199 LEN 3 TO TAG AS 'APZ'                  
//*--------------------------------------------------------------------         
//STEP04   EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTJNF2 DD DSN=BP13.F740.MATUREBA.APPZ.SUCC,DISP=SHR                         
//MATCH    DD DSN=BP13.F740.MATUREBA.APPZ,DISP=OLD                              
//SYSIN    DD *                                                                 
   JOINKEYS FILE=F1,FIELDS=(1,28,A)                                             
   JOINKEYS FILE=F2,FIELDS=(1,28,A)                                             
   REFORMAT FIELDS=(F1:1,500)                                                   
   OUTFILE FNAMES=MATCH,                                                        
      OUTREC=(1,198,C'APZ',202,299)                                             
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* DEFINE TEMPORARY BP13K010 FILE                                              
//* PASS BEFORE ADJUSTMENT RECORDS FROM BP13F010                                
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=BP13.F010.TENDER.A600,DISP=SHR                                
//SYSIN    DD *                                                                 
  DEL 'BP13.K010.TENDER.BFADJUST' CL PURGE                                      
  DEF CLUSTER                                          -                        
        (NAME(BP13.K010.TENDER.BFADJUST)               -                        
        SHAREOPTIONS(2,3)                              -                        
        KEYS(5 0)                                      -                        
        CYL(1 1)                                       -                        
        STORCLAS(PRODRLS)                              -                        
        LOG(NONE)                                      -                        
        RECSZ(600 600)                                 -                        
        FREESPACE(30 30)                               -                        
        CISZ(4096)                                     -                        
        IXD                                            -                        
        UNQ)                                           -                        
      DATA                                             -                        
        (NAME(BP13.K010.TENDER.BFADJUST.DATA))         -                        
      INDEX                                            -                        
        (NAME(BP13.K010.TENDER.BFADJUST.INDEX))                                 
         IF LASTCC = 0 THEN                            -                        
           REPRO IFILE(INPUT)                          -                        
                 ODS(BP13.K010.TENDER.BFADJUST)                                 
//*--------------------------------------------------------------------         
//* SHORTLISTED IN 100%                                                         
//* S1: SORT OUT ALL 2F CASES                                                   
//* S2: SORT OUT SBF CASES W/ 3-ROOM & ABOVE FLAT TYPE                          
//*--------------------------------------------------------------------         
//STEP06   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//SORTOUT1 DD DSN=&&F740CB65,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(50,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SORTOUT2 DD DSN=&&F740CB66,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(50,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,187,3,A,211,2,A,123,8,A),FORMAT=CH                     
    OUTFIL FNAMES=SORTOUT1,INCLUDE=(226,3,CH,NE,C'   ',AND,                     
                 211,2,CH,EQ,C'2F',AND,260,1,CH,EQ,C'S')                        
    OUTFIL FNAMES=SORTOUT2,INCLUDE=(226,3,CH,NE,C'   ',AND,                     
                 (211,2,CH,GE,C'3 ',OR,211,2,CH,EQ,C'E '),AND,                  
                 376,3,CH,EQ,C'SBF',AND,                                        
                 260,1,CH,EQ,C'S')                                              
//*--------------------------------------------------------------------         
//* SHORTLISTED ONLY IN BP13APPZ (100%)                                         
//* S1: SORT OUT 2F CASES                                                       
//* S2: SORT OUT SBF CASES W/ 3-ROOM & ABOVE FLAT TYPE                          
//*--------------------------------------------------------------------         
//STEP07   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.F740.MATUREBA.APPZ.SUCC,DISP=SHR                         
//SORTOUT1 DD DSN=&&F730CB65,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SORTOUT2 DD DSN=&&F730CB66,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,187,3,A,211,2,A,123,8,A),FORMAT=CH                     
    OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,2,CH,EQ,C'2F')                          
    OUTFIL FNAMES=SORTOUT2,INCLUDE=((211,2,CH,GE,C'3 ',OR,                      
                                    211,2,CH,EQ,C'E '),AND,                     
                                    376,3,CH,EQ,C'SBF')                         
//*--------------------------------------------------------------------         
//* SHORTLISTED ONLY IN BP13APFT (100%)                                         
//* S1: SORT OUT 2F CASES                                                       
//*--------------------------------------------------------------------         
//STEP07A  EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.F740.MATUREBA.BP13APFT.UNSUCC,DISP=SHR                   
//SORTOUT1 DD DSN=&&F73ACB65,DISP=(NEW,PASS),                                   
//            SPACE=(CYL,(20,10),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
    SORT FIELDS=(376,3,A,187,3,A,211,2,A,123,8,A),FORMAT=CH                     
    OUTFIL FNAMES=SORTOUT1,INCLUDE=(211,2,CH,EQ,C'2F')                          
//*--------------------------------------------------------------------         
//* GENERATE SHORTLISTING REPORTS TO BE USED FOR CLEARANCE OF                   
//* BALLOT RESULTS FOR 2F ONLY (100%)                                           
//*--------------------------------------------------------------------         
//STEP08   EXEC PGM=BP13CB65,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CB65,DISP=(OLD,DELETE)                                  
//BP13F730 DD DSN=&&F730CB65,DISP=(OLD,DELETE)                                  
//P13F730A DD DSN=&&F73ACB65,DISP=(OLD,DELETE)                                  
//BP13K010 DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//BP13K01A DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K030 DD DSN=BP13.K010.TENDER.BFADJUST,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//BP13K71A DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13LB65 DD DSN=BP13.LB65.REPORT,DISP=OLD                                     
//BP13FW3I DD DSN=BP13.FW3I.BALLOT.RESULT.A100,DISP=OLD                         
//SYSIN    DD *                                                                 
100                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* GENERATE SHORTLISTING REPORTS TO BE USED FOR CLEARANCE OF                   
//* BALLOT RESULTS FOR SBF 3-RM AND ABOVE (100%)                                
//*--------------------------------------------------------------------         
//STEP09   EXEC PGM=BP13CB66,COND=(0,NE)                                        
//BP13F740 DD DSN=&&F740CB66,DISP=(OLD,DELETE)                                  
//BP13F730 DD DSN=&&F730CB66,DISP=(OLD,DELETE)                                  
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K030 DD DSN=BP13.K010.TENDER.BFADJUST,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13K813 DD DSN=BP13.K813.BTOBE,DISP=SHR                                      
//BP13LB66 DD DSN=BP13.LB66.REPORT,DISP=OLD                                     
//BP13FW3I DD DSN=BP13.FW3I.BALLOT.RESULT.A100,DISP=MOD                         
//SYSIN    DD *                                                                 
100                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  BACKUP TO SEQUENTIAL FILES                                                 
//*--------------------------------------------------------------------         
//STEP10   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F740.MATUREBA.APPZ.SUCC,DISP=SHR                         
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.APPZ.SUCC100,DISP=OLD                      
//INPUT2   DD DSN=BP13.K010.ELDERLY,DISP=SHR                                    
//OUTPUT2  DD DSN=BP13.F010.ELDERLY.ASUS,DISP=OLD                               
//INPUT3   DD DSN=BP13.K712.ELDERLY,DISP=SHR                                    
//OUTPUT3  DD DSN=BP13.F712.ELDERLY.ASUS,DISP=OLD                               
//INPUT4   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT4  DD DSN=BP13.F010.TENDER.ASUS,DISP=OLD                                
//INPUT5   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT5  DD DSN=BP13.F712.FLATNHUG.ASUS,DISP=OLD                              
//INPUT6   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT6  DD DSN=BP13.F740.MATUREBA.ASUS,DISP=OLD                              
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
   REPRO INFILE(INPUT6)  OUTFILE(OUTPUT6)                                       
/*                                                                              
