//BP13AY02 JOB (BP13P),'BP13AY02',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*=================================================================            
//* USR REQUEST JOB (SOCY)                                                      
//* FOR OPTION 2 - APPLICATION BOOKING PROFILE (K205-NUM-FORM-TYPE='B')         
//* FOR OPTION 4 - APPLICATION NOT BOOK PROFILE(K205-NUM-FORM-TYPE='N')         
//* BY MODE/NT/FT/LAUCH-DATE/CLOSE-DATE                                         
//* IF 2 DIFF NT OFFER UNDER BTO LAUNCH, SYSTEM TO PRINT SEPARATE REPORT        
//*=================================================================            
//* BP133340 20080415  LSB - NEW JOB                                            
//* BP133340 20080822  JB8 - NEW OUTPUT FILE(BP13.LY31.BP13CY31)                
//* BP133490 20081121  JB8 - CATER FOR OPT 4, NOT BOOK PROFILE                  
//* BP133580 20090507  JB8 - ADD BP13S996                                       
//* BP133917 20100510  CCC5- INCREASE 2NDARY DISK SPACE IN STEP5 TO 50          
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAMPPA1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT BP13.K205.CTLREC, INCLUDE OPTION = Y2                                  
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F205,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(1,1),RLSE),                                
//            DCB=(LRECL=80,RECFM=FB)                                           
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,15,A),FORMAT=CH                                                
  INCLUDE COND=(14,2,CH,EQ,C'Y2')                                               
//*---------------------------------------------------------------------        
//*- SORT OUT BOOKED & NOTBOOKED UNIT FROM SOC HISTORY                          
//*---------------------------------------------------------------------        
//STEP2A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR,                             
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F80A,DISP=(NEW,PASS),                                       
//        UNIT=(SYSDA,3),DCB=(RECFM=FB,LRECL=2000,BLKSIZE=),                    
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(155,11,A),FORMAT=CH                                              
  INCLUDE COND=(785,4,CH,GE,C'2007')                                            
  OUTREC FIELDS=(1,2000)                                                        
//*---------------------------------------------------------------------        
//*  SORT OUT BOOKED & NOTBOOKED UNIT FROM SOC MASTER                           
//*---------------------------------------------------------------------        
//STEP2B   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F80A,DISP=(MOD,PASS),                                       
//        UNIT=(SYSDA,3),DCB=(RECFM=FB,LRECL=2000,BLKSIZE=),                    
//        SPACE=(CYL,(250,50),RLSE)                                             
//SYSIN    DD  *                                                                
  SORT FIELDS=(155,11,A),FORMAT=CH                                              
//*-----------------------------------------------------------------            
//* SORT BP13K800 DTE-BALLOT/ALLO-CAT                                           
//*-----------------------------------------------------------------            
//STEP2C   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F80A,DISP=(OLD,PASS)                                        
//SORTOUT  DD DSN=&&F800DTEB,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,3),SPACE=(CYL,(250,100),RLSE),                        
//            DCB=(LRECL=2000,RECFM=FB)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(785,6,A,924,3,A,4,8,A),FORMAT=CH                                 
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//*- MATCH WITH BP13F205 TO EXTRACT F800 REC BY DTE-BALLOT/ALLO-CAT             
//*- TO EXTRACT BOOKED CASE OR NOT BOOK CASES                                   
//*- K205-NUM-FORM-TYPE = 'B' FOR BOOKING CASES                                 
//*                       'N' FOR NOT BOOK CASES                                
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13CY30,COND=(0,NE)                                        
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13F800 DD DSN=&&F800DTEB,DISP=(OLD,PASS)                                    
//BP13F730 DD DSN=&&F730CY30,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(200,100),RLSE),                            
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* INCLUDE BE/BTO SORTLISTED CASES                                             
//* SORT BY NRIC                                                                
//*-----------------------------------------------------------------            
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CY30,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730NRIC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(100,30),RLSE)                                         
//SYSIN   DD  *                                                                 
  SORT FIELDS=(41,9,A),FORMAT=CH                                                
//*-----------------------------------------------------------------            
//* SORT BY NRIC/ALLO-CAT/DTE-BALLOT                                            
//* INCLUDE BE/BTO SORTLISTED CASES                                             
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD DSN=&&F595HIST,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,3),                                                   
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(250,50),RLSE)                                         
//SYSIN   DD  *                                                                 
  SORT FIELDS=(41,9,A,376,3,A,334,6,A,123,8,A),FORMAT=CH                        
   INCLUDE COND=(260,1,CH,NE,C'C',AND,                                          
                 260,1,CH,NE,C' ')                                              
//*-----------------------------------------------------------------            
//* MATCH BTO AND BALLOT HOSTORY REC                                            
//* BP13OUTA - ANALYSIS OF ATTEMPT IN PREVIOUS APPLICANTS (MULTIPLE)            
//* BP13OUTB - SUM UP NUMBER OF PREVIOUS ATTEMPTS                               
//* BP13OUTC - ANALYSIS OF ATTEMPT IN PREVIOUS APPLICANTS (LATEST)              
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=BP13CY05,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730NRIC,DISP=(OLD,PASS)                                    
//BP13F595 DD DSN=&&F595HIST,DISP=(OLD,PASS)                                    
//BP13OUTA DD DSN=&&CY05OUTA,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                                 
//         DCB=(LRECL=100,RECFM=FB)                                             
//BP13OUTB DD DSN=&&CY05OUTB,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                                 
//         DCB=(LRECL=2000,RECFM=FB)                                            
//BP13OUTC DD DSN=&&CY05OUTC,DISP=(,PASS),                                      
//         UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                                 
//         DCB=(LRECL=100,RECFM=FB)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* REPORT ATTEMPT IN PREVIOUS APPLICANTS(LATEST)                               
//*-----------------------------------------------------------------            
//STEP07   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                    
//BP13OUTC DD DSN=&&CY05OUTC,DISP=(OLD,PASS)                                    
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13L053 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S053),DISP=SHR                             
//*-----------------------------------------------------------------            
//* REPORT ATTEMPT IN PREVIOUS APPLICANTS(MULTIPLE)                             
//*-----------------------------------------------------------------            
//STEP08   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                    
//BP13OUTC DD DSN=&&CY05OUTA,DISP=(OLD,PASS)                                    
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13L053 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S053),DISP=SHR                             
//*-----------------------------------------------------------------            
//* SORT BY REGN, OMIT IF NO OF COUNT FOR BE/BTO = ZEROS                        
//*-----------------------------------------------------------------            
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&CY05OUTB,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F800S049,DISP=(,PASS),                                      
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                             
//            SPACE=(CYL,(20,2),RLSE)                                           
//SYSIN    DD  *                                                                
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
  OMIT COND=(1997,4,CH,EQ,C'    ')                                              
//*-----------------------------------------------------------------            
//* REPORT ON NO OF APPLICATION PREV APPLY UNDER BE/BTO/DBS/WIS                 
//*-----------------------------------------------------------------            
//STEP10   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                    
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//BP13F800 DD DSN=&&F800S049,DISP=(OLD,DELETE)                                  
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13L049 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S049),DISP=SHR                             
//*-----------------------------------------------------------------            
//* OUTREC OCCUP TO BP13F825 FORMAT                                             
//*-----------------------------------------------------------------            
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&F825,DISP=(NEW,PASS),                                      
//             UNIT=(SYSDA,3),SPACE=(CYL,(250,30),RLSE),                        
//             DCB=(RECFM=FB,LRECL=200)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  OMIT COND=(1,8,CH,EQ,C'        ')                                             
  OUTREC FIELDS=(1,200)                                                         
//*-----------------------------------------------------------------            
//* OUTREC OCCUP IN SOC HISTORY FILE TO BP13F825 FORMAT                         
//*-----------------------------------------------------------------            
//STEP11A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//SORTOUT  DD  DSN=&&F825,DISP=(MOD,PASS),                                      
//             UNIT=(SYSDA,3),SPACE=(CYL,(250,30),RLSE),                        
//             DCB=(RECFM=FB,LRECL=200)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  OMIT COND=(1,8,CH,EQ,C'        ')                                             
  OUTREC FIELDS=(1,200)                                                         
//*-----------------------------------------------------------------            
//* OUTREC OCCUP TO BP13F825 FORMAT                                             
//*-----------------------------------------------------------------            
//STEP11B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=&&F825,DISP=(OLD,PASS)                                       
//SORTOUT  DD  DSN=&&BP13F825,DISP=(,PASS),                                     
//             UNIT=(SYSDA,3),SPACE=(CYL,(200,30),RLSE),                        
//             DCB=(RECFM=FB,LRECL=200)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  SUM FIELDS=NONE                                                               
//*-----------------------------------------------------------------            
//* INCLUDE BE/BTO SORTLISTED CASES                                             
//* SORT BY REGN                                                                
//*-----------------------------------------------------------------            
//STEP11C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CY30,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500),                                         
//            SPACE=(CYL,(30,10),RLSE)                                          
//SYSIN   DD  *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* GET THE HH SIZE/AGE/INCOME/MARIED COUPLES                                   
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13CB53,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730REGN,DISP=(OLD,PASS)                                    
//BP13F825 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//P13F730A DD DSN=&&F730HHIN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(100,200),RLSE),                            
//            DCB=(LRECL=500,RECFM=FB)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* REPORT ON BTO APPL RECVD (INTERNET/MANUAL) & SUMMARY AND                    
//*           REQ UNDER MCPS BY NEW TOWN                                        
//*---------------------------------------------------------------------        
//STEP13   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP13F730 DD DSN=&&F730HHIN,DISP=(OLD,PASS)                                    
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13L041 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S041),DISP=SHR                             
//*---------------------------------------------------------------------        
//* REPORT ON AGE/INCOME PROFILE OF APPL & HH SIZE OF APPLICANTS                
//* REPORT AVERAGE INCOME,MEDIAN AGE,AVERAGE HH SIZE,INCOME & AGE               
//*---------------------------------------------------------------------        
//STEP14   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP13F730 DD DSN=&&F730HHIN,DISP=(OLD,PASS)                                    
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13L042 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S042),DISP=SHR                             
//*---------------------------------------------------------------------        
//* REPORT ON ETHNIC PROFILE OF BTO APPL   (FIRST & SECOND TIMER)               
//*           ETHNIC PROFILE REQ UNDER MCPS(FIRST & SECOND TIMER)               
//*           ETHNIC PROFILE REQ UNDER GRO (FIRST & SECOND TIMER)               
//*           REQ UNDER GRO                                                     
//*---------------------------------------------------------------------        
//STEP15   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP13F730 DD DSN=&&F730HHIN,DISP=(OLD,PASS)                                    
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13L043 DD SYSOUT=*                                                          
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S043),DISP=SHR                             
//*---------------------------------------------------------------------        
//* REPORT ON REQ UNDER VARIOUS PRIORITY SCHEME                                 
//*           REQ UNDER ELIGIBILITY SCHEME                                      
//*           REQ FROM COUPLES                                                  
//*           ETHNIC PROFILE OF COUPLES                                         
//*---------------------------------------------------------------------        
//STEP16   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//BP13F730 DD DSN=&&F730HHIN,DISP=(OLD,PASS)                                    
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//BP13L044 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//PRIOFMT  DD DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S044),DISP=SHR                             
//*                                                                             
//*=================================================================            
//*  REPORT TO SHOW REQUEST PREVIOUS ROLE/FT, LESSEE, OCCUPIER                  
//*  AND TENANTS                                                                
//*-----------------------------------------------------------------            
//STEP17   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                    
//BP13F730  DD DSN=&&F730REGN,DISP=(OLD,PASS)                                   
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR                                    
//FT18F001  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S093),DISP=SHR                            
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BP13K800 ALLO-CAT/BALLOT/NT/FT/DTE-BK-APPT                             
//*-----------------------------------------------------------------            
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&F800T1,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(200,100),RLSE),                            
//            DCB=(LRECL=2000,RECFM=FB)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(924,3,A,785,6,A,51,3,A,30,2,A,509,8,A),FORMAT=CH                 
//*---------------------------------------------------------------------        
//*- MATCH WITH BP13F205 TO EXTRACT F800 REC BY DTE-BALLOT/ALLO-CAT             
//*- TO EXTRACT BOOKED CASE                                                     
//*---------------------------------------------------------------------        
//STEP19   EXEC PGM=BP13CY33,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800T1,DISP=(OLD,PASS)                                      
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F800A DD DSN=&&F800T2,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(200,100),RLSE),                            
//            DCB=(LRECL=2000,RECFM=FB)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BP13K800 BY REGN                                                       
//*-----------------------------------------------------------------            
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800T2,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&F800T3,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(200,100),RLSE),                            
//            DCB=(LRECL=2000,RECFM=FB)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(4,8,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//* GET THE HH SIZE/AGE/INCOME/MARIED COUPLES                                   
//*---------------------------------------------------------------------        
//STEP22   EXEC PGM=BP13C041,COND=(0,NE)                                        
//BP13F800 DD DSN=&&F800T3,DISP=(OLD,PASS)                                      
//BP13F825 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//P13F800A DD DSN=&&F800T4,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(300,200),RLSE),                            
//            DCB=(LRECL=2000,RECFM=FB)                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT BP13K800                                                               
//*-----------------------------------------------------------------            
//STEP23   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F800T4,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&F800T5,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,SPACE=(CYL,(200,100),RLSE),                            
//            DCB=(LRECL=2000,RECFM=FB)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(924,3,A,785,6,A,51,3,A,30,2,A,509,8,A),FORMAT=CH                 
//*---------------------------------------------------------------------        
//*- MATCH WITH BP13F205 TO EXTRACT F800 REC BY DTE-BALLOT/ALLO-CAT             
//*- TO EXTRACT SUMMARY AND DETAIL CASES                                        
//*---------------------------------------------------------------------        
//STEP24   EXEC PGM=BP13CY31,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F800 DD DSN=&&F800T5,DISP=(OLD,PASS)                                      
//BP13F205 DD DSN=&&BP13F205,DISP=(OLD,PASS)                                    
//BP13K595 DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LY31 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13F800A DD DSN=BP13.LY31.BP13CY31,DISP=OLD                                   
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* READ BP13K800 TO CHECK BOOK AND CANCEL CASES                                
//*--------------------------------------------------------------------         
//STEP09   EXEC  PGM=BP13CY12,COND=(0,NE)                                       
//BP13F595 DD DSN=&&F730CY30,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR,                               
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F595F DD DSN=&&CY12F,DISP=(NEW,PASS),                                      
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(100,50),RLSE)                                            
//P13F595N DD DSN=&&CY12NOTF,DISP=(NEW,PASS),                                   
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(50,20),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* READ BB24K020 TO CHECK RESALE CASES                                         
//*--------------------------------------------------------------------         
//STEP10   EXEC  PGM=BP13CY13,COND=(0,NE)                                       
//BP13F595 DD DSN=&&CY12NOTF,DISP=(OLD,PASS)                                    
//BB24K020 DD DSN=BB24.K020.OCCUPIER,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB24K021 DD DSN=BB24.K020.OCCUPIER.PATH1,DISP=SHR,                            
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F595F DD DSN=&&CY13F,DISP=(NEW,PASS),                                      
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(100,50),RLSE)                                            
//P13F595N DD DSN=&&CY13NOTF,DISP=(NEW,PASS),                                   
//         DCB=(RECFM=FB,LRECL=500),                                            
//         SPACE=(CYL,(50,20),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* READ AB03K080,AB03K030 TO BOUGHT FLAT AFTER NEW BE/BTO APPLICATION          
//*--------------------------------------------------------------------         
//STEP11   EXEC  PGM=BP13CY14,COND=(0,NE)                                       
//BP13F595 DD DSN=&&CY13NOTF,DISP=(OLD,PASS)                                    
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K816 DD DSN=BP13.K816.BTODATA,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F595F DD DSN=&&CY14F,DISP=(NEW,PASS),                                      
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(100,50),RLSE)                                            
//P13F595N DD DSN=&&CY14NOTF,DISP=(NEW,PASS),                                   
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(50,20),RLSE)                                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* NRIC NOTFD IN RESALE, SMS, SOC                                              
//*--------------------------------------------------------------------         
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&CY14NOTF,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F595CY17,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                               03880012
//            DCB=(BLKSIZE=0,LRECL=100,RECFM=FB),                       03890012
//            SPACE=(CYL,(50,20),RLSE)                                  03890112
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(23,9,A),FORMAT=CH                                               
//*--------------------------------------------------------------------         
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//SORTOUT  DD DSN=&&F730CY17,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                               03880012
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                       03890012
//            SPACE=(CYL,(50,20),RLSE)                                  03890112
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD  *                                                                
   SORT FIELDS=(41,9,A,334,6,D),FORMAT=CH                                       
//*--------------------------------------------------------------------         
//* MATCH FOUND IN REQUEST UNDER BTO/BE/WIH                                     
//*--------------------------------------------------------------------         
//STEP15   EXEC PGM=BP13CY17,COND=(0,NE)                                        
//BP13F595 DD DSN=&&F595CY17,DISP=(OLD,PASS)                                    
//BP13F730 DD DSN=&&F730CY17,DISP=(OLD,PASS)                                    
//P13F595F DD DSN=&&CY17F,DISP=(,PASS),                                         
//            UNIT=SYSDA,                                               03880012
//            DCB=(BLKSIZE=0,LRECL=100,RECFM=FB),                       03890012
//            SPACE=(CYL,(50,20),RLSE)                                  03890112
//P13F595N DD DSN=&&CY17NF,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                               03880012
//            DCB=(BLKSIZE=0,LRECL=100,RECFM=FB),                       03890012
//            SPACE=(CYL,(50,20),RLSE)                                  03890112
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* MERGE BOOKED/NEW REQUEST DATA                                               
//*--------------------------------------------------------------------         
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&CY12F,DISP=(OLD,PASS)                                       
//         DD DSN=&&CY13F,DISP=(OLD,PASS)                                       
//         DD DSN=&&CY14F,DISP=(OLD,PASS)                                       
//         DD DSN=&&CY17F,DISP=(OLD,PASS)                                       
//         DD DSN=&&CY17NF,DISP=(OLD,PASS)                                      
//SORTOUT  DD DSN=&&F595FINL,DISP=(NEW,PASS),                                   
//         DCB=(RECFM=FB,LRECL=100),                                            
//         SPACE=(CYL,(50,20),RLSE)                                             
//SYSIN    DD  *                                                                
   SORT FIELDS=(41,9,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* PRINT REPORTS BTO REQUEST ALREADY BOOKED FLAT OR BOUGHT SMS/RSL             
//* OR STILL WAITING FOR FLATS                                                  
//*-----------------------------------------------------------------            
//STEP17  EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                     
//WORK DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                        
//BP13F595 DD DSN=&&F595FINL,DISP=(OLD,PASS)                                    
//BP13L000 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S996),DISP=SHR                             
