//BP13D704  JOB (BP13P),'BP13D704',CLASS=I,MSGCLASS=N,                          
//        MSGLEVEL=(1,1),NOTIFY=CSD0071                                         
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*================================================================*            
//* TO SEND EMAIL ALERT TO CSM FOR THE THOSE CASES THAT THE                     
//* MARRIAGE CERITIFICATE ARE DUE                                               
//*================================================================*            
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP133681 ZDD 100430 - NEW JCL                                               
//*================================================================*            
//*  SORT CASES WHERE SUBMISSION DATE IS BLANK AND DUE DATE IS NOT  *           
//*  BLANK                                                          *           
//*-----------------------------------------------------------------*           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K399.APPLOCCP,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F399,DISP=(NEW,PASS),                                   
//            SPACE=(TRK,(50,55),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=800,BLKSIZE=27200)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,17,A),FORMAT=CH                                            
  INCLUDE COND=(709,8,CH,NE,C'        ',AND,717,8,CH,EQ,C'        ')            
//*-----------------------------------------------------------------*           
//*  TO GENERATE FILE FOR THE CASES THAT THE SUBMISSION OF MARRIAGE *           
//*  CERTIFICATE IS DUE                                             *           
//*-----------------------------------------------------------------*           
//STEP02   EXEC PGM=BP13CF07,COND=(0,NE)                                        
//BP13F399 DD DSN=&&BP13F399,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13MAIL DD DSN=&&BP13MAIL,DISP=(NEW,PASS),                                   
//             UNIT=SYSDA,SPACE=(CYL,(10,05),RLSE),                             
//             DCB=(BLKSIZE=27768,LRECL=267,RECFM=FB)                           
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------*           
//*  SORT CASES BY CSM FOR SENDING OF EMAIL                         *           
//*-----------------------------------------------------------------*           
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13MAIL,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&P13MAILA,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(10,05),RLSE),                              
//            DCB=(BLKSIZE=27768,LRECL=267,RECFM=FB)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,5,A),FORMAT=CH                                             
//*-----------------------------------------------------------------*           
//*  TO FORMAT CASES FOR EMAIL                                      *           
//*-----------------------------------------------------------------*           
//STEP04   EXEC PGM=BP13CF08,COND=(0,NE)                                        
//BP13MAIL DD DSN=&&P13MAILA,DISP=(OLD,DELETE)                                  
//MAILOUT  DD DSN=&&MAILOUT,DISP=(NEW,PASS),                                    
//             UNIT=SYSDA,SPACE=(CYL,(05,05),RLSE),                             
//             DCB=(BLKSIZE=27900,LRECL=100,RECFM=FB)                           
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------*           
//*  TO EXTRACT CASES WITH SUBMISSION DATE                          *           
//*-----------------------------------------------------------------*           
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K399.APPLOCCP,DISP=SHR                                   
//SORTOUT  DD DSN=&&BP13F399,DISP=(NEW,PASS),                                   
//            SPACE=(TRK,(50,55),RLSE),UNIT=SYSDA,                              
//            DCB=(RECFM=FB,LRECL=800,BLKSIZE=27200)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,17,A),FORMAT=CH                                            
  INCLUDE COND=(717,8,CH,NE,C'        ')                                        
//*-----------------------------------------------------------------*           
//*  TO DELETE CASES THAT SUBMISSION DATE IS AFTER 1 YEAR           *           
//*-----------------------------------------------------------------*           
//STEP06   EXEC PGM=BP13CF15,COND=(0,NE)                                        
//BP13F399 DD DSN=&&BP13F399,DISP=(OLD,DELETE)                                  
//BP13K399 DD DSN=BP13.K399.APPLOCCP,DISP=SHR                                   
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//*  SEND MAINFRAME EMAIL = MAXCC=4 WHEN FILE IS EMPTY                          
//*-----------------------------------------------------------------            
//STEP07   EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=&&MAILOUT,DISP=(OLD,DELETE)                                   
/*                                                                              
//*-----------------------------------------------------------------            
//*  END OF BP13D704                                                            
//*-----------------------------------------------------------------            
