//BP13AHH2 JOB (BP13P),'BP13AHH2',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//* OBJECTIVES OF THIS JCL                                                      
//* ---------------------                                                       
//* 1. TO SORT OUT BE CASES FROM BP13K730 FILE TO BP13.F500.NT                  
//* 2. TO ASSIGN BALLOT DATE                                                    
//* 3. TO PRINT REPORT ON CANCELLATION CASES DURING APPLN PERIOD                
//* 4. TO PRINT REPORT ON THE FLAT SUPPLY                                       
//* 5. TO CREATE BP13.F558.UPGOCCP                                              
//* 6. THIS JCL IS FOR BE CASES.                                                
//*                                                                             
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP132455 CKK  20040201 NEW JCL                                              
//* BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                               
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//*STEPAA   EXEC PGM=IDCAMS,COND=(0,NE)                                         
//*INPUT1   DD DSN=BP13.K825.REQOCCP,DISP=OLD                                   
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSIN    DD *                                                                
//*        VFY FILE(INPUT1)                                                     
//**************************************************************                
//*  TO SEND DJDE AHEAD OF THE PRINT DATASET                                    
//*  PRT01                    APPLICATION TEAM                                  
//**************************************************************                
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAP1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*--------------------------------------------------------------------         
//* REPRO MATURE REQUESTS TO SEQUENCIAL FILE                                    
//* OMIT BTO CASES                                                              
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F500MNT,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(80,10),RLSE),                              
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(123,8,A),FORMAT=CH                                            
     INCLUDE COND=(123,1,CH,EQ,C'1')                                            
//*---------------------------------------------------------------------        
//* BP13.F500.SEQUENCE - ALREADY UPDATED WITH SEQ-REF-NO                        
//* COMPUTE DTE-BALLOT FOR THE QUARTER                                          
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=BP13C705,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F500MNT,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=BP13.F500.NT,DISP=OLD                                         
//BP13K703 DD DSN=BP13.K703.SOCDATE,DISP=SHR                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//*  OUTPUT REC FROM SOC MASTER WITHOUT REGN DATE                               
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K595.BALLOT.LOG,DISP=SHR,                                
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&P13F595,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(160,50),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      INCLUDE COND=(260,1,CH,EQ,C'C')                                           
//*---------------------------------------------------------------------        
//* PRINT REPORT FOR CANCELLATION REQUESTS                                      
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=BP13C527,COND=(0,NE)                                        
//BP13F595 DD DSN=&&P13F595,DISP=(OLD,PASS)                                     
//BP13K500 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K501 DD DSN=BP13.K730.MATURERQ.PATH1,DISP=SHR                             
//BP13K502 DD DSN=BP13.K730.MATURERQ.PATH2,DISP=SHR                             
//BP13K828 DD DSN=BP13.K828.HISTOCCP,DISP=SHR                                   
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13L527 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 4D,5D,ED FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING            
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010N,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'4 ',OR,                                             
       4,2,CH,EQ,C'5 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010N,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.BLANK.CHAR20,DISP=SHR                                    
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 4D,5D,ED FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING            
//*---------------------------------------------------------------------        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010D,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'4D',OR,                                            
                 4,2,CH,EQ,C'5D',OR,                                            
                 4,2,CH,EQ,C'ED')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY FOR DESIGN AND BUILD FLATS IN TAP              
//* BEFORE PIGEON-HOLING                                                        
//*---------------------------------------------------------------------        
//STEP10   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010D,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.BLANK.CHAR20,DISP=SHR                                    
//BP13L524 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//*  REPRO MATURE REQUEST                                                       
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT2   DD DSN=BP13.F500.NT,DISP=SHR                                         
//OUTPUT2  DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                   
//*                                                                             
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*                                                                             
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP15   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(131,1,CH,EQ,C'Y',AND,7,2,CH,NE,C'  ')                           
  OUTREC FIELDS=(1,200,200X)                                                    
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP16   EXEC PGM=BP13C577,COND=(0,NE)                                        
//BP13F500 DD DSN=BP13.F500.NT,DISP=SHR                                         
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=BP13.F558.UPGOCCP,DISP=OLD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=====================================================================        
//* END BP13A500                                                                
//*=====================================================================        
