//BP13M051 JOB (BP13P),'BP13M051',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================*           
//* OBJECTIVE : THIS JOB PROCESSES THE SENDING OF S&P FILE FROM     *           
//*             HDB TO CPF THRU IDNET.                              *           
//*-----------------------------------------------------------------*           
//* CHGE REQ  DATE        BY   DESCRIPTION                          *           
//* ========  ==========  ==== ===========                          *           
//* BP132249  13/01/2003  CLT1 BANK ORIGINATION JOB                 *           
//* BP132341  26/05/2003  CLT1 CATER FOR HBL2 INTERFACE WITH SMS    *           
//* BP132526  23/07/2004  SK   EXPAND BP13K671 LENGTH TO 3000       *           
//* BP132526  13/06/2005  LSB1 BACKUP BP13K677                      *           
//* BP132828  27/02/2006  LSB1 DELETE K671 > 6 MTH KEY-ISSUED       *           
//*=================================================================*           
//*-------------------------------------------------------------------*         
//*  BACKUP BP13K671 TO MTHLY FILE                                    *         
//*-------------------------------------------------------------------*         
//STEP01 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.K671.BO.FIN,DISP=SHR                                    
//OUTPUT1   DD DSN=BP13.F671.BO.FIN.MBKUP(+1),DISP=(NEW,CATLG),                 
//          SPACE=(CYL,(50,20)),                                                
//          DCB=(BP13.GDG,BLKSIZE=0,LRECL=3000,RECFM=FB)                        
//INPUT2    DD DSN=BP13.K677.BOFINHIS,DISP=SHR                                  
//OUTPUT2   DD DSN=BP13.F677.BOFINHIS.MBKUP(+1),DISP=(NEW,CATLG),               
//          SPACE=(CYL,(4,2)),                                                  
//          DCB=(BP13.GDG,BLKSIZE=0,LRECL=3500,RECFM=FB)                        
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-------------------------------------------------------------------*         
//* BACKUP BB24F04A TO MTHLY BKUP                                     *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.BB24.F04A.IBGCPF.MTH,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.BB24.F04A.IBGCPF.MBKUP(+1),DISP=(NEW,CATLG),             
//         SPACE=(CYL,(20,10)),                                                 
//         DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* CLEAR MTH ACCUM FILE FOR BB24F04A                                 *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.BB24.F04A.IBGCPF.MTH,DISP=SHR                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* BACKUP AB03F845 TO MTHLY BKUP                                     *         
//*-------------------------------------------------------------------*         
//STEP04   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.AB03.F845.SALES.MTH,DISP=SHR                             
//OUTPUT1  DD DSN=BP13.AB03.F845.SALES.MBKUP(+1),DISP=(NEW,CATLG),              
//         SPACE=(CYL,(20,10)),                                                 
//         DCB=(BP13.GDG,BLKSIZE=0,LRECL=150,RECFM=FB)                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*-------------------------------------------------------------------*         
//* CLEAR MTH ACCUM FILE FOR AB03F845                                 *         
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT1  DD DSN=BP13.AB03.F845.SALES.MTH,DISP=SHR                             
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT BY REGN-NO                                                             
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K671.BO.FIN,DISP=SHR                                     
//SORTOUT  DD DSN=&&BP13F671,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=3000,BLKSIZE=27000),                          
//            SPACE=(CYL,(30,10),RLSE)                                          
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
//*---------------------------------------------------------------------        
//*  DELETE BANKLOAN RECORD AFTER 6 MTH KEY-ISSUED DATE                         
//*---------------------------------------------------------------------        
//STEP07  EXEC PGM=BP13C459,COND=(0,NE)                                         
//BP13F671 DD DSN=&&BP13F671,DISP=(OLD,PASS)                                    
//BP13K671  DD DSN=BP13.K671.BO.FIN,DISP=SHR                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=SHR                                    
//P13F671A DD DSN=BP13.F671.BO.FINHIST,DISP=MOD                                 
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDUMP  DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*   END OF BP13M051                                                 *         
//*-------------------------------------------------------------------*         
