//BP13DP07 JOB (BP13P),'RSL XSP',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),             
//         NOTIFY=CSD0071                                                       
//JOBLIB DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                     
//*=====================================================================        
//* JOB TO CHECK RESALE SPOUSE OCCUPIER TO INFORM SOU                           
//* NOTE : SOU TO CONFIRM AND UPDATE HOUSEHOLD TYPE TO 'G' IF APPLICABLE        
//* STARTED FROM JUL 2012                                                       
//*=====================================================================        
//*---------------------------------------------------------------------        
//* EXTRACT CURRENT EXERCISE CASES TO FORM THE BP13F558 FILE                    
//*---------------------------------------------------------------------        
//STEP01   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(50,30))                                    
//BP13K764 DD DSN=BP13.K764.SALES,DISP=SHR                                      
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13F558 DD DSN=&&P13F5581,DISP=(NEW,PASS),                                   
//         SPACE=(CYL,(20,30),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//BP13F730 DD DSN=BP13.F730.MATURERQ.RSLXSP,DISP=OLD                            
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SK16),DISP=SHR                             
//*--------------------------------------------------------------------         
//* SORT XSPOUSE MATCHED AFTER RESALE FOR CASES WITH ALLOC SCHEME               
//* FOR BACKUP OF BP13F730 PURPOSE                                              
//*--------------------------------------------------------------------         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F5581,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F5582,DISP=(NEW,PASS),                                   
//         SPACE=(CYL,(10,30),RLSE),                                            
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*=====================================================================        
//* BASED ON EXTRACTED FILE CHECK RESALE HISTORY FOR SPOUSE AS OCCUPIER         
//*=====================================================================        
//STEP03   EXEC PGM=BP13CK17,COND=(0,NE)                                        
//BP13F558 DD DSN=&&P13F5582,DISP=(OLD,PASS)                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR                                   
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR                                    
//P13F558O DD DSN=BP13.F558.UPGOCCP.RSLXSP,DISP=OLD                             
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*=====================================================================        
//* GERNERATE REPORT FOR SOU ON XPOUSE WITH ALLOCATION SCHEME CHECKED           
//*=====================================================================        
//STEP04   EXEC SAS,COND=(0,NE)                                                 
//BP13F558 DD DSN=BP13.F558.UPGOCCP.RSLXSP,DISP=SHR                             
//BP13F730 DD DSN=BP13.F730.MATURERQ.RSLXSP,DISP=SHR                            
//BP13LK17 DD DSN=BP13.MAILOUT.BP13LK17.RSLXSP,DISP=OLD                         
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SK17),DISP=SHR                             
//*---------------------------------------------------------------------        
//* GENERATE FOREIGN NRIC NO. EXCEPTION REPORT                                  
//*---------------------------------------------------------------------        
//STEP05   EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(50,30))                                    
//BP13K764 DD DSN=BP13.K764.SALES,DISP=SHR                                      
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//BP13LK18 DD DSN=BP13.MAILOUT.BP13LK18.RSLXSP,DISP=OLD                         
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13SK18),DISP=SHR                             
//*                                                                             
//*---------------------------------------------------------------------        
//* MERGE FILES                                                                 
//*---------------------------------------------------------------------        
//STEP06  EXEC   PGM=IEBGENER,COND=(0,NE)                               00000060
//SYSPRINT DD  SYSOUT=*                                                 00000070
//SYSUT1   DD  DSN=BP13.MAILOUT.BP13LK17.HEADER,DISP=SHR                00000080
//         DD  DSN=BP13.MAILOUT.BP13LK17.RSLXSP,DISP=SHR                00000080
//         DD  DSN=BP13.MAILOUT.BP13LK18.RSLXSP,DISP=SHR                00000080
//SYSUT2   DD  DSN=BP13.MAILOUT.BP13LK18.RSLXSP.FINAL,DISP=OLD          00000110
//SYSIN    DD  DUMMY                                                    00000170
//****************************************************************              
//*  SEND THE SMTP MAIL FOR EXCEPTION REPORTS                                   
//*****************************************************************             
//STEP99A  EXEC SENDMAIL,COND=(0,NE)                                            
//INPUT    DD DSN=BP13.MAILOUT.BP13LK18.RSLXSP.FINAL,DISP=SHR                   
