//BP13D307 JOB (BP13P),'BP13D307',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//      NOTIFY=CSD0071                                                          
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================*           
//*                                                                 *           
//*            S U B    T R A N S F E R    J O B                    *           
//*                                                                 *           
//*=================================================================*           
//* CHG REF   DATE        BY   DESCRIPTION                                      
//* --------  ----        ---  -----------                                      
//* BP130418  31/08/1998  LJL1 Y2K COMPLIANCE CHANGES                           
//* BP130696  16/08/1999  CLT1 REMOVE STAMPING RELATED STEPS TO                 
//*                            BP13D407                                         
//* BP130883  27/10/2000  CLT1 REMOVE BP13C904 AND CALL BP13C913                
//* BP130883  30/10/2000  CLT1 REMOVE BP13C904 AND CALL BP13C913                
//* BP130850  07/11/2001  LSB  INCLUDE FILE BP13F915 ( CDB TRANS)               
//* BP132481  17/02/2004  MJ16 INCLUDE FILE BP13K022 IN BP13C131                
//* BP132546  11/06/2004  YCH2 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)            
//* BP132526  18/06/2004  SK   BANKLOAN SUBTRF - BP13C380,BP13C447              
//* BP132702  11/08/2005  CLT1 SUPPRESS REPORT - BL13L130, BP13L131,            
//*                                              BL13L350, BP13L358             
//* BP133194  10/11/2007  SSS2 STOP PRINT L104                                  
//* BP133591  22/05/2009  JB8  TO UPDATE KD05-AMT-AHG-USED IN C350              
//* BP134561  23/08/2012  AB9  ADD BP13C35A- FOR COURT ORDER                    
//*                            SEND EMAIL ALERT                                 
//* BP134561  23/04/2013  ESD1 INCLUDE NEW OUTPUT FILE FOR BP13C104.            
//* BP135171  11/02/2014  RJE1 TO CATER FOR DB2 UPGRADE                         
//* BP135901  27/08/2015  KSJ3 INCLUDE BP13K022 FOR BP13C350, ADD A             
//*                            SORT STEP ON F880 FOR BP13C353                   
//* BP136253  27/05/2016  KVL1 TO REMOVE P13L353A LISTING FROM STEP03           
//* BP138865  28/10/2021  KR13 CONVERT L14A REPORT TO IOM8.                     
//* BP138916  18/10/2022  ZAR7 ADD BP13C31Y TO UPD K885 CITIZENSHIP             
//*=================================================================            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG1 CP-1',END;                                     
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG1                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALAG2B CP-2',END;                                    
1$DJDE$ JDE=BP13S,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALAG2B                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* EXTRACT COMPLETED SUB-TRANSFER CASES, INCLUDE DTE-SIGN-FRESH-SA             
//*-----------------------------------------------------------------            
//STEP01  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K880.SUBTRF,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&BP13F880,DISP=(NEW,PASS),                                   
//            UNIT=3380,SPACE=(CYL,(35,10),RLSE),                               
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                
      INCLUDE COND=(258,8,CH,GE,C'19960601')                                    
//*                                                                             
//*-----------------------------------------------------------------            
//* UPDATE SOC MASTER, SUB-TRANSFER EX-APPLN FILE                               
//*-----------------------------------------------------------------            
//STEP02  EXEC PGM=BP13C350,COND=(0,NE)                                         
//BP13F880 DD DSN=&&BP13F880,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR,                                      
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K831 DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                                
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K310 DD DSN=BP13.K310.TRANS,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13KD05 DD DSN=BP13.KD05.CPFGRANT,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13OUT  DD DSN=BP13.F880.SUCCSTF,DISP=OLD                                    
//BP13KIV  DD DSN=BP13.F880.KIVSTF,DISP=OLD                                     
//BP13F120 DD DSN=BP13.F120.SATRAN.SUBTRF,DISP=SHR                              
//BP13F130 DD DSN=BP13.F130.SATRAN.SUBTRF,DISP=SHR                              
//BP13F800 DD DSN=BP13.F800.APPLN.SUBTRF,DISP=MOD                               
//BP13L350 DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT COURT ORDER NON REFUND CASES                                           
//*-----------------------------------------------------------------            
//STEP02A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F880.SUCCSTF,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F88B,DISP=(NEW,PASS),                                   
//            UNIT=3380,SPACE=(CYL,(35,10),RLSE),                               
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(1996,5,A,1,8,A),FORMAT=CH                                    
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT SUB-TRANSFER ORDER RAISE ON THE DAY                                   
//*-----------------------------------------------------------------            
//STEP03  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                
//BP13F880 DD DSN=&&BP13F88B,DISP=(OLD,DELETE)                                  
//BP13K890 DD DSN=BP13.K890.SUBOCCUP,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//*P13L353A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//P13L353B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//P13L353C DD DSN=&&P13L353C,DISP=(NEW,PASS),                                   
//            UNIT=DISK,SPACE=(CYL,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=132,BLKSIZE=0)                                
//P13L353D DD DSN=&&P13L353D,DISP=(NEW,PASS),                                   
//            UNIT=DISK,SPACE=(CYL,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=132,BLKSIZE=0)                                
//P13L353E DD DSN=&&P13L353E,DISP=(NEW,PASS),                                   
//            UNIT=DISK,SPACE=(CYL,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=132,BLKSIZE=0)                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13C353) PLAN(BP13PCC) -                                      
         LIB    ('BP13.BATCH.LOADCOB')                                          
     END                                                                        
//*                                                                             
//*=================================================================            
//* OUTPUT SUB-TRANSFER OCCUPIER AND SOC OCCUPIER REC                           
//* DELETE SUB-TRANSFER OCCUPIER FILE BP13K890                                  
//*-----------------------------------------------------------------            
//STEP04 EXEC PGM=BP13C351,COND=(0,NE)                                          
//BP13F880 DD DSN=BP13.F880.SUCCSTF,DISP=SHR                                    
//BP13K890 DD DSN=BP13.K890.SUBOCCUP,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F890 DD DSN=BP13.F890.SUBOCCP.SUBTRF,DISP=OLD                             
//BP13F820 DD DSN=BP13.F820.OCCUP.SUBTRF,DISP=OLD                               
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* UPDATE/CREATE/DELETE SOC OCCUPIER REC BP13K820 UPON SUB-TRANSFER            
//*-----------------------------------------------------------------            
//STEP05  EXEC PGM=BP13C358,COND=(0,NE)                                         
//BP13F890 DD DSN=BP13.F890.SUBOCCP.SUBTRF,DISP=SHR                             
//BP13F820 DD DSN=BP13.F820.OCCUP.SUBTRF,DISP=SHR                               
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F915 DD DSN=BP13.F915.CDBTRANS,DISP=MOD                                   
//BP13L358 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//*UPDATE K885-NUM-CITIZENSHIP                                                  
//*=================================================================            
//STEP05A  EXEC PGM=BP13C31Y,COND=(0,NE)                                        
//BP13F890 DD DSN=BP13.F890.SUBOCCP.SUBTRF,DISP=SHR                             
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* UPDATE SUB-TRANSFER EX-APPLN FILE  ON CONFIRMATION OF SUCC                  
//* SUB-TRANSFER CASES AND TAG THE ROOM TYPE IN EXAPPLT FILE.                   
//*-----------------------------------------------------------------            
//STEP06  EXEC PGM=BP13C352,COND=(0,NE)                                         
//BP13F880 DD DSN=BP13.F880.SUCCSTF,DISP=SHR                                    
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* ACCUMULATE SUCC SUB-TRANSFER CASES TO ACCUMULATED FILE                      
//*-----------------------------------------------------------------            
//STEP07  EXEC PGM=BP13C356,COND=(0,NE)                                         
//BP13F880 DD DSN=BP13.F880.SUCCSTF,DISP=SHR                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K882 DD DSN=BP13.K882.ACCUMSTF,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F885 DD DSN=BP13.F885.EXAPPLT.ACCUM,DISP=MOD                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* SORT COURT ORDER NON REFUND CASES                                           
//*-----------------------------------------------------------------            
//STEP07A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F880.SUCCSTF,DISP=SHR                                    
//SORTOUT  DD DSN=&&BP13F88A,DISP=(NEW,PASS),                                   
//            UNIT=3380,SPACE=(CYL,(35,10),RLSE),                               
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH                                             
      INCLUDE COND=(1911,1,CH,EQ,C'N')                                          
//*                                                                             
//*=================================================================            
//* UPDATE COURT ORDER NON REFUND CASES                                         
//*-----------------------------------------------------------------            
//STEP07B EXEC PGM=BP13C35A,COND=(0,NE)                                         
//BP13F880 DD DSN=&&BP13F88A,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L35A DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* SORT COURT ORDER NON REFUND CASES                                           
//*-----------------------------------------------------------------            
//STEP07C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//SORTOUT  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,25),RLSE),                              
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(4,8,A),FORMAT=CH                                             
      INCLUDE COND=(1595,1,CH,EQ,C'Y',AND,                                      
                    1604,1,CH,NE,C'Y')                                          
//*                                                                             
//*=================================================================            
//* CREATE MAIL OUT FILE FOR COURT ORDER APPROVED                               
//*-----------------------------------------------------------------            
//STEP07D EXEC PGM=BP13C35B,COND=(0,NE)                                         
//BP13F800 DD DSN=&&BP13F800,DISP=(OLD,DELETE)                                  
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//P13F35B  DD DSN=BP13.F35B.OUT,DISP=SHR                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//*   SORT BASED ON OIC                                                         
//*--------------------------------------------------------------------         
//STEP07E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F35B.OUT,DISP=SHR                                        
//SORTOUT  DD DSN=&&BP13F35B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,50),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                                 
//SYSIN    DD *                                                                 
     SORT FIELDS=(33,5,A,2,8,A),FORMAT=CH                                       
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE MAIL OUT FILE                                                        
//*-----------------------------------------------------------------            
//STEP07F  EXEC  PGM=BP13C35C,COND=(0,NE)                                       
//P13F35B  DD DSN=&&BP13F35B,DISP=(OLD,DELETE)                                  
//BP13MAIL DD DSN=&&BP13F35C,DISP=(NEW,PASS),                                   
//            UNIT=DISK,SPACE=(CYL,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)                             
//P13MAILA DD DSN=&&P13F35C,DISP=(NEW,PASS),                                    
//            UNIT=DISK,SPACE=(CYL,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*=================================================================            
//* CREATE MAIL OUT FILE FOR COURT ORDER COMPLETED                              
//*-----------------------------------------------------------------            
//STEP07G EXEC PGM=BP13C35D,COND=(0,NE)                                         
//BP13F880 DD DSN=&&BP13F88A,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR                                     
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR                               
//P13F35D  DD DSN=BP13.F35D.OUT,DISP=SHR                                        
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*--------------------------------------------------------------------         
//*   SORT BASED ON REGN                                                        
//*--------------------------------------------------------------------         
//STEP07H  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F35D.OUT,DISP=SHR                                        
//SORTOUT  DD DSN=&&BP13F35D,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,50),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=80,RECFM=FB)                                 
//SYSIN    DD *                                                                 
     SORT FIELDS=(33,5,A,2,8,A),FORMAT=CH                                       
//*                                                                             
//*-----------------------------------------------------------------            
//* CREATE MAIL OUT FILE                                                        
//*-----------------------------------------------------------------            
//STEP07I  EXEC  PGM=BP13C35E,COND=(0,NE)                                       
//P13F35D  DD DSN=&&BP13F35D,DISP=(OLD,DELETE)                                  
//BP13MAIL DD DSN=&&BP13F35E,DISP=(NEW,PASS),                                   
//            UNIT=DISK,SPACE=(CYL,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)                             
//P13MAILA DD DSN=&&P13F35E,DISP=(NEW,PASS),                                    
//            UNIT=DISK,SPACE=(CYL,(10,20),RLSE),                               
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=27920)                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*=================================================================            
//* 1. POST PAYMENT TO RFF MASTER FROM THE VALIDATED PAYMENT TRANS              
//* 2. FOR EACH UPDATE, OUTPUT REC TO TRANSACTION HISTORY FILE                  
//* ON TEMPORARY FILE                                                           
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=BP13C104,COND=(0,NE),PARM='-B'                              
//BP13F125 DD DSN=BP13.F120.SATRAN.SUBTRF,DISP=SHR                              
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K880 DD DSN=BP13.K880.SUBTRF,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L104 DD SYSOUT=*                                                          
//BP13L14A DD SYSOUT=8,DEST=IOM8                                                
//BP13F126 DD DSN=BP13.F125.DAILYTRN.SUBTRF,DISP=SHR                            
//BP13F127 DD DSN=BP13.F125.DAILYINT.SUBTRF,DISP=SHR                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* UPDATE SOC MASTER, SUB-TRANSFER EX-APPLN FILE                               
//*-----------------------------------------------------------------            
//STEP12  EXEC PGM=BP13C113,COND=(0,NE)                                         
//BP13F120 DD DSN=BP13.F120.SATRAN.SUBTRF,DISP=SHR                              
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K880 DD DSN=BP13.K880.SUBTRF,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13L113 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//BP13L13A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* UPDATE BALANCING FILE USING THE VALIDATE PAYMENT TRANS            *         
//*-------------------------------------------------------------------*         
//STEP13   EXEC PGM=BP13C105,COND=(0,NE)                                        
//BP13F125 DD DSN=BP13.F120.SATRAN.SUBTRF,DISP=SHR                              
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//BP13L105 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*********************************************                                 
//* EXTRACT SUB-TRANSFER CASES FOR RHMS PPS                                     
//*********************************************                                 
//STEP13A  EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K880.SUBTRF,DISP=SHR                                    
//SORTOUT  DD  DSN=&&BP13F88I,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(50,5),RLSE),                                         
//             DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB)                              
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,8,A),FORMAT=CH                                             
//***************************************                                       
//*CREATE SUB-TRANSFER CASES FOR RHMS PPS                                       
//***************************************                                       
//STEP13B  EXEC PGM=BP13CD64,COND=(0,NE)                                        
//BP13F880 DD DSN=&&BP13F88I,DISP=(OLD,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BP13F305 DD DSN=BP13.F305.UPDATE,DISP=MOD                                     
//BP13F30B DD DSN=BP13.F30B.LOG,DISP=MOD                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//*  SORT OUT UNCOMPLETED SUB-TRANSFER CASES, PUT BACK TO SUB-TRANSFER*         
//*  FILE                                                             *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K880.SUBTRF,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&F880SUB,DISP=(NEW,PASS),                                    
//            UNIT=3380,SPACE=(CYL,(20,10),RLSE),                               
//            DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,8,A),FORMAT=CH,FILSZ=E20000                                
      OMIT COND=(258,8,CH,NE,C'        ')                                       
//*                                                                             
//*-------------------------------------------------------------------*         
//* DELETE AND DEFINE SOC SUB-TRANSFER FILE                           *         
//*-------------------------------------------------------------------*         
//STEP15    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&F880SUB,DISP=(OLD,DELETE)                                  
//          DD DSN=BP13.F880.KIVSTF,DISP=SHR                                    
//SYSIN     DD  *                                                               
          DEL (BP13.K880.SUBTRF) CL PURGE                                       
          DEF CLUSTER                                -                          
              (NAME(BP13.K880.SUBTRF)                -                          
              CYL(20 10)                             -                          
              UNIQUE                                 -                          
              SPEED                                  -                          
              STORCLAS(PRODRLS)                      -                          
              LOG(NONE)                              -                          
              SHR(2 3))                              -                          
              DATA                                   -                          
              (NAME(BP13.K880.SUBTRF.DATA)           -                          
              KEYS(8 0)                              -                          
              RECSZ(2000 2000)                       -                          
              CISZ(4096)                             -                          
              FSPC(10 10))                           -                          
              INDEX                                  -                          
              (NAME(BP13.K880.SUBTRF.INDEX)          -                          
              CISZ(4096))                                                       
      IF MAXCC = 0  THEN                             -                          
         REPRO IFILE(INPUT1)                         -                          
              ODS(BP13.K880.SUBTRF)                                             
//*                                                                             
//*=================================================================            
//* BACKUP CASE INTO ACCUM FILE                                                 
//*-----------------------------------------------------------------            
//STEP16   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT18  DD DSN=BP13.F880.SUCCSTF,DISP=OLD                                    
//OUTPUT18 DD DSN=BP13.K880.SUBTRF.SUCC,DISP=SHR,                               
//            AMP=('BUFND=23')                                                  
//SYSIN     DD *                                                                
     REPRO INFILE(INPUT18) OUTFILE(OUTPUT18) REPLACE                            
//*                                                                             
//*=================================================================            
//* SORT OUT K885 RECS WITH 'Y' TAGS ON CDE-VOUCHER                             
//*-----------------------------------------------------------------            
//STEP17   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F885,DISP=(NEW,PASS),                                       
//            UNIT=(SYSDA,1),                                                   
//            DCB=(BLKSIZE=0,LRECL=400,RECFM=FB),                               
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=((140,1,CH,EQ,C'Y',AND,184,1,CH,EQ,C' '))                      
    SUM FIELDS=NONE                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* RETAIN ONLY VALID K885 RECORDS FOR FURTHER PROCESSING                       
//*-----------------------------------------------------------------            
//STEP18   EXEC PGM=BP13C130,COND=(0,NE)                                        
//BP13F885 DD DSN=&&F885,DISP=(OLD,DELETE)                                      
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13FOUT DD DSN=BP13.F885.EXAPPLT.C130,DISP=SHR                               
//BP13L130 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-----------------------------------------------------------------            
//* PRINT VOUCHERS FOR REFUND FOR SUB-TRANSFER                                  
//*-----------------------------------------------------------------            
//STEP19   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//BP13K130 DD DSN=BP13.K130.SOCHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13F885 DD DSN=BP13.F885.EXAPPLT.C130,DISP=SHR                               
//BP13L129 DD SYSOUT=8,DEST=IOM8                                                
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C129) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* TAG EXAPPLT IF REFUND IS RAISED.                                            
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=BP13C131,COND=(0,NE)                                        
//AB02F003 DD DSN=AB02.F003.SOCREFND,DISP=SHR                                   
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                    
//            AMP=('BUFNI=8','BUFND=4')                                         
//BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13L131 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* BANK LOAN CASE UPDATE BP13K671 ACCORDING TO SUB-TRANSFER FILE     *         
//* CREATE CPF HISTORY RECORDS (BP13K677)                             *         
//*-------------------------------------------------------------------*         
//STEP21   EXEC PGM=BP13C380,COND=(0,NE)                                        
//BP13F880 DD DSN=&&BP13F880,DISP=(OLD,DELETE)                                  
//BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K677 DD DSN=BP13.K677.BOFINHIS,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*                                                                             
//*=================================================================            
//* INCLUDE SUB-TRF CASES AND SUBSTR-PROCESSED NOT = 'Y'                        
//*-----------------------------------------------------------------            
//*  //STEP22    EXEC SORT,COND=(0,NE)                                          
//*  //SORTIN    DD DSN=BP13.K671.BO.FIN,DISP=SHR                               
//*  //SORTOUT   DD DSN=&&F671SBTR,DISP=(NEW,PASS),                             
//*  //             UNIT=(SYSDA,1),                                             
//*  //             DCB=(LRECL=3000,RECFM=FB),                                  
//*  //             SPACE=(CYL,(10,10),RLSE)                                    
//*  //SYSIN     DD *                                                           
//*      SORT FIELDS=(1,8,A),FORMAT=CH                                          
//*      INCLUDE COND=(2001,1,CH,EQ,C'Y',AND,2392,1,CH,NE,C'Y')                 
//*  //*                                                                        
//*-----------------------------------------------------------------            
//* INCLUDE SUB-TRF SHORTFALL CASES AND SUBSTR-PROCESSED NOT = 'Y'              
//*-----------------------------------------------------------------            
//*  //STEP23    EXEC SORT,COND=(0,NE)                                          
//*  //SORTIN    DD DSN=BP13.E671.BO.FIN.LOG,DISP=SHR                           
//*  //SORTOUT   DD DSN=&&F671SBTR,DISP=(MOD,PASS),                             
//*  //             UNIT=(SYSDA,1),                                             
//*  //             DCB=(LRECL=3000,RECFM=FB),                                  
//*  //             SPACE=(CYL,(10,10),RLSE)                                    
//*  //SYSIN     DD *                                                           
//*      SORT FIELDS=(1,8,A),FORMAT=CH                                          
//*      INCLUDE COND=(2001,1,CH,EQ,C'Y',AND,                                   
//*                    2392,1,CH,NE,C'Y',AND,                                   
//*                    2393,1,CH,EQ,C'Y')                                       
//*  //*                                                                        
//*=================================================================            
//* CHECK PAYMENT CAME FULLY UPDATED FOR SUB-TRANSFER                           
//* KIV IMPLEMENTATION - 13/06/2005                                             
//*-----------------------------------------------------------------            
//*STEP24   EXEC PGM=BP13C447,COND=(0,NE)                                       
//*BP13F671 DD DSN=&&F671SBTR,DISP=(OLD,PASS)                                   
//*BP13K671 DD DSN=BP13.K671.BO.FIN,DISP=SHR                                    
//*BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=SHR,                                  
//*        AMP=('BUFND=8','BUFNI=4')                                            
//*BP13F300 DD DSN=BP13.F300.SUCCESS,DISP=MOD                                   
//*BP13F121 DD DSN=BP13.F121.BANKIBG,DISP=MOD                                   
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*                                                                             
//*=================================================================            
//* EMPTY THE FILE                                                              
//*-----------------------------------------------------------------            
//STEP25   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT26  DD DSN=NULLFILE,DISP=SHR                                             
//OUTPUT26 DD DSN=AB02.F003.SOCREFND,DISP=OLD                                   
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT26) OUTFILE(OUTPUT26)                                      
//*                                                                             
//*=================================================================            
//* BACKUP DELETED KIV RECORDS                                                  
//*-----------------------------------------------------------------            
//STEP26   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K885.EXAPPLT,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//OUTPUT1  DD DSN=BP13.F885.EXAPPLT.BACKUP,DISP=SHR                             
//SYSIN    DD *                                                                 
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
//*                                                                             
//*=================================================================            
//* BACKUP DELETED KIV RECORDS                                                  
//*-----------------------------------------------------------------            
//STEP27   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K880.SUBTRF,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F880.SUBTRF.BACKUP,DISP=SHR                              
//SYSIN    DD *                                                                 
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
//*                                                                             
//*=================================================================            
//* BACKUP DELETED KIV RECORDS                                                  
//*=================================================================            
//STEP28   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K882.ACCUMSTF,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//OUTPUT1  DD DSN=BP13.F882.ACCUMSTF.BACKUP,DISP=SHR                            
//SYSIN    DD *                                                                 
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
//*                                                                             
//*=================================================================            
//* BACKUP DELETED KIV RECORDS                                                  
//*-----------------------------------------------------------------            
//STEP29   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K890.SUBOCCUP,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//OUTPUT1  DD DSN=BP13.F890.SUBOCCUP.BACKUP,DISP=SHR                            
//SYSIN    DD *                                                                 
         REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                  
//*                                                                             
//*=================================================================            
//* BACKUP BP13K677                                                             
//*-----------------------------------------------------------------            
//STEP31 EXEC PGM=IDCAMS,COND=(0,NE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT     DD DSN=BP13.K677.BOFINHIS,DISP=SHR                                  
//OUTPUT    DD DSN=BP13.F677.BOFINHIS.DAILY(+1),DISP=(NEW,CATLG),               
//             SPACE=(CYL,(4,2)),                                               
//             DCB=(BP13.GDG,BLKSIZE=0,LRECL=3500,RECFM=FB)                     
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT)  OUTFILE(OUTPUT)                                         
//*                                                                             
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP32   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13F35C,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP33   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13F35C,DISP=(OLD,DELETE)                                   
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP34   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&BP13F35E,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP35   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13F35E,DISP=(OLD,DELETE)                                   
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP36   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L353C,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP37   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L353D,DISP=(OLD,DELETE)                                  
//*-------------------------------------------------------------------*         
//*  SEND MAINFRAME EMAIL                                                       
//*-----------------------------------------------------------------            
//STEP38   EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L353E,DISP=(OLD,DELETE)                                  
//*-----------------------------------------------------------------            
//*=================================================================            
//*                 END OF BP13D307                                             
//*=================================================================            
