//BP13Y721 JOB (BP13P),'BP13Y721',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//*-------------------------------------------------------------------          
//* CHG-NO   BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -------------------------------------------          
//* BP135171 RJE1 20140211 TO CATER FOR DB2 UPGRADE                             
//*-------------------------------------------------------------------          
//*  PRT01 : 1 COPY                                                             
//*-----------------------------------------------------------------            
//PRT01    EXEC  PGM=IEBGENER                                                   
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,OUTPUT=(*.FORMID)                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*                                                                             
//*-----------------------------------------------------------------            
//* COVERING LETTER BY SIM LIAN                                                 
//*-----------------------------------------------------------------            
//PRT02   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13POT5,JDL=BP13,FORMS=BP13IO,END;                                    
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1B                                     
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*===============================================================              
//* SORT OUT PROJECT DTE-BALLOT/MODE/SCH-ACC-NO                                 
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K800.APPLN,DISP=SHR,                                     
//         AMP=('BUFNI=8','BUFND=4')                                            
//SORTOUT  DD DSN=&&BP13F800,DISP=(,PASS),                                      
//        UNIT=SYSDA,DCB=(RECFM=FB,LRECL=2000),                                 
//        SPACE=(CYL,(10,3),RLSE)                                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(155,11,A),FORMAT=CH                                              
  INCLUDE COND=(1,1,CH,NE,C'C',AND,                                             
                924,3,CH,EQ,C'DBS',AND,                                         
                155,3,CH,NE,C'   ',AND,                                         
                785,6,CH,EQ,C'200810')                                          
//*---------------------------------------------------------------------        
//* PRINT DBSS CHANGE OF TOP DATE LETTER                                        
//*---------------------------------------------------------------------        
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F800  DD DSN=&&BP13F800,DISP=(SHR,PASS)                                   
//BP13K820  DD DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K830  DD DSN=BP13.K830.ADDR,DISP=SHR,                                     
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K831  DD DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13PD4AO  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//BP13LD4A  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSTSPRT  DD SYSOUT=*                                                         
//SYSTSIN   DD *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13CD4A) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*                                                                             
