//BP13A21D JOB (BP13P),'BP13A21D',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071,                                                  
//             TYPRUN=HOLD                                                      
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*********************************************************************         
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR E-REGISTRATION SYSTEM FOR CRG                               
//* BASED ON POSTAL CODES INPUT, UPDATE DETAILS INTO EVENT_PTCPNT AND           
//* THE FINAL STATUS INTO EVENT_PRFL                                            
//*********************************************************************         
//*CHG REF  OIC   DATE    DESCRIPTION                                           
//*-------- ---- -------- ------------------------------------------            
//*BP137495 CC37 19122018 NEW JCL FOR E-REGISTRATION SYSTEM FOR CRG             
//*BP137495 CC37 27092019 ADDED FILE BM06F120                                   
//*BP137583 KR13 13012020 DEF TEMP BM06K120 FOR CRG4.                           
//******************************************************************            
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT  DD  DSN=&&BP13F205,DISP=(NEW,PASS),                                  
//             SPACE=(CYL,(2,1),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=80,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(16,27,A,1,15,A),FORMAT=CH                                       
   INCLUDE COND=(14,2,CH,EQ,C'CR')                                              
/*                                                                              
//******************************************************************            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BM06.F120.FLATINV.PIDB,DISP=SHR                               
//SORTOUT  DD  DSN=&&F120,DISP=(NEW,PASS),                                      
//             SPACE=(CYL,(200,100),RLSE),                                      
//             DCB=(RECFM=FB,LRECL=700,BLKSIZE=0)                               
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* TO CREATE TEMP BM06K120                                                     
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT    DD DSN=&&F120,DISP=(OLD,DELETE)                                      
//SYSIN    DD *                                                                 
         DEF CL (NAME(BM06.K120.PIDB.TEMP)            -                         
                 CYL(200 100)                         -                         
                 UNIQUE                               -                         
                 SPEED                                -                         
                 SHR(2 3))                            -                         
                 DATA                                 -                         
                 (NAME(BM06.K120.PIDB.TEMP.DATA)      -                         
                 KEYS(11 0)                           -                         
                 RECSZ(700 700)                       -                         
                 FSPC(10 10)                          -                         
                 CISZ(4096))                                                    
         IF LASTCC = 0 THEN                           -                         
           REPRO IFILE(INPUT)                         -                         
                 ODS(BM06.K120.PIDB.TEMP)                                       
//*--------------------------------------------------------------------*        
//*  TO CREATE RECORDS IN EVENT-PTCPNT TABLE                                    
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F205 DD DSN=&&BP13F205,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K830 DD DSN=BP13.K830.ADDR,DISP=SHR                                       
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//BP13K857 DD DSN=BP13.K857.EMAIL,DISP=SHR                                      
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH1,DISP=SHR                              
//BM06K112 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                              
//BM06K120 DD DSN=BM06.K120.PIDB.TEMP,DISP=SHR                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
 DSN SYSTEM(DSN)                                                                
 RUN PROGRAM(BP13CRG4) PLAN(BP13PCC) -                                          
     LIB('BP13.BATCH.LOADCOB')                                                  
 END                                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* ACCUM CONTROL REC                                                           
//*-----------------------------------------------------------------            
//STEP05 EXEC    PGM=IDCAMS                                                     
//SYSPRINT DD  SYSOUT=*                                                         
//INPUT1   DD  DSN=&&BP13F205,                                                  
//             DISP=(SHR,DELETE)                                                
//OUTPUT1  DD  DSN=BP13.F205.ACCUM,                                             
//             DISP=MOD                                                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
/*                                                                              
//*---------------------------------------------------------------------        
//* TO DELETE TEMPORARY BM06K120 VSAM FILE                                      
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
       DEL 'BM06.K120.PIDB.TEMP' CL PURGE                                       
//*---------------------------------------------------------------------        
