//BP13ADP8 JOB (BP13P),'BP13ADP8',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//* SAME JOB AS BP13A512, DBSS FILE FOR OIC                                     
//* UPLOAD BALLOT RESULT TO BP13K800/K820/K200                                  
//* OUTREC FLAT-TYPE=5 FOR COMPUTE LOAN TAG                                     
//*=================================================================            
//*=================================================================            
//* CHG REF  DATE     BY   DESCRIPTION                                          
//* -------- -------- ---  -----------                                          
//* BP130652 19990824 NOR  EXPAND F520,K740,K740 RECL 300 TO 500                
//* BP130778 19991215 YCH  TO INCLUDE BP13F713.PIGEON.PA                        
//* BP130871 20000609 SSS  LISTING FOR EAALSS                                   
//* BP130897 20000807 AKT  EXPAND F558 RECL FROM 400 TO 600                     
//* BP132283 20021226 ANC1 ADD STEPS TO DETERMINE LOAN TAG & PREM CDE           
//* BP132352 20030625 SK   ADD BP13C145,BP13C144                                
//* BP132384 20030731 ANC1 ADD STEPS TO CAPTURE EXISTING/EX-DP FLATS            
//* BP132432 20031021 MJ16 REMOVE PROCESSING OF NON BANK LOAN CASES             
//* BP132451 20031202 SK   ADD BP13L520 FOR BP13C520                            
//* BP132627 20041130 SSS2 DELETE F542 / K542 DATASETS                          
//* BP132618 20050104 ROM1 READ BP04.K010 INSTEAD OF BP04.F010                  
//* BP132653 20050215 CKK7 INCLUDE BP13C175 REPORTS                             
//* BP132862 20060615 CKK7 INCLUDE BP13K648 IN BP13C528                         
//* BP133083 20070614 IL5  INCLUDE STEPS TO GENERATE REPORT BP13L534            
//* BP133253 20080130 IL5  INCLUDE ZONE FOR BP13S534                            
//* BP133244 20080215 LSB  OUTREC FT=5 FOR LOAN CHECK                           
//* BP133389 20080731 JB8  TO CATER FOR DBSS PRJCT                              
//* BP133527 20090331 YCH2 INCLUDE UPDATE OF RESALE LEVY 'LN' OR 'LNS'          
//* BP133527 20090423 YCH2 DROP UPDATE OF RESALE LEVY 'LN' 'LNS' FOR DBS        
//* BP134024 20100930 ZDD1 INCLUDE BP13K813 ON BP13C528                         
//* BP134270 20110711 IL5  REMOVE STEPS TO ASSIGN OIC                           
//*                        REMOVE BP13K022, BP13K025 FROM VERIFY                
//* BP134447 20120127 IL5  BACKUP BP13.K740.MATUREBA TO                         
//*                        BP13.K740.MATUREBA.DBS                               
//* BP135043 21082013 SMR2 CATER FOR EC BALLOTING                               
//* BP135171 10022014 RJE1 TO CATER FOR DB2 UPGRADE                             
//* BP135505 21102014 IL5  REPLACE BP13.F200.BKAPPMT WITH                       
//*                        BP13.F200.BKAPPMT.EC                                 
//* BP135872 31072015 SMR2 CHANGE CLASS 2 TO CLASS J                            
//* BP139931 29022024 AM25 CHANGE CLASS J TO CLASS 2                            
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//*INPUT1   DD DSN=BP13.K530.ISSUENO,DISP=OLD                                   
//*          VFY FILE(INPUT1)                                                   
//*--------------------------------------------------------------------         
//STEP01  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT2   DD DSN=BP13.K800.APPLN.DBS,DISP=OLD                                  
//INPUT3   DD DSN=BP13.K820.OCCUP.DBS,DISP=OLD                                  
//INPUT4   DD DSN=BP13.K840.APPLHIST,DISP=OLD                                   
//INPUT5   DD DSN=BP13.K648.BANKLOAN,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
//*=================================================================            
//*  SEND DJDE AHEAD OF THE PRINT DATASET                                       
//*  PRT01                                                                      
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAALSS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------- 00330000
//*  TO DELETE/CREATE SOC MASTER FILE                                   00340000
//*-------------------------------------------------------------------- 00350000
//STEP0A    EXEC PGM=IDCAMS,COND=(0,NE)                                 00360000
//INPUT1    DD DSN=BP13.BLANK.CHAR2000,DISP=SHR                         00370000
//SYSPRINT  DD SYSOUT=*                                                 00380000
//SYSIN     DD  *                                                       00390000
          DEL (BP13.K800.APPLN.DBS) CL PURGE                            00400000
          DEF CLUSTER                                -                  00410000
              (NAME(BP13.K800.APPLN.DBS)             -                  00420000
              CYL(50 10)                             -                  00430000
              DATACLAS(MULTIVOL)                     -                  00440000
              SPEED                                  -                  00450000
              UNIQUE                                 -                  00460000
              STORCLAS(PRODRLS)                      -                  00470000
              LOG(NONE)                              -                  00480000
              SHR(2 3))                              -                  00490000
              DATA                                   -                  00500000
              (NAME(BP13.K800.APPLN.DBS.DATA)        -                  00510000
              KEYS(8 3)                              -                  00520000
              RECSZ(2000 2000)                       -                  00530000
              CISZ(4096)                             -                  00540000
              FSPC(10 10))                           -                  00550000
              INDEX                                  -                  00560000
              (NAME(BP13.K800.APPLN.DBS.INDEX)       -                  00570000
              CISZ(4096))                                               00580000
      IF MAXCC = 0  THEN                             -                  00590000
         REPRO IFILE(INPUT1)                         -                  00600000
              ODS(BP13.K800.APPLN.DBS)                                  00610000
//*-------------------------------------------------------------------- 00970000
//*      TO CREATE SOC OCCUPIER FILE  ( BP13.K820.OCCUP )               00980000
//*-------------------------------------------------------------------- 00990000
//STEP0B    EXEC PGM=IDCAMS,COND=(0,NE)                                 01000000
//SYSPRINT  DD SYSOUT=*                                                 01010000
//INPUT1   DD DSN=BP13.BLANK.CHAR400,DISP=SHR                           01020000
//SYSIN     DD  *                                                       01030000
          DEL (BP13.K820.OCCUP.DBS) CL PURGE                            01040000
          DEF CLUSTER                                -                  01050000
              (NAME(BP13.K820.OCCUP.DBS)             -                  01060000
              CYL(350 100)                           -                  01070000
              DATACLAS(MULTIVOL)                     -                  01080000
              STORCLAS(PRODRLS)                      -                  01090000
              LOG(NONE)                              -                  01100000
              SPEED                                  -                  01110000
              UNIQUE                                 -                  01120000
              SHR(2 3))                              -                  01130000
              DATA                                   -                  01140000
              (NAME(BP13.K820.OCCUP.DBS.DATA)        -                  01150000
              KEYS(17 0)                             -                  01160000
              RECSZ(400 400)                         -                  01170000
              CISZ(4096)                             -                  01180000
              FSPC(10 10))                           -                  01190000
              INDEX                                  -                  01200000
              (NAME(BP13.K820.OCCUP.DBS.INDEX)       -                  01210000
              CISZ(4096))                                               01220000
      IF MAXCC = 0  THEN                             -                  01230000
         REPRO IFILE(INPUT1)                         -                  01240000
              ODS(BP13.K820.OCCUP.DBS)                                  01250000
      IF MAXCC = 0  THEN                             -                  01260000
           DEF AIX (NAME(BP13.K820.OCCUP.DBS.ALTX1)  -                  01270000
               REL(BP13.K820.OCCUP.DBS)              -                  01280000
               REUSE                                 -                  01290000
               KEYS(9 8)                             -                  01300000
               SHR(2 3)                              -                  01310000
               NUNQK)                                -                  01320000
               DATA                                  -                  01330000
               (NAME(BP13.K820.OCCUP.DBS.ALTX1.DATA)     -              01340000
               CYL(100 50)                          -                   01350000
               RECSZ(31 354)                         -                  01360000
               FSPC(10 10)                           -                  01370000
               CISZ(4096))                           -                  01380000
               INDEX                                 -                  01390000
               (NAME(BP13.K820.OCCUP.DBS.ALTX1.INDEX)    -              01400000
               CISZ(4096))                                              01410000
         IF MAXCC = 0 THEN                           -                  01420000
           DEF PATH (NAME(BP13.K820.OCCUP.DBS.PATH1)     -              01430000
               PENT(BP13.K820.OCCUP.DBS.ALTX1))                         01440000
         IF MAXCC = 0 THEN                                              01450000
           BIX IDS(BP13.K820.OCCUP.DBS)                  -              01460000
               ODS(BP13.K820.OCCUP.DBS.ALTX1)                           01470000
//*-------------------------------------------------------------------- 00970000
//*      CHANGE UNSUCCESSFUL TCP TO PA                                  00980000
//*-------------------------------------------------------------------- 00990000
//STEP0C   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SORTOUT  DD DSN=&&F740TCP,                                                    
//             DISP=(NEW,PASS),                                                 
//             SPACE=(1,(70000,20000),RLSE),AVGREC=K,                           
//             DSORG=PS,LRECL=500,BLKSIZE=0,RECFM=FB                            
//SYSIN    DD *                                                                 
 SORT FIELDS=(1,28,A),FORMAT=CH                                                 
      INCLUDE COND=(213,3,CH,EQ,C'TCP',AND,                                     
                    260,1,CH,EQ,C'W')                                           
      OUTREC FIELDS=(1,212,C'PA ',216,204,C'TCP',423,78)                        
//*-------------------------------------------------------------------- 00970000
//*      REPRO CHANGES INTO BP13K740                                    00980000
//*-------------------------------------------------------------------- 00990000
//STEP0D   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&F740TCP,DISP=(OLD,DELETE)                                   
//OUTPUT1  DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT1) OFILE(OUTPUT1) REPLACE                                
//*-------------------------------------------------------------------- 00970000
//*      CHANGE UNSUCCESSFUL MCP TO PA                                  00980000
//*-------------------------------------------------------------------- 00990000
//STEP0E   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SORTOUT  DD DSN=&&F740MCP,                                                    
//             DISP=(NEW,PASS),                                                 
//             SPACE=(1,(70000,20000),RLSE),AVGREC=K,                           
//             DSORG=PS,LRECL=500,BLKSIZE=0,RECFM=FB                            
//SYSIN    DD *                                                                 
 SORT FIELDS=(1,28,A),FORMAT=CH                                                 
      INCLUDE COND=(213,3,CH,EQ,C'MCP',AND,                                     
                    260,1,CH,EQ,C'W')                                           
      OUTREC FIELDS=(1,212,C'PA ',216,204,C'MCP',423,78)                        
//*-------------------------------------------------------------------- 00970000
//*      REPRO CHANGES INTO BP13K740                                    00980000
//*-------------------------------------------------------------------- 00990000
//STEP0F   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&F740MCP,DISP=(OLD,DELETE)                                   
//OUTPUT1  DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SYSIN    DD *                                                                 
      REPRO IFILE(INPUT1) OFILE(OUTPUT1) REPLACE                                
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&BP13F740,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT    COND=(226,3,CH,EQ,C'   ')                                            
   OUTREC FIELDS=(1,210,C'5 ',213,288)                                          
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER (FOR BP13F200 IN STEP20A)                            
//* FLAT TYPE WILL REMAIN AS '4'                                                
//*-----------------------------------------------------------------            
//STEP02A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//            AMP=('BUFND=22')                                                  
//SORTOUT  DD DSN=&&F740BK,DISP=(NEW,PASS),                                     
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OMIT    COND=(226,3,CH,EQ,C'   ')                                            
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F825,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(50,5),RLSE),                               
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                               
  OUTREC FIELDS=(1,200,200X)                                                    
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13C577,COND=(0,NE)                                        
//BP13F500 DD DSN=&&BP13F740,DISP=(OLD,PASS)                                    
//BP13F820 DD DSN=&&BP13F825,DISP=(OLD,PASS)                                    
//BP13F558 DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT BY NRIC SEQUENCE                                                       
//*---------------------------------------------------------------------        
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&P13F558B,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=27600,LRECL=600,RECFM=FB),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST, SOC-OCCUPIER FILE                             
//* MATCH NRIC IN SMS FILE, IF MATCH UPDATE AS UPGRADER                         
//*---------------------------------------------------------------------        
//STEP06   EXEC PGM=BP13U706,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&P13F558B,DISP=(OLD,PASS)                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K080 DD DSN=AB03.K080.UINACC,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K081 DD DSN=AB03.K080.PATH1,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//AB03K700 DD DSN=AB03.K700.CUSTFILE,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=&&P13F558C,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//BP13F559 DD DUMMY                                                             
//BP13L706 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* MATCH NRIC WITH TRANSFER HISTORY ONLY FOR TRF-APPLN-DTE  AFTER              
//* '19970901' OR FOR DIVORCE CASES TRF-APPLN-DATE > 19970709                   
//* AND TRF-SCH-ACC IS NOT THE SAME AS SMS-SCH-ACC                              
//* AS ONE NRIC TRANSFER, ALL FOUR LESSEE WILL BE FOUND IN TRANSFER             
//* BP13.F558.UPGOCCP CONTAINS TRANSFER HISTORY DATA                            
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=BP13C619,COND=(0,NE)                                        
//BB13K510 DD DSN=BB13.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BB13K500 DD DSN=BB13.K500.HISTORY,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13F558 DD DSN=&&P13F558C,DISP=(OLD,PASS)                                    
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT IN SCH-ACC-NI ORDER FOR RETRIEVING FLAT TYPE FROM PBF                  
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN     DD  *                                                               
   SORT FIELDS=(101,11,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* FLAT TYPE  IS NOT AVAILABLE IN SMS                                          
//* BASED ON THE SCHEME ACCOUNT FR SMS EXTRACT FLAT TYPE FROM PBF               
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F558 DD DSN=&&F558SORT,DISP=(OLD,PASS)                                    
//BP13OUT  DD DSN=&&F558PBF,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C742) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT BP13F558 IN NRIC ORDER, IF ONE NRIC WITH MULTIPLE SMS REC          
//* PROGRAM WILL SELECT THE BIGGER FLAT TYPE                                    
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558PBF,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F558SMSF,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,17,A),FORMAT=CH                                               
//*---------------------------------------------------------------------        
//* SELECT THE LEAST PRIORITY IF FOUND TO HAVE MULTIPLE SMS RECORDS             
//* SELECT BIGGER FLAT TYPE, DIRENT PURCHASE OVER OPEN MARKET                   
//*---------------------------------------------------------------------        
//STEP11   EXEC PGM=BP13C734,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558SMSF,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=&&F558FLAT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT BY NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F558FLAT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F558RESL,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600),                           
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE)                              
//SYSIN    DD  *                                                                
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* BASED ON THE NRIC IN REQUEST , SOC-OCCUPIER FILE                            
//* MATCH NRIC IN RESALE FILE, IF MATCH UPDATE AS UPGRADER                      
//*---------------------------------------------------------------------        
//STEP13   EXEC PGM=BP13U702,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13F558 DD DSN=&&F558RESL,DISP=(OLD,PASS)                                    
//BB24K500 DD DSN=BB24.K500.RESLHIST,DISP=SHR,                                  
//            AMP=('BUFND=8','BUFNI=4')                                         
//BB24K510 DD DSN=BB24.K510.UINHIST,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F558O DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//BP13L702 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT REQUEST OCCUPIER BY NRIC                                               
//*---------------------------------------------------------------------        
//STEP14A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558NRIC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(9,9,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* SORT DEBARMENT FILE BY PRIMARY KEY                                          
//*---------------------------------------------------------------------        
//STEP14B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=8','BUFNI=4')                                         
//SORTOUT  DD DSN=&&BP04K010,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,2),SPACE=(CYL,(1000,150),RLSE),                       
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=27900)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,44,A),FORMAT=CH                                            
//*---------------------------------------------------------------------        
//* MATCH SOC OCCUPIER REC WITH DEBARMENT REC FD IN                             
//*---------------------------------------------------------------------        
//STEP15   EXEC PGM=BP13C690,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558NRIC,DISP=(OLD,PASS)                                    
//P04K010  DD DSN=&&BP04K010,DISP=(OLD,PASS)                                    
//P13F558A DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=OLD                           
//P13F558B DD DUMMY                                                             
//P13F558C DD DUMMY                                                             
//P13F558D DD DUMMY                                                             
//P13F558E DD DUMMY                                                             
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY REGN NO                                                             
//*-----------------------------------------------------------------            
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BANKLOAN,DISP=SHR                           
//SORTOUT  DD DSN=&&F558RDB,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(200,30),RLSE),                             
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                            
//SYSIN    DD  *                                                                
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
//*=====================================================================        
//* RDB INFO                                                                    
//*=====================================================================        
//*---------------------------------------------------------------------        
//* SPLIT F558 FILE FROM THE OUTPUT OF DETERMINE THE HOUSEHOLD TYPE             
//* IF - HHTYPE='G' OR '3' OR                                                   
//*      (HHTYPE='H' AND FILE-STATUS-SMS OR FILE-STATUS-RSL = 'OM')             
//*          OUTPUT TO BP13F716                                                 
//* ELSE                                                                        
//*      OUTPUT TO BP13F716 TO CHECK RDB                                        
//*---------------------------------------------------------------------        
//* 1)  P13F716A - TO FURTHER CHECK WITH RDB                                    
//* 2)  BP13F716 - INFO ALREADY FOUND IN SMS & RESALE                           
//*---------------------------------------------------------------------        
//STEP16A  EXEC PGM=BP13C788,COND=(0,NE)                                        
//BP13F558 DD DSN=&&F558RDB,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=&&P13F716A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//BP13F716 DD DSN=&&BP13F716,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650),                           
//            UNIT=SYSDA,SPACE=(CYL,(60,15),RLSE)                               
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT IN NRIC SEQUENCE                                                   
//*---------------------------------------------------------------------        
//STEP16B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F716A,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716SORT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(9,9,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*---------------------------------------------------------------------        
//STEP16C  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716SORT,DISP=(OLD,PASS)                                    
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR                                   
//P13F716A DD DSN=&&F716Q748,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q748) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* USE SCH-ACC-NO TO GET ESTATE-CODE IN PBF                                    
//* USE ESTATE-CODE TO GET NEW TOWN CODE FOR RDB RECORDS                        
//*---------------------------------------------------------------------        
//STEP16D  EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716Q748,DISP=(OLD,PASS)                                    
//BM06K510 DD DSN=BM06.K510.ESTCDE,DISP=SHR                                     
//BP13OUT  DD DSN=&&F716C754,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C754) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT IN REGN NO SEQUENCE                                                
//*---------------------------------------------------------------------        
//STEP16E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//         DD DSN=&&F716C754,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716REGN,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(60,9),RLSE),                               
//            DCB=(RECFM=FB,LRECL=350,BLKSIZE=27650)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,8,A),FORMAT=CH                                                
//*---------------------------------------------------------------------        
//*  TO DETERMINE SMS FT/STATUS, RSL FT/STATUS, RDB FT/STATUS                   
//*---------------------------------------------------------------------        
//STEP16F   EXEC PGM=BP13C519,COND=(0,NE)                                       
//BP13F716  DD DSN=&&F716REGN,DISP=(OLD,PASS)                                   
//BP13F520  DD DSN=&&BP13F740,DISP=(OLD,PASS)                                   
//P13F520A  DD DSN=&&F520C519,DISP=(NEW,PASS),                                  
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT THE REGN NO ORDER                                                      
//*-----------------------------------------------------------------            
//STEP16G  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F520C519,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520SORT,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//*  TO DETERMINE LOAN TAG & PREMIUM CODE                                       
//*---------------------------------------------------------------------        
//STEP17    EXEC PGM=BP13C520,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520SORT,DISP=(OLD,PASS)                                   
//BP13F558  DD DSN=&&F558RDB,DISP=(OLD,PASS)                                    
//BR10K010  DD DSN=BR10.K010.PTEPPTY,DISP=SHR,                                  
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//P13F520A  DD DSN=&&BP13F520,DISP=(NEW,PASS),                                  
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//             UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                              
//BP13L520  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*                                                                             
//*-----------------------------------------------------------------            
//* SORT F520 IN REGN NO ORDER                                                  
//* OUTREC FT=4 FOR UPLOAD TO SOC MASTER                                        
//*-----------------------------------------------------------------            
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F520A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            UNIT=SYSDA,SPACE=(CYL,(65,10),RLSE)                               
//SYSIN DD *                                                                    
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*OUTREC FIELDS=(1,210,C'4 ',213,288)                                          
//*---------------------------------------------------------------------        
//* TO EXTRACT THE SUCCESSFUL BALLOTED APPLICANT'S & OCCUPIER INFOR             
//* TO UPDATE THE SOC MASTER AND SOC OCCUPIER FILE                              
//* TO PASS RECORDS TO CFS FOR PRE-ELIGIBILITY CHECK                            
//*---------------------------------------------------------------------        
//STEP19    EXEC PGM=BP13C528,COND=(0,NE)                                       
//BP13F520  DD DSN=&&P13F520A,DISP=(OLD,PASS)                                   
//BP13K530  DD DSN=BP13.K530.ISSUENO,DISP=SHR                                   
//BP13K825  DD DSN=BP13.K825.REQOCCP,DISP=SHR                                   
//BP13K800  DD DSN=BP13.K800.APPLN.DBS,DISP=SHR,                                
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K820  DD DSN=BP13.K820.OCCUP.DBS,DISP=SHR,                                
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K840  DD DSN=BP13.K840.APPLHIST,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K648  DD DSN=BP13.K648.BANKLOAN,DISP=SHR,                                 
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13K813  DD DSN=BP13.K813.BTOBE,DISP=SHR,                                    
//             AMP=('BUFNI=8','BUFND=4')                                        
//BP13F310  DD DSN=BP13.F310.APPOINT,DISP=MOD                                   
//BP13F800  DD DSN=&&BP13F800,DISP=(NEW,PASS),                                  
//             DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                             
//             UNIT=SYSDA,SPACE=(CYL,(40,20),RLSE)                              
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*******************************************************************           
//* SORT CSM BY PROJECT FOR D08                                                 
//*------------------------------------------------------------------           
//*STEP19A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F800,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F800A,DISP=(NEW,PASS),                                     
//*            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                             
//*            SPACE=(CYL,(100,15),RLSE)                                        
//*SYSIN    DD *                                                                
//* SORT FIELDS=(4,8,A),FORMAT=CH                                               
//* INCLUDE COND=(51,3,CH,EQ,C'TAP')                                            
//* OUTREC FIELDS=(1,64,C'D08',68,1933)                                         
//*******************************************************************           
//* SORT F730 FILE TO F800 FORMAT                                               
//*------------------------------------------------------------------           
//*STEP19E  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F800A,DISP=(OLD,DELETE)                                    
//*SORTOUT  DD DSN=&&F800FILE,DISP=(NEW,PASS),                                  
//*            DCB=(BLKSIZE=0,LRECL=2000,RECFM=FB),                             
//*           SPACE=(CYL,(100,15),RLSE)                                         
//*SYSIN    DD *                                                                
//* SORT FIELDS=(4,8,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* ASSIGNING RESISTRATION NUMBER TO OIC                                        
//*-----------------------------------------------------------------            
//*STEP19F  EXEC PGM=BP13C14A,COND=(0,NE)                                       
//*BP13F800 DD DSN=&&F800FILE,DISP=(OLD,PASS)                                   
//*BP13F520 DD DSN=&&P13F520A,DISP=(OLD,PASS)                                   
//*BP13K025 DD DSN=BP13.K025.CSM.DBSS,DISP=SHR,                                 
//*         AMP=('BUFNI=8','BUFND=4')                                           
//*BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//*         AMP=('BUFNI=8','BUFND=4')                                           
//*BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                             
//*         AMP=('BUFND=8','BUFNI=4')                                           
//*BP13L14A DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSUDUMP DD SYSOUT=*                                                         
//*SYSABEND DD SYSOUT=*                                                         
//*SYSDBUG  DD SYSOUT=*                                                         
//*SYSABOUT DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SKIP F800 CASES WHERE DTE-REGN IS NOT = F001-CURR-DTE                       
//*-----------------------------------------------------------------            
//*STEP19G  EXEC PGM=BP13C14B,COND=(0,NE)                                       
//*BP13F800 DD DSN=&&F800FILE,DISP=(OLD,DELETE)                                 
//*BP13K025 DD DSN=BP13.K025.CSM.DBSS,DISP=SHR,                                 
//*         AMP=('BUFNI=8','BUFND=4')                                           
//*BP13K022 DD DSN=BP13.K022.WISOIC,DISP=SHR,                                   
//*         AMP=('BUFNI=8','BUFND=4')                                           
//*BP13K021 DD DSN=BP13.K022.WISOIC.PATH1,DISP=SHR,                             
//*         AMP=('BUFND=8','BUFNI=4')                                           
//*BP13L14B DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSUDUMP DD SYSOUT=*                                                         
//*SYSABEND DD SYSOUT=*                                                         
//*SYSDBUG  DD SYSOUT=*                                                         
//*SYSABOUT DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* SORT BP13F800 RECORDS IN ESTATE, FLAT TYPE AND REGN NO SEQ                  
//*--------------------------------------------------------------------         
//STEP19H  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F800,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F800R,DISP=(NEW,PASS),                                   
//         DCB=(RECFM=FB,LRECL=2000,BLKSIZE=0),                                 
//         UNIT=SYSDA,SPACE=(CYL,(40,20),RLSE)                                  
//SYSIN    DD *                                                                 
  SORT FIELDS=(51,3,A,30,2,A,4,8,A),FORMAT=CH                                   
/*                                                                              
//*                                                                             
//*--------------------------------------------------------------------         
//* PRINT 3 REPORTS. =< $2000 HSEHLD-INCOME, LRT AND STAGGERED PAYMENT          
//* P13L175A - =< $2000 HOUSEHOLD INCOME REPORT                                 
//* P13L175B - IDP-SCH = LRT REPORT                                             
//* P13L175C - STAGGERED PAYMENT (1/2 IDP-SCH = 'S') REPORT                     
//*--------------------------------------------------------------------         
//STEP19I  EXEC  PGM=BP13C175,COND=(0,NE)                                       
//BP13F800 DD  DSN=&&P13F800R,DISP=(OLD,DELETE)                                 
//BP13K820 DD  DSN=BP13.K820.OCCUP.DBS,DISP=SHR                                 
//P13L175A DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//P13L175B DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//P13L175C DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*----------------------------------------------------------------*            
//* TO EXTRACT SUCCESSFUL APPLICANTS FROM REQUEST FILE             *            
//*----------------------------------------------------------------*            
//STEP20   EXEC PGM=BP13C579,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                  
//BP13F520 DD DSN=&&F740BK,DISP=(SHR,DELETE)                                    
//BP13F200 DD DSN=&&P13F200A,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=23400),                           
//            UNIT=SYSDA,SPACE=(CYL,(2,1),RLSE)                                 
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* TO APPEND BP13F200 RECORDS TO BOOKING APPOINTMENT FILE                      
//*---------------------------------------------------------------------        
//STEP21    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&P13F200A,DISP=(SHR,PASS)                                   
//OUTPUT1   DD DSN=BP13.F200.BKAPPMT.EC,DISP=OLD                                
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                        
/*                                                                              
//*---------------------------------------------------------------------        
//* INCLUDE NRIC FOUND IN SMS AS HUDC FLAT , SORT BY REGN-NO                    
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.MATURENT,DISP=SHR                           
//SORTOUT  DD DSN=&&BP13F558,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=600),                                         
//            UNIT=SYSDA,SPACE=(CYL,(100,10),RLSE)                              
//SYSIN    DD  *                                                                
      SORT FIELDS=(1,8,A),FORMAT=CH                                             
      INCLUDE COND=(101,4,CH,GE,C'7911',AND,                                    
                    101,4,CH,LE,C'7999')                                        
/*                                                                              
//*--------------------------------------------------------------------         
//*    EXTRACT F810 RECORDS WITH CHANGED ZONE CODES                             
//*--------------------------------------------------------------------         
//STEP23   EXEC PGM=BP13C532,COND=(0,NE)                                        
//BP13F558 DD DSN=&&BP13F558,DISP=(OLD,PASS)                                    
//BP13K740 DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                               
//            AMP=('BUFND=23')                                                  
//BP13K741 DD DSN=BP13.K740.MATUREBA.EC.PATH1,DISP=SHR,                         
//            AMP=('BUFND=23')                                                  
//BP13L532 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*    SORT OUT REC WITH FROM BP13K740 (REQUEST STATUS 'S' OR 'R')              
//*--------------------------------------------------------------------         
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//SORTOUT  DD DSN=&&BP13K740,DISP=(NEW,PASS),                                   
//        UNIT=SYSDA,DCB=(LRECL=500,RECFM=FB),                                  
//        SPACE=(CYL,(500,250),RLSE)                                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   OUTREC FIELDS=(1,500)                                                        
   INCLUDE COND=(260,1,CH,EQ,C'S',OR,                                           
                 260,1,CH,EQ,C'R')                                              
//*                                                                             
//*-------------------------------------------------------------------*         
//*    SORT OUT REC WITH PREM-CODE = 'SN' FROM BP13K800                         
//*-------------------------------------------------------------------*         
//STEP25   EXEC SORT,COND=(0,NE)                                                
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.K800.APPLN.DBS,DISP=SHR                                  
//SORTOUT  DD DSN=&&BP13K800,DISP=(NEW,PASS),                                   
//         LRECL=50,RECFM=FB,DSORG=PS,DATACLAS=MULTIVOL,                        
//         SPACE=(5,(2,2),RLSE),AVGREC=M,BLKSIZE=0                              
//SYSIN    DD *                                                                 
   SORT FIELDS=(4,8,CH,A)                                                       
   OUTREC FIELDS=(4,8,30,1,51,3,81,1,88,9,97,9,525,1,                           
                  526,5,785,6,924,3,963,1,49,2)                                 
   INCLUDE COND=(964,2,CH,EQ,C'SN')                                             
/*                                                                              
//*--------------------------------------------------------------------*        
//* TO GENERATE REPORT ON APPLICATIONS WITH RESALE STATUS = 'SN'                
//*--------------------------------------------------------------------*        
//STEP26     EXEC SAS,OPTIONS='MACRO',COND=(0,NE)                               
//WORK       DD UNIT=SYSDA,SPACE=(CYL,(200,100),,,ROUND)                        
//BP13K740   DD DSN=&&BP13K740,DISP=(SHR,DELETE)                                
//BP13K800   DD DSN=&&BP13K800,DISP=(SHR,DELETE)                                
//BP13L534   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                      
//SYSIN      DD DSN=BP13.BATCH.SRC(BP13S534),DISP=SHR                           
/*                                                                              
//*---------------------------------------------------------------------00036900
//* BACKUP DBS RECORDS INTO K740.MATUREBA.DBS                           00037000
//*---------------------------------------------------------------------00037100
//STEP27   EXEC PGM=IDCAMS,COND=(0,NE)                                  00037200
//SYSPRINT DD SYSOUT=*                                                  00037300
//SYSIN    DD *                                                         00037400
         DEL (BP13.K740.MATUREBA.DBS) CL PURGE                          00037500
//*---------------------------------------------------------------------00041600
//* TO CREATE THE BALLOT FILE & TO ENSURE THAT NO DUPLICATE RANDOM NO   00041700
//* BY USINF DEFINE VSAM BALLOT FILE                                    00041800
//*---------------------------------------------------------------------00041900
//STEP28   EXEC PGM=IDCAMS,COND=(0,NE)                                  00042000
//SYSPRINT DD SYSOUT=*                                                  00042100
//INPUT    DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                        00042204
//SYSIN    DD *                                                         00042300
         DEF CL (NAME(BP13.K740.MATUREBA.DBS)        -                  00042400
                 CYL(36 5)                       -                      00042500
                 UNIQUE                          -                      00042600
                 SPEED                           -                      00042700
                 STORCLAS(PRODRLS)               -                      00042800
                 LOG(NONE)                       -                      00042900
                 SHR(2 3))                       -                      00043000
                 DATA                            -                      00043100
                 (NAME(BP13.K740.MATUREBA.DBS.DATA)  -                  00043200
                 KEYS(28 0)                      -                      00043300
                 RECSZ(500 500)                  -                      00043400
                 FSPC(10 10)                     -                      00043500
                 CISZ(4096))                                            00043600
         IF LASTCC = 0 THEN                      -                      00043700
           REPRO IFILE(INPUT)                    -                      00043800
                 ODS(BP13.K740.MATUREBA.DBS)                            00043900
//*-------------------------------------------------------------------- 00044000
//*      TO CREATE PATH/ALTX FOR MATUREBA BALLOT FILE                   00045000
//*-------------------------------------------------------------------- 00046000
//STEP29   EXEC PGM=IDCAMS,COND=(0,NE)                                  00047000
//SYSPRINT DD SYSOUT=*                                                  00048000
//INPUT1   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                        00049000
//SYSIN    DD  *                                                        00050000
           DEF AIX (NAME(BP13.K740.MATUREBA.DBS.ALTX1)   -              00060000
               REL(BP13.K740.MATUREBA.DBS)               -              00070000
               REUSE                                 -                  00080000
               KEYS(8 122)                            -                 00090000
               SHR(2 3)                              -                  00100000
               NUNQK)                                -                  00110000
               DATA                                  -                  00120000
               (NAME(BP13.K740.MATUREBA.DBS.ALTX1.DATA) -               00130000
               CYL(10 5)                              -                 00140000
               RECSZ(31 354)                         -                  00150000
               FSPC(10 10)                           -                  00160000
               CISZ(4096))                           -                  00170000
               INDEX                                 -                  00180000
               (NAME(BP13.K740.MATUREBA.DBS.ALTX1.INDEX) -              00190000
               CISZ(4096))                                              00200000
         IF MAXCC = 0 THEN                           -                  00210000
           DEF PATH (NAME(BP13.K740.MATUREBA.DBS.PATH1) -               00220000
               PENT(BP13.K740.MATUREBA.DBS.ALTX1))                      00230000
         IF MAXCC = 0 THEN                                              00240000
           BIX IDS(BP13.K740.MATUREBA.DBS)               -              00250000
               ODS(BP13.K740.MATUREBA.DBS.ALTX1)                        00260000
