//BP13M002 JOB (BP13P),'CS94324',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),             
//             COND=(4,LT),NOTIFY=CSD0071                                       
//**********************************************************************        
//* 1.TO BACKUP THE DAILY ACCUMALATED FT(PMC) FILES INTO MONTHLY BACKUP         
//* 2.TO FTP FTPMC ACCUMULATED ELIGIBLE AND INELIGIBLE FILE TO USER.            
//**********************************************************************        
//*--------------------------------------------------------------------         
//* CHG REF   BY   ON           DESCRIPTION                                     
//* ---------------------------------                                           
//* BP139831 SC54 12122023    - TO CHECK IF THERE IS DETAIL TO FTP AND          
//*                             BACKUP.                                         
//*                           - IF THERE IS DETAIL WHEN STEP01.SORT.            
//*                             RC=0, PERFORM BACKUP & FTP STEPS.               
//*                           - CHANGE THE DESTINATION FILE NAME.               
//**********************************************************************        
//*STEP01: TO CHECK IF THERE IS DETAILS TO FTP FOR THE DAY.                     
//**********************************************************************        
//STEP01   EXEC SORT,PARM='NULLOUT=RC4'                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SORTIN   DD  DISP=SHR,DSN=BP13.FDM27001.ACCEPTED.SD                           
//         DD  DISP=SHR,DSN=BP13.FDM28001.REJECTED.SD                           
//SORTOUT  DD  DUMMY                                                            
//SYSIN    DD  *                                                                
  SORT FIELDS=COPY                                                              
  OMIT COND=(7,8,CH,EQ,X'0000000000000000',OR,                                  
             7,8,CH,EQ,X'FFFFFFFFFFFFFFFF')                                     
/*                                                                              
//IF1      IF (STEP01.SORT.RC = 0) THEN                                         
//**********************************************************************        
//*STEP02: BACKUP DAILY ACCUMALATED ELIGIBLE FILE TO MONTHLY BACKUP             
//**********************************************************************        
//STEP02   EXEC PGM=ICEGENER                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DISP=SHR,DSN=BP13.FDM27001.ACCEPTED.SD                            
//SYSUT2   DD DSN=BP13.FM002001.ACCEPTED.SD(+1),                                
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(30,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                            
//SYSIN    DD DUMMY                                                             
/*                                                                              
//**********************************************************************        
//*STEP03: BACKUP DAILY ACCUMALATED INELIGIBLE FILE TO MONTHLY BACKUP           
//**********************************************************************        
//STEP03   EXEC PGM=ICEGENER                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DISP=SHR,DSN=BP13.FDM28001.REJECTED.SD                            
//SYSUT2   DD DSN=BP13.FM002002.REJECTED.SD(+1),                                
//            DISP=(NEW,CATLG,DELETE),                                          
//            SPACE=(CYL,(50,20),RLSE),                                         
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                            
//SYSIN    DD DUMMY                                                             
/*                                                                              
//**********************************************************************        
//*STEP04: SYMBOL TRANSLATOR TO APPEND TIMESTAMP TO DEST. FILE NAME             
//**********************************************************************        
//STEP04   EXEC PGM=EZACFSM1                                                    
//SYSIN    DD   *                                                               
PUT '//DD:INFILE1 ' +                                                           
    'BP13M002_FTPMC_ELIGIBLE_&LYR4&LMON&LDAY_&LHR&LMIN..TXT'                    
PUT '//DD:INFILE2 ' +                                                           
    'BP13M002_FTPMC_INELIGIBLE_&LYR4&LMON&LDAY_&LHR&LMIN..TXT'                  
QUIT                                                                            
/*                                                                              
//SYSOUT   DD DISP=(NEW,PASS,DELETE),                                           
//            DCB=(RECFM=FB,LRECL=80,BLKSIZE=0),                                
//            DSN=&&STEP04                                                      
/*                                                                              
//**********************************************************************        
//*STEP05: FTP FILES TO USER FOLDER                                             
//**********************************************************************        
//STEP05   EXEC FTP,PARM='HDBWINFS1 (EXIT'                                      
//NETRC    DD DISP=SHR,DSN=SY08.FTP.NETRC.BP13                                  
//INFILE1  DD DISP=SHR,DSN=BP13.FDM27001.ACCEPTED.SD                            
//INFILE2  DD DISP=SHR,DSN=BP13.FDM28001.REJECTED.SD                            
//INPUT    DD *                                                                 
CD /GROUP/EAPG/APPS/BP13/PREEREPORTS                                            
ASCII                                                                           
/*                                                                              
//         DD DSN=&&STEP04,DISP=(OLD,DELETE,DELETE)                             
/*                                                                              
//**********************************************************************        
//*STEP06: INITAIZE ACCUMLATION DAILY ELIGIBLE FILE                             
//**********************************************************************        
//STEP06   EXEC PGM=ICEGENER                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DUMMY,                                                            
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSUT2   DD DISP=SHR,DSN=BP13.FDM27001.ACCEPTED.SD                            
//SYSIN    DD DUMMY                                                             
/*                                                                              
//**********************************************************************        
//*STEP07:INITAIZE ACCUMLATION DAILY INELIGIBLE FILE                            
//**********************************************************************        
//STEP07   EXEC PGM=ICEGENER                                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSUT1   DD DUMMY,                                                            
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=0)                                
//SYSUT2   DD DISP=SHR,DSN=BP13.FDM28001.REJECTED.SD                            
//SYSIN    DD DUMMY                                                             
/*                                                                              
//IF1      ENDIF                                                                
