//BP13DM29 JOB (BP13P),'CS94324',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),             
//             COND=(0,NE),NOTIFY=CSD0071                                       
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*                                                                             
//**********************************************************************        
//*FTPMC TAG UPDATE TO APPLICATION REQUEST VASM FILE (BP13K730)                 
//**********************************************************************        
//*STEP01: MERGE AND SORT INELIGIBILITY FILES                                   
//**********************************************************************        
//STEP01   EXEC PGM=SORT                                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDUMP  DD SYSOUT=*                                                          
//SORTIN   DD DISP=SHR,DSN=BP13.FDM24004.REJECTED.SD(0)                         
//         DD DISP=SHR,DSN=BP13.FDM26002.REJECTED.SD(0)                         
//         DD DISP=SHR,DSN=BP13.FDM25002.REJECTED.SD(0)                         
//SORTOUT  DD DISP=(NEW,PASS,DELETE),                                           
//            UNIT=CART,                                                        
//            DCB=(RECFM=FB,LRECL=100),                                         
//            DSN=&&STEP01                                                      
//SYSIN    DD *                                                                 
   OMIT COND=(07,08,CH,EQ,X'0000000000000000',OR,                               
              07,08,CH,EQ,X'FFFFFFFFFFFFFFFF')                                  
   SORT FIELDS=(07,08,CH,A)                                                     
/*                                                                              
//**********************************************************************        
//*STEP02: MERGE AND SORT INELIGIBILITY FILES WITH FINAL ELIGIBLE FILE          
//**********************************************************************        
//STEP02   EXEC PGM=SORT                                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDUMP  DD SYSOUT=*                                                          
//SORTIN   DD DISP=SHR,DSN=BP13.FDM25001.ACCEPTED.SD(0)                         
//         DD DISP=(OLD,DELETE,DELETE),DSN=&&STEP01                             
//SORTOUT  DD DISP=(NEW,PASS,DELETE),                                           
//            UNIT=CART,                                                        
//            DCB=(RECFM=FB,LRECL=100),                                         
//            DSN=&&STEP02                                                      
//SYSIN    DD *                                                                 
   SORT FIELDS=(07,08,CH,A)                                                     
/*                                                                              
//**********************************************************************        
//*STEP03:FT(PMC) TAG UPDATE TO APPLICATION REQUEST VSAM FILE (BP13K730)        
//**********************************************************************        
//STEP03   EXEC PGM=BP13CM29                                                    
//SYSPRINT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//SYSTSPRT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//BP13FIN1  DD DISP=(OLD,DELETE,DELETE),DSN=&&STEP02                            
//BP13K730  DD DISP=OLD,DSN=BP13.K730.MATURERQ,                                 
//             AMP=('BUFND=4','BUFNI=8')                                        
//BP13FOT1  DD DSN=BP13.FDM29001.REJECTED.SD(+1),                               
//             DISP=(NEW,CATLG,DELETE),                                         
//             SPACE=(CYL,(10,20),RLSE),                                        
//             DCB=(RECFM=FB,LRECL=100,BLKSIZE=27900)                           
//*                                                                             
