//BP13ARE5  JOB (BP13P),'BP13ARE5',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071,TYPRUN=HOLD                                 
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*---------------------------------------------------------------------        
//* THIS JCL COMBINE BP13A509, BP13ABAL AND BP13A522 TOGETHER                   
//* THIS JCL IS COPY FROM BP13ARES, DIFF IS USING BP13K712                      
//* ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~                 
//* STEP01-06 ADJUST PA ETHNIC MAX ALLOWANCE TAKEN BY GRO - BP13A509            
//* STEP07-15 ADJUST BAL GRO QUOTA TO PA AFTER PIGEONHOLING OFGRO               
//* STEP16    COMPUTE NO OF FT/2T FLAT QUOTA                                    
//* STEP17    PRINT FLAT SUPPLY REPORT                                          
//*                                                                             
//* LATEST CHANGE - 05022002 - COMMENT OUT STEP1B DUE TO SWAP OF GRO            
//*                            AND PRO PIGEONHOLING                             
//**********************************************************************        
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP131064 CKK  20010925 DETERMINE THE RESIDENT QUOTA FOR PA CASES            
//* BP132360 CKK  20030725 TO CREATE ALTERNATE KEY FOR BP13K740                 
//* BP132546 YCH  11062004 INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                
//* BP132596 PGS  17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E           
//* BP132693 CKK  12052005 TO REMOVE DEFINATION OF K740 ALT KEY                 
//* BP133142 IL5  14092007 TO REMOVE REPORT PRINTING FOR K012                   
//* BP133913 IL5  25052010 REMOVE UNUSED REPORTS                                
//* BP134688 IL5  25102012 OMIT UNSHORTLISTED GRO RECORDS FROM                  
//*                        PUBLIC ROUND                                         
//* BP134718 SMR2 04122012 EXCLUDE UNSUCCESSFUL MGP RECORD FROM                 
//*                        PUBLIC ROUND SHORTLISTING                            
//* BP134782 SMR2 04022013 CHANGE BP13C545 TO BP13CF78 TO CATER                 
//*                        FOR PPS SHORTLISTING                                 
//* BP134861 EAA1 30042013 EXPAND BP13K010 TO 600                               
//* BP135392 SMR2 19062014 CATER FOR 3P FLAT TYPE                               
//* BP135458 SMR2 04082014 EXPAND BP13K712 TO 350                               
//* BP135708 SMR2 31032015 CHANGE CLASS=2 TO CLASS=J                            
//* BP136055 IL5  17122015 CATER FOR 2F FLAT TYPE                               
//* BP136096 IL5  07012016 REINSTATE STEPS15-19.ADD STEP20 TO                   
//*                        CLEAR FILES                                          
//* BP138076 IL5  08012020 REPLACE BP13C751 WITH BP13C757                       
//*                        CEASE RUNNING BP13C766 (REPL WITH BP13C759)          
//* BP138301 AM25 14052020 HARDCOPY REPORTS CONVERSION                          
//* BP139411 AM25 07122022 ADD SYSIN FOR BP13CF78                               
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
//*--------------------------------------------------------------------         
//* DELETE DATASETS                                                             
//*--------------------------------------------------------------------         
//STEP00 EXEC  PGM=IDCAMS                                                       
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
    DEL   ('BP13.F740.MATUREBA.GRO.UNSUCC')                                     
             IF MAXCC < 12 THEN                                                 
                SET MAXCC = 0                                                   
/*                                                                              
//*---------------------------------------------------------------------        
//* START OF BP13A509                                                           
//*---------------------------------------------------------------------        
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F010.TENDER.GRO.AFTER,DISP=OLD                           
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.GRO.AFTER,DISP=OLD                         
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
//*-------------------------------------------------------------------          
//* ADJUST MAX-PA-CAT1/CAT2/CAT3 AFTER PIGEONHOLING OF GRO                      
//*--------------------------------------------------------------------         
//STEP02   EXEC PGM=BP13C757,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13F010 DD DSN=BP13.F010.TENDER.PA,DISP=SHR                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* FOR MATURE NT                                                               
//* SORT UNSUCC PRIORITY AND PUBLIC CASES FOR PA PIGEONHOLONG                   
//*---------------------------------------------------------------------        
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.PA,DISP=OLD                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,213,3,CH,NE,C'GRO',AND,                 
                 245,1,CH,EQ,C' ')                                              
//*---------------------------------------------------------------------        
//* SORT UNSUCC GRO                                                             
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=BP13.F740.MATUREBA.GRO.UNSUCC,DISP=(NEW,CATLG),               
//            SPACE=(CYL,(2,5),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
   INCLUDE COND=(226,3,CH,EQ,C'   ',AND,213,3,CH,EQ,C'GRO')                     
//*--------------------------------------------------------------------         
//* START OF BP13ABAL                                                           
//*--------------------------------------------------------------------         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.MATNT,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*--------------------------------------------------------------------         
//* ADJUST BALANCE GRO QUOTA TO PA QUOTA AFTER PIGEONHOLING OF GRO              
//* ADJUST BALANCE OF PRIORITY QUOTA TO PA QOUTA                                
//*--------------------------------------------------------------------         
//*STEP10   EXEC PGM=BP13C766,COND=(0,NE)                                       
//*BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*--------------------------------------------------------------------         
//* UPDATE TOTAL PRIORTY QUOTA BASED ON REGISTERED                              
//*--------------------------------------------------------------------         
//STEP10   EXEC PGM=BP13C759,COND=(0,NE)                                        
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING             
//*---------------------------------------------------------------------        
//STEP11    EXEC SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&P13K010B,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
  INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                             
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&P13K010B,DISP=(OLD,DELETE)                                  
//BP13F713 DD DSN=BP13.F713.PIGEON.BALANCE,DISP=SHR                             
//BP13L524 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING               
//*---------------------------------------------------------------------        
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K0104RMA,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'4P',OR,                                                      
       4,2,CH,EQ,C'5P',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP14   EXEC PGM=BP13C524,COND=(0,NE)                                        
//SYSPRINT DD SYSOUT=*                                                          
//BP13F010 DD DSN=&&K0104RMA,DISP=(OLD,PASS)                                    
//BP13F713 DD DSN=BP13.F713.PIGEON.BALANCE,DISP=SHR                             
//BP13L524 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT 3P FLATS TO PRINT FLAT SUPPLY BEFORE PIGEONHOLING                  
//*---------------------------------------------------------------------        
//STEP14A   EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT   DD DSN=&&P13K010C,DISP=(,PASS),                                     
//          UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                              
//          DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                  
//SYSIN     DD *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3P')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP14B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&P13K010C,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.BALANCE,DISP=SHR                            
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//****************************************************************              
//* START BP13ARE5                                                              
//****************************************************************              
//*---------------------------------------------------------------------        
//* CREATE/DEFINE BP13K712 FLAT NHH/UPG FILE                                    
//*---------------------------------------------------------------------        
//STEP15    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.BLANK.CHAR350,DISP=SHR                                  
//SYSIN     DD  *                                                               
          DEL (BP13.K712.FLATNHUG) CL PURGE                                     
          DEF CLUSTER                                -                  00800000
              (NAME(BP13.K712.FLATNHUG)              -                  00810000
              CYL(1 1)                               -                  00830000
              UNIQUE                                 -                  00840000
              STORCLAS(PRODRLS)               -                                 
              LOG(NONE)                       -                                 
              SHR(2 3))                              -                  00850000
              DATA                                   -                  00860000
              (NAME(BP13.K712.FLATNHUG.DATA)         -                  00870000
              KEYS(10 0)                             -                  00880000
              RECSZ(350 350)                         -                  00890000
              CISZ(4096)                             -                  00900000
              FSPC(10 10))                           -                  00910000
              INDEX                                  -                  00920000
              (NAME(BP13.K712.FLATNHUG.INDEX))                          00930000
      IF MAXCC = 0  THEN                             -                  00950000
         REPRO IFILE(INPUT1)                         -                  00960000
              ODS(BP13.K712.FLATNHUG)                                   00720000
//*---------------------------------------------------------------------        
//* SORT THE BALLOT FILE FOR PA SCHEME (NEW TOWN, FLAT TYPE, ALLOC SCH)         
//* SORT OUT FLAT TYPE '2' NON-ELDERLY APPLICATIONS                             
//*---------------------------------------------------------------------        
//STEP16A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                
//SORTOUT  DD DSN=&&F520NHUG,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(187,3,A,211,2,A,213,3,A),FORMAT=CH                            
     INCLUDE COND=(211,1,CH,EQ,C'2',AND,                                        
                  (210,1,CH,EQ,C'N',OR,210,1,CH,EQ,C' '))                       
//*                                                                             
//*---------------------------------------------------------------------        
//* SORT THE BALLOT FILE FOR PA SCHEME (NEW TOWN, FLAT TYPE, ALLOC SCH)         
//* SORT OUT OTHER FLAT TYPES                                                   
//*---------------------------------------------------------------------        
//STEP16B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F740.MATUREBA.PA,DISP=SHR                                
//SORTOUT  DD DSN=&&F520NHUG,DISP=(MOD,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(120,10),RLSE),                             
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD *                                                                 
     SORT FIELDS=(187,3,A,211,2,A,213,3,A),FORMAT=CH                            
     INCLUDE COND=(211,1,CH,NE,C'2')                                            
//*                                                                             
//*---------------------------------------------------------------------        
//* COMPUTE NO OF TOTAL REQUESTS FOR NHH/UPG FOR PA ONLY                        
//*---------------------------------------------------------------------        
//STEP17   EXEC PGM=BP13C54A,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13F520 DD DSN=&&F520NHUG,DISP=(OLD,PASS)                                    
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* COMPUTE NO OF UNITS SET ASIDE FOR NHH/UPG FOR PRIORITY SCHEME               
//* COMPUTE FOR PA SCHEME                                                       
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=BP13CF78,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
//*---------------------------------------------------------------------        
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG FOR EACH COHORT                    
//* (WILL ONLY HAVE PA COHORT)                                                  
//*---------------------------------------------------------------------        
//STEP19   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.MATUREPA,DISP=SHR                            
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13L552 DD SYSOUT=8,DEST=IOM8                                                
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP20   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.PAPPS.SUCC,DISP=SHR                        
//OUTPUT2  DD DSN=BP13.F740.MATUREBA.PAAST.SUCC,DISP=SHR                        
//OUTPUT3  DD DSN=BP13.F740.MATUREBA.PAMCPS.SUCC,DISP=SHR                       
//OUTPUT4  DD DSN=BP13.F740.MATUREBA.PAELD.SUCC,DISP=SHR                        
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT4)                                       
