//BP13D243 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//**************************************************************                
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//*----------------------------------                                           
//* BP137114 ESA1290118 - NEW JCL PATTERNED TO BP13A243                         
//* BP137021 ESA1240518 - TO ADD BP13C25D TO ACTIVE PREAHG IN CDB               
//**************************************************************                
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01  EXEC    PGM=IEBGENER,COND=(0,NE)                                       
//SYSUT1   DD  *                                                                
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAL1A                                     
//SYSUT2   DD  SYSOUT=2,                                                        
//             OUTPUT=(*.FORMID)                                                
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  DUMMY                                                            
//*------------------------------------------------------------------*  00003002
//* MERGE BP13.K200.PNDAPPMT & BP13.K200.BKAPPMT                     *  00003002
//*                                                                  *  00003002
//*------------------------------------------------------------------*  00003002
//STEP1A   EXEC SORT,CYL=30                                             00004002
//SORTJNF1 DD DSN=BP13.K200.PNDAPPMT,DISP=SHR                           00005003
//SORTJNF2 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                            00006003
//MATCH    DD DSN=&&P13F2001,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                            
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(14,8,A)                                     00009403
   JOINKEYS FILE=F2,FIELDS=(14,8,A)                                     00009503
   REFORMAT FIELDS=(F2:1,300)                                           00009703
   OUTFILE FNAMES=MATCH                                                 00009802
   OPTION COPY                                                          00009303
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*--------------------------------------------------------------------*        
//*  SORT BP13F200 BY ALLOC-DATE, NT/ZONE, FT, CUR-REG-NO                       
//*--------------------------------------------------------------------*        
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=&&P13F2001,                                                  
//             DISP=(SHR,PASS)                                                  
//SORTOUT  DD  DSN=&&BP13F200,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(9,3,A,12,2,A,50,6,A,57,5,A),FORMAT=CH                          
/*                                                                              
//*--------------------------------------------------------------------         
//*    OUTREC BP13F200 TO BP13F203 TO BE USE AS INPUT IN BP13C24N               
//*--------------------------------------------------------------------         
//STEP02   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=&&BP13F200,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&BP13F203,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(8,5),RLSE),                                           
//            DCB=(RECFM=FB,LRECL=200,BLKSIZE=0)                                
//SYSIN    DD  *                                                                
    SORT FIELDS=COPY                                                            
    OUTREC FIELDS=(11X,14,8,130X,C'D243',38,12,185,1,192,12,22X)                
//*                                                                             
//*-------------------------------------------------------------------*         
//* FILTER CASES WITH APPMT DATE <= 30 DAYS AFTER THE CURRENT DATE              
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=BP13C24N,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F203 DD DSN=&&BP13F203,DISP=(SHR,PASS)                                    
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K76D DD DSN=BP13.K76D.BALLOT.BLOCKLST,DISP=SHR                            
//P13F203A DD DSN=&&P13F203A,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,DCB=(RECFM=FB,LRECL=200),                                 
//         SPACE=(CYL,(8,5),RLSE)                                               
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------*  00003002
//* MERGE P13F203A AND BP13T.K200.BKAPPMT                            *  00003002
//*                                                                  *  00003002
//*------------------------------------------------------------------*  00003002
//STEP04   EXEC SORT,CYL=30                                             00004002
//SORTJNF1 DD DSN=&&P13F203A,DISP=(SHR,PASS)                            00005003
//SORTJNF2 DD DSN=BP13.K200.BKAPPMT,DISP=SHR                            00006003
//MATCH    DD DSN=&&P13F200A,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                            
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(12,8,A)                                     00009403
   JOINKEYS FILE=F2,FIELDS=(14,8,A)                                     00009503
   REFORMAT FIELDS=(F2:1,300)                                           00009703
   OUTFILE FNAMES=MATCH                                                 00009802
   OPTION COPY                                                          00009303
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*---------------------------------------------------------------------        
//* UPDATE BOOKING FEE DETAILS TO BP13K800 FROM BP13F200                        
//*---------------------------------------------------------------------        
//STEP05 EXEC    PGM=BP13C208,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* DELETE THE UPLOADED APPMT IN BP13.K200.PNDAPPMT                             
//*---------------------------------------------------------------------        
//STEP06 EXEC    PGM=BP13C25E,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200A,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K200 DD  DSN=BP13.K200.PNDAPPMT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K201 DD  DSN=BP13.K200.PNDAPPMT.PATH1,                                    
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*--------------------------------------------------------------------*        
//*SORT BOOKING APPOINTMENTS                                                    
//*-------------------------------------------------------------------*         
//STEP07   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F200A,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F200B,                                                   
//            DISP=(,PASS),                                                     
//            UNIT=SYSDA,                                                       
//            SPACE=(TRK,(10,5),RLSE),                                          
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSIN    DD *                                                                 
      SORT FIELDS=(50,6,CH,A,38,8,CH,A,57,5,CH,A),FORMAT=CH                     
//*---------------------------------------------------------------------        
//* CREATE PARENT AND CHILD BP13F200 RECORDS FOR MGPS                   00001810
//*---------------------------------------------------------------------00001830
//STEP08   EXEC  PGM=BP13C24M,COND=(0,NE)                               00001840
//BP13F200 DD  DSN=&&P13F200B,                                          00001900
//             DISP=(SHR,PASS)                                          00001910
//BP13K200 DD  DSN=BP13.K200.BKAPPMT,                                   00001920
//             DISP=SHR,                                                00001930
//             AMP=('BUFNI=8','BUFND=4')                                00001940
//BP13K201 DD  DSN=BP13.K200.BKAPPMT.PATH1,                             00001920
//             DISP=SHR,                                                00001930
//             AMP=('BUFNI=8','BUFND=4')                                00001940
//P13F200A DD  DSN=&&P13F200C,                                          00001310
//             DISP=(NEW,PASS),                                         00001320
//             SPACE=(CYL,(10,5),RLSE),                                 00001330
//             DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                   00001340
//SYSDBG   DD  SYSOUT=*                                                 00002020
//SYSDBOUT DD  SYSOUT=*                                                 00002030
//SYSOUT   DD  SYSOUT=*                                                 00002040
/*                                                                      00002050
//*--------------------------------------------------------------------*        
//*SORT OUT THOSE MGPS CHILD W/O PA APPT AND SET CDE-PROJECT TO 'BTO'           
//*--------------------------------------------------------------------*        
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&P13F200C,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13F200D,                                                   
//            DISP=(NEW,PASS),                                          00001320
//            SPACE=(CYL,(10,5),RLSE),                                  00001330
//            DCB=(BLKSIZE=23400,LRECL=300,RECFM=FB)                    00001340
//SYSIN    DD *                                                                 
      SORT FIELDS=(1,21,CH,A),FORMAT=CH                                         
      INCLUDE COND=(38,8,CH,EQ,C'        ',AND,                                 
                    185,1,CH,EQ,C'C')                                           
      OUTREC BUILD(1,123,C'BTO',127,174)                                        
/*                                                                      00002050
//*---------------------------------------------------------------------        
//* UPDATE DETAILS TO BP13K800 FROM BP13F200 FOR MGPS CHILD (NEED??)            
//*---------------------------------------------------------------------        
//STEP10 EXEC    PGM=BP13C208,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200D,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K800 DD  DSN=BP13.K800.APPLN,                                             
//             DISP=SHR                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* DELETE THE UPLOADED APPMT IN BP13.K200.PNDAPPMT                             
//*---------------------------------------------------------------------        
//STEP11 EXEC    PGM=BP13C25E,COND=(0,NE)                                       
//BP13F200 DD  DSN=&&P13F200D,                                                  
//             DISP=(SHR,PASS)                                                  
//BP13K200 DD  DSN=BP13.K200.PNDAPPMT,                                          
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K201 DD  DSN=BP13.K200.PNDAPPMT.PATH1,                                    
//             DISP=SHR,                                                        
//             AMP=('BUFND=8','BUFNI=4')                                        
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------05360006
//* MERGE ALL P13F200A & P13F200D                                       05370006
//*---------------------------------------------------------------------05380006
//STEP12  EXEC SORT,COND=(0,NE)                                         05390006
//SORTIN  DD DSN=&&P13F200A,DISP=(OLD,PASS)                             05400006
//        DD DSN=&&P13F200D,DISP=(OLD,PASS)                             05410006
//SORTOUT DD DSN=&&P13F200E,                                            05420006
//           DISP=(NEW,PASS),                                           05430006
//           UNIT=(SYSDA,1),                                            05440006
//           SPACE=(CYL,(10,5),RLSE),                                   05450006
//           DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                         05460006
//SYSIN     DD  *                                                       05470006
   SORT FIELDS=(14,8,A),FORMAT=CH                                       05480006
   SUM FIELDS=NONE                                                              
/*                                                                      05490006
//*------------------------------------------------------------------*  00003002
//* SORT BP13KQ10 BASED ON BP13F200                                  *  00003002
//*------------------------------------------------------------------*  00003002
//STEP13   EXEC SORT,CYL=30                                             00004002
//SORTJNF1 DD DSN=BP13.KQ10.DOC.TBL,DISP=SHR                            00005003
//SORTJNF2 DD DSN=&&P13F200E,DISP=(SHR,PASS)                            00006003
//MATCH    DD DSN=&&P13FQ10A,                                                   
//            DISP=(NEW,PASS),                                                  
//            UNIT=SYSDA,                                                       
//            SPACE=(CYL,(10,5),RLSE),                                          
//            DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                
//SYSIN DD *                                                            00009202
   JOINKEYS FILE=F1,FIELDS=(1,8,A)                                      00009403
   JOINKEYS FILE=F2,FIELDS=(14,8,A)                                     00009503
   REFORMAT FIELDS=(F1:1,400)                                           00009703
   OUTFILE FNAMES=MATCH                                                 00009802
   OPTION COPY                                                          00009303
/*                                                                      00009902
//SYSUDUMP DD SYSOUT=*                                                  00010002
//SYSPRINT DD SYSOUT=*                                                  00010102
//SYSABOUT DD SYSOUT=*                                                  00010202
//SYSOUT   DD SYSOUT=*                                                  00010302
//*--------------------------------------------------------------------*        
//*  SORT BP13FQ10 TO INCLUDE 'PREAHG' ONLY                                     
//*--------------------------------------------------------------------*        
//STEP014  EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=&&P13FQ10A,DISP=(SHR,PASS)                                    
//SORTOUT  DD DSN=&&P13FQ10B,                                           05420006
//            DISP=(NEW,PASS),                                          05430006
//            UNIT=(SYSDA,1),                                           05440006
//            SPACE=(CYL,(10,5),RLSE),                                  05450006
//            DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                        05460006
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(270,6,CH,EQ,C'PREAHG')                                          
//*--------------------------------------------------------------------*        
//*  UPDATE THE BUSINESS TRANSACTION OF 'PREAHG' TO 'ACTIVE'                    
//*--------------------------------------------------------------------*        
//STEP15   EXEC  PGM=IKJEFT01,COND=(0,NE),                                      
//             REGION=4096K,                                                    
//             DYNAMNBR=20                                                      
//BP13FQ10 DD DSN=&&P13FQ10B,DISP=(OLD,DELETE)                                  
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13F996 DD DUMMY                                                     05580008
//BE01F331 DD DSN=BE01.F331.CDOCRQST.PRCS.BP13,DISP=MOD,                05590009
//            SPACE=(CYL,(50,25),RLSE),                                 05600006
//            DCB=(BLKSIZE=0,LRECL=19800,RECFM=FB)                      05610006
//BE01F332 DD DSN=BE01.F332.CDOCRQST.INV.BP13,DISP=MOD,                 05620009
//            SPACE=(CYL,(50,25),RLSE),                                 05630006
//            DCB=(BLKSIZE=0,LRECL=27450,RECFM=FB)                      05640006
//BE01F333 DD DSN=BE01.F333.CDOCRQST.LOG.BP13,DISP=MOD,                 05650009
//            SPACE=(CYL,(50,25),RLSE),                                 05660006
//            DCB=(BLKSIZE=0,LRECL=27500,RECFM=FB)                      05670006
//SYSOUT   DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSPRINT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C25D) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13D243                                                                
//*---------------------------------------------------------------------        
