//BP13D040 JOB (BP13P),'BP13D040',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//     NOTIFY=CSD0071                                                           
//JOBLIB    DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*=================================================================            
//* INTERFACE WITH ROM ON MARRIAGE DATA                                         
//*                                                                             
//* 1) RETURN FROM ROM, UPDATE MARRIAGE DATA                                    
//*                                                                             
//* FOR FS APPLICATION, SEND TO ROM FOR SCREENING                               
//* 2) INPUT RECORD BOOKED AND NOT SIGN-SA-DATE                                 
//* 3) INPUT RECORD SIGN-SA WITH PACD=M AND WITH PACD DATE                      
//*=================================================================*           
//* OBJECTIVE : PROCESS NEW APPLICATIONS                            *           
//*-----------------------------------------------------------------*           
//*                                                                 *           
//* CHG REF  DATE     BY   DESCRIPTION                              *           
//* -------- -------- ---  -----------                              *           
//* BP130888 20000711 LSB  INCLUDE STEP TO PROCESS OFA CASES        *           
//* BP130888 20000718 LSB  ADD PRINTING JOB FOR LETTER              *           
//* BP130888 20000728 SSS  REMOVE OFA JOB                           *           
//* BP130978 20010412 LSB  REMOVE C500 REPORT, DO NOT RUN S520      *           
//* BP131022 20010901 LSB  BYPASS BTO FOR BP13C050                  *           
//* BP132025 20020228 CT2  ADDED STEP 5 TO REFORMAT BP13K517 TO     *           
//*                        BE01F400 FORMAT                          *           
//* BP136646 20020228 LSB1 DELETE BP13C505, BP13S735                *           
//*=================================================================*           
//*-------------------------------------------------------------------*         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                     *         
//*-------------------------------------------------------------------*         
//STEPA    EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K517.ROMDATA,DISP=OLD                                    
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//*-------------------------------------------------------------------*         
//*      TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS              *         
//*      PRT01 : CLASS = 2                                            *         
//*-------------------------------------------------------------------*         
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-------------------------------------------------------------------*         
//* FOR ADHOC CASES REQUESTED VIA ONLINE, NUM-REMARK = BLANK                    
//* TO REFORMAT BP13K517 TO BE01F400 FORMAT FOR ROM MATCHING                    
//*-------------------------------------------------------------------*         
//STEP01 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K517.ROMDATA,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=BP13.F400.SENDID.MRG.BE01,DISP=MOD                           
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,20,A),FORMAT=CH                                               
   INCLUDE COND=(196,10,CH,EQ,C'          ')                                    
 OUTREC FIELDS=(1,20,214,3,67X,C'BP13',28X,235,4,C'-',239,2,C'-',               
        241,2,28X)                                                              
/*                                                                              
//*-------------------------------------------------------------------*         
//*  TO INCLUDE NEW CASES IN BP13K517 (NUM-REMARK = BLANK)            *         
//*-------------------------------------------------------------------*         
//STEP02 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.K517.ROMDATA,                                           
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&BP13F517,DISP=(,PASS),                                     
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(10,5),RLSE),                                         
//        DCB=(RECFM=FB,LRECL=250,BLKSIZE=0)                                    
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,20,A),FORMAT=CH                                               
   INCLUDE COND=(196,10,CH,EQ,C'          ')                                    
   OUTREC FIELDS=(1,195,C'SEND',6X,206,45)                                      
/*                                                                              
//*-------------------------------------------------------------------*         
//*  TO UDPATE 'SEND' IN REMARK COLUMN TO INDICATE DATA SEND TO ROM   *         
//*-------------------------------------------------------------------*         
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&BP13F517,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=BP13.K517.ROMDATA,DISP=OLD                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1) REPLACE                             
//*                                                                             
