//BP13ADPR JOB (BP13P),'BP13ADPR',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//* UPDATE NUM-REQUEST-STATUS = R (200% SUCC )                                  
//**********************************************************************        
//* CHGE REQ  BY     DATE    DESCRIPTION                                        
//* -------- ---- -------- -------------------------------------                
//* BP138246 IL5  12032020 REMOVE PRINT DESCRIPTOR                              
//*--------------------------------------------------------------------         
//* REPRO THE UPDATED BALLOT FILE BACK                                          
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K740.MATUREBA.EC,DISP=SHR                                
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.EC.ARE2.R02,DISP=OLD                       
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*---------------------------------------------------------------------        
//*- UPDATE COHORT=01 FOR 300%                                                  
//*--------------------------------------------------------------------         
//STEP02   EXEC  PGM=BP13C71H,COND=(0,NE)                               00002680
//BP13F740 DD DSN=BP13.F740.MATUREBA.EC.ARE2.R01,DISP=SHR                       
//BP13F713 DD DSN=BP13.F713.PIGEON.COHORT01,DISP=SHR                            
//BP13K740 DD  DSN=BP13.K740.MATUREBA.EC,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//SYSOUT   DD  SYSOUT=*                                                 00002880
//SYSPRINT DD  SYSOUT=*                                                 00002890
//SYSDBG   DD  SYSOUT=*                                                 00001760
//SYSDBOUT DD  SYSOUT=*                                                 00001770
