//BP13A542 JOB (BP13P),'BP13A542',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071,TYPRUN=HOLD                                           
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* FORCE OUT THE LAST 10 UNITS PUBLIC APPLICANT TO BE UNSUCCESSFUL             
//**********************************************************************        
//* CHG REF  BY   DATE     DESCRIPTION                                          
//* -------- ---- -------- -----------                                          
//* BP130652      19990825 EXPAND F520,K520 RECL 300 TO 500                     
//* BP130857 SSS  20000626 ADD GROUPID                                          
//**********************************************************************        
//*      VERIFY FILES BEFORE JOB RUN                                            
//**********************************************************************        
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K520.BALLOT,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*--------------------------------------------------------------------         
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*--------------------------------------------------------------------         
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//OUTPUT1  DD DSN=BP13.F520.BALLOT.DAILY(+1),DISP=(NEW,CATLG),                  
//            SPACE=(CYL,(60,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=27500,LRECL=500,RECFM=FB)                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*---------------------------------------------------------------------        
//*  SORT THE BALLOT FILE BY ZONE/FLAT-TYPE/SEQ-NO/REGN-NO                      
//*--------------------------------------------------------------------         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K520.BALLOT,DISP=SHR                                    
//SORTOUT  DD  DSN=&&BP13F520,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),               
//             SPACE=(CYL,(80,10),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(78,2,A,211,2,A,131,8,D,123,8,D),FORMAT=CH                        
  INCLUDE COND=(226,3,CH,NE,C'   ')                                             
/*                                                                              
//*--------------------------------------------------------------------         
//* UPDATE THE LAST 5% TOTAL FLAT SUPPLY ON THE PUBLIC APPLICANTS TO            
//* BE UNSUCCESSFUL                                                             
//*--------------------------------------------------------------------         
//STEP03   EXEC  PGM=BP13C591,COND=(0,NE)                                       
//BP13F520 DD DSN=&&BP13F520,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//            AMP=('BUFND=23')                                                  
//BP13L591 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
