//BP13A543 JOB (BP13P),'BP13A543',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//**********************************************************************        
//* COMPUTE QUEUE POSITION FOR THE UNSUCCESSFUL APPLICATIONS                    
//**********************************************************************        
//* STEP     JOB DESCRIPTION                                                    
//*-------------------------                                                    
//* 00      LASER PRINT JCL                                                     
//* 0A      VERIFY FILES                                                        
//* 01 - 03 EXTRACT WAITING LIST APPLICANTS                                     
//* 04 - 05 COMPUTE QUEUE-POSITION BY ZONE/FT/HHTY     FOR ALL                  
//* 06 - 07                           ZONE/FT/HHTY/CAT FOR ALL                  
//* 08 - 09                           ZONE/FT          FOR ALL                  
//* 10 - 11                           ZONE/FT/CAT      FOR ALL                  
//* 12 - 13                           ZONE/FT/HHTY     FOR MTF/TCP/JB           
//* 14 - 15                           ZONE/FT/HHTY/CAT FOR MTF/TCP/JB           
//* 16 - 17                           ZONE/FT          FOR MTF/TCP/JB           
//* 17 - 19                           ZONE/FT/CAT      FOR MTF/TCP/JB           
//* 20      SORT OUT PUBLIC CASES                                               
//* 21      MERGE PA & PRIORITY CASES, SORT BY ZONE/FT/SEQ-NO/REGN-NO           
//* 22      PRINT REPORT BP13S711 TO SHOW 8 QUEUE-POSTION                       
//* 23      SORT IN REGN-NO ORDER                                               
//* 24      UPDATE QUEUE-POSITION TO SOC MASTER BP13K800                        
//* 25      SORT OUT PRIORITY CASES                                             
//* 26      UPDATE QUEUE-TIME-IFPA FROM K776 TO K520                            
//* 27-28   CREATE JB LINK FLAT TYPE FILES BP13F817                             
//* 29-30   PRINT  JB LINK REPORT  ON PIN INFORMATION                           
//* 31      OUTPUT FILE BP13.F818.JBREGN                                        
//**********************************************************************        
//* CHG-NO  BY   ON      DESCRIPTION                                            
//* --------------------------------                                            
//*BP130133 LSB 010696 - RUN AFTER BP13A574, UPDATE TO BP13.K520.PRIOPIN        
//*                      INSTEAD OF BP13K800                                    
//*BP130146 LSB 160996 - UPDATE Q-TME-IFPA TO BP13K520                          
//*BP130182 LSB 300996 - OUTPUT FILE BP13F818 FOR JB-PIN USED                   
//*BP130182 LSB 041096 - F817, F818, JOB MOVE TO BP13A577                       
//*BP130224 LSB 260397 - ADD WORK SPACE FOR STEP22                              
//*BP130348 LSB 150897 - ADD BP13C618 TO MATCH LAST QTR PIN FILE FOR            
//*                      REPORT BP13S711                                        
//*BP130695 LSB 260999 - CHG SORT IN STEP24 ZN/FT/HH/ALSCH/CAT/SEQ/REG          
//*BP130652     260899 - EXPAND F500,F510,F520,K520 RECL 300 TO 500             
//*BP130857 SSS 260600 - ADD GROUPID                                            
//**********************************************************************        
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  DATASET, SINGLE COPY                                                       
//**********************************************************************        
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*---------------------------------------------------------------------        
//* BACKUP FILE                                                                 
//*---------------------------------------------------------------------        
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K520.PRIOPIN,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//OUTPUT1 DD DSN=BP13.F520.PRIOPIN.RESULT,DISP=OLD                              
//SYSIN    DD *                                                                 
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*                                                                             
//*---------------------------------------------------------------------        
//* BY ZONE/FT/HHTY/SEQ-NO/REGN-NO                                              
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K520.PRIOPIN,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&F520HHTY,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(160,20),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(78,2,A,211,2,A,116,1,A,131,8,A,123,8,A),FORMAT=CH               
//*---------------------------------------------------------------------        
//* COMPUTE QUEUE POSITION FOR ZONE/FT/HHTY/SEQ-NO/REGN-NO                      
//*---------------------------------------------------------------------        
//STEP05    EXEC PGM=BP13C701,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520HHTY,DISP=(OLD,PASS)                                   
//BP13F500  DD DSN=&&F500PINH,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//             SPACE=(CYL,(160,20),RLSE)                                        
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT THE UNSUCCESSFUL BALLOTED APPLICANTS                                   
//* BY ZONE/FT/HHTY/CAT/SEQ-NO/REGN-NO                                          
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F500PINH,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520CAT,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(160,20),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(78,2,A,211,2,A,116,1,A,225,1,A,131,8,A,123,8,A),                
   FORMAT=CH                                                                    
//*---------------------------------------------------------------------        
//* COMPUTE QUEUE POSITION FOR ZONE/FT/HHTY/CAT/SEQ-NO/REGN-NO                  
//*---------------------------------------------------------------------        
//STEP07    EXEC PGM=BP13C702,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520CAT,DISP=(OLD,PASS)                                    
//BP13F500  DD DSN=&&HHTYCATQ,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,                                                      
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//             SPACE=(CYL,(80,20),RLSE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT THE UNSUCCESSFUL BALLOTED APPLICANTS                                   
//* BY ZONE/FT/SEQ-NO/REGN-NO                                                   
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&HHTYCATQ,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520ZONE,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(160,20),RLSE)                                         
//SYSIN    DD  *                                                                
   SORT FIELDS=(78,2,A,211,2,A,131,8,A,123,8,A),FORMAT=CH                       
//*---------------------------------------------------------------------        
//* COMPUTE QUEUE POSITION FOR ZONE/FT/HHTY/SEQ-NO/REGN-NO                      
//*---------------------------------------------------------------------        
//STEP09    EXEC PGM=BP13C703,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520ZONE,DISP=(OLD,PASS)                                   
//BP13F500  DD DSN=&&F500ZNFT,DISP=(NEW,PASS),                                  
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,20),RLSE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT THE UNSUCCESSFUL BALLOTED APPLICANTS                                   
//* BY ZONE/FT/CAT/SEQ-NO/REGN-NO                                               
//*---------------------------------------------------------------------        
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F500ZNFT,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&ZNFTCAT,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,20),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(78,2,A,211,2,A,225,1,A,131,8,A,123,8,A),                        
   FORMAT=CH                                                                    
//*---------------------------------------------------------------------        
//* COMPUTE QUEUE POSITION FOR ZONE/FT/CAT/SEQ-NO/REGN-NO                       
//*---------------------------------------------------------------------        
//STEP11    EXEC PGM=BP13C704,COND=(0,NE)                                       
//BP13F520  DD DSN=&&ZNFTCAT,DISP=(OLD,PASS)                                    
//BP13F500  DD DSN=&&F500QNUM,DISP=(NEW,PASS),                                  
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(80,20),RLSE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT THE UNSUCCESSFUL MTF/TCP/JB APPLICANTS                                 
//* BY ZONE/FT/ALLOC_SCH/HHTY/SEQ-NO/REGN-NO                                    
//*---------------------------------------------------------------------        
//STEP12   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F500QNUM,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520PRHH,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,20),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(78,2,A,211,2,A,213,2,A,116,1,A,131,8,A,123,8,A),                
   FORMAT=CH                                                                    
   INCLUDE COND=(213,2,CH,EQ,C'JB',OR,                                          
                 213,2,CH,EQ,C'MT',OR,                                          
                 213,2,CH,EQ,C'TC')                                             
//*---------------------------------------------------------------------        
//* MT/JB/TCP                                                                   
//* COMPUTE QUEUE POSITION FOR ZONE/FT/HHTY/SEQ-NO/REGN-NO                      
//*---------------------------------------------------------------------        
//STEP13    EXEC PGM=BP13C820,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520PRHH,DISP=(OLD,PASS)                                   
//BP13F500  DD DSN=&&F500QPRH,DISP=(NEW,PASS),                                  
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(80,20),RLSE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT THE UNSUCCESSFUL MTF/TCP/JB APPLICANTS                                 
//* BY ZONE/FT/HHTY/CAT/SEQ-NO/REGN-NO                                          
//*---------------------------------------------------------------------        
//STEP14   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F500QPRH,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F520PRC,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,20),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(78,2,A,211,2,A,116,1,A,213,2,A,225,1,A,                         
          131,8,A,123,8,A),FORMAT=CH                                            
   INCLUDE COND=(213,2,CH,EQ,C'JB',OR,                                          
                 213,2,CH,EQ,C'MT',OR,                                          
                 213,2,CH,EQ,C'TC')                                             
//*---------------------------------------------------------------------        
//* COMPUTE QUEUE POSITION FOR ZONE/FT/HHTY/CAT/SEQ-NO/REGN-NO                  
//*---------------------------------------------------------------------        
//STEP15    EXEC PGM=BP13C821,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520PRC,DISP=(OLD,PASS)                                    
//BP13F500  DD DSN=&&F500PRC,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(80,20),RLSE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT THE UNSUCCESSFUL MTF/TCP/JB APPLICANTS                                 
//* BY ZONE/FT/ALLOC_SCH/SEQ-NO/REGN-NO                                         
//*---------------------------------------------------------------------        
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F500PRC,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F520PRZN,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,20),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(78,2,A,211,2,A,213,2,A,131,8,A,123,8,A),                        
   FORMAT=CH                                                                    
   INCLUDE COND=(213,2,CH,EQ,C'JB',OR,                                          
                 213,2,CH,EQ,C'MT',OR,                                          
                 213,2,CH,EQ,C'TC')                                             
//*---------------------------------------------------------------------        
//* MT/JB/TCP                                                                   
//* COMPUTE QUEUE POSITION FOR ZONE/FT/SEQ-NO/REGN-NO                           
//*---------------------------------------------------------------------        
//STEP17    EXEC PGM=BP13C722,COND=(0,NE)                                       
//BP13F520  DD DSN=&&F520PRZN,DISP=(OLD,PASS)                                   
//BP13F500  DD DSN=&&PRIOZONE,DISP=(NEW,PASS),                                  
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(80,20),RLSE)                                            
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT THE UNSUCCESSFUL MTF/TCP/JB APPLICANTS                                 
//* BY ZONE/FT/CAT/SEQ-NO/REGN-NO                                               
//*---------------------------------------------------------------------        
//STEP18   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&PRIOZONE,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&PRIOPRC,DISP=(NEW,PASS),                                    
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,20),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(78,2,A,211,2,A,213,2,A,225,1,A,                                 
          131,8,A,123,8,A),FORMAT=CH                                            
   INCLUDE COND=(213,2,CH,EQ,C'JB',OR,                                          
                 213,2,CH,EQ,C'MT',OR,                                          
                 213,2,CH,EQ,C'TC')                                             
//*---------------------------------------------------------------------        
//* COMPUTE QUEUE POSITION FOR ZONE/FT/CAT/SEQ-NO/REGN-NO                       
//*---------------------------------------------------------------------        
//STEP19    EXEC PGM=BP13C725,COND=(0,NE)                                       
//BP13F520  DD DSN=&&PRIOPRC,DISP=(OLD,PASS)                                    
//BP13F500  DD DSN=&&F500FIN,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,40),RLSE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTPUT FINAL FILE IN ZONE/FT/HH TYPE/SEQ NO/REGN NO                         
//*        EXCLUDE PRIORITY SCHEME                                              
//*---------------------------------------------------------------------        
//STEP20   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F500QNUM,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13FINAL,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,20),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(78,2,A,211,2,A,116,1,A,131,8,A,123,8,A),                        
   FORMAT=CH                                                                    
   OMIT  COND=(213,2,CH,EQ,C'JB',OR,                                            
               213,2,CH,EQ,C'MT',OR,                                            
               213,2,CH,EQ,C'TC')                                               
//*---------------------------------------------------------------------        
//* SORT CURRENT QTR FILE IN REGN-NO ORDER                                      
//*---------------------------------------------------------------------        
//STEP21   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F500FIN,DISP=(OLD,PASS)                                     
//         DD DSN=&&P13FINAL,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13TOTAL,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,20),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* SORT PREVIOUS QTR FILE IN REGN-NO ORDER                                     
//*---------------------------------------------------------------------        
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F520.PRIOPIN.PREVQTR,DISP=SHR                            
//SORTOUT  DD DSN=&&F520PREV,DISP=(NEW,PASS),                                   
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,20),RLSE)                                           
//SYSIN     DD  *                                                               
   SORT FIELDS=(123,8,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* TO RETRIEVE PREVIOUS QTR PIN AND STORE IN THE PREV-PIN                      
//* (RE-DEFINE CDE-COHORT FIELD)                                                
//*---------------------------------------------------------------------        
//STEP23    EXEC PGM=BP13C618,COND=(0,NE)                                       
//BP13F500  DD DSN=&&P13TOTAL,DISP=(OLD,PASS)                                   
//BP13F520  DD DSN=&&F520PREV,DISP=(OLD,PASS)                                   
//BP13F510  DD DSN=&&F510PPIN,DISP=(NEW,PASS),                                  
//          UNIT=SYSDA,                                                         
//          DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                             
//          SPACE=(CYL,(160,20),RLSE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTPUT FINAL FILE IN ZONE/FLAT TYPE/SEQ NO/REGN NO                          
//*---------------------------------------------------------------------        
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F510PPIN,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13REPOT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(160,20),RLSE)                                         
//SYSIN    DD  *                                                                
  SORT FIELDS=(78,2,A,211,2,A,116,1,A,213,3,A,225,1,A,131,8,A,123,8,A),         
   FORMAT=CH                                                                    
//*---------------------------------------------------------------------        
//* PRINT TOTAL BY ZONE/FT/SEQNO/REGNO                                          
//*---------------------------------------------------------------------        
//STEP25   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,20))                                    
//BP13F500 DD DSN=&&P13REPOT,DISP=(OLD,PASS)                                    
//BP13L711 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=*                                                          
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S711),DISP=SHR                             
//*                                                                             
//*---------------------------------------------------------------------        
//* UPDATE UNSUCC QUEUE POSITION FOR PUBLIC/PRIORITY TO BP13K520                
//* NOW, BP13.K520.PRIOPIN CONTAIN QUEUE-TIME AND QUEUE-POSITION                
//*---------------------------------------------------------------------        
//STEP26   EXEC  PGM=BP13C595,COND=(0,NE)                                       
//BP13F520 DD DSN=&&P13TOTAL,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K520.PRIOPIN,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*---------------------------------------------------------------------        
//* END BP13A543                                                                
//*---------------------------------------------------------------------        
