//BP13APA5 JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                 
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//*-- WITH EFF FROM 2ND QTR 2000                                                
//*-- NEW JOB BP13APA5, BP13AJBB, BP13APA6, TO RUN AFTER BP13APA2               
//*-- DO NOT RUN BP13APA3, BP13APA4                                             
//*                                                                             
//*1 THIRD ROUND PUBLIC PIGEONHOLING, BYPASS HOUSEHOLD TYPE CHECK               
//*  FOR ALL UNSUCC CASES INCLUDE JB LINK TO GET PA QUOTA                       
//*2 AFTER PIGEONHOLING, CHECK PARTIAL SUCC/USNUCC JB LINK                      
//*3 RE-RUN BP13AJBB TO MAKE PARTIAL UNSUCC JB AS WHOLE LINK UNSUCC             
//*4 FOURTH ROUND PUBLIC PIGEONHOLING,BP13APA6, FOR PA ONLY THE TAKE            
//*  UP BALANCE PA QUOTA AFTER BP13AJBB                                         
//******************************************************************            
//* CHG REF  BY  ON      DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP130642 LSB 250599  PRINT REPORT S522 AFTER COMPLETE BALLOTING             
//*                      SORT IN REGN BEFORE BP13C817                           
//* BP130721 LSB 180899  BP13U734 TO BYPASS UGP QUATA                           
//* BP130836 LSB 200400  WITH EFF FR 2ND QTR 2000, BYPASS UPG LET               
//*                      ALL UUSUCC COME IN USE CUR-REGN INCLUDE JB             
//* BP130871 SSS 080600  LISTING TO EAALSS                                      
//* BP132317 ROM 030315  TO CHANGE BP13U721 TO BP13U734                         
//* BP132317 CKK 030325  TO SORT IN RANDOM NO SEQUEUE BEFORE PIGEOHOLING        
//* BP132596 PGS 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E            
//* BP134861 EAA1 23042013 EXPAND BP13K010 TO 600                               
//******************************************************************            
//* STEP 00 - 01 = LASER PRINTER JCL                                            
//* STEP 02      = BACKUP FILE                                                  
//* STEP 03 - 04 = PRINT SUPPLY REPORT BP13L524 BF ADJUSTMENT                   
//* STEP 05      = ADJUST JB QUOTA TO PA                                        
//* STEP 06 - 07 = PRINT SUPPLY REPORT BP13L524 BF PIGEONHOLING                 
//* STEP 08      = PRINT SUPPLY NHH/UPG BF PIGEONHOLING                         
//* STEP 09 - 10 = PIGENOHOLE FOR PA ONLY BP13U734                              
//* STEP 11 - 12 = PRINT SUPPLY REPORT BP13L524 AF PIGEONHOLING                 
//* STEP 13      = PRINT SUPPLY NHH/UPG AF PIGEONHOLING                         
//* STEP 14 - 15 = OUTPUT UNSUCC PRIORITY/PUBLIC FOR PA                         
//*                PIGEONHOLING                                                 
//* STEP 16 - 18 = PRINT REPORT                                                 
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN                                            
//*=================================================================            
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K520.BALLOT,DISP=OLD                                     
//INPUT3   DD DSN=BP13.K712.FLATNHUG,DISP=OLD                                   
//INPUT4   DD DSN=BP13.K720.RESIDENT,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  PRT01 : COPIES = 1                                                         
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAALSS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  TO SEND DYNAMIC JOB DESCRIPTOR ENTRIES AHEAD OF THE PRINT                  
//*  PRT02 : COPIES = 2                                                         
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
$DJDE$ JDE=13C510,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD2,GROUPID=EAALSS2A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.PA3,DISP=OLD                                 
//INPUT2   DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F712.FLATNHUG.PA3,DISP=OLD                               
//INPUT3   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//OUTPUT3  DD DSN=BP13.F520.BALLOT.APA3,DISP=OLD                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY BEFORE ADJUST PA FLAT             
//*-----------------------------------------------------------------            
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K0104RMB,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT BEFORE ADJUST PA FLAT SUPPLY            
//*---------------------------------------------------------------------        
//STEP04    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K0104RMB,DISP=(OLD,PASS)                                   
//BP13F713  DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                 
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*-------------------------------------------------------------------          
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG BEFORE PIGEONHOLING                
//*-------------------------------------------------------------------          
//STEP08   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                  
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13L552 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------          
//* SORT BY RANDOM NO/REGN-NO                                           00010000
//* INCLUDE ONLY UNSUCCESSFUL PA FOR E FLAT APPLICATION                 00010000
//* WITH EFF FR 199910 ALLOW ALL FT TO COME IN                          00010000
//*-------------------------------------------------------------------          
//STEP09  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//SORTOUT DD DSN=&&F520PUB,DISP=(,PASS),                                        
//        UNIT=(SYSDA,1),SPACE=(CYL,(80,20),RLSE),                              
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                    
//SYSIN   DD  *                                                                 
    SORT FIELDS=(1,28,A,123,8,A),FORMAT=CH                                      
    OMIT COND=(226,2,CH,NE,C'  ')                                               
//*--------------------------------------------------------------------         
//* TO PROCESS THE PIGEON-HOLDING FOR PUBLIC   CASES, THE PROGRAM WILL          
//* ONLY ALLOCATE THE PUBLIC QUOTA AND PRIORITY QUOTA ON CCC, SFF, MTF          
//* WITH EFF FR 199910 USE U734 BYPASS UPG                                      
//*--------------------------------------------------------------------         
//STEP10   EXEC PGM=BP13U734,COND=(0,NE)                                        
//STEPLIB   DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                           
//BP13F713  DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                 
//BP13K010  DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//BP13F520  DD DSN=&&F520PUB,DISP=(OLD,PASS)                                    
//BP13K520  DD DSN=BP13.K520.BALLOT,DISP=SHR,                                   
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13K712  DD DSN=BP13.K712.FLATNHUG,DISP=SHR,                                 
//         AMP=('BUFND=23')                                                     
//BP13F525  DD DSN=BP13.F525.APPL,DISP=OLD                                      
//BP13L734  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//P13L734A  DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-------------------------------------------------------------------          
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*-------------------------------------------------------------------          
//STEP12    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010AFN,DISP=(OLD,PASS)                                    
//BP13F713  DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                 
//BP13L524  DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                 
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
/*                                                                              
//*-------------------------------------------------------------------          
//* PRINT REPORT ON REQUEST/FLAT FOR NHH/UPG AFTER PIGEONHOLING                 
//*-------------------------------------------------------------------          
//STEP13   EXEC PGM=BP13C552,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.PA,DISP=SHR                                  
//BP13K712 DD DSN=BP13.K712.FLATNHUG,DISP=SHR                                   
//BP13L552 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-------------------------------------------------------------------          
//*  REPRO VSAM FILE TO SEQUENTIAL FILES FOR MATCHING BP13C817                  
//*------------------------------------------------------------------           
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT5   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//OUTPUT5  DD DSN=&&F520BALT,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT5)  OUTFILE(OUTPUT5)                                       
//*-------------------------------------------------------------------          
//STEP15  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=&&F520PUB,DISP=(OLD,PASS)                                      
//SORTOUT DD DSN=&&F520PA3,DISP=(,PASS),                                        
//        UNIT=(SYSDA,1),SPACE=(CYL,(80,20),RLSE),                              
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                    
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------          
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING                          
//*-------------------------------------------------------------------          
//STEP16   EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520PA3,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,PASS)                                    
//P13UNSUC DD DSN=&&P13UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//P13SUCC  DD DSN=&&P13SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------          
//* PRINT SUMMARY BALLOT RESULT BY ZONE/FT/CAT                                  
//* ON SUCC/UNSUCC REPORT FOR BP13APA3 ONLY                                     
//*-------------------------------------------------------------------          
//STEP17   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//P13FSUCC DD  DSN=&&P13SUCC,DISP=(OLD,PASS)                                    
//P13FUNSC DD  DSN=&&P13UNSUC,DISP=(OLD,PASS)                                   
//PRIOFMT  DD  DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT42F001 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                            
//*-------------------------------------------------------------------          
//* SORT BY REGN-NO                                                             
//*-------------------------------------------------------------------          
//STEP18  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K520.BALLOT,DISP=SHR,                                     
//        AMP=('BUFND=23')                                                      
//SORTOUT DD DSN=&&F520ALL,DISP=(,PASS),                                        
//        UNIT=(SYSDA,1),SPACE=(CYL,(80,20),RLSE),                              
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                                    
//SYSIN   DD  *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*-------------------------------------------------------------------          
//* MATCH PRIORITY SUCC AND UNSUCC CASES FOR REPORTING FOR ALL                  
//*-------------------------------------------------------------------          
//STEP19   EXEC  PGM=BP13C817,COND=(0,NE)                                       
//BP13F510 DD DSN=&&F520ALL,DISP=(OLD,PASS)                                     
//BP13F520 DD DSN=&&F520BALT,DISP=(OLD,PASS)                                    
//P13UNSUC DD DSN=&&F52UNSUC,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//P13SUCC  DD DSN=&&F52SUCC,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,SPACE=(CYL,(20,10),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB)                                
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBOUT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------          
//* PRINT SUMMARY BALLOT RESULT BY ZONE/FT/CAT                                  
//* ON SUCC/UNSUCC REPORT FOR THE WHOLE BALLOTING                               
//*-------------------------------------------------------------------          
//STEP20   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//P13FSUCC DD  DSN=&&F52SUCC,DISP=(OLD,PASS)                                    
//P13FUNSC DD  DSN=&&F52UNSUC,DISP=(OLD,PASS)                                   
//PRIOFMT  DD  DSN=BP13.BATCH.COPYCOB(PRIOFMT),DISP=SHR                         
//FT42F001 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                 
//SYSIN    DD  DSN=BP13.BATCH.SRC(BP13S522),DISP=SHR                            
//*-------------------------------------------------------------------          
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*-------------------------------------------------------------------          
//STEP21  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F525.APPL,DISP=SHR                                      
//OUTPUT1   DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*------------------------------------------------------------------           
//* SORT LAST SUCC REGN-NO IN NT/FT ORDER                                       
//*------------------------------------------------------------------           
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F525,DISP=(,PASS),                                      
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=100,BLKSIZE=20000)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,4,2,A,53,3,A,11,1,A),FORMAT=CH                            
//*------------------------------------------------------------------           
//* PRINT REPORT TO SHOW THE LAST SUCC REGN-NO HIT MAX ZONE/ALLOC/CAT           
//*------------------------------------------------------------------           
//STEP23   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//BP13K525 DD DSN=&&BP13F525,DISP=(OLD,PASS)                                    
//FT18F001 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S502),DISP=SHR                             
//*---------------------------------------------------------------------        
//* SORT OUT F520 ON SEQNO/JB-PARENT RNO/REGN-NO                                
//* INCLUDE ONLY JB CASES                                                       
//*---------------------------------------------------------------------        
//STEP24   EXEC  SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F520PJB,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(80,30),RLSE),                             
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(131,8,A,155,8,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=(213,3,CH,EQ,C'JB ')                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTPUT IF WITHIN THE JB -LINKS, THERE ARE SOME CASES SUCC AND UNSUCC        
//* DO NOT OUTPUT IF ALL SUCC OR ALL UNSUCC                                     
//*---------------------------------------------------------------------        
//STEP25   EXEC PGM=BP13C852,COND=(0,NE)                                        
//BP13F520 DD DSN=&&F520PJB,DISP=(OLD,PASS)                                     
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//         AMP=('BUFND=8','BUFNI=4')                                            
//BP13F510 DD DSN=BP13.F520.BALLOT.UNSUCCJB,DISP=OLD                            
//BP13L852 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSOUT   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*                                                                             
