//BP13ACC6 JOB (BP13P),'BP13ACC6',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**************************************************************                
//*    PIGEONHOLING OF GRO FOR MATURE NT                       *                
//*                            ---------                       *                
//*    - 2ND ROUND PIGEONHOLING FOR GRO TO ALLOW               *                
//*      UNSUCC SERVE GRO, ADJUST RANKING THRU ONLINE          *                
//*      SERVE GRO                                             *                
//*      FOE GRO, SORT BY RANK, RANDOM NUMBER                  *                
//*      UNSUCC REN TO TAKE RH QUOTA                           *                
//*                                                            *                
//*    NOTE THE DIFFERENCE                                     *                
//*    - TENDER PROGRAM ONLY HAVE NEW FLAT SUPPLY              *                
//*    - BP13K760 - CHECK FOR NON-SERVE QUOTA, ETHNIC          *                
//**************************************************************                
//* STEP 00 - 01 = LASER PRINTER JCL                           *                
//* STEP 02 - 03 = BACKUP TENDER AND BALLOT FILE               *                
//* STEP 04 - 4A = PRINT FLAT SYPPLY REPORT BF PIGEONHOLING    *                
//* STEP 06 - 08 = PROCESS PIGEONHOLING BP13U770. GRO ROUND 2  *                
//* STEP 09 - 10 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING    *                
//* STEP 11      = MATCH RELEVANT REQUEST TO GET SUCC & UNSUCC *                
//*                BALLOT RESULT FOR PRINT REPORT              *                
//* STEP 12      = PRINT SUMMARY RESULT OF ALL REQUEST BP13L522*                
//* STEP 13      = PRINT REPORT ON GRO RANKING                 *                
//* STEP 14      = BACKUP TENDER FILE                          *                
//* STEP 15      = ACCUM BP13F525                              *                
//**************************************************************                
//* CHG-NO   BY   ON    - DESCRIPTION                                           
//* ---------------------------------                                           
//* BP131064 CKK 010924 - DUPLICATION OF BP13CCC1. CHANGE PIGEON-               
//*                       HOLING PROGRAM TO BP13U770.                           
//* BP132171 ED  120702 - INCLUDE STEPS FOR GROPA CASES.                        
//*                       (STEP19-21)                                           
//* BP132412 SK  061003 - INCLUDE BP13K520 FOR BP13C085.                        
//* BP132463 CKK 261203 - INCLUDE NEW REPORT FOR BP13C085                       
//* BP132596 PGS1 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E           
//* BP133292 IL5 06032008 ADD BP13C525                                          
//* BP133913 IL5 25052010                                                       
//* BP134413 IL5 13122011 BACKUP BP13.K030.BALFLAT                              
//* BP134483 IL5 10042012 ADD ADDITONAL OUTPUT FILE FOR BP13C741                
//* BP134903 SMR 26042013 INCLUDE BP13S569                                      
//* BP135392 SMR 19062014 CATER FOR 3P FLAT TYPE                                
//* BP135708 SMR 31032015 CHANGE CLASS=2 TO CLASS=J                             
//* BP136055 IL5 17122015 CATER FOR 2F FLAT TYPE                                
//* BP136107 SMR 17022016 ACCEPT PARAMETER FROM JCL IN BP13C525                 
//* BP138301 AM2 14052020 HARDCOPY REPORTS CONVERSION                           
//**************************************************************                
//*      VERIFY FILES BEFORE JOB RUN                                            
//**************************************************************                
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K765.WARDSRV,DISP=OLD                                    
//INPUT4   DD DSN=BP13.K520.BALLOT,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.CC1,DISP=OLD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K030.BALFLAT,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F030.BALFLAT.CC1,DISP=OLD                                
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F740.MATUREBA,DISP=OLD                                   
//INPUT3   DD DSN=BP13.K765.WARDSRV,DISP=SHR                                    
//OUTPUT3  DD DSN=BP13.F765.WARDSRV.CC2,DISP=OLD                                
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*-----------------------------------------------------------------            
//*  BACKUP BALLOT FILE BEFORE PIGEONHOLING                                     
//*  SORT BY RANDOM NO ORDER                                                    
//*-----------------------------------------------------------------            
//STEP3A   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=BP13.F740.PIGEON,DISP=OLD                                     
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,28,A),FORMAT=CH                                               
//*-----------------------------------------------------------------            
//* OUTPUT FILES FOR SEPARATE PIGEONHOLING PROCESS, PRIORITY,                   
//* TRANSITION NHH > 7 MTH, AND COHORTS ( MAX 5 )                               
//*-----------------------------------------------------------------            
//STEP3B   EXEC PGM=BP13C741,COND=(0,NE),ADDRSPC=VIRT,REGION=4096K              
//BP13F520 DD  DSN=BP13.F740.PIGEON,DISP=SHR                                    
//BP13PR   DD  DSN=BP13.F740.MATUREBA.PRIO,DISP=OLD                             
//BP13GRO  DD  DSN=BP13.F740.MATUREBA.GRO,DISP=OLD                              
//BP13MGP  DD  DSN=BP13.F740.MATUREBA.MGP,DISP=OLD                              
//BP13PUB  DD DSN=&&BP13PUB,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                              
//         SPACE=(CYL,(50,5),RLSE)                                              
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*---------------------------------------------------------------------        
//* TRANSFER BALANCE FLAT OF SERVE TO NON-SERVE IN BP13K765                     
//*---------------------------------------------------------------------        
//STEP4D   EXEC PGM=BP13C779,COND=(0,NE)                                        
//BP13K765 DD DSN=BP13.K765.WARDSRV,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* INCLUDE RESIDENT GRO WITH CDE-SERVE = N                                     
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F740GR2,DISP=(NEW,PASS),                                    
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(80,5),RLSE)                                           
//SYSIN    DD  *                                                                
    SORT FIELDS=(187,3,A,373,3,A,163,2,A,1,28,A),FORMAT=CH                      
    INCLUDE COND=(163,2,CH,NE,C'  ')                                            
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR GRO CASES.                                
//* PROCESS NON-SERVING GRO + UNSUCCESSFUL SERVING GRO FROM 1ST ROUND           
//* GRO PIGEOHOLING                                                             
//* THIS IS 2ND ROUND GRO PIGEONHOLING                                          
//*---------------------------------------------------------------------        
//STEP08   EXEC PGM=BP13U770,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13K765 DD DSN=BP13.K765.WARDSRV,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13F740 DD DSN=&&F740GR2,DISP=(OLD,PASS)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.CC2,DISP=SHR                                 
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L770 DD SYSOUT=8,DEST=IOM8                                                
//P13L770A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP09   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010GR1,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,                                                      
       4,2,CH,EQ,C'5 ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP10    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010GR1,DISP=(OLD,DELETE)                                  
//BP13F713  DD DSN=BP13.F713.PIGEON.CC1,DISP=SHR                                
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT OUT 1A,2A,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING              
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP10A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010GR2,DISP=(,PASS),                                       
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP10B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010GR2,DISP=(OLD,DELETE)                                  
//BP13F713  DD DSN=BP13.F713.PIGEON.CC1,DISP=SHR                                
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* SORT OUT 3P FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                   
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP11    EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT   DD DSN=&&K010GR3,DISP=(,PASS),                                      
//             UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                           
//             DCB=(RECFM=FB,LRECL=600,BLKSIZE=28800)                           
//SYSIN     DD *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3P')                                               
//*-----------------------------------------------------------------            
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//* FOR 2ND ROUND GRO PIGEONHOLING                                              
//*-----------------------------------------------------------------            
//STEP12    EXEC PGM=BP13C524,COND=(0,NE)                                       
//SYSPRINT  DD SYSOUT=*                                                         
//BP13F010  DD DSN=&&K010GR3,DISP=(OLD,DELETE)                                  
//BP13F713  DD DSN=BP13.F713.PIGEON.CC1,DISP=SHR                                
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*  FOR WHOLE GRO PIGEONHOLING                                                 
//*-----------------------------------------------------------------            
//STEP14   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER(+1),DISP=(NEW,CATLG),                        
//            SPACE=(TRK,(5,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=28800,LRECL=600,RECFM=FB)                   
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*-----------------------------------------------------------------            
//STEP15   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//OUTPUT1  DD DSN=BP13.F525.APPL.ACCUM,DISP=MOD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT LAST SUCC REGN-NO IN NT/FT ORDER                                       
//*-----------------------------------------------------------------            
//STEP16   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//SORTOUT  DD DSN=&&BP13F525,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                            
//            DCB=(RECFM=FB,LRECL=100,BLKSIZE=20000)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,3,A,4,2,A,53,3,A,11,1,A),FORMAT=CH                            
//*-----------------------------------------------------------------            
//* PRINT REPORT TO SHOW LAST SUCC REGN-NO HIT MAX ZONE/ALLOC/CAT               
//*-----------------------------------------------------------------            
//STEP17    EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                 
//BP13K525  DD DSN=&&BP13F525,DISP=(OLD,PASS)                                   
//FT18F001  DD SYSOUT=8,DEST=IOM8                                               
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S502),DISP=SHR                            
//*---------------------------------------------------------------------        
//* PRINT REPORT ON FLAT/REGISTERED COUNT FOR GRO IN BP13K765                   
//*---------------------------------------------------------------------        
//STEP18   EXEC PGM=BP13C746,COND=(0,NE)                                        
//BP13F713 DD DSN=BP13.F713.PIGEON.CC2,DISP=SHR                                 
//BP13K765 DD DSN=BP13.K765.WARDSRV,DISP=SHR                                    
//BP13L746 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* INCLUDE SUCC GRO CASES AND ASSIGN AS PA                                     
//* DBSS CASES NOT INCLUDED                                                     
//*-----------------------------------------------------------------            
//STEP19   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&BP13F740,DISP=(,PASS),                                      
//            UNIT=(SYSDA,1),SPACE=(CYL,(25,25),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=COPY                                                             
   INCLUDE COND=(226,3,CH,NE,C'   ',AND,                                        
                 376,3,CH,NE,C'DBS',AND,376,3,CH,NE,C'EC ')                     
//*-----------------------------------------------------------------            
//* EXTRACT GRO CASES FOR INPUT TO BP13C085                                     
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=BP13C741,COND=(0,NE)                                        
//BP13F520 DD  DSN=&&BP13F740,DISP=(OLD,DELETE)                                 
//BP13GRO  DD  DSN=&&GROPA,DISP=(,PASS),                                        
//         UNIT=(SYSDA,1),SPACE=(CYL,(25,25),RLSE),                             
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//BP13PR   DD  DUMMY                                                            
//BP13PUB  DD  DUMMY                                                            
//BP13MGP  DD  DUMMY                                                            
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*-------------------------------------------------------------------*         
//* CREATE DUPLICATE GRO APPLICATIONS AND CHG TO PA                             
//*-------------------------------------------------------------------*         
//STEP21   EXEC PGM=BP13C085,COND=(0,NE)                                        
//BP13F740 DD DSN=&&GROPA,DISP=(OLD,DELETE)                                     
//BP13K740 DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//BP13K520 DD DSN=BP13.K520.BALLOT,DISP=SHR,                                    
//         AMP=('BUFND=23')                                                     
//P13F740B DD DSN=BP13.F740.MATUREBA.GROPA,DISP=OLD                             
//BP13L085 DD SYSOUT=8,DEST=IOM8                                                
//SYSOUT   DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSABEND DD SYSOUT=*                                                          
//SYSDBUG  DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP22   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740S8,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION FORM FOR COUNTER AND MAIL CASES                           
//* 3 DIFFERENT LETTERS DEPENDING ON MCPS OPTION                                
//*------------------------------------------------------------------           
//STEP23   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740S8,DISP=(OLD,DELETE)                                    
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
AL2                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* INCLUDE SUCC CASES                                                          
//*-----------------------------------------------------------------            
//STEP24   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD DSN=&&F740SUCC,DISP=(NEW,PASS),                                   
//            UNIT=(SYSDA,1),SPACE=(CYL,(25,25),RLSE),                          
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                            
//SYSIN    DD  *                                                                
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
   INCLUDE COND=(226,3,CH,NE,C'   ')                                            
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR PPS & NON-PPS APPLICANTS                                   
//*-----------------------------------------------------------------            
//STEP25   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=&&F740SUCC,DISP=(OLD,DELETE)                                  
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
//*--------------------------------------------------------------------         
//* END BP13ACC6                                                                
//*--------------------------------------------------------------------         
