//BP13WBK1  JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                
//      NOTIFY=CSD0071                                                          
//*--------------------------------------------------------------------------   
//* CHG-NO    BY  ON                                                    -----   
//* -------------------------------------------                         -----   
//* BP130615 LSB 990310 - TAKE  OUT VOL PACK NO                         -----   
//* BP132168 CLT 280802 - REMOVE DELETE/DEFINE OF BP13K454              -----   
//* BP132546 YCH 110604 - INCLUDE STORCLAS(PRODRLS) & LOG(NONE)                 
//* BP135616 JGO1090315 - CHANGE LENGTH OF K650 TO 500                          
//*---------------------------------------------------------------------00010000
//*  SORT THE BP13K650                                                          
//*---------------------------------------------------------------------        
//STEP1   EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=BP13.K650.PREPVRCH,DISP=SHR                                   
//SORTOUT  DD DSN=&&TEMP,DISP=(NEW,PASS),                                       
//            UNIT=(SYSDA,1),                                           03880012
//            DCB=(BLKSIZE=27500,LRECL=500,RECFM=FB),                   03890012
//            SPACE=(CYL,(10,1),RLSE)                                   03890112
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,20,A),FORMAT=CH                                               
//*-------------------------------------------------------------------- 00360000
//* DELETE AND DEFINE BP13K650                                          00360000
//*-------------------------------------------------------------------- 00360000
//STEP2 EXEC PGM=IDCAMS,COND=(0,NE)                                             
//INPUT    DD DSN=&&TEMP,DISP=(OLD,PASS)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
       DEL (BP13.K650.PREPVRCH) CL PURGE                                        
         DEF CL (NAME(BP13.K650.PREPVRCH)          -                            
                 CYL(5 1)                          -                            
                 UNIQUE                            -                            
                 STORCLAS(PRODRLS)                 -                            
                 LOG(NONE)                         -                            
                 SPEED                             -                            
                 SHR(2 3)                          -                            
                 KEYS(8 0)                         -                            
                 CISZ(4096)                        -                            
                 RECSZ(500 500) )                                               
         IF LASTCC = 0 THEN                        -                            
           REPRO IFILE(INPUT)                      -                            
               ODS(BP13.K650.PREPVRCH)             -                            
               REUSE                                                            
/*                                                                              
//*---------------------------------------------------------------------------  
//* END BP13WBK1                                                        -----   
//*--------------------------------------------------------------------------   
