//BP13A594 JOB (BP13P),'BP13A594',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),    00010000
//       NOTIFY=CSD0071                                                 00020000
//*-------------------------------------------------------------------  00030000
//* STEP01:  SPLIT BY 2000 RECORDS FOR EMAIL                           *00040000
//*--------------------------------------------------------------------*00050000
//STEP01   EXEC PGM=SORT                                                00060000
//SYSPRINT DD SYSOUT=*                                                  00070000
//SYSOUT   DD SYSOUT=*                                                  00080000
//SORTIN   DD DSN=BP13.F23A.EMAIL.PA.F100,DISP=SHR                      00090000
//OUT1     DD DSN=BP13.F23A.EMAIL.PA.F100.F01,DISP=SHR                  00100000
//OUT2     DD DSN=BP13.F23A.EMAIL.PA.F100.F02,DISP=SHR                  00110000
//OUT3     DD DSN=BP13.F23A.EMAIL.PA.F100.F03,DISP=SHR                  00120000
//OUT4     DD DSN=BP13.F23A.EMAIL.PA.F100.F04,DISP=SHR                  00130000
//SYSIN    DD  *                                                        00140000
   OPTION COPY                                                          00150000
   OUTFIL FNAMES=(OUT1,OUT2,OUT3,OUT4),SPLIT1R=2000                     00160000
//*------------------------------------------------------------         00170000
//* STEP02:  SPLIT BY 2000 RECORDS FOR EMAIL                           *00180000
//*--------------------------------------------------------------------*00190000
//STEP02   EXEC PGM=SORT                                                00200000
//SYSPRINT DD SYSOUT=*                                                  00210000
//SYSOUT   DD SYSOUT=*                                                  00220000
//SORTIN   DD DSN=BP13.F23A.EMAIL.PA.F150,DISP=SHR                      00230000
//OUT1     DD DSN=BP13.F23A.EMAIL.PA.F150.F01,DISP=SHR                  00240000
//OUT2     DD DSN=BP13.F23A.EMAIL.PA.F150.F02,DISP=SHR                  00250000
//SYSIN    DD  *                                                        00260000
   OPTION COPY                                                          00270000
   OUTFIL FNAMES=(OUT1,OUT2),SPLIT1R=2000                               00280000
//*------------------------------------------------------------         00290000
//* STEP03:  SPLIT BY 2000 RECORDS FOR EMAIL                           *00300000
//*--------------------------------------------------------------------*00310000
//STEP03   EXEC PGM=SORT                                                00320000
//SYSPRINT DD SYSOUT=*                                                  00330000
//SYSOUT   DD SYSOUT=*                                                  00340000
//SORTIN   DD DSN=BP13.F23A.EMAIL.PA.F200,DISP=SHR                      00350000
//OUT1     DD DSN=BP13.F23A.EMAIL.PA.F200.F01,DISP=SHR                  00360000
//OUT2     DD DSN=BP13.F23A.EMAIL.PA.F200.F02,DISP=SHR                  00370000
//OUT3     DD DSN=BP13.F23A.EMAIL.PA.F200.F03,DISP=SHR                  00380000
//OUT4     DD DSN=BP13.F23A.EMAIL.PA.F200.F04,DISP=SHR                  00390000
//OUT5     DD DSN=BP13.F23A.EMAIL.PA.F200.F05,DISP=SHR                  00400000
//OUT6     DD DSN=BP13.F23A.EMAIL.PA.F200.F06,DISP=SHR                  00410000
//SYSIN    DD  *                                                        00420000
   OPTION COPY                                                          00430000
   OUTFIL FNAMES=(OUT1,OUT2,OUT3,OUT4,OUT5,OUT6),SPLIT1R=2000           00440000
//*------------------------------------------------------------         00450000
//* STEP04:  SPLIT BY 2000 RECORDS FOR EMAIL                           *00460000
//*--------------------------------------------------------------------*00470000
//STEP04   EXEC PGM=SORT                                                00480000
//SYSPRINT DD SYSOUT=*                                                  00490000
//SYSOUT   DD SYSOUT=*                                                  00500000
//SORTIN   DD DSN=BP13.F23A.EMAIL.PA.F300,DISP=SHR                      00510000
//OUT1     DD DSN=BP13.F23A.EMAIL.PA.F300.F01,DISP=SHR                  00520000
//OUT2     DD DSN=BP13.F23A.EMAIL.PA.F300.F02,DISP=SHR                  00530000
//OUT3     DD DSN=BP13.F23A.EMAIL.PA.F300.F03,DISP=SHR                  00540000
//OUT4     DD DSN=BP13.F23A.EMAIL.PA.F300.F04,DISP=SHR                  00550000
//SYSIN    DD  *                                                        00560000
   OPTION COPY                                                          00570000
   OUTFIL FNAMES=(OUT1,OUT2,OUT3,OUT4),SPLIT1R=2000                     00580000
//*------------------------------------------------------------         00590000
//* STEP05:  SPLIT BY 2000 RECORDS FOR EMAIL                           *00600000
//*--------------------------------------------------------------------*00610000
//STEP05   EXEC PGM=SORT                                                00620000
//SYSPRINT DD SYSOUT=*                                                  00630000
//SYSOUT   DD SYSOUT=*                                                  00640000
//SORTIN   DD DSN=BP13.F23A.EMAIL.PA.F400,DISP=SHR                      00650000
//OUT1     DD DSN=BP13.F23A.EMAIL.PA.F400.F01,DISP=SHR                  00660000
//OUT2     DD DSN=BP13.F23A.EMAIL.PA.F400.F02,DISP=SHR                  00670000
//OUT3     DD DSN=BP13.F23A.EMAIL.PA.F400.F03,DISP=SHR                  00680000
//OUT4     DD DSN=BP13.F23A.EMAIL.PA.F400.F04,DISP=SHR                  00690000
//OUT5     DD DSN=BP13.F23A.EMAIL.PA.F400.F05,DISP=SHR                  00700000
//OUT6     DD DSN=BP13.F23A.EMAIL.PA.F400.F06,DISP=SHR                  00710000
//OUT7     DD DSN=BP13.F23A.EMAIL.PA.F400.F07,DISP=SHR                  00720000
//OUT8     DD DSN=BP13.F23A.EMAIL.PA.F400.F08,DISP=SHR                  00730000
//OUT9     DD DSN=BP13.F23A.EMAIL.PA.F400.F09,DISP=SHR                  00740000
//OUT10    DD DSN=BP13.F23A.EMAIL.PA.F400.F10,DISP=SHR                  00750000
//OUT11    DD DSN=BP13.F23A.EMAIL.PA.F400.F11,DISP=SHR                  00760000
//OUT12    DD DSN=BP13.F23A.EMAIL.PA.F400.F12,DISP=SHR                  00770000
//OUT13    DD DSN=BP13.F23A.EMAIL.PA.F400.F13,DISP=SHR                  00780000
//OUT14    DD DSN=BP13.F23A.EMAIL.PA.F400.F14,DISP=SHR                  00790000
//OUT15    DD DSN=BP13.F23A.EMAIL.PA.F400.F15,DISP=SHR                  00800000
//OUT16    DD DSN=BP13.F23A.EMAIL.PA.F400.F16,DISP=SHR                  00810000
//OUT17    DD DSN=BP13.F23A.EMAIL.PA.F400.F17,DISP=SHR                  00820000
//OUT18    DD DSN=BP13.F23A.EMAIL.PA.F400.F18,DISP=SHR                  00830000
//OUT19    DD DSN=BP13.F23A.EMAIL.PA.F400.F19,DISP=SHR                  00840000
//OUT20    DD DSN=BP13.F23A.EMAIL.PA.F400.F20,DISP=SHR                  00850000
//OUT21    DD DSN=BP13.F23A.EMAIL.PA.F400.F21,DISP=SHR                  00860000
//OUT22    DD DSN=BP13.F23A.EMAIL.PA.F400.F22,DISP=SHR                  00870000
//OUT23    DD DSN=BP13.F23A.EMAIL.PA.F400.F23,DISP=SHR                  00880000
//OUT24    DD DSN=BP13.F23A.EMAIL.PA.F400.F24,DISP=SHR                  00890000
//OUT25    DD DSN=BP13.F23A.EMAIL.PA.F400.F25,DISP=SHR                  00900000
//SYSIN    DD  *                                                        00910000
   OPTION COPY                                                          00920000
   OUTFIL FNAMES=(OUT1,OUT2,OUT3,OUT4,OUT5,OUT6,OUT7,OUT8,OUT9,OUT10,   00930000
                  OUT11,OUT12,OUT13,OUT14,OUT15,OUT16,OUT17,OUT18,      00940000
                  OUT19,OUT20,OUT21,OUT22,OUT23,OUT24,                  00950000
                  OUT25),SPLIT1R=2000                                   00960000
/*                                                                      00970000
//*---------------------------------------------------------------------00980000
//* STEP06:  SPLIT BY 2000 RECORDS FOR EMAIL                           *01000000
//*--------------------------------------------------------------------*01010000
//STEP06   EXEC PGM=SORT                                                01020000
//SYSPRINT DD SYSOUT=*                                                  01030000
//SYSOUT   DD SYSOUT=*                                                  01040000
//SORTIN   DD DSN=BP13.F23A.EMAIL.PAFTS.F400,DISP=SHR                   01050000
//OUT1     DD DSN=BP13.F23A.EMAIL.PAFTS.F400.F01,DISP=SHR               01060000
//OUT2     DD DSN=BP13.F23A.EMAIL.PAFTS.F400.F02,DISP=SHR               01070000
//OUT3     DD DSN=BP13.F23A.EMAIL.PAFTS.F400.F03,DISP=SHR               01080000
//OUT4     DD DSN=BP13.F23A.EMAIL.PAFTS.F400.F04,DISP=SHR               01090000
//OUT5     DD DSN=BP13.F23A.EMAIL.PAFTS.F400.F05,DISP=SHR               01091001
//SYSIN    DD  *                                                        01100000
   OPTION COPY                                                          01110000
   OUTFIL FNAMES=(OUT1,OUT2,OUT3,OUT4,OUT5),SPLIT1R=2000                01120001
//*------------------------------------------------------------         01130000
