//BP13D216 JOB (BP13P),'BP13D216',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//             NOTIFY=CSD0071                                                   
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,                                          
//             DISP=SHR                                                         
//******************************************************************            
//* IMPORTANT NOTE :                                                            
//* THIS JCL IS FOR UPDATING OF BOOKING APPMT DATE AND TIME FOR                 
//* NON-MATURE NEW TOWNS ONLY (BOOKING EXERCISE ON ZONE BASIS).                 
//*CHG REQ  OIC   DATE    DESCRIPTION                                           
//*=====================================                                        
//*BP134253 DW5  03/06/11 NEW JCL TO CONTINUE BP13A202 JOB AFTER                
//*                       OFFICE HOURS.                                         
//*BP134521 ESA1 04/05/12 ADD BM06K100 IN BP13C227                              
//*BP134587 ESA1 07/02/12 ADD BP13KQ50 IN BP13C227                              
//*BP134769 SMR2 04/03/13 REMOVE SIMILAR STEPS IN BP13A216 FOR THE              
//*                       CREATION OF BP13F230                                  
//*BP13XXXX EL27 12/03/13 ADD VFR TO BB14K580 AND BB14K500                      
//*BP135377 EL27 29/09/14 ADD CHECKING OF 'LD' IN K205                          
//*--------------------------------------------------------------------         
//*      VERIFY FILES BEFORE DAILY PRODUCTION RUN                               
//*--------------------------------------------------------------------         
//STEP00  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BB14.K580.UNTLEASE,DISP=OLD                                   
//INPUT2   DD DSN=BB14.K500.BLKLEASE,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
/*                                                                              
//*---------------------------------------------------------------------        
//* BP135377 - BATCH UPDATE BB14K580 WHEN TRIGGERED FROM BP13B197               
//*---------------------------------------------------------------------        
//**********************************************************************        
//*        SORT 'LD' OPTION IN BP13K205                                *        
//**********************************************************************        
//STEP21  EXEC  SORT,COND=(0,NE)                                                
//SORTIN  DD  DSN=BP13.K205.CTLREC,DISP=SHR                                     
//SORTOUT DD  DSN=&&P13F205A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=80),                                          
//            SPACE=(CYL,(5,2),RLSE)                                            
//SYSIN   DD  *                                                                 
      SORT FIELDS=(1,15,A),FORMAT=CH                                            
      INCLUDE COND=(14,2,CH,EQ,C'LD')                                           
//**********************************************************************        
//*        TO FILTER BP13F205 CASES WITH THE FOLLOWING CONDTN          *        
//* K100-DTE-KEY-AVAIL SHOULD BE BLANK OR ZEROES (NOT COMPLETED)       *        
//* K500-DTE-BLDG-COMPLETE SHOULD NOT BE BLANK OR ZEROES (FOR COMPUTE) *        
//**********************************************************************        
//STEP22   EXEC PGM=BP13C24X,COND=(0,NE)                                        
//BP13F205 DD DSN=&&P13F205A,DISP=(OLD,PASS)                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR                                   
//P13F205B DD DSN=&&P13F205B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=80),                                          
//            SPACE=(CYL,(5,2),RLSE)                                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//**********************************************************************        
//* TO EXTRACT ALL SCHEME ACCOUNT (BM06K110) THAT MATCH WITH K110-AIX1 *        
//**********************************************************************        
//STEP23   EXEC PGM=BP13C24Y,COND=(0,NE)                                        
//BP13F205 DD DSN=&&P13F205B,DISP=(OLD,PASS)                                    
//BM06K110 DD DSN=BM06.K110.FLATINV,DISP=SHR                                    
//BM06K111 DD DSN=BM06.K110.FLATINV.PATH2,DISP=SHR                              
//BM06F110 DD DSN=&&BM06F110,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(50,50),RLSE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//**********************************************************************        
//* TO UPDATE BB14K580 WITH UPDATED DPD COMPUTATION                    *        
//**********************************************************************        
//STEP24   EXEC PGM=BP13C24Z,COND=(0,NE)                                        
//BM06F110 DD DSN=&&BM06F110,DISP=(SHR,PASS)                                    
//BM06K100 DD DSN=BM06.K100.BLOCK,DISP=SHR                                      
//BB14K500 DD DSN=BB14.K500.BLKLEASE,DISP=SHR                                   
//BB14K580 DD DSN=BB14.K580.UNTLEASE,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSUDUMP DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//**********************************************************************        
//*  ACCUM F205 CTRL REC                                               *        
//**********************************************************************        
//* F205A = INITIAL F205, E.G. 3 RECORDS             A, B, C                    
//* F205B = FILTERED F205, E.G. 2 RECORDS            A  &  C                    
//* F205C = RECORDS FOUND IN F205A, BUT NOT IN F205B,   B*                      
//* F205  = MERGED F205B AND F205C, E.G.             A, B*,C                    
//*                                              * INSERTED 'NOTRUN'            
//*---------------------------------------------------------------------        
//STEP25  EXEC SORT,COND=(0,NE)                                                 
//SORTJNF1 DD DSN=&&P13F205A,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=&&P13F205B,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&P13F205C,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=80),                                             
//         SPACE=(CYL,(5,2),RLSE)                                               
//SYSIN    DD *                                                                 
  JOINKEYS FILES=F1,FIELDS=(1,22,A)                                             
  JOINKEYS FILES=F2,FIELDS=(1,22,A)                                             
  JOIN UNPAIRED,F1                                                              
  REFORMAT FIELDS=(F1:1,80,F2:1,80)                                             
  SORT FIELDS=COPY                                                              
  INCLUDE COND=(81,3,CH,EQ,C'  ')                                               
  OUTREC FIELDS=(1,59,C'NOTRUN',66,15)                                          
//*---------------------------------------------------------------------        
//STEP26  EXEC SORT,COND=(0,NE)                                                 
//SORTIN   DD DSN=&&P13F205B,DISP=(OLD,PASS)                                    
//         DD DSN=&&P13F205C,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F205.ACCUM,DISP=MOD                                      
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
/*                                                                              
//*********************************************************************         
//* TO LIST CAT ENTRY                                                           
//*********************************************************************         
//S1     EXEC    PGM=IDCAMS                                                     
//*                                                                             
//SYSPRINT DD  SYSOUT=*                                                         
//SYSIN    DD  *                                                                
   LISTC ENT(BP13.F230.BP13A216) ALL                                            
   LISTC ENT(BP13.F230.BP13D216) ALL                                            
/*                                                                              
//IFTEST1 IF (S1.RC = 0) THEN                                                   
//*---------------------------------------------------------------------        
//* CTRL REC FOR OPTION 5 - SCHEDULE BOOKING APPMT (ZONE)                       
//*--------------------------------------------------------------------         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F205.WISREC,DISP=SHR                                     
//SORTOUT  DD DSN=&&F205A,DISP=(NEW,PASS),                                      
//         UNIT=SYSDA,                                                          
//         DCB=(RECFM=FB,LRECL=80),                                             
//        SPACE=(CYL,(5,2),RLSE)                                                
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,15,A),FORMAT=CH                                               
   INCLUDE COND=(14,2,CH,EQ,C'WS')                                              
   SUM FIELDS=NONE                                                              
//*---------------------------------------------------------------------        
//* UPDATE BB14K500 & BB14K580 BY LEASE-COMM-DTE AND DTE-UNIT-DELIVERY          
//*---------------------------------------------------------------------        
//STEP12  EXEC    PGM=BP13C207,COND=(0,NE)                                      
//BM06F800 DD  DSN=BM06.F800.ALLOUNIT.ADHC1,                                    
//             DISP=SHR                                                         
//BP13F205 DD  DSN=&&F205A,                                                     
//             DISP=(SHR,DELETE)                                                
//BM06K100 DD  DSN=BM06.K100.BLOCK,                                             
//             DISP=SHR                                                         
//BB14K580 DD  DSN=BB14.K580.UNTLEASE,                                          
//             DISP=OLD                                                         
//BB14K500 DD  DSN=BB14.K500.BLKLEASE,                                          
//             DISP=OLD                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* THE STEPS BELOW ARE FOR SENDING INTV FLATLIST TO EQMS                       
//*---------------------------------------------------------------------        
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER FOR EQMS                                  
//*---------------------------------------------------------------------        
//STEP14 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F230.BP13A216,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F230C,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=450,RECFM=FB)                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(7,8,A,108,3,A,30,20,A,52,5,A,50,2,A,                          
                  5,2,A,59,5,A,57,2,A),FORMAT=CH                                
/*                                                                              
//*---------------------------------------------------------------------        
//* EDIT RECORDS WITH NUM-SELECTION = '3R ' (FOR RECID = '01,02,03')            
//*---------------------------------------------------------------------        
//STEP15 EXEC  PGM=BP13C279,COND=(0,NE)                                         
//BP13F230 DD  DSN=&&P13F230C,                                                  
//             DISP=(SHR,PASS)                                                  
//P13F230O DD  DSN=&&P13F230D,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=130,RECFM=FB)                               
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT EST/N/C/BLK, FLAT-TYPE ORDER (EXTRACT RECID=06)                        
//*---------------------------------------------------------------------        
//STEP16 EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD  DSN=BP13.F230.BP13D216,                                          
//             DISP=SHR                                                         
//SORTOUT  DD  DSN=&&P13F230E,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(BLKSIZE=0,LRECL=130,RECFM=FB)                               
//SYSIN    DD  *                                                                
     SORT FIELDS=(7,8,A,41,3,A,15,20,A,44,5,A,5,2,A),FORMAT=CH                  
     INCLUDE COND=(5,2,CH,EQ,C'06')                                             
//*---------------------------------------------------------------------        
//* TO MERGE RECINTO THIS ORDER 01,06,02,03 FOR EACH BLOCK                      
//*---------------------------------------------------------------------        
//STEP17   EXEC PGM=BP13C23P,COND=(0,NE)                                        
//P13F230A DD DSN=&&P13F230D,DISP=(OLD,DELETE)                                  
//P13F230B DD DSN=&&P13F230E,DISP=(OLD,DELETE)                                  
//P13F230C DD DSN=BP13.F230.EQMS,DISP=OLD                                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* TO INCLUDE THE EQMS1 FOOTER                                                 
//*---------------------------------------------------------------------        
//STEP18 EXEC  PGM=BP13C23Q,COND=(0,NE)                                         
//BP13F230 DD  DSN=BP13.F230.EQMS,DISP=MOD                                      
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
/*                                                                              
//******************************************************************            
//* FTP EQMS FILE TO HDBEQMSPF1 SERVER                                          
//******************************************************************            
//*STEP19   EXEC FTP,PARM='HDBEQMSPF1 (EXIT',COND=(8,LT)                        
//*NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                 
//*INPUT    DD *                                                                
//*  CD  FTP\INTV\IN                                                            
//*  ASCII                                                                      
//*  PUT 'BP13.F230.EQMS' INTV_ZONE_IN.TXT                                      
//*  QUIT                                                                       
//*                                                                             
//******************************************************************            
//* FTP EQMS FILE TO HDBEQMSPF2 SERVER                                          
//******************************************************************            
//*STEP20   EXEC FTP,PARM='HDBEQMSPF2 (EXIT',COND=(8,LT)                        
//*NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                 
//*INPUT    DD *                                                                
//*  CD  FTP\INTV\IN                                                            
//*  ASCII                                                                      
//*  PUT 'BP13.F230.EQMS' INTV_ZONE_IN.TXT                                      
//*  QUIT                                                                       
//*                                                                             
//******************************************************************            
//* FTP HQMS FILE TO HQMSIFSGP01 SERVER (PRODUCTION SERVER)                     
//******************************************************************            
//STEP21   EXEC FTP,PARM='HQMSIFSGP01 (EXIT',COND=(8,LT)                        
//NETRC    DD DSN=SY08.FTP.NETRC.BP13,DISP=SHR                                  
//INPUT    DD *                                                                 
    CD  HQMS\FTP\INTV\IN                                                        
    ASCII                                                                       
    PUT 'BP13.F230.EQMS' INTV_ZONE_IN.TXT                                       
    QUIT                                                                        
//*                                                                             
//ENDTEST1  ENDIF                                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* END BP13D216                                                                
//*---------------------------------------------------------------------        
