//BP13D50D JOB (BP13P),'BP13D50D',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//         NOTIFY=CSD0071                                                       
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//*=================================================================            
//*                                                                             
//*  THIS JOB IS USE ONLY FOR SALES OF BALANCE FLAT                             
//*  TO GENERATE EXCEPTION REPORT BP13S16A                                      
//*                                                                             
//*=================================================================            
//* CHG REF  BY   ON       DESCRIPTION                                          
//* -------- ---  -------- -----------                                          
//* BP133438 IL5  230908   NEW JCL                                              
//* BP133657 ZDD  040809   ADD BP13K730 ON BP13CB59                             
//*               110809   ADD BP13CB61                                         
//* BP133721 IL5  290909   ADD NEW CODE SBF                                     
//* BP133893 ZDD  230410   ADD BP13CF04 AND BP13CF05 (STEP 36A-36D)             
//* BP133964 ZDD  190710   ADD BP13CF17                                         
//* BP134367 ZDD  200911   ADD NEW FIELDS ON BP13S16A INCLUDE                   
//*                        PRINTING OF LETTERS                                  
//* BP134626 SMR2 040113   ADD NEW FORM, BP137K                                 
//* BP134778 SMR2 290113   ADD NEW FORMS FOR PPS                                
//* BP134778 SMR2 300113   CHANGE &&F730 TO DISP=(SHR,DELETE)                   
//* BP134582 SMR2 250313   OUTPUT FILECOPY TO CD-ROM (BP13C077/BP13C084)        
//*                        REMOVE UNUSED FORMS (AJ/AO/AU/BG/AX)                 
//* BP134906 SMR2 290413   TRANSFER CF72/CF73/CF74 TO BP13AMCS                  
//*                        REMOVE FORMS (BP1371/72/73/7B) IN BP13C084           
//*                        ADD NEW FORM FOR DWP (BP13XY/X5) IN BP13C077         
//*                        ADD DWP PENDING IN REPORT 3 OF BP13S16A              
//*                        INCLUDE DEBARMENT CODE 'DZ', 'DX', 'DY'              
//* BP134996 SMR2 230713   ADD AST=AS & PPS HH=G COLS IN REPORT 3               
//*                        CATER FOR AHG DEB & AGE COLS IN REPORT 4             
//*                        ADD NEW FORM FOR FTS (BP13Y1/Y2) IN BP13C077         
//* BP135080 SMR2 190913   ADD 3GEN IN REPORT 2 & DEB 'SS' IN REPORT 4          
//*                        STOP DAILY PRINT OF CONFIRMATION LETTERS             
//* BP135148 IL5  251113   ADD DEB CODES TO REPORT 4                            
//*                        '4F' 'AT' 'FD' 'FE' 'FX' 'FY'                        
//* BP135211 IL5  210114   UPDATE JCL COND CHECKING FOR REGN STARTING           
//*                        WITH '2'                                             
//* BP135190 SMR2 051213   EXPAND BP13K813 TO 1000                              
//* BP135254 SMR2 070314   STOP REPORTING FOR STUDIO APT WHEN PPO OR            
//*                        PPOS OR DEB '33' OR 2ND FT LES IN REPORT 4           
//*                        TRANSFER DEB '4F' UNDER DEB PO/SS IN REPORT 4        
//*                        RENAME DWP TO AST & SHOW ALL APPLICATIONS            
//*                        WHERE AST IS NOT BLANK IN REPORT 3                   
//* BP135532 SMR2 281014   CATER FOR MCPS = 'B'                                 
//* BP135661 SMR2 170215   NEW COLS MCPS-G & MCPS-H NO QUOTA UNDER L16B         
//*                        NEW COLS TCP/TPS & NO ETHNIC QUOTA UNDER L16C        
//* BP135944 SMR2 280815   TAG DEB 'YR/YS/AC' UNDER 'AD' COL (1)                
//*                        REMOVE 'NCP' UNDER 'NCS' COL (2)                     
//*                        NRIC EXISTS IN EC APPLICATION - BP13CD15 (2)         
//*                        TAG DEB 'MC/MD/ME/MF' UNDER 'MA/MB' COL (2)          
//*                        TAG DEB 'DU' UNDER '4E/FC/DV/DW' COL (4)             
//*                        TAG DEB 'EF/4J/R2' UNDER 'SERS PORT' COL (4)         
//*                        COMBINE 'MC/MD/PU/PP' & 'MA/MB/70/71' &              
//*                        TAG DEB 'ME/MF' UNDER 'MC/MD/PU/PP' COL (4)          
//*                        TAG DEB 'E5/E6' UNDER 'EC/CG/GR' COL (4)             
//*                        NEW COL FOR DEB CODE '11/18' (4)                     
//* BP136358 SMR2 220716   TAG DEB 'EC/E5/EU' UNDER 'MA/MB' COL (2)             
//* BP136358 SMR2 220816   ADD NEW PROGRAM BP13CB15                             
//* BP136609 SMR2 100317   PRINT 2 COPIES OF THE REPORTS                        
//* BP136609 SMR2 030417   NEW COL FOR RDB DIFF IN REPORT 2                     
//* BP136756 SMR2 200417   REPLACE COL FOR TPS HH=G WITH TPS NTIMER=Y           
//* BP136762 SMR2 240517   START A NEW SHEET PER REPORT                         
//* BP137048 SMR2 271017   NEW COL FOR FS AGE < 18 IN REPORT 4                  
//*                        NEW DEB CODE 'FF/5T/5U' & ELIG-TAG 'RR' (4)          
//*                        TRANSFER BP13CB15 TO BP13D501                        
//* BP137378 IL5  230718   TAG DEB 'MH/MJ' UNDER 'MA/MB' COL (2)                
//*                        TAG DEB 'MH/MJ' UNDER 'MC/MD/PU/PP' COL (4)          
//* BP137494 IL5  230918   REMOVE DEB DU/DV/DW/DX/DY/DZ FROM REPORT 4           
//*                        COL DEB 4E/FC/DV/DW                                  
//*                        ADD DEB PV/PX/PY/PZ/Q1/Q2/Q3/Q4 TO REPORT            
//*                        2 AND 4 COLS DEB MA/MB AND DEB MC/MD/PU/PP           
//* BP137662 IL5  110219   ADD STEPS TO RUN PROGRAM BP13L557                    
//*                        ADD DEB RX TO REPORT 4 DEB 4E/FC/RX                  
//* BP137783 AM25 110419   ADD STEPS FOR COLS IN L16A & REMOVE IN L16D          
//* BP137783 AM25 300519   UPDATE INCLUDE OF REGN(1:1) TO NOT EQ 1&5&6          
//*                        ADD CONDITION FOR SALES MODE 'SBF'                   
//* BP137920 AM25 180719   REPLACE DSN RDB POSTAL DIFF TO RDB SUBT              
//*                        ADD DEB TB/TC TO REPORT 4                            
//* BP137920 IL5  060919   REPLACE SOURCE FILE FROM P/C COL IN L16A             
//*                        WITH BP13.F730.MATURERQ.DAILY.                       
//*                        (ALLO SCH NOT FTS AND PARENT-CHILD = P)              
//*                        (STEP13A-C REPLACED BY STEP13)                       
//* BP138038 AM25 041119   ADD NEW ELIG SCH 'PAC' TO REPORT 1                   
//* BP138164 AM25 140120   ADD DEB PD, SHIFT DEB GR TO COL 1 AND                
//*                        REMOVE COLS 5/6/18 IN REPORT 1                       
//* BP138285 AM25 240420   HARDCOPY REPORTS CONVERSION                          
//*               050620   REMOVE DJDE, ADD NEW OUTPUT FILES FOR S557           
//* BP138495 AM25 211020   SHIFT COLS 1/2/3 FROM REPORT 1 TO REPORT 4           
//*                        REMOVE COLS 1/2/3/11/13 IN REPORT 3                  
//*                        REMOVE COL 1 IN REPORT 2                             
//*                        SHIFT GEN3 FROM REPORT 2 TO REPORT 4                 
//*                        UPDATE STEP30                                        
//*                        EXTRACT HA CASES ONLY FOR DEBMAMB MCP P/C            
//*                        ADD BP13C17B FOR TCP APPLNS                          
//*                        ADD OUTREC TO TAG DAILY REPORTS PART1/2/3/4          
//* BP138889 IL5  150921   ADD PARAM TO INCREASE VOLS ALLOC FOR WKSP            
//* BP139571 AM25 240423   SHIFT COL 9 FROM REPORT 4 TO REPORT 2                
//* BP139682 AM25 110823   CATER FOR MERGED EXCEPTION REPORT                    
//* BP139875 AM25 080224   REMOVE BP13C174                                      
//*               230224   REMOVE RES-NRIC FOR DEBARMENT                        
//* BP139682 AM25 020424   REMOVE ITEMS FROM EXCEPTION REPORTS                  
//*=================================================================            
//******************************************************************            
//* START OF DAILY PRINT JOBS                                                   
//*******************************************************************           
//*------------------------------------------------------------------           
//* SORT OUT ONLY BE CASES FROM THE DAILY FILE                                  
//*------------------------------------------------------------------           
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MATURERQ.DAILY,DISP=SHR                             
//SORTOUT  DD DSN=&&F730BE,DISP=(NEW,PASS),                                     
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(376,3,CH,EQ,C'SBF')                                           
//*------------------------------------------------------------------           
//* COMPARE DAILY FILE WITH ACCUMULATED VSAM FILE.                              
//* SORT OUT ONLY CASES IN THE DAILY FILE                                       
//*------------------------------------------------------------------           
//STEP02   EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730BE,DISP=(SHR,PASS)                                      
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&BP13F730,DISP=(,PASS),                                      
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(60,20),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT IN NRIC ORDER                                                          
//*------------------------------------------------------------------           
//STEP11A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F558.UPGOCCP.BTO,DISP=SHR                                
//SORTOUT  DD DSN=&&BP13F824,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(1,17,A),FORMAT=CH                                              
    INCLUDE COND=(1,1,CH,NE,C'1',&,1,1,CH,NE,C'5',&,1,1,CH,NE,C'6')             
    OUTREC FIELDS=(1,17,233X)                                                   
//*------------------------------------------------------------------           
//* SORT IN NRIC ORDER                                                          
//*------------------------------------------------------------------           
//STEP11B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F824,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=&&F824SOR1,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
    SORT FIELDS=(9,9,A),FORMAT=CH                                               
//*------------------------------------------------------------------           
//* MATCH DEBARMENT MASTER TO EXTRACT ONLY VALID REASON CODE                    
//*------------------------------------------------------------------           
//STEP11C  EXEC PGM=BP13C919,COND=(0,NE)                                        
//BP13F824 DD DSN=&&F824SOR1,DISP=(OLD,PASS)                                    
//P04K010  DD DSN=BP04.K010.DEBAR,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//OUTF824  DD DSN=&&F824DEBR,DISP=(,PASS),                                      
//            DCB=(BLKSIZE=0,LRECL=250,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT BTO CASES FROM F558                                                
//*------------------------------------------------------------------           
//*STEP12A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                   
//*SORTOUT  DD DSN=&&F558,DISP=(NEW,PASS),                                      
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                              
//*            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                              
//*SYSIN    DD  *                                                               
//*     SORT FIELDS=(1,8,A),FORMAT=CH                                           
//*     INCLUDE COND=(151,11,CH,NE,C'           ',OR,                           
//*                   318,11,CH,NE,C'           ')                              
//*------------------------------------------------------------------           
//* SORT OUT BTO CASES FROM F558                                                
//*------------------------------------------------------------------           
//*STEP12B  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F558.UPGOCCP.MAMS,DISP=SHR                              
//*SORTOUT  DD DSN=&&F558,DISP=(MOD,PASS),                                      
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                              
//*            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                              
//*SYSIN    DD  *                                                               
//*     SORT FIELDS=(1,8,A),FORMAT=CH                                           
//*------------------------------------------------------------------           
//* SORT OUT BTO CASES FROM F558                                                
//*------------------------------------------------------------------           
//*STEP12C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F558,DISP=(OLD,DELETE)                                     
//*SORTOUT  DD DSN=&&F558A,DISP=(NEW,PASS),                                     
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                              
//*            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                              
//*SYSIN    DD  *                                                               
//*     SORT FIELDS=(1,8,A),FORMAT=CH                                           
//*     INCLUDE COND=(1,1,CH,NE,C'1',&,1,1,CH,NE,C'5',&,1,1,CH,NE,C'6')         
//*     OUTREC FIELDS=(1,313,C'DB',316,285)                                     
//*------------------------------------------------------------------           
//* TO MATCH AND OUTPUT 'Y' IF SLS, MAMS OR TRSF FOUND                          
//* COL 10 = 'Y' IF TRSF HDB-REF FOUND                                          
//* COL 11 = 'Y' IF SLS HDB-REF FOUND                                           
//* COL 12 = 'Y' IF MAMS HDB-REF FOUND                                          
//*------------------------------------------------------------------           
//*STEP12D  EXEC PGM=BP13C169,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13F558 DD DSN=&&F558A,DISP=(OLD,DELETE)                                    
//*P13F730A DD DSN=&&P13F730S,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                             
//*            SPACE=(CYL,(5,3),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT TRF CASES FOR DAILY REPORT                                         
//* TRF HDB-REF NOT = SPACE - COL 10                                            
//* SLS HDB-REF NOT = SPACE - COL 11                                            
//* MAMS HDB-REF NOT = SPACE - COL 12                                           
//*------------------------------------------------------------------           
//*STEP12E  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&P13F730S,DISP=(OLD,DELETE)                                 
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=OLD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(10,1,CH,EQ,C'Y',OR,                                        
//*                  11,1,CH,EQ,C'Y',OR,                                        
//*                  12,1,CH,EQ,C'Y')                                           
//*------------------------------------------------------------------           
//* SORT OUT BE CASES FROM F558.UPGOCCP.PARENT                                  
//*------------------------------------------------------------------           
//*STEP13A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F558.UPGOCCP.PARENT,DISP=SHR                            
//*SORTOUT  DD DSN=&&F558PC,DISP=(NEW,PASS),                                    
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                              
//*            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                              
//*SYSIN    DD  *                                                               
//*     SORT FIELDS=(1,8,A),FORMAT=CH                                           
//*     INCLUDE COND=(1,1,CH,NE,C'1',&,1,1,CH,NE,C'5',&,1,1,CH,NE,C'6')         
//*     OUTREC FIELDS=(1,313,C'PC',316,285)                                     
//*------------------------------------------------------------------           
//* TO MATCH AND OUTPUT 'Y' IF P/C RELATIONSHIP IS FOUND                        
//* COL 13 = 'Y' IF P/C IS FOUND                                                
//*------------------------------------------------------------------           
//*STEP13B  EXEC PGM=BP13C169,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13F558 DD DSN=&&F558PC,DISP=(OLD,DELETE)                                   
//*P13F730A DD DSN=&&F730PC,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                             
//*            SPACE=(CYL,(5,3),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT PC CASES FOR DAILY REPORT                                          
//* PC NOT = SPACE - COL 13                                                     
//*------------------------------------------------------------------           
//*STEP13C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730PC,DISP=(OLD,DELETE)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(13,1,CH,EQ,C'Y')                                           
//*------------------------------------------------------------------           
//* SORT OUT PC CASES FOR DAILY REPORT                                          
//* PARENT-CHILD = P AND NOT FTS                                                
//* COL 13                                                                      
//*------------------------------------------------------------------           
//*STEP13   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(SHR,PASS)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(255,1,CH,EQ,C'P',AND,213,3,CH,NE,C'FTS')                   
//*    OUTREC FIELDS=(1,12,C'Y',14,487)                                         
//*---------------------------------------------------------------------        
//* SORT OUT WITH SMS SALES TYPE = BLANK                                        
//*---------------------------------------------------------------------        
//*STEP14A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN  DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//*SORTOUT  DD DSN=&&F558SB,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                            
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                           
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(1,8,A),FORMAT=CH                                             
//*   INCLUDE COND=(61,1,CH,EQ,C' ',AND,                                        
//*                 101,11,CH,NE,C'           ',AND,                            
//*                 (1,1,CH,NE,C'1',&,1,1,CH,NE,C'5',&,1,1,CH,NE,C'6'))         
//*   OUTREC FIELDS=(1,313,C'SB',316,285)                                       
//*---------------------------------------------------------------------        
//* TO MATCH AND OUTPUT 'Y' IF SMS SALE TYPE = BLANK                            
//* COL 14 = 'Y' IF SMS SALE TYPE = BLANK                                       
//*---------------------------------------------------------------------        
//*STEP14B  EXEC PGM=BP13C169,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13F558 DD DSN=&&F558SB,DISP=(OLD,DELETE)                                   
//*P13F730A DD DSN=&&F730SB,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                             
//*            SPACE=(CYL,(5,3),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT SALE TYPE = BLANK CASES FOR DAILY REPORT                           
//* SMS SALE TYPE = BLANK - COL 14                                              
//*------------------------------------------------------------------           
//*STEP14C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730SB,DISP=(OLD,DELETE)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(14,1,CH,EQ,C'Y')                                           
//*---------------------------------------------------------------------        
//* SORT OUT WITH SMS SALES TYPE = 7 AND LESSEE CODE = 01                       
//*---------------------------------------------------------------------        
//*STEP15A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN  DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//*SORTOUT  DD DSN=&&F558S7,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                            
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                           
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(1,8,A),FORMAT=CH                                             
//*   INCLUDE COND=(61,1,CH,EQ,C'7',AND,110,2,CH,EQ,C'01',AND,                  
//*                 (1,1,CH,NE,C'1',&,1,1,CH,NE,C'5',&,1,1,CH,NE,C'6'))         
//*   OUTREC FIELDS=(1,313,C'S7',316,285)                                       
//*---------------------------------------------------------------------        
//* TO MATCH AND OUTPUT 'Y' SMS SALE TYPE = 7 AND LESSEE CODE = 01 FND          
//* COL 15 = 'Y' IF SMS SALE TYPE = 7 AND LESSEE CODE = 01                      
//*---------------------------------------------------------------------        
//*STEP15B  EXEC PGM=BP13C169,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13F558 DD DSN=&&F558S7,DISP=(OLD,DELETE)                                   
//*P13F730A DD DSN=&&F730S7,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                             
//*            SPACE=(CYL,(5,3),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT SALE TYPE = 7, LESSEE CODE = 01 CASES FOR DAILY REPORT             
//* SMS SALE TYPE = 7 AND LESSEE CODE = 01 - COL 15                             
//*------------------------------------------------------------------           
//*STEP15C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730S7,DISP=(OLD,DELETE)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(15,1,CH,EQ,C'Y')                                           
//*---------------------------------------------------------------------        
//* SORT OUT SCH-ACC-NO SEQUENCE FOR SALES SCHEME-ACCNT                         
//*---------------------------------------------------------------------        
//*STEP16A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F716.A534Q748,DISP=OLD                                  
//*SORTOUT  DD DSN=&&F716DIVR,DISP=(,PASS),                                     
//*            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB),                          
//*            SPACE=(CYL,(150,30),RLSE)                                        
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(1,17,A),FORMAT=CH                                            
//*   INCLUDE COND=(51,9,CH,GE,C'700000000',AND,                                
//*                 (1,1,CH,NE,C'1',&,1,1,CH,NE,C'5',&,1,1,CH,NE,C'6'))         
//*---------------------------------------------------------------------        
//* SORT OUT ONLY SALES FLATS IN NRIC/SCH-ACC-NO SEQUENCE                       
//* 4= TRUST                                                                    
//* 5= O-TRUST                                                                  
//* RELATIONSHIP = 20(SPUSE), 02(FATHER), 12(MOTHER), 16(PARENT)                
//*---------------------------------------------------------------------        
//*STEP16B  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F716DIVR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F558WIDO,DISP=(,PASS),                                     
//*            DCB=(LRECL=600,RECFM=FB),                                        
//*            SPACE=(CYL,(150,30),RLSE)                                        
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(1,17,A),FORMAT=CH                                            
//*   INCLUDE COND=((89,1,CH,EQ,C'4',OR,                                        
//*                  89,1,CH,EQ,C'5'),AND,                                      
//*                 (99,2,CH,EQ,C'20',OR,99,2,CH,EQ,C'02',OR,                   
//*                  99,2,CH,EQ,C'12',OR,99,2,CH,EQ,C'16'))                     
//*   OUTREC FIELDS=(1,17,296X,C'AS',284X)                                      
//*---------------------------------------------------------------------        
//* TO MATCH AND OUTPUT 'Y' ADMINSTRATOR SPOUSE FND                             
//* COL 17 = 'Y' IF ADMINSTRATOR SPOUSE                                         
//*---------------------------------------------------------------------        
//*STEP16C  EXEC PGM=BP13C169,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13F558 DD DSN=&&F558WIDO,DISP=(OLD,DELETE)                                 
//*P13F730A DD DSN=&&F730AS,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                             
//*            SPACE=(CYL,(5,3),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT ADMINSTRATOR SPOUSE FOR DAILY REPORT                               
//* SORT OUT ONLY HHTY = 'H' OR 'T'                                             
//* ADMINSTRATOR SPOUSE - COL 16                                                
//*------------------------------------------------------------------           
//*STEP16D  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730AS,DISP=(OLD,DELETE)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(16,1,CH,EQ,C'Y',AND,                                       
//*                  116,1,CH,NE,C'G')                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 62,64,66,GA,GB (CONVERSION)                         
//*------------------------------------------------------------------           
//*STEP18A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'62',OR,221,2,CH,EQ,C'64',OR,                 
//*                  221,2,CH,EQ,C'66',OR,221,2,CH,EQ,C'GA',OR,                 
//*                  221,2,CH,EQ,C'GB')                                         
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'CONVERSION' CASES FROM VSAM FILE              
//*------------------------------------------------------------------           
//*STEP18B  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730CONV,DISP=(,PASS),                                     
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 62/64/66/GA/GB CASES FOR DAILY REPORT               
//* DEBARMENT CODE  62/64/66/GA/GB = Y - COL 4                                  
//*------------------------------------------------------------------           
//*STEP18C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730CONV,DISP=(SHR,DELETE)                                 
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,3,C'Y',5,496)                                           
//*---------------------------------------------------------------------        
//* SORT OUT PC RELATION WITH IN-LAW/SPOUSE IN RDB                              
//* NOTE: ...PARENT.RDBINLAW  - INCLUDED OUTPUT DSN FROM BP13C803               
//*---------------------------------------------------------------------        
//*STEP22A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F558.UPGOCCP.PARENT.RDBINLAW,DISP=SHR                   
//*SORTOUT  DD DSN=&&F558LS,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                            
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                           
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(1,8,A),FORMAT=CH                                             
//*   INCLUDE COND=(1,1,CH,NE,C'1',&,1,1,CH,NE,C'5',&,1,1,CH,NE,C'6')           
//*   OUTREC FIELDS=(1,313,C'LS',316,285)                                       
//*------------------------------------------------------------------           
//* TO MATCH AND OUTPUT 'Y' PC RELATION WITH IN-LAW/SPOUSE IN RDB               
//* COL 7 = 'Y' IF PC RELATION WITH IN-LAW/SPOUSE IN RDB                        
//*------------------------------------------------------------------           
//*STEP22B  EXEC PGM=BP13C169,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13F558 DD DSN=&&F558LS,DISP=(OLD,DELETE)                                   
//*P13F730A DD DSN=&&F730LS,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                             
//*            SPACE=(CYL,(5,3),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT PC RELATION WITH IN-LAW/SPOUSE IN RDB FOR DAILY REPORT             
//* PC RELATION WITH IN-LAW/SPOUSE IN RDB - COL 7                               
//*------------------------------------------------------------------           
//*STEP22C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730LS,DISP=(OLD,DELETE)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(7,1,CH,EQ,C'Y')                                            
//*---------------------------------------------------------------------        
//* SORT OUT WITH EX SPOUSE RESL - DIVORCED                                     
//* NOTE: ...UPGOCCP.XSPOUSE - ADDED OUTPUT DSN FROM BP13C188                   
//*---------------------------------------------------------------------        
//*STEP23A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F558.UPGOCCP.XSPOUSE,DISP=SHR                           
//*SORTOUT  DD DSN=&&F558XS,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                            
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                           
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(1,8,A),FORMAT=CH                                             
//*   INCLUDE COND=(1,1,CH,NE,C'1',&,1,1,CH,NE,C'5',&,1,1,CH,NE,C'6')           
//*   OUTREC FIELDS=(1,313,C'XS',316,285)                                       
//*------------------------------------------------------------------           
//* TO MATCH AND OUTPUT 'Y' EX SPOUSE RESL - DIVORCED                           
//* COL 8 = 'Y' IF EX SPOUSE RESL - DIVORCED                                    
//*------------------------------------------------------------------           
//*STEP23B  EXEC PGM=BP13C169,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13F558 DD DSN=&&F558XS,DISP=(OLD,DELETE)                                   
//*P13F730A DD DSN=&&F730XS,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                             
//*            SPACE=(CYL,(5,3),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT EX SPOUSE RESL - DIVORCED FOR DAILY REPORT                         
//* EX SPOUSE RESL - DIVORCED - COL 8                                           
//*------------------------------------------------------------------           
//*STEP23C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730XS,DISP=(OLD,DELETE)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(8,1,CH,EQ,C'Y')                                            
//*------------------------------------------------------------------           
//* SORT OUT HH BLANK CASES FOR DAILY REPORT                                    
//* HH BALNK  = Y - COL 14 TOGETHER WITH SLE TYPE = BLANK                       
//*------------------------------------------------------------------           
//*STEP24   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(116,1,CH,EQ,C' ')                                          
//*    OUTREC FIELDS=(1,13,C'Y',15,486)                                         
//*------------------------------------------------------------------           
//* SORT OUT ALLOC SCHEME PAS/PAA  FOR DAILY REPORT                             
//* CDE-ALLOC-SCH PAS/PAA = Y - COL 19                                          
//*------------------------------------------------------------------           
//*STEP25G  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(248,3,CH,EQ,C'PAS',OR,248,3,CH,EQ,C'PAA',                  
//*               OR,248,3,CH,EQ,C'PAC',OR,248,3,CH,EQ,C'SMP')                  
//*    OUTREC FIELDS=(1,18,C'Y',20,481)                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE GR,CG,EC,EG,EH,EM,EO,EQ,ES,EU,E5,E6                 
//*------------------------------------------------------------------           
//*STEP25H1 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'GR',OR,221,2,CH,EQ,C'CG',OR,                 
//*                  221,2,CH,EQ,C'EC',OR,221,2,CH,EQ,C'EG',OR,                 
//*                  221,2,CH,EQ,C'EH',OR,221,2,CH,EQ,C'EM',OR,                 
//*                  221,2,CH,EQ,C'EO',OR,221,2,CH,EQ,C'EQ',OR,                 
//*                  221,2,CH,EQ,C'ES',OR,221,2,CH,EQ,C'EU',OR,                 
//*                  221,2,CH,EQ,C'E5',OR,221,2,CH,EQ,C'E6')                    
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE GR/CG/EC FROM VSAM FILE                        
//*------------------------------------------------------------------           
//*STEP25H2 EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE GR/CG/EC/EG/EH/EM/EO/EQ/ES/EU/E5/E6                 
//* DEBARMENT CODE  GR/CG/EC/EG/EH/EM/EO/EQ/ES/EU/E5/E6 = Y - COL 20            
//*------------------------------------------------------------------           
//*STEP25H3 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,19,C'Y',21,480)                                         
//*------------------------------------------------------------------           
//* SORT OUT BLANK CAT FOR DAILY REPORT                                         
//* CDE-CATEGORY BLANK = Y - COL 21                                             
//*------------------------------------------------------------------           
//*STEP25I  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(225,1,CH,EQ,C' ')                                          
//*    OUTREC FIELDS=(1,20,C'Y',22,479)                                         
//*------------------------------------------------------------------           
//* SORT OUT BLANK ALLOC FOR DAILY REPORT                                       
//* NUM-ALLO-CAT BLANK = Y - COL 22                                             
//*------------------------------------------------------------------           
//*STEP25J  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(215,3,CH,EQ,C'   ')                                        
//*    OUTREC FIELDS=(1,21,C'Y',23,478)                                         
//*------------------------------------------------------------------           
//* SORT OUT BLANK ELIG FOR DAILY REPORT                                        
//* CDE-ELIG-SCH BLANK = Y - COL 23                                             
//*------------------------------------------------------------------           
//*STEP25K  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(248,3,CH,EQ,C'   ')                                        
//*    OUTREC FIELDS=(1,22,C'Y',24,477)                                         
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES ACCORDING TO REGN NO                           
//*------------------------------------------------------------------           
//*STEP26A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F730.DAILY.REPORT,DISP=SHR                              
//*SORTOUT  DD DSN=&&F730FULL,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                             
//*            SPACE=(CYL,(10,5),RLSE)                                          
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*------------------------------------------------------------------           
//* MERGE SIMILAR REF NO TOGETHER                                               
//*------------------------------------------------------------------           
//*STEP26B  EXEC PGM=BP13C165,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&F730FULL,DISP=(OLD,DELETE)                                 
//*P13F730A DD DSN=BP13.F730.DAILY.REPORT.BE,DISP=OLD                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES - HOUSEHOLD CHECKS                             
//*------------------------------------------------------------------           
//*STEP26C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F730.DAILY.REPORT.BE,DISP=SHR                           
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT.PART1,DISP=OLD                        
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(376,3,CH,EQ,C'SBF')                                        
//*    OUTREC FIELDS=(1,499,C'A')                                               
//*                                                                             
//*BEGIN DATA EXTRACTION FOR REPORT 2                                           
//*                                                                             
//*------------------------------------------------------------------           
//* SORT OUT MCPS CASES FOR DAILY REPORT                                        
//*------------------------------------------------------------------           
//STEP30   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=OLD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=((118,1,CH,EQ,C'M',OR,118,1,CH,EQ,C'C',OR,                     
                  118,1,CH,EQ,C'B',OR,                                          
                  118,1,CH,EQ,C'P'),AND,                                        
                 (253,1,CH,NE,C'1',AND,                                         
                  253,1,CH,NE,C'A',AND,                                         
                  253,1,CH,NE,C'T'))                                            
//*------------------------------------------------------------------           
//* SORT OUT  MHA POSTAL CODES OF P/C FROM APPLICATIONS POSTAL CODE             
//* NOTE: BP13.F730.MHA.POSTAL.DIFF ADDED DSN FROM BP13C021                     
//*------------------------------------------------------------------           
//STEP32A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.MHA.POSTAL.DIFF,DISP=SHR                            
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(376,3,CH,EQ,C'SBF')                                           
    SUM FIELDS=NONE                                                             
    OUTREC FIELDS=(1,2,C'Y',4,497)                                              
//*------------------------------------------------------------------           
//* CHECK FOR PRIORITY SCHEMES WITH NO QUOTA                                    
//*------------------------------------------------------------------           
//STEP32B  EXEC PGM=BP13CF53,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K811 DD DSN=BP13.K811.PRIOSCH.NOQUOTA,DISP=SHR                            
//P13F730A DD DSN=&&F730CF53,DISP=(NEW,PASS),                                   
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT MCPS-G NO QUOTA - COL 4                                            
//*------------------------------------------------------------------           
//STEP32C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CF53,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(4,1,CH,EQ,C'Y')                                               
//*------------------------------------------------------------------           
//* SORT OUT MCPS-H NO QUOTA - COL 5                                            
//*------------------------------------------------------------------           
//STEP32D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CF53,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(5,1,CH,EQ,C'Y')                                               
//*------------------------------------------------------------------           
//* SORT OUT  RDB SUBTENANT APPLICATIONS                                        
//* NOTE: BP13.F730.RDB.SBTNT ADDED DSN FROM BP13C021                           
//*------------------------------------------------------------------           
//STEP32E  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.RDB.SBTNT,DISP=SHR                                  
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(376,3,CH,EQ,C'SBF')                                           
    SUM FIELDS=NONE                                                             
    OUTREC FIELDS=(1,5,C'Y',7,494)                                              
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE MC,MD,PU,PP,MA,MB,70,71,ME,MF                       
//*------------------------------------------------------------------           
//STEP32F1 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'MC',OR,221,2,CH,EQ,C'MD',OR,                    
                  221,2,CH,EQ,C'PU',OR,221,2,CH,EQ,C'PP',OR,                    
                  221,2,CH,EQ,C'MA',OR,221,2,CH,EQ,C'MB',OR,                    
                  221,2,CH,EQ,C'70',OR,221,2,CH,EQ,C'71',OR,                    
                  221,2,CH,EQ,C'ME',OR,221,2,CH,EQ,C'MF',OR,                    
                  221,2,CH,EQ,C'MH',OR,221,2,CH,EQ,C'MJ',OR,                    
                  221,2,CH,EQ,C'PV',OR,221,2,CH,EQ,C'PX',OR,                    
                  221,2,CH,EQ,C'PY',OR,221,2,CH,EQ,C'PZ',OR,                    
                  221,2,CH,EQ,C'Q1',OR,221,2,CH,EQ,C'Q2',OR,                    
                  221,2,CH,EQ,C'Q3',OR,221,2,CH,EQ,C'Q4')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE MC/MD/PU/PP/MA/MB/70/71 FROM VSAM FILE         
//*------------------------------------------------------------------           
//STEP32F2 EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE MC/MD/PU/PP/MA/MB/70/71/ME/MF                       
//* DEBARMENT CODE  MC/MD/PU/PP/MA/MB/70/71/ME/MF = Y - COL 7                   
//*------------------------------------------------------------------           
//STEP32F3 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,6,C'Y',8,493)                                              
//*------------------------------------------------------------------           
//* PROCESS CASES FOR MCP PARENT                                                
//*------------------------------------------------------------------           
//STEP33A  EXEC PGM=BP13CB61,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K820 DD DSN=BP13.K820.OCCUP,DISP=SHR                                      
//BP13K821 DD DSN=BP13.K820.OCCUP.PATH1,DISP=SHR                                
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//P13F730A DD DSN=&&F730MCP,DISP=(,PASS),                                       
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT CASES WITH PARENT THAT ARE IN SOC - COL 19                         
//*------------------------------------------------------------------           
//STEP33B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730MCP,DISP=(SHR,DELETE)                                   
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,18,C'Y',20,481)                                            
//*------------------------------------------------------------------           
//* OUTPUT CASES WHERE NRIC EXISTS IN EC APPLICATION                            
//* RESIDENT-HA1 = '1/A/T'                                                      
//*------------------------------------------------------------------           
//STEP33C  EXEC PGM=BP13CD15,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP18K310 DD DSN=BP18.K310.OCCUPIER,DISP=SHR                                   
//P13F730A DD DSN=&&F730CD15,DISP=(NEW,PASS),UNIT=SYSDA,                        
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT CASES WHERE NRIC EXISTS IN EC APPLN - COL 19                       
//*------------------------------------------------------------------           
//STEP33D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CD15,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,18,C'Y',20,481)                                            
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE MA,MB,MC,MD,ME,MF,EC,E5,EU,MH,MJ                    
//*------------------------------------------------------------------           
//STEP34A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'MA',OR,221,2,CH,EQ,C'MB',OR,                    
                  221,2,CH,EQ,C'MC',OR,221,2,CH,EQ,C'MD',OR,                    
                  221,2,CH,EQ,C'ME',OR,221,2,CH,EQ,C'MF',OR,                    
                  221,2,CH,EQ,C'MH',OR,221,2,CH,EQ,C'MJ',OR,                    
                  221,2,CH,EQ,C'EC',OR,221,2,CH,EQ,C'E5',OR,                    
                  221,2,CH,EQ,C'EU',OR,                                         
                  221,2,CH,EQ,C'PV',OR,221,2,CH,EQ,C'PX',OR,                    
                  221,2,CH,EQ,C'PY',OR,221,2,CH,EQ,C'PZ',OR,                    
                  221,2,CH,EQ,C'Q1',OR,221,2,CH,EQ,C'Q2',OR,                    
                  221,2,CH,EQ,C'Q3',OR,221,2,CH,EQ,C'Q4')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'MA/MB/MC/MD/ME/MF/EC/E5/EU'                   
//*------------------------------------------------------------------           
//STEP34B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* EXTRACT  ONLY MCPS CASES                                                    
//*------------------------------------------------------------------           
//STEP34C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//SORTOUT  DD DSN=&&F730MCP,DISP=(NEW,PASS),                                    
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
  INCLUDE  COND=(118,1,CH,NE,C' ')                                              
//*------------------------------------------------------------------           
//* SORT OUT THOSE PARENT/CHILD NRIC WITH DEB MA/MB/MC/MD/ME/MF/EC/E5/EU        
//* DEBARMENT CODE  MA/MB/MC/MD/ME/MF/EC/E5/EU = Y - COL 20                     
//*------------------------------------------------------------------           
//STEP34D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730MCP,DISP=(SHR,DELETE)                                   
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,19,C'Y',21,480)                                            
//*-----------------------------------------------------------------            
//* EXTRACT MCPS APPLICATIONS                                                   
//*------------------------------------------------------------------           
//STEP35A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730BE,DISP=(SHR,PASS)                                      
//SORTOUT  DD DSN=&&F730TEMP,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD  *                                                                
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
  INCLUDE  COND=(118,1,CH,NE,C' ')                                              
//*------------------------------------------------------------------           
//* TO EXTRACT ALL NRIC UNDER THE MCP APPLICATION                               
//*------------------------------------------------------------------           
//STEP35B  EXEC PGM=BP13CF04,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730TEMP,DISP=(OLD,DELETE)                                  
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//P13F730A DD DSN=&&P13F730A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* CHECK NRIC IF EXISTING IN RESALE FILE                                       
//*------------------------------------------------------------------           
//STEP35C  EXEC PGM=BP13CF05,COND=(0,NE)                                        
//BP13F730 DD DSN=&&P13F730A,DISP=(OLD,DELETE)                                  
//BB24K020 DD DSN=BB24.K020.OCCUPIER,DISP=SHR                                   
//BB24K021 DD DSN=BB24.K020.OCCUPIER.PATH1,DISP=SHR                             
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//P13F730A DD DSN=&&F730TEMP,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(5,3),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT THOSE WITH RESALE HISTORY  = Y  - COL 21                           
//*------------------------------------------------------------------           
//STEP35D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730TEMP,DISP=(OLD,DELETE)                                  
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,20,C'Y',22,479)                                            
//*------------------------------------------------------------------           
//* PROCESS CASES THAT HAS CDE-HOUSEHOLD = 'H' OR 'T' AND                       
//* CDE-BALLOT-HOUSEHOLD = 'G'                                                  
//*------------------------------------------------------------------           
//STEP36A  EXEC PGM=BP13CB59,COND=(0,NE)                                        
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//P13F730A DD DSN=&&F730HH,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT STRIKE CASES FOR DAILY REPORT - COL 22                             
//*------------------------------------------------------------------           
//STEP36B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730HH,DISP=(SHR,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,21,C'Y',23,478)                                            
//*------------------------------------------------------------------           
//* SORT OUT  APPS NOT BLANK= Y COL 23                                          
//*------------------------------------------------------------------           
//STEP37   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(243,1,CH,EQ,C'Y',AND,                                         
                  244,1,CH,NE,C'1',AND,                                         
                  244,1,CH,NE,C'T')                                             
    OUTREC FIELDS=(1,22,C'Y',24,477)                                            
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES ACCORDING TO REGN NO                           
//*------------------------------------------------------------------           
//STEP39A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT,DISP=SHR                               
//SORTOUT  DD DSN=&&F730FULL,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*------------------------------------------------------------------           
//* MERGE SIMILAR REF NO TOGETHER                                               
//*------------------------------------------------------------------           
//STEP39B  EXEC PGM=BP13C165,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730FULL,DISP=(OLD,DELETE)                                  
//P13F730A DD DSN=BP13.F730.DAILY.REPORT.BE,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES -  MCPS APPLICATIONS                           
//*------------------------------------------------------------------           
//STEP39C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT.BE,DISP=SHR                            
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT.PART2,DISP=OLD                         
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(376,3,CH,EQ,C'SBF')                                           
    OUTREC FIELDS=(1,499,C'B')                                                  
//*                                                                             
//*                                                                             
//*BEGIN DATA EXTRACTION FOR REPORT 3                                           
//*                                                                             
//*--------------------------------------------------------------------         
//* EXTRACT TCP APPLICATIONS                                                    
//*--------------------------------------------------------------------         
//STEP43A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730C17B,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(213,3,CH,EQ,C'TCP')                                             
//*--------------------------------------------------------------------         
//* MATCH TCP APPLICATIONS TO EXTRACT BP13K825                                  
//* SORT DATE OF BIRTH, SORT OUT NUM-RELATIONSHIP 41/39/51                      
//*--------------------------------------------------------------------         
//STEP43B  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&F730C17B,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=BP13.K825.REQOCCP,DISP=SHR                                    
//MATCH    DD DSN=&&F825C17B,DISP=(NEW,PASS),                                   
//            DCB=(BLKSIZE=0,LRECL=200,RECFM=FB),                               
//            SPACE=(CYL,(100,15),RLSE)                                         
//SYSIN    DD *                                                                 
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(1,8,A)                                              
   REFORMAT FIELDS=(F2:1,200)                                                   
   OUTFILE FNAMES=MATCH                                                         
   SORT FIELDS=(1,17,A,97,8,A),FORMAT=CH                                        
   INCLUDE COND=(107,2,CH,EQ,C'41',OR,107,2,CH,EQ,C'39',OR,                     
                 107,2,CH,EQ,C'51')                                             
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*--------------------------------------------------------------------         
//* TO SCREEN CITIZENSHIP OF THE 1ST 3 OLDEST CHILDREN IN TCP APPLNS            
//*--------------------------------------------------------------------         
//STEP43C  EXEC PGM=BP13C17B,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730C17B,DISP=(OLD,DELETE)                                  
//BP13F825 DD DSN=&&F825C17B,DISP=(OLD,DELETE)                                  
//P13F730A DD DSN=&&F730TCP,DISP=(NEW,PASS),                                    
//            DCB=(BLKSIZE=0,LRECL=500,RECFM=FB),                               
//            SPACE=(CYL,(50,15),RLSE)                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT TCP CASES FOR DAILY REPORT                                         
//* ALLO_SCH TCP = Y - COL 4                                                    
//*------------------------------------------------------------------           
//STEP43D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730TCP,DISP=(OLD,DELETE)                                   
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=OLD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,3,C'Y',5,496)                                              
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 39,40,41                                            
//*------------------------------------------------------------------           
//STEP44A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'39',OR,                                         
                  221,2,CH,EQ,C'40',OR,                                         
                  221,2,CH,EQ,C'41')                                            
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE '39/40/41' FROM VSAM FILE                      
//*------------------------------------------------------------------           
//STEP44B  EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT ONLY TCP  AND TPS CASES                                            
//*------------------------------------------------------------------           
//STEP44C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(OLD,DELETE)                                      
//SORTOUT  DD DSN=&&F730TCP,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(213,3,CH,EQ,C'TCP',OR,213,3,CH,EQ,C'TPS')                     
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 39/40/41 CASES FOR DAILY REPORT                     
//* DEBARMENT CODE  39/40/41 = Y - COL 5                                        
//*------------------------------------------------------------------           
//STEP44D  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730TCP,DISP=(SHR,DELETE)                                   
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,4,C'Y',6,495)                                              
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE EA,EB,ET COL 6                                      
//*------------------------------------------------------------------           
//*STEP44E  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'EA',OR,221,2,CH,EQ,C'EB',OR,                 
//*                  221,2,CH,EQ,C'ET')                                         
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE EA/EB/ET FROM VSAM FILE                        
//*------------------------------------------------------------------           
//*STEP44F  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE EA/EB/ET CASES FOR DAILY REPORT                     
//* DEBARMENT CODE  EA/EB/ET = Y - COL 6                                        
//*------------------------------------------------------------------           
//*STEP44G  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,PASS)                                       
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,5,C'Y',7,494)                                           
//*------------------------------------------------------------------           
//* SORT OUT BY NRIC1                                                           
//*------------------------------------------------------------------           
//*STEP44H  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=&&F730CF47,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(41,9,A),FORMAT=CH                                           
//*------------------------------------------------------------------           
//* SORT OUT BTO CASES FROM F558                                                
//*------------------------------------------------------------------           
//*STEP44I  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                   
//*SORTOUT  DD DSN=&&F558CF47,DISP=(NEW,PASS),                                  
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=0),                              
//*            SPACE=(CYL,(15,10),RLSE),UNIT=SYSDA                              
//*SYSIN    DD  *                                                               
//*     SORT FIELDS=(1,8,A),FORMAT=CH                                           
//*     INCLUDE COND=(1,1,CH,NE,C'1',&,1,1,CH,NE,C'5',&,1,1,CH,NE,C'6')         
//*------------------------------------------------------------------           
//* EXRACT SERS PORT NOT LESSEE CASES                                           
//*------------------------------------------------------------------           
//*STEP44J  EXEC PGM=BP13CF47,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&F730CF47,DISP=(SHR,PASS)                                   
//*BP13F558 DD DSN=&&F558CF47,DISP=(OLD,DELETE)                                 
//*P13F730A DD DSN=&&F730SER1,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT SERS PORT TAG  BUT NOT LESSESS CASES                               
//*  - COL 7                                                                    
//*------------------------------------------------------------------           
//*STEP44K  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730SER1,DISP=(OLD,DELETE)                                 
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,6,C'Y',8,493)                                           
//*------------------------------------------------------------------           
//* SORT OUT CASES PORT TAG WITH HOUSING SCHEME                                 
//*------------------------------------------------------------------           
//*STEP44L  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&F730CF47,DISP=(OLD,DELETE)                                  
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(213,2,CH,NE,C'PA',OR,118,1,CH,NE,C' ')                     
//*    OUTREC FIELDS=(1,7,C'Y',9,492)                                           
//*------------------------------------------------------------------           
//* SORT OUT PPS MARITAL STATUS = 'S' - COL 09                                  
//* SORT OUT PPS & RELATIONSHIP 38/39 - COL 10                                  
//*------------------------------------------------------------------           
//STEP44M  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.CF72,DISP=SHR                                       
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=((9,1,CH,EQ,C'Y',OR,10,1,CH,EQ,C'Y'),AND,                      
                   376,3,CH,EQ,C'SBF')                                          
//*------------------------------------------------------------------           
//* INCLUDE NEPHEW & NIECE CASES IN COL 09                                      
//*------------------------------------------------------------------           
//STEP44N  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.CF72,DISP=SHR                                       
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(469,1,CH,EQ,C'P',AND,376,3,CH,EQ,C'SBF')                      
    OUTREC FIELDS=(1,8,C'Y',10,491)                                             
//*------------------------------------------------------------------           
//* SORT OUT AST CASES FOR DAILY REPORT                                         
//* NUM-AST NOT BLANK - COL 12                                                  
//*------------------------------------------------------------------           
//STEP44R  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(471,1,CH,NE,C' ')                                             
    OUTREC FIELDS=(1,11,471,1,13,488)                                           
//*------------------------------------------------------------------           
//* SORT OUT PPS AND HH=G CASES                                                 
//* PPS & HH IS G = Y - COL 14                                                  
//*------------------------------------------------------------------           
//STEP44V  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.CF72,DISP=SHR                                       
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(469,1,CH,EQ,C'Y',AND,461,1,CH,EQ,C'G',AND,                    
                  376,3,CH,EQ,C'SBF')                                           
    OUTREC FIELDS=(1,13,C'Y',15,486)                                            
//*------------------------------------------------------------------           
//* SORT OUT TCP NO QUOTA - COL 15                                              
//*------------------------------------------------------------------           
//STEP44W  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CF53,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(15,1,CH,EQ,C'Y')                                              
//*------------------------------------------------------------------           
//* SORT OUT TPS NO QUOTA - COL 16                                              
//*------------------------------------------------------------------           
//STEP44X  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CF53,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(16,1,CH,EQ,C'Y')                                              
//*------------------------------------------------------------------           
//* SORT OUT NO ETHNIC QUOTA - COL 17                                           
//*------------------------------------------------------------------           
//STEP44Y  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730CF53,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(17,1,CH,EQ,C'Y')                                              
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES ACCORDING TO REGN NO                           
//*------------------------------------------------------------------           
//STEP45A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT,DISP=SHR                               
//SORTOUT  DD DSN=&&F730FULL,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*------------------------------------------------------------------           
//* MERGE SIMILAR REF NO TOGETHER                                               
//*------------------------------------------------------------------           
//STEP45B  EXEC PGM=BP13C165,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730FULL,DISP=(OLD,DELETE)                                  
//P13F730A DD DSN=BP13.F730.DAILY.REPORT.BE,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES -  MCPS APPLICATIONS                           
//*------------------------------------------------------------------           
//STEP45C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT.BE,DISP=SHR                            
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT.PART3,DISP=OLD                         
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(376,3,CH,EQ,C'SBF')                                           
    OUTREC FIELDS=(1,499,C'C')                                                  
//*                                                                             
//*                                                                             
//*BEGIN DATA EXTRACTION FOR REPORT 4                                           
//*                                                                             
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE AD,AC                                               
//*------------------------------------------------------------------           
//*STEP50A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'AD',OR,221,2,CH,EQ,C'AC')                    
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'AD/AC' FROM VSAM FILE                         
//*------------------------------------------------------------------           
//*STEP50B  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT THOSE WITH DEB AD/AC                                               
//* DEBARMENT CODE  AD/AC = Y - COL 2                                           
//*------------------------------------------------------------------           
//*STEP50C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=OLD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,1,C'Y',3,498)                                           
//*------------------------------------------------------------------           
//* SORT OUT REJECTED APPLICATION DUE TO 10-YRS PERIOD NOT MET                  
//*------------------------------------------------------------------           
//* SORT OUT 10-YR = N CASES FOR DAILY REPORT                                   
//* 10-YR = N - COL 1                                                           
//*------------------------------------------------------------------           
//*STEP51A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(175,1,CH,EQ,C'N')                                          
//*    OUTREC FIELDS=(C'N',2,499)                                               
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FOR 5-YEAR                                          
//*------------------------------------------------------------------           
//*STEP51B  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'GR')                                         
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 5-YEAR                                         
//*------------------------------------------------------------------           
//*STEP51C  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT THOSE WITH DEB GR                                                  
//* DEBARMENT CODE  5-YEAR = Y - COL 1                                          
//*------------------------------------------------------------------           
//*STEP51D  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(C'Y',2,499)                                               
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE PA,PB,PC,PE,PF,QF,PD (SOLD HUDC)                    
//*------------------------------------------------------------------           
//*STEP52A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'PA',OR,221,2,CH,EQ,C'PB',OR,                 
//*                  221,2,CH,EQ,C'PC',OR,221,2,CH,EQ,C'PE',OR,                 
//*                  221,2,CH,EQ,C'PF',OR,221,2,CH,EQ,C'QF',OR,                 
//*                  221,2,CH,EQ,C'PD')                                         
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'SOLD HUDC' CASES FROM VSAM FILE               
//*------------------------------------------------------------------           
//*STEP52B  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730HUDC,DISP=(,PASS),                                     
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE PA/PB/PC/PE/PF/QF CASES FOR DAILY REPORT            
//* DEBARMENT CODE  PA/PB/PC/PE/PF/QF = Y - COL 3                               
//*------------------------------------------------------------------           
//*STEP52C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730HUDC,DISP=(SHR,DELETE)                                 
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,2,C'Y',4,497)                                           
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE EA/EB/ET/EF/4J/R2                                   
//*------------------------------------------------------------------           
//*STEP53A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'EA',OR,221,2,CH,EQ,C'EB',OR,                 
//*                  221,2,CH,EQ,C'ET',OR,221,2,CH,EQ,C'EF',OR,                 
//*                  221,2,CH,EQ,C'4J',OR,221,2,CH,EQ,C'R2')                    
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE EA/EB/ET/EF/4J/R2 FROM VSAM FILE               
//*------------------------------------------------------------------           
//*STEP53B  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE EA/EB/ET/EF/4J/R2 CASES FOR DAILY REPORT            
//* DEBARMENT CODE  EA/EB/ET/EF/4J/R2 = Y - COL 4                               
//*------------------------------------------------------------------           
//*STEP53C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,3,C'Y',5,496)                                           
//*------------------------------------------------------------------           
//* COMPARE DAILY FILE WITH ACCUMULATED VSAM FILE.                              
//* SORT OUT ONLY CASES IN THE DAILY FILE                                       
//*------------------------------------------------------------------           
//*STEP54A  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13K730 DD DSN=BP13.K730.MATURERQ.PPO,DISP=SHR                              
//*BP13F730 DD DSN=&&F730PPO,DISP=(,PASS),                                      
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT PPO CASES FOR DAILY REPORT - FROM PPO FILE                         
//* PPOS TAG = Y - COL 6                                                        
//*------------------------------------------------------------------           
//*STEP54B  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730PPO,DISP=(OLD,DELETE)                                  
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(347,1,CH,EQ,C'Y',AND,211,2,CH,NE,C'1A')                    
//*    OUTREC FIELDS=(1,5,C'Y',7,494)                                           
//*------------------------------------------------------------------           
//* SORT OUT PPO CASES FOR DAILY REPORT - FROM SURVEY                           
//* PPO TAG = Y - COL 5                                                         
//*------------------------------------------------------------------           
//*STEP55   EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(347,1,CH,NE,C' ',AND,211,2,CH,NE,C'1A')                    
//*    OUTREC FIELDS=(1,4,C'Y',6,495)                                           
//*******************************************************************           
//* SORT OUT DUAL APPLICATION CASES FOR DAILY REPORT                            
//* DUAL CASES - 'SL' - COL 7                                                   
//*------------------------------------------------------------------           
//*STEP56A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(SHR,PASS)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(258,2,CH,EQ,C'SL')                                         
//*    OUTREC FIELDS=(1,6,C'S',8,493)                                           
//*******************************************************************           
//* SORT OUT DUAL APPLICATION CASES FOR DAILY REPORT                            
//* DUAL CASES - 'RR' - COL 7                                                   
//*------------------------------------------------------------------           
//*STEP56B  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(SHR,PASS)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(258,2,CH,EQ,C'RR')                                         
//*    OUTREC FIELDS=(1,6,C'R',8,493)                                           
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FX/FY                                               
//*------------------------------------------------------------------           
//*STEP56C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'FX',OR,221,2,CH,EQ,C'FY')                    
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 33 FROM VSAM FILE                              
//*------------------------------------------------------------------           
//*STEP56D  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FOR DAILY REPORT                                    
//* DEBARMENT CODE  FX/FY  = Y - COL 7 (SHARE WITH DUAL CASES)                  
//*------------------------------------------------------------------           
//*STEP56E  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,6,C'F',8,493)                                           
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE TB/TC                                               
//*------------------------------------------------------------------           
//*STEP56F  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'TB',OR,221,2,CH,EQ,C'TC')                    
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE TB/TC FROM VSAM FILE                           
//*------------------------------------------------------------------           
//*STEP56G  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FOR DAILY REPORT                                    
//* DEBARMENT CODE  TB/TC  = T - COL 7                                          
//*------------------------------------------------------------------           
//*STEP56H  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,6,C'T',8,493)                                           
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 33                                                  
//*------------------------------------------------------------------           
//*STEP57A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'33')                                         
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 33 FROM VSAM FILE                              
//*------------------------------------------------------------------           
//*STEP57B  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 33 FOR DAILY REPORT                                 
//* DEBARMENT CODE  33 = Y - COL 8                                              
//*------------------------------------------------------------------           
//*STEP57C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OMIT COND=(211,2,CH,EQ,C'1A')                                            
//*    OUTREC FIELDS=(1,7,C'Y',9,492)                                           
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE RA/AC                                               
//*------------------------------------------------------------------           
//*STEP57D  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'RA',OR,221,2,CH,EQ,C'AC')                    
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE RA/AC FROM VSAM FILE                           
//*------------------------------------------------------------------           
//*STEP57E  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE RA/AC FOR DAILY REPORT                              
//* DEBARMENT CODE  RA/AC = Y - COL 8                                           
//*------------------------------------------------------------------           
//*STEP57F  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,7,C'Y',9,492)                                           
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 77/GC/GX/GZ                                         
//*------------------------------------------------------------------           
//*STEP59A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'77',OR,221,2,CH,EQ,C'GC',OR,                 
//*                  221,2,CH,EQ,C'GX',OR,221,2,CH,EQ,C'GZ')                    
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 77 AND GC FROM VSAM FILE                       
//*------------------------------------------------------------------           
//*STEP59B  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 77 FOR DAILY REPORT                                 
//* DEBARMENT CODE  77/GC/GX/GZ = Y - COL 10                                    
//*------------------------------------------------------------------           
//*STEP59C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,9,C'Y',11,490)                                          
//*---------------------------------------------------------------------        
//* SORT OUT WITH NUM-HDB-REF-SMS NOT EMPTY, NUM-HDB-REF-RSL NOT EMPTY,         
//*        CDE-FILE-STATUS-RSL NOT 'OM', AND CDE-FILE-STATUS-SMS EMPTY          
//*---------------------------------------------------------------------        
//*STEP60A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN  DD DSN=BP13.F558.UPGOCCP,DISP=SHR                                    
//*SORTOUT  DD DSN=&&F558FL,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,SPACE=(CYL,(150,20),RLSE),                            
//*            DCB=(RECFM=FB,LRECL=600,BLKSIZE=27600)                           
//*SYSIN    DD  *                                                               
//*   SORT FIELDS=(1,8,A),FORMAT=CH                                             
//*   INCLUDE COND=(101,11,CH,NE,C'           ',AND,                            
//*                  71,11,CH,NE,C'           ',AND,                            
//*                          112,3,CH,NE,C'OM ',AND,                            
//*                          124,2,CH,EQ,C'  ')                                 
//*   OUTREC FIELDS=(1,313,C'FL',316,285)                                       
//*---------------------------------------------------------------------        
//* TO MATCH AND OUTPUT 'Y' 2ND FLAT LESSEE                                     
//*         COL 12 = 'Y' IF 2ND FLAT LESSEE                                     
//*---------------------------------------------------------------------        
//*STEP60B  EXEC PGM=BP13C169,COND=(0,NE)                                       
//*BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*BP13F558 DD DSN=&&F558FL,DISP=(OLD,DELETE)                                   
//*P13F730A DD DSN=&&F730FL,DISP=(NEW,PASS),                                    
//*            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                             
//*            SPACE=(CYL,(5,3),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT 2ND FLAT LESSEE FOR DAILY REPORT                                   
//* 2ND FLAT LESSEE   - COL 12                                                  
//*------------------------------------------------------------------           
//*STEP60C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730FL,DISP=(OLD,DELETE)                                   
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(12,1,CH,EQ,C'Y',AND,211,2,CH,NE,C'1A')                     
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FS                                                  
//*------------------------------------------------------------------           
//*STEP62A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'FS')                                         
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE FS FROM VSAM FILE                              
//*------------------------------------------------------------------           
//*STEP62B  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FS FOR DAILY REPORT                                 
//* DEBARMENT CODE  FS = Y - COL 14                                             
//*------------------------------------------------------------------           
//*STEP62C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,13,C'Y',15,486)                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 6C/7A                                               
//*------------------------------------------------------------------           
//*STEP63A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'6C',OR,221,2,CH,EQ,C'7A',OR,                 
//*                  221,2,CH,EQ,C'6A',OR,221,2,CH,EQ,C'6B',OR,                 
//*                  221,2,CH,EQ,C'6D',OR,221,2,CH,EQ,C'07',OR,                 
//*                  221,2,CH,EQ,C'5C',OR,221,2,CH,EQ,C'5B',OR,                 
//*                  221,2,CH,EQ,C'UA')                                         
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 6C/7A FROM VSAM FILE                           
//*------------------------------------------------------------------           
//*STEP63B  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE FS FOR DAILY REPORT                                 
//* DEBARMENT CODE  6C/7A = Y - COL 15                                          
//*------------------------------------------------------------------           
//*STEP63C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,14,C'Y',16,485)                                         
//*------------------------------------------------------------------           
//* SORT OUT AHG DEBARMENT CODES                                                
//*------------------------------------------------------------------           
//*STEP64A  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'LA',OR,221,2,CH,EQ,C'LB',OR,                 
//*                  221,2,CH,EQ,C'LC',OR,221,2,CH,EQ,C'LD',OR,                 
//*                  221,2,CH,EQ,C'LE',OR,221,2,CH,EQ,C'LF',OR,                 
//*                  221,2,CH,EQ,C'LG',OR,221,2,CH,EQ,C'LH',OR,                 
//*                  221,2,CH,EQ,C'LI',OR,221,2,CH,EQ,C'LJ',OR,                 
//*                  221,2,CH,EQ,C'LK',OR,221,2,CH,EQ,C'LL',OR,                 
//*                  221,2,CH,EQ,C'JA',OR,221,2,CH,EQ,C'JB',OR,                 
//*                  221,2,CH,EQ,C'JC',OR,221,2,CH,EQ,C'JD',OR,                 
//*                  221,2,CH,EQ,C'JE',OR,221,2,CH,EQ,C'JF',OR,                 
//*                  221,2,CH,EQ,C'JG',OR,221,2,CH,EQ,C'JH',OR,                 
//*                  221,2,CH,EQ,C'JI',OR,221,2,CH,EQ,C'JJ',OR,                 
//*                  221,2,CH,EQ,C'JK',OR,221,2,CH,EQ,C'JL',OR,                 
//*                  221,2,CH,EQ,C'JM',OR,221,2,CH,EQ,C'JN',OR,                 
//*                  221,2,CH,EQ,C'JO',OR,221,2,CH,EQ,C'JP',OR,                 
//*                  221,2,CH,EQ,C'JQ',OR,221,2,CH,EQ,C'JR',OR,                 
//*                  221,2,CH,EQ,C'NA',OR,221,2,CH,EQ,C'NB',OR,                 
//*                  221,2,CH,EQ,C'NC',OR,221,2,CH,EQ,C'ND',OR,                 
//*                  221,2,CH,EQ,C'NE',OR,221,2,CH,EQ,C'NF',OR,                 
//*                  221,2,CH,EQ,C'NG',OR,221,2,CH,EQ,C'NH',OR,                 
//*                  221,2,CH,EQ,C'NI',OR,221,2,CH,EQ,C'NJ',OR,                 
//*                  221,2,CH,EQ,C'NK',OR,221,2,CH,EQ,C'NL',OR,                 
//*                  221,2,CH,EQ,C'NM',OR,221,2,CH,EQ,C'NN',OR,                 
//*                  221,2,CH,EQ,C'NO',OR,221,2,CH,EQ,C'NP',OR,                 
//*                  221,2,CH,EQ,C'NQ',OR,221,2,CH,EQ,C'NR',OR,                 
//*                  221,2,CH,EQ,C'NS',OR,221,2,CH,EQ,C'NT',OR,                 
//*                  221,2,CH,EQ,C'NU',OR,221,2,CH,EQ,C'NV',OR,                 
//*                  221,2,CH,EQ,C'NW',OR,221,2,CH,EQ,C'NX',OR,                 
//*                  221,2,CH,EQ,C'FM',OR,221,2,CH,EQ,C'FN')                    
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE  FROM VSAM FILE                                
//*------------------------------------------------------------------           
//*STEP64B  EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT STRIKE CASES FOR DAILY REPORT COL 18                               
//*------------------------------------------------------------------           
//*STEP64C  EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,17,C'Y',19,482)                                         
//*-----------------------------------------------------------------            
//* TO DETERMINE HA1 NATIONALITY NOT = SC                                       
//*-----------------------------------------------------------------            
//STEP66A  EXEC PGM=BP13CF17,REGION=1500K                                       
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13F730A DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT OUT HA1 WITH NATIONALITY NOT = 'SC'                                    
//*        = Y - COL 20                                                         
//*------------------------------------------------------------------           
//STEP66B  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                      
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=OLD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(21,1,CH,EQ,C'Y')                                              
//*    INCLUDE COND=(20,1,CH,EQ,C'Y',OR,21,1,CH,EQ,C'Y')                        
//*-----------------------------------------------------------------            
//* TO DETERMINE AGE :  NON-SA > 21 / SA > 55                                   
//*-----------------------------------------------------------------            
//STEP67A1 EXEC PGM=BP13CF31,REGION=1500K                                       
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13F730A DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT OUT AGE > 21 FOR NON SA AND AGE > 55 FOR SA = Y - COL 22               
//*------------------------------------------------------------------           
//STEP67A2 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F730,DISP=(OLD,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,21,C'Y',23,478)                                            
//*-----------------------------------------------------------------            
//* OUTPUT CASES WHERE AGE OF HA1-HA4 IS < 35 YEARS OLD AND                     
//* ALLOC-SCH IS FTS                                                            
//*-----------------------------------------------------------------            
//STEP67B1 EXEC PGM=BP13CF96,REGION=1500K                                       
//BP13F730 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//BP13K825 DD DSN=BP13.K825.REQOCCP,DISP=SHR,                                   
//            AMP=('BUFNI=8','BUFND=4')                                         
//P13F730A DD DSN=&&F730,DISP=(,PASS),                                          
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*------------------------------------------------------------------           
//* SORT OUT AGE < 35 FOR FTS ALLOC SCHEME CASES = A - COL 22                   
//*------------------------------------------------------------------           
//STEP67B2 EXEC SORT,COND=(0,NE)                                                
//*SORTIN   DD DSN=&&F730,DISP=(OLD,PASS)                                       
//SORTIN   DD DSN=&&F730,DISP=(OLD,DELETE)                                      
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN    DD *                                                                 
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(22,1,CH,EQ,C'A')                                              
//*------------------------------------------------------------------           
//* SORT OUT AGE < 18 FOR FS ELIG SCHEME CASES = Y - COL 24                     
//*------------------------------------------------------------------           
//*STEP67B3 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(OLD,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN    DD *                                                                
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    INCLUDE COND=(24,1,CH,EQ,C'Y')                                           
//*------------------------------------------------------------------           
//* SORT OUT FTS AND HH=G CASES                                                 
//* FTS & HH IS G = H - COL 22                                                  
//*------------------------------------------------------------------           
//STEP67C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(213,3,CH,EQ,C'FTS',AND,116,1,CH,EQ,C'G')                      
    OUTREC FIELDS=(1,21,C'H',23,478)                                            
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 4E,DY,FC,DV,DW,FW,DZ,DX,FD,FE,DU,FF                 
//*------------------------------------------------------------------           
//STEP67D1 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                    
//            DCB=(RECFM=FB,LRECL=500),                                         
//            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                 
//SYSIN   DD *                                                                  
    SORT FIELDS=(1,8,A),FORMAT=CH                                               
    INCLUDE COND=(221,2,CH,EQ,C'4E',OR,                                         
                  221,2,CH,EQ,C'FC',OR,                                         
                  221,2,CH,EQ,C'FW',OR,                                         
                  221,2,CH,EQ,C'FD',OR,221,2,CH,EQ,C'FE',OR,                    
                  221,2,CH,EQ,C'FF',OR,221,2,CH,EQ,C'RX')                       
    OUTREC FIELDS=(122X,1,8,370X)                                               
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'SOLD HUDC' CASES FROM VSAM FILE               
//*------------------------------------------------------------------           
//STEP67D2 EXEC PGM=BP13C161,COND=(0,NE)                                        
//BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                   
//BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                   
//BP13F730 DD DSN=&&F7304E,DISP=(,PASS),                                        
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(6,2),RLSE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 4E/DY/FC/DV/DW/FW/DZ/DX/FD/FE/DU/FF                 
//* DEBARMENT CODE  4E/DY/FC/DV/DW/FW/DZ/DX/FD/FE/DU/FF = Y - COL 23            
//*------------------------------------------------------------------           
//STEP67D3 EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F7304E,DISP=(SHR,DELETE)                                    
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                               
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    OUTREC FIELDS=(1,22,C'Y',24,477)                                            
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE PO/4F/5T/5U                                         
//*------------------------------------------------------------------           
//*STEP67E1 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'PO',OR,221,2,CH,EQ,C'4F',OR,                 
//*                  221,2,CH,EQ,C'5T',OR,221,2,CH,EQ,C'5U')                    
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE PO/4F/5T/5U FROM VSAM FILE                     
//*------------------------------------------------------------------           
//*STEP67E2 EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE PO/4F/5T/5U                                         
//* DEBARMENT CODE PO/4F/5T/5U = Y - COL 16                                     
//*------------------------------------------------------------------           
//*STEP67E3 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,15,C'Y',17,484)                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE SS                                                  
//*------------------------------------------------------------------           
//*STEP67F1 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'SS')                                         
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'SS' FROM VSAM FILE                            
//*------------------------------------------------------------------           
//*STEP67F2 EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE SS                                                  
//* DEBARMENT CODE SS = S - COL 16                                              
//*------------------------------------------------------------------           
//*STEP67F3 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,15,C'S',17,484)                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE AT                                                  
//*------------------------------------------------------------------           
//*STEP67G1 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'AT')                                         
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 'AT' FROM VSAM FILE                            
//*------------------------------------------------------------------           
//*STEP67G2 EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE SS                                                  
//* DEBARMENT CODE AT = A - COL 16                                              
//*------------------------------------------------------------------           
//*STEP67G3 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,15,C'A',17,484)                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 11,18                                               
//*------------------------------------------------------------------           
//*STEP67H1 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F824DEBR,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730DEB,DISP=(NEW,PASS),                                   
//*            DCB=(RECFM=FB,LRECL=500),                                        
//*            UNIT=SYSDA,SPACE=(CYL,(5,5),RLSE)                                
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,8,A),FORMAT=CH                                            
//*    INCLUDE COND=(221,2,CH,EQ,C'11',OR,221,2,CH,EQ,C'18')                    
//*    OUTREC FIELDS=(122X,1,8,370X)                                            
//*------------------------------------------------------------------           
//* SORT OUT ONLY DEBARMENT CODE 11/18 FROM VSAM FILE                           
//*------------------------------------------------------------------           
//*STEP67H2 EXEC PGM=BP13C161,COND=(0,NE)                                       
//*BP13F500 DD DSN=&&F730DEB,DISP=(SHR,DELETE)                                  
//*BP13K730 DD DSN=BP13.K730.MATURERQ,DISP=SHR                                  
//*BP13F730 DD DSN=&&F730,DISP=(,PASS),                                         
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(6,2),RLSE)                                           
//*SYSOUT   DD SYSOUT=*                                                         
//*SYSDBG   DD SYSOUT=*                                                         
//*SYSDBOUT DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT DEBARMENT CODE 11/18 CASES FOR DAILY REPORT                        
//* DEBARMENT CODE  11/18 = Y - COL 17                                          
//*------------------------------------------------------------------           
//*STEP67H3 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&F730,DISP=(SHR,DELETE)                                     
//*SORTOUT  DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(123,8,A),FORMAT=CH                                          
//*    OUTREC FIELDS=(1,16,C'Y',18,483)                                         
//*------------------------------------------------------------------           
//* SORT OUT BY NT, FT, DTE-BALLOT & REGN NO                                    
//*------------------------------------------------------------------           
//*STEP67I1 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=&&BP13F730,DISP=(OLD,PASS)                                   
//*SORTOUT  DD DSN=&&F730GEN3,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                          
//*            SPACE=(CYL,(20,10),RLSE)                                         
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(187,3,A,211,2,A,334,6,A,123,8,A),FORMAT=CH                  
//*    INCLUDE COND=(246,1,CH,NE,C' ')                                          
//*------------------------------------------------------------------           
//* SORT OUT BY NT, FT & DTE-BALLOT                                             
//*------------------------------------------------------------------           
//*STEP67I2 EXEC SORT,COND=(0,NE)                                               
//*SORTIN   DD DSN=BP13.K813.BTOBE,DISP=SHR                                     
//*SORTOUT  DD DSN=&&F813GEN3,DISP=(NEW,PASS),                                  
//*            UNIT=SYSDA,                                                      
//*            DCB=(RECFM=FB,LRECL=1000,BLKSIZE=0),                             
//*            SPACE=(CYL,(10,5),RLSE)                                          
//*SYSIN   DD *                                                                 
//*    SORT FIELDS=(1,11,A),FORMAT=CH                                           
//*    INCLUDE COND=(376,1,CH,NE,C' ')                                          
//*------------------------------------------------------------------           
//* MATCH NT, FT & DTE-BALLOT OF F730 AND K813 TO EXTRACT GEN3 CASES            
//*------------------------------------------------------------------           
//*STEP67I3 EXEC PGM=SORT,COND=(0,NE)                                           
//*SORTJNF1 DD DSN=&&F730GEN3,DISP=(OLD,PASS)                                   
//*SORTJNF2 DD DSN=&&F813GEN3,DISP=(OLD,PASS)                                   
//*MATCH    DD DSN=BP13.F730.DAILY.REPORT,DISP=MOD                              
//*SYSIN DD *                                                                   
//*   JOINKEYS FILE=F1,FIELDS=(187,3,A,211,2,A,334,6,A)                         
//*   JOINKEYS FILE=F2,FIELDS=(1,3,A,4,2,A,6,6,A)                               
//*   REFORMAT FIELDS=(F1:1,500)                                                
//*   OUTFILE FNAMES=MATCH                                                      
//*   SORT FIELDS=(123,8,A),FORMAT=CH                                           
//*                                                                             
//*SYSUDUMP DD SYSOUT=*                                                         
//*SYSPRINT DD SYSOUT=*                                                         
//*SYSABOUT DD SYSOUT=*                                                         
//*SYSOUT   DD SYSOUT=*                                                         
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES ACCORDING TO REGN NO                           
//*------------------------------------------------------------------           
//STEP68A  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT,DISP=SHR                               
//SORTOUT  DD DSN=&&F730FULL,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,DCB=(RECFM=FB,LRECL=500),                              
//            SPACE=(CYL,(10,5),RLSE)                                           
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
//*------------------------------------------------------------------           
//* MERGE SIMILAR REF NO TOGETHER                                               
//*------------------------------------------------------------------           
//STEP68B  EXEC PGM=BP13C165,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F730FULL,DISP=(OLD,DELETE)                                  
//P13F730A DD DSN=BP13.F730.DAILY.REPORT.BE,DISP=OLD                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*------------------------------------------------------------------           
//* SORT OUT ALL NOT CLEAN CASES -  MCPS APPLICATIONS                           
//*------------------------------------------------------------------           
//STEP68C  EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT.BE,DISP=SHR                            
//SORTOUT  DD DSN=BP13.F730.DAILY.REPORT.PART4,DISP=OLD                         
//SYSIN   DD *                                                                  
    SORT FIELDS=(123,8,A),FORMAT=CH                                             
    INCLUDE COND=(376,3,CH,EQ,C'SBF')                                           
    OUTREC FIELDS=(1,499,C'D')                                                  
//*                                                                             
//*                                                                             
//******************************************************************            
//* PRINT DAILY EXCEPTION REPORT FOR BE                                         
//* 1. HOUSEHOLD CHECKS       (INPUT : F730.DAILY.REPORT.PART1)                 
//* 2. MCPS APPLICATIONS      (INPUT : F730.DAILY.REPORT.PART2)                 
//* 3. TPS/TCP APPLICATIONSM  (INPUT : F730.DAILY.REPORT.PART3)                 
//* 4. OTHERS                 (INPUT : F730.DAILY.REPORT.PART4)                 
//******************************************************************            
//STEP68   EXEC  SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE),                 
//         PARM='SYSPARM="_SBF"'                                                
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(100,400),,,ROUND)                          
//*P13F730A  DD DSN=BP13.F730.DAILY.REPORT.PART1,DISP=OLD                       
//P13F730B  DD DSN=BP13.F730.DAILY.REPORT.PART2,DISP=OLD                        
//P13F730C  DD DSN=BP13.F730.DAILY.REPORT.PART3,DISP=OLD                        
//P13F730D  DD DSN=BP13.F730.DAILY.REPORT.PART4,DISP=OLD                        
//BP13L16A  DD SYSOUT=8,DEST=IOM8                                               
//BP13L16B  DD SYSOUT=8,DEST=IOM8                                               
//BP13L16C  DD SYSOUT=8,DEST=IOM8                                               
//BP13L16D  DD SYSOUT=8,DEST=IOM8                                               
//SYSIN     DD DSN=BP13.BATCH.SRC(BP13S16A),DISP=SHR                            
//SYSOUT    DD SYSOUT=*                                                         
//SYSPRINT  DD SYSOUT=*                                                         
//*=====================================================================        
//* STEP69 - GENERATE MOP REPORT                                                
//*(((((((((((((  MATCH REQUEST WITH SMS SNAPSHORT            )))))))))         
//*--------------------------------------------------------------------         
//STEP69A  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=BP08.K002.SMSSNAP,DISP=SHR                                    
//MATCH    DD DSN=&&P08F002,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,SPACE=(CYL,(50,50),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=1000,BLKSIZE=27000)                              
//JNF2CNTL DD *                                                                 
  OPTION DYNALLOC=(,16)                                                         
/*                                                                              
//SYSIN DD *                                                                    
   SORT FIELDS=COPY                                                             
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(5,8,A)                                              
   REFORMAT FIELDS=(F2:1,1000)                                                  
   OUTFILE FNAMES=MATCH,                                                        
          INCLUDE=(41,8,CH,EQ,C'BP13I9CI',&,                                    
         (432,2,CH,EQ,C'7 ',OR,432,2,CH,EQ,C'7J',OR,                            
          432,2,CH,EQ,C'8A',OR,432,2,CH,EQ,C'8B',OR,                            
          432,2,CH,EQ,C'8E',OR,432,2,CH,EQ,C'9 ',OR,                            
          432,2,CH,EQ,C'9A'))                                                   
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*=====================================================================        
//*(((((((((((((  MATCH REQUEST WITH RDB SNAPSHORT            )))))))))         
//*--------------------------------------------------------------------         
//STEP69B  EXEC PGM=SORT,COND=(0,NE)                                            
//SORTJNF1 DD DSN=&&BP13F730,DISP=(OLD,PASS)                                    
//SORTJNF2 DD DSN=BP08.K005.RDBSNAP,DISP=SHR                                    
//MATCH    DD DSN=&&P08F005,DISP=(NEW,PASS),                                    
//         UNIT=SYSDA,SPACE=(CYL,(50,50),RLSE),                                 
//         DCB=(RECFM=FB,LRECL=400,BLKSIZE=27600)                               
//JNF2CNTL DD *                                                                 
  OPTION DYNALLOC=(,16)                                                         
/*                                                                              
//SYSIN DD *                                                                    
   SORT FIELDS=COPY                                                             
   JOINKEYS FILE=F1,FIELDS=(123,8,A)                                            
   JOINKEYS FILE=F2,FIELDS=(5,8,A)                                              
   REFORMAT FIELDS=(F2:1,400)                                                   
   OUTFILE FNAMES=MATCH,                                                        
          INCLUDE=(41,8,CH,EQ,C'BP13I9CI',&,                                    
         (121,2,CH,EQ,C'7 ',OR,121,2,CH,EQ,C'7J',OR,                            
          121,2,CH,EQ,C'8A',OR,121,2,CH,EQ,C'8B',OR,                            
          121,2,CH,EQ,C'8E',OR,121,2,CH,EQ,C'9 ',OR,                            
          121,2,CH,EQ,C'9A'))                                                   
/*                                                                              
//SYSUDUMP DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//STEP69C  EXEC SAS,COND=(0,NE),OPTIONS='MACRO DQUOTE,TEXT82'                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(60,50))                                    
//BP13K730 DD DSN=&&BP13F730,DISP=(OLD,DELETE)                                  
//BP08F002 DD DSN=&&P08F002,DISP=(OLD,DELETE)                                   
//BP08F005 DD DSN=&&P08F005,DISP=(OLD,DELETE)                                   
//FT42F001 DD SYSOUT=*                                                          
//FT43F001 DD SYSOUT=*                                                          
//FT44F001 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S557),DISP=SHR                             
//*------------------------------------------------------------------           
//* BACKUP PREVIOUS DAILY REPORT TO ACCUM FILE                                  
//* AND MERGE TO BE FILE                                                        
//*------------------------------------------------------------------           
//STEP99A  EXEC SORT,COND=(0,NE)                                                
//*SORTIN   DD DSN=BP13.F730.DAILY.REPORT.PART1,DISP=SHR                        
//SORTIN   DD DSN=BP13.F730.DAILY.REPORT.PART2,DISP=SHR                         
//         DD DSN=BP13.F730.DAILY.REPORT.PART3,DISP=SHR                         
//         DD DSN=BP13.F730.DAILY.REPORT.PART4,DISP=SHR                         
//SORTOUT1 DD DSN=BP13.F730.DAILY.REPORT.ACCUM.BE,DISP=MOD                      
//SORTOUT2 DD DSN=BP13.F730.DAILY.REPORT.BE,DISP=OLD                            
//SYSIN   DD *                                                                  
      SORT FIELDS=(123,8,A),FORMAT=CH                                           
      OUTFIL FNAMES=SORTOUT1                                                    
      OUTFIL FNAMES=SORTOUT2                                                    
//*------------------------------------------------------------------           
//*                      END OF JOB                                             
//*------------------------------------------------------------------           
