//BP13M730 JOB (BP13P),'BP13M700',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//        NOTIFY=CSD0071                                                        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//*====================================================================         
//* RUN ON 6TH OF THE MONTH, SECOND GIRO DEDUCTION                              
//*====================================================================         
//* ACCEPT GIRO PAYMENT ( 2ND DEDUCTION)                                        
//* POSTING OF INSTALMENT IS SIMILAR TO BP13D103 JOB                            
//* BP13D103 WILL NOT BE RUN FOR 1, 2,3RD DAY OF THE MONTH                      
//*=================================================================            
//* CHG-NO    ON     BY                                                         
//*------------------------------                                               
//* BP132772 030506 LSB  DBSS                                                   
//* BP133713 311007 LSB  ADD P13F125 TO CC05                                    
//* BP133184 221107 LSB  COPY JCL FROM BP13M700                                 
//* BP133091 151207 LMS  EXPANSION OF BP13KD00 FROM 1200 TO 1600                
//* BP133387 110908 LSB  MOVE BP13CC01 AS LAST STEP                             
//* BP134149 230211 JB8  OUTPUT AB03F001 IN BP13CC12                            
//* BP134154 190411 JB8  ADD SORTING FOR BP13CC74                               
//* BP134029 150811 JB8  TO ADD BP13K482 TO BP13CC74                            
//* BP134029 041011 JB8  TO ADD BP13K800 TO BP13CC74                            
//* BP134493 200312 IMC  CHANGED MIN LUMPSUM PAYMENT FROM $500 TO $5000         
//* BP135171 110214 RJE  TO CATER FOR DB2 UPGRADE                               
//*-------------------------------------------------------------------*         
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                          *         
//*-------------------------------------------------------------------*         
//STEP0A  EXEC PGM=IDCAMS,COND=(0,NE)                                           
//INPUT1   DD DSN=BP13.KD00.DBSMAST,DISP=OLD                                    
//INPUT2   DD DSN=BP13.KD99.DBSMAST.LOG,DISP=OLD                                
//INPUT3   DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                    
//INPUT4   DD DSN=BP13.KD63.TXHIST,DISP=OLD                                     
//INPUT5   DD DSN=BP13.KD60.ACCHIST,DISP=OLD                                    
//INPUT6   DD DSN=BP13.KD65.PDATE,DISP=OLD                                      
//INPUT7   DD DSN=BP13.KD92.UPDLOAN,DISP=OLD                                    
//INPUT8   DD DSN=BP13.KD94.UPDLOAN.LOG,DISP=OLD                                
//INPUT9   DD DSN=BP13.KD03.DBSHIST,DISP=OLD                                    
//INPUT10  DD DSN=BP13.K482.FLATSOLD.BFSL,DISP=OLD                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
          VFY FILE(INPUT6)                                                      
          VFY FILE(INPUT7)                                                      
          VFY FILE(INPUT8)                                                      
          VFY FILE(INPUT9)                                                      
          VFY FILE(INPUT10)                                                     
//*=================================================================            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                
//*-----------------------------------------------------------------            
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
$DJDE$ JDE=BP13D,JDL=BP13,END;                                                  
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------    00050004
//* LUMP SUM PAYMENT LETTER                                             00060004
//* PRT02 : 1 COPY                           (MA&B)                   *         
//*-----------------------------------------------------------------    00070004
//PRT02    EXEC PGM=IEBGENER                                            00080004
//SYSUT1   DD *                                                         00090004
$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13DT,END;                            00100004
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1B                           00110004
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00120004
//SYSPRINT DD SYSOUT=*                                                  00130004
//SYSIN    DD DUMMY                                                     00131004
//*                                                                     00132004
//*-----------------------------------------------------------------    00050004
//* LUMP SUM PAYMENT < $500 LETTER                                      00060004
//* PRT03 : 1 COPY                           (MA&B)                   *         
//*-----------------------------------------------------------------    00070004
//PRT03    EXEC PGM=IEBGENER                                            00080004
//SYSUT1   DD *                                                         00090004
$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13DQ,END;                            00100004
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1C                           00110004
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00120004
//SYSPRINT DD SYSOUT=*                                                  00130004
//SYSIN    DD DUMMY                                                     00131004
//*                                                                     00132004
//*-----------------------------------------------------------------    00050004
//* LUMP SUM PAYMENT < $5000 LETTER                                     00060004
//* PRT04 : 1 COPY                           (MA&B)                   *         
//*-----------------------------------------------------------------    00070004
//PRT04    EXEC PGM=IEBGENER                                            00080004
//SYSUT1   DD *                                                         00090004
$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13DW,END;                            00100004
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1D                           00110004
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID)                                00120004
//SYSPRINT DD SYSOUT=*                                                  00130004
//SYSIN    DD DUMMY                                                     00131004
//*                                                                     00132004
//*-----------------------------------------------------------------            
//* REFORMAT GIRO FILE TO BP13F125 FORMAT                                       
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AC08.F685.PAYT.DBSS.DEDN2,DISP=SHR                            
//OUTPUT1  DD DSN=BP13.AC08.F685.PAYT(+1),DISP=(NEW,CATLG),                     
//            SPACE=(CYL,(2,1)),                                                
//            DCB=(BP13.GDG,BLKSIZE=27900,LRECL=100,RECFM=FB)                   
//SYSIN     DD *                                                                
  REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                        
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT DBS MASTER FILE IN SCH-ACCNT SEQUENCE                        *         
//*-------------------------------------------------------------------*         
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=13')                                                     
//SORTOUT  DD DSN=&&FD00SCHT,DISP=(NEW,PASS),                                   
//         UNIT=SYSDA,SPACE=(CYL,(30,10),RLSE),                                 
//         DCB=(BLKSIZE=0,LRECL=1600,RECFM=FB)                                  
//SYSIN    DD *                                                                 
     SORT FIELDS=(11,11,A),FORMAT=CH                                            
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT GIRO PAYMENT IN SCH-ACC-NO ORDER                                       
//*---------------------------------------------------------------------        
//STEP03   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=AC08.F685.PAYT.DBSS.DEDN2,DISP=SHR                            
//SORTOUT  DD DSN=BP13.F001.GIRO,DISP=OLD                                       
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,11,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* VALIDATE GIRO PAYMENT                                                       
//*---------------------------------------------------------------------        
//STEP04   EXEC PGM=BP13CC12,COND=(0,NE)                                        
//AC08F685 DD DSN=BP13.F001.GIRO,DISP=SHR                                       
//BP13FD00 DD DSN=&&FD00SCHT,DISP=(OLD,PASS)                                    
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=SHR                                    
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR                                    
//BP13KD01 DD DSN=BP13.KD03.DBSHIST.PATH1,DISP=SHR                              
//BP13F136 DD DSN=BP13.F136.DBSGIRO.VALID,DISP=OLD                              
//C08F685A DD DSN=BP13.AC08.F685.PAYT.DBSSTOP,DISP=MOD                          
//AB03F001 DD DSN=BP13.F001.DBSS.PYMT,DISP=MOD                                  
//BP13LC12 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* INCLUDE ONLY INSTALMENT AFTER LOAN START                                    
//* TRANS-TYPE = 64 (GIRO PAYMENT) - IN M700                                    
//* INS- UPDATE KD00-AMT-LOAN-BAL, AMT-LOAN-PAID, TOTL-PYMT-TODTE               
//*      UPDATE KD00-AMT-ARR-INSTAL, MTH-ARR-INSTAL                             
//*-------------------------------------- ----------------------------*         
//STEP05   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.DBSGIRO.VALID,DISP=SHR                              
//SORTOUT  DD DSN=&&F125INST,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
  INCLUDE COND=(99,3,CH,EQ,C'INS',AND,1,2,CH,EQ,C'64')                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* UPDATE INSTALMENT TO DBS MASTER AND OUTPUT TRANSCCTION FILE                 
//*-------------------------------------------------------------------*         
//STEP06   EXEC PGM=BP13CC05,COND=(0,NE)                                        
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13F125 DD DSN=&&F125INST,DISP=(OLD,PASS)                                    
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD03 DD DSN=BP13.KD03.DBSHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD99 DD DSN=BP13.KD99.DBSMAST.LOG,DISP=OLD                                
//BP13KD65 DD DSN=BP13.KD65.PDATE,DISP=OLD                                      
//BP13K140 DD DSN=BP13.K140.KIVTRAN,DISP=OLD                                    
//BP13LC05 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//P13F125A DD DSN=BP13.F136.DBSGIRO,DISP=OLD                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* INCLUDE LUMP SUM PAYMENT - GIRO                                             
//*-----------------------------------------------------------------            
//STEP7  EXEC    SORT,COND=(0,NE)                                               
//SORTIN   DD DSN=BP13.F136.DBSGIRO.VALID,DISP=SHR                              
//SORTOUT  DD  DSN=&&F125LUMP,                                                  
//             DISP=(NEW,PASS),                                                 
//             UNIT=SYSDA,                                                      
//             SPACE=(CYL,(5,3),RLSE),                                          
//             DCB=(RECFM=FB,LRECL=150,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
   SORT FIELDS=(5,19,A,1,2,A),FORMAT=CH                                         
   INCLUDE COND=(99,3,CH,EQ,C'LS ')                                             
//*-----------------------------------------------------------------            
//* UPDATE LUMPSUM PAYMENT, COMPUTE INTEREST REBATE                             
//*-----------------------------------------------------------------            
//STEP8  EXEC  PGM=BP13CC74,COND=(0,NE)                                         
//BP13F125 DD  DSN=&&F125LUMP,DISP=(OLD,PASS)                                   
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD03 DD  DSN=BP13.KD03.DBSHIST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD99 DD  DSN=BP13.KD99.DBSMAST.LOG,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K482 DD  DSN=BP13.K482.FLATSOLD.BFSL,DISP=OLD,                            
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD92 DD  DSN=BP13.KD92.UPDLOAN,DISP=SHR                                   
//BP13KD94 DD  DSN=BP13.KD94.UPDLOAN.LOG,DISP=SHR                               
//AB03K050 DD  DSN=AB03.K050.INTTABLE,DISP=SHR                                  
//BP13FD92 DD  DSN=BP13.FD92.UPDLOAN.LETTER,DISP=OLD                            
//P13F125A DD  DSN=BP13.F125.DBSLUMP,DISP=OLD                                   
//BP13LC74 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//* PRINT LUMP SUM LETTERS                                                      
//* P13PC51A - LUMP SUM PAYMENT                                                 
//* P13PC51B - LUMP SUM PAYMENT < $500                                          
//*-----------------------------------------------------------------            
//STEP9  EXEC  PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K                
//BP13FD92 DD  DSN=BP13.FD92.UPDLOAN.LETTER,DISP=OLD                            
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//            AMP=('BUFND=4','BUFNI=8')                                         
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//P13PC51A DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID)                                  
//P13PC51B DD SYSOUT=2,OUTPUT=(*.PRT03.FORMID)                                  
//P13PC51C DD SYSOUT=2,OUTPUT=(*.PRT04.FORMID)                                  
//BP13LC51 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID)                                  
//SYSPRINT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD *                                                         00620002
     DSN SYSTEM(DSN)                                                    00630002
     RUN PROGRAM(BP13CC51) PLAN(BP13PCC) -                              00640002
         LIB('BP13.BATCH.LOADCOB')                                      00650002
     END                                                                00660002
//*-------------------------------------------------------------------*         
//* INCLUDE ONLY INSTALMENT AFTER LOAN START, LUMPSUM-INSTAL                    
//*-------------------------------------- ----------------------------*         
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.DBSGIRO,DISP=SHR                                    
//SORTOUT  DD DSN=&&F125CC07,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
  INCLUDE COND=((99,3,CH,EQ,C'INS',OR,99,3,CH,EQ,C'LS '),AND,                   
          (1,2,CH,EQ,C'64'))                                                    
/*                                                                              
//*-------------------------------------------------------------------*         
//* INCLUDE NEW LOAN, INTEREST RAISE                                            
//* DSN=BP13.F125.INTEREST.NEWLOAN, FD IN F125.PPDUE                            
//* DSN=BP13.F125.INSTAL.NEWLOAN,FD IN F125.PPDUE                               
//* DSN=BP13.F125.INTEREST.MONTH, IN M713                                       
//* DSN=BP13.F125.INSTAL.MONTH,DISP=SHR, M713                                   
//*-------------------------------------- ----------------------------*         
//STEP11   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F125CC07,DISP=(OLD,PASS)                                    
//         DD DSN=BP13.F125.DBSLUMP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F125ALL,DISP=(,PASS),                                       
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
  SORT     FIELDS=(1,2,A,5,19,A),FORMAT=CH                                      
//*---------------------------------------------------------------------        
//* UPDATE DAILY PAYMENT TO FINANCIAL TRANSACTION HIST                          
//* FOR ENQUIRY FIN HISTORY ON LOAN INFOR (OPTION 27)                           
//*---------------------------------------------------------------------        
//STEP12   EXEC PGM=BP13CC07,COND=(0,NE)                                        
//BP13F125 DD DSN=&&F125ALL,DISP=(OLD,PASS)                                     
//BP13KD63 DD DSN=BP13.KD63.TXHIST,DISP=SHR                                     
//BP13KD60 DD DSN=BP13.KD60.ACCHIST,DISP=SHR                                    
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//*-------------------------------------------------------------------*         
//* INCLUDE ONLY LUMP SUM PAYMENT FOR PP, INS, AND LS                           
//*-------------------------------------- ----------------------------*         
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.F136.DBSGIRO,DISP=SHR                                    
//         DD DSN=BP13.F125.DBSLUMP,DISP=SHR                                    
//SORTOUT  DD DSN=&&F125C105,DISP=(,PASS),                                      
//         DCB=(RECFM=FB,LRECL=150,BLKSIZE=0),                                  
//         SPACE=(CYL,(30,10),RLSE)                                             
//SYSIN    DD *                                                                 
   SORT FIELDS=(1,2,A,5,19,A),FORMAT=CH                                         
   INCLUDE COND=(99,3,CH,EQ,C'PP ',OR,99,3,CH,EQ,C'INS',OR,                     
                 99,3,CH,EQ,C'LS ')                                             
//*-------------------------------------------------------------------*         
//* UPDATE BALANCING FILE USING THE VALIDATE PAYMENT TRANS (PP, INS)  *         
//*-------------------------------------------------------------------*         
//STEP14   EXEC PGM=BP13C105,COND=(0,NE)                                        
//BP13F125 DD DSN=&&F125C105,DISP=(OLD,PASS)                                    
//BP13K160 DD DSN=BP13.K160.BALANCE.DBSS,DISP=SHR                               
//BP13L105 DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//* ACCUMULATE DAILY PAYMENT TRANS TO MTHLY PAYMENT TRANS             *         
//*-------------------------------------------------------------------*         
//STEP16   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F136.DBSGIRO,DISP=SHR                                    
//         DD DSN=BP13.F125.DBSLUMP,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F136.MTHTRAN.DBSS,DISP=MOD                               
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY GIRO FILE                                                             
//*--------------------------------------------------------------------         
//STEP19   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AC08.F685.PAYT.DBSS.DEDN2,DISP=OLD                            
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* BACKUP BP13.F125.ACCUM.DAILY - GDG(7)                             *         
//*-------------------------------------------------------------------*         
//STEP20   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F136.DBSGIRO,DISP=SHR                                    
//         DD DSN=BP13.F125.DBSLUMP,DISP=SHR                                    
//OUTPUT1  DD DSN=BP13.F125.DBSPAYMT.DAILY(+1),DISP=(NEW,CATLG),                
//            SPACE=(CYL,(10,5)),                                               
//            DCB=(BP13.GDG,BLKSIZE=23400,LRECL=150,RECFM=FB)                   
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* EMPTY FINANCIAL TRANSACTION FILE                                  *         
//*-------------------------------------------------------------------*         
//STEP21   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.EMPTY.CHAR150,DISP=SHR                                   
//OUTPUT1  DD DSN=BP13.F136.DBSGIRO,DISP=OLD                                    
//OUTPUT2  DD DSN=BP13.F125.DBSLUMP,DISP=OLD                                    
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* PERFORM BALANCING FOR PP/INS UPDATED IN DBSS MASTER AND THE                 
//* BALANCING FILE. COND CODE = 99 FOR ANY FEES NOT BALANCED                    
//*-------------------------------------------------------------------*         
//STEP99   EXEC PGM=BP13CC01,COND=(0,NE)                                        
//BP13KD00 DD DSN=BP13.KD00.DBSMAST,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K160 DD DSN=BP13.K160.BALANCE.DBSS,DISP=SHR                               
//BP13LC01 DD SYSOUT=N                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*                                                                             
//*-------------------------------------------------------------------*         
//*          E N D      O F     J O B                                 *         
//*-------------------------------------------------------------------*         
