//BP13D109  JOB (BP13P),'BP13D109',MSGCLASS=N,CLASS=I,                          
//       MSGLEVEL=(1,1),NOTIFY=CSD0071                                          
//JOBLIB   DD  DSN=BP13.BATCH.LOADCOB,DISP=SHR                                  
//*====================================================================         
//* RUN ON     OF THE MONTH                                                     
//* 1) CREATE CPF REFUND FILE                                                   
//*====================================================================         
//* BP133095 190607 ED1 ADDED PRINTING OF LETTER IN BP13CC80                    
//*                     & NEW PGM BP13CC85                                      
//* BP133209 270308 ED1 ADDED BP13KD63 IN BP13CC85                              
//* BP133480 261208 LSB DTE-SEND-COF COL 643                                    
//* BP133389 190309 JB8 ADDED BP13KD60 , BP13KD61 IN BP13CC85                   
//* BP135171 100214 RJE TO CATER FOR DB2 UPGRADE                                
//*-----------------------------------------------------------------            
//* VERIFY FILES BEFORE DAILY PRODUCTION RUN                                    
//*-----------------------------------------------------------------            
//STEP00   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.KD92.UPDLOAN,DISP=OLD                                    
//INPUT2   DD DSN=BP13.KD94.UPDLOAN.LOG,DISP=OLD                                
//INPUT3   DD DSN=BP13.KD00.DBSMAST,DISP=OLD                                    
//INPUT4   DD DSN=BP13.KD99.DBSMAST.LOG,DISP=OLD                                
//INPUT5   DD DSN=BP13.KD63.TXHIST,DISP=OLD                                     
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN   DD *                                                                  
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
          VFY FILE(INPUT3)                                                      
          VFY FILE(INPUT4)                                                      
          VFY FILE(INPUT5)                                                      
//*=================================================================            
//* TO SEND DYNAMIC JDE AHEAD OF THE PRINT DATASETS                             
//* PRT01 : 1 COPY                           (MA&B TEAM)                        
//*-----------------------------------------------------------------            
//PRT01    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1A CP-1',END;                                    
1$DJDE$ JDE=BP13D,JDL=BP13,END;                                                 
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1A                                   
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-----------------------------------------------------------------            
//* PRT02 : 1 COPY CESSATION LETTER          (MA&B TEAM)                        
//*-----------------------------------------------------------------            
//PRT02    EXEC PGM=IEBGENER                                                    
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-EAAARS1B CP-1',END;                                    
1$DJDE$ JDE=13POT2,JDL=BP13,FORMS=BP13A4,END;                                   
//FORMID   OUTPUT FORMS=1WD1,GROUPID=EAAARS1B                                   
//SYSUT2   DD SYSOUT=W,OUTPUT=(*.FORMID),DEST=IOMW                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORD BP13KD92 - INCLUDE TRANS = 'STOP'                                      
//* DTE-REVSD-INST NOT SPACES AND DTE-SEND-CPF = SPACES                         
//*-------------------------------------------------------------------*         
//STEP01 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=BP13.KD92.UPDLOAN,DISP=SHR                                   
//SORTOUT   DD DSN=&&BP13FD92,DISP=(,PASS),                                     
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=1000,RECFM=FB)                                 
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
  SORT FIELDS=(1,8,A),FORMAT=CH                                                 
  INCLUDE COND=(9,4,CH,EQ,C'STOP',AND,402,8,CH,NE,C'        ',AND,              
              643,8,CH,EQ,C'        ')                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* CREATE CESSATION CPF DEDUCTION RECORD TO AB02F820(REFUND FILE)              
//*-------------------------------------------------------------------*         
//STEP02   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13FD92 DD  DSN=&&BP13FD92,DISP=(OLD,PASS)                                   
//BP13KD92 DD  DSN=BP13.KD92.UPDLOAN,DISP=SHR                                   
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//             AMP=('BUFND=8','BUFNI=4')                                        
//AB02F820 DD DSN=BP13.AB02F820.CPFREFND,DISP=MOD                               
//BP13LC81 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CC81) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
     END                                                                        
//*-------------------------------------------------------------------*         
//* SORT BY HDB-REF,INCLUDE TRANS = 'STOP' & DTE-REVSD-INST NOT SPACES          
//* DTE-SEND-CPF NOT = SPACES TO MATCH CPF CESSATION RETURN FILE                
//*-------------------------------------------------------------------*         
//STEP03 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=BP13.KD92.UPDLOAN,DISP=SHR                                   
//SORTOUT   DD DSN=&&FD92GET,DISP=(,PASS),                                      
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=1000,RECFM=FB)                                 
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
  SORT FIELDS=(23,11,A),FORMAT=CH                                               
  INCLUDE COND=(9,4,CH,EQ,C'STOP',AND,402,8,CH,NE,C'        ',AND,              
              643,8,CH,NE,C'        ')                                          
/*                                                                              
//*-------------------------------------------------------------------*         
//* SORT BY HDB-REF-NO                                                          
//*-------------------------------------------------------------------*         
//STEP04 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=AB02.F835.SOC,DISP=SHR                                       
//SORTOUT   DD DSN=&&AB02F835,DISP=(,PASS),                                     
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=300,RECFM=FB)                                  
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
  SORT FIELDS=(3,11,A),FORMAT=CH                                                
/*                                                                              
//*-------------------------------------------------------------------*         
//* MATCH CPF CESSATION RETURN FILE, UPDATE ACCEPT/REJECT                       
//*-------------------------------------------------------------------*         
//STEP05   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13FD92 DD  DSN=&&FD92GET,DISP=(OLD,PASS)                                    
//AB02F835 DD  DSN=&&AB02F835,DISP=(OLD,PASS)                                   
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD92 DD  DSN=BP13.KD92.UPDLOAN,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD94 DD  DSN=BP13.KD94.UPDLOAN.LOG,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K800 DD  DSN=BP13.K800.APPLN,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K820 DD  DSN=BP13.K820.OCCUP,DISP=SHR,                                    
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K830 DD  DSN=BP13.K830.ADDR,DISP=SHR,                                     
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13K831 DD  DSN=BP13.K830.ADDR.PATH1,DISP=SHR,                               
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LC80 DD  SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                       
//BP13PC80 DD  SYSOUT=W,OUTPUT=(*.PRT02.FORMID),DEST=IOMW                       
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
     DSN SYSTEM(DSN)                                                            
     RUN PROGRAM(BP13CC80) PLAN(BP13PCC) -                                      
         LIB('BP13.BATCH.LOADCOB')                                              
     END                                                                        
//*--------------------------------------------------------------------         
//* BACKUP CPF FILE                                                             
//*--------------------------------------------------------------------         
//STEP06   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=AB02.F835.SOC,DISP=SHR                                        
//OUTPUT1  DD DSN=BP13.AB02F835.SOC,DISP=MOD                                    
//INPUT2   DD DSN=BP13.AB02F820.CPFREFND,DISP=SHR                               
//OUTPUT2  DD DSN=BP13.AB02F820.CPFREFND.BKUP,DISP=MOD                          
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
     REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                     
//*--------------------------------------------------------------------         
//* EMPTY CPF FILE                                                    *         
//*-------------------------------------------------------------------*         
//STEP07   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=AB02.F835.SOC,DISP=OLD                                        
//SYSIN    DD *                                                                 
     REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                     
//*                                                                             
//*-------------------------------------------------------------------*         
//* SORT TRANS = 'RADJ'                                                         
//*-------------------------------------------------------------------*         
//STEP08 EXEC SORT,COND=(0,NE)                                                  
//SORTIN    DD DSN=BP13.KD92.UPDLOAN,DISP=SHR                                   
//SORTOUT   DD DSN=&&FD92ADJ,DISP=(,PASS),                                      
//          UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                                 
//          DCB=(BLKSIZE=0,LRECL=1000,RECFM=FB)                                 
//SYSPRINT  DD SYSOUT=*                                                         
//SYSIN     DD *                                                                
  SORT FIELDS=(1,12,A),FORMAT=CH                                                
  INCLUDE COND=(9,4,CH,EQ,C'RADJ')                                              
//*-----------------------------------------------------------------            
//* UPDATE ARR-INSTAL BASED ON ADJUSTMENTS FROM TRANS FILE BP13KD92             
//* AND CREATE ARRADJ TRANS IN BP13KD63                                         
//*-----------------------------------------------------------------            
//STEP09 EXEC  PGM=BP13CC85,COND=(0,NE)                                         
//BP13FD92 DD  DSN=&&FD92ADJ,DISP=(OLD,PASS)                                    
//SY02F001 DD  DSN=SY02.F001.DATE,DISP=SHR                                      
//BP13KD00 DD  DSN=BP13.KD00.DBSMAST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD60 DD  DSN=BP13.KD60.ACCHIST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD61 DD  DSN=BP13.KD61.ACCHIST,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD92 DD  DSN=BP13.KD92.UPDLOAN,DISP=SHR,                                  
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD94 DD  DSN=BP13.KD94.UPDLOAN.LOG,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD99 DD  DSN=BP13.KD99.DBSMAST.LOG,DISP=SHR,                              
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13KD63 DD  DSN=BP13.KD63.TXHIST,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//BP13LC85 DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
