//BP13M100  JOB (BP13P),'SOC',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),                
//        NOTIFY=CSD0071                                                        
//JOBLIB  DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                    
//******************************************************************            
//* BP130421 980611 SSS  MICROFICHE CONVERSION                                  
//* BP131016 010516 LSB  STUDIO APARTMENT - GL                                  
//* BP132440 031110 SSS  REMOVE C108, ADD MICROFICHE L140                       
//* BP133468 081107 LSB  ADD DBSS TOP FEE                                       
//* BP135006 220813 LSB  REMOVE PARAMETERS FOR MICROFICHE OUTPUT                
//* BP136088 020216 KSJ  ADD BP13.FC10.ACCUM AND MTHBKUP                        
//* BP136642 060217 SMR2 CATER FOR SYSOUT=8,DEST=IOM8                           
//* BP137956 011019 LJL1 CATER FOR MND JOINT STUDY ON KEY ISSUANCE              
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                
//*-----------------------------------------------------------------            
//PRT01   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-FI CP-2',END;                                          
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=2,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=FI                                         
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//******************************************************************            
//*  SEND DYNAMIC JDE AHEAD OF THE PRINT DATASET                                
//*-----------------------------------------------------------------            
//PRT02   EXEC PGM=IEBGENER                                                     
//SYSUT1   DD *                                                                 
1$DJDE$ BTEXT='DPT=GRPID-FIFA CP-2',END;                                        
1$DJDE$ JDE=BP13D,JDL=BP13,COPIES=2,END;                                        
//FORMID   OUTPUT FORMS=1WD1,GROUPID=FIFA                                       
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.FORMID),DEST=IOM2                              
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
//*-----------------------------------------------------------------            
//*  MTHLY GL POSTING FOR ACCOUNTING BY ACTIVITY                                
//*-----------------------------------------------------------------            
//STEP02   EXEC PGM=BP13C140,COND=(0,NE)                                        
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=OLD                                    
//BP13K410 DD DSN=BP13.K410.ACCUMSO,DISP=OLD                                    
//BP13K330 DD DSN=BP13.K330.ACCUMAO,DISP=OLD                                    
//BP13F136 DD DSN=BP13.F136.MTHTRAN,DISP=OLD                                    
//BP13F180 DD DSN=&&BP13F180,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//BP13L140 DD DSN=&&BP13L140,DISP=(,PASS),UNIT=SYSDA,                           
//            SPACE=(TRK,(600,50),RLSE),                                        
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//*  SEND BP13L140 TO MICROFICHE                                                
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L140,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//*  SEND BP13L140 TO HARDCOPY                                                  
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=IEBGENER,COND=(0,NE)                                        
//SYSUT1   DD DSN=&&BP13L140,DISP=(OLD,PASS)                                    
//SYSUT2   DD SYSOUT=2,OUTPUT=(*.PRT01.FORMID),DEST=IOM2                        
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD DUMMY                                                             
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT GL TRANS BY ACCOUNT CODE, GST RATE AND DESCRIPTION                     
//*-----------------------------------------------------------------            
//STEP05   EXEC SORT,COND=(0,NE),CYL=20                                         
//SORTIN   DD DSN=&&BP13F180,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&BP13F182,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD   *                                                               
     SORT FIELDS=(15,24,A,117,4,A,58,40,A),FORMAT=CH                            
//*-----------------------------------------------------------------            
//* SUM THE GL TRAN RECORD TO GL SYSTEM                                         
//*-----------------------------------------------------------------            
//STEP06   EXEC PGM=BP13C109,COND=(0,NE)                                        
//BP13F180 DD DSN=&&BP13F182,DISP=(OLD,PASS)                                    
//AG20F900 DD DSN=&&BP13F190,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* SUM THE GL TRAN RECORD TO GL SYSTEM                                         
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=BP13C119,COND=(0,NE)                                        
//BP13K800 DD DSN=BP13.K800.APPLN,DISP=SHR                                      
//BP13K885 DD DSN=BP13.K885.EXAPPLT,DISP=SHR                                    
//BP13K160 DD DSN=BP13.K160.BALANCE,DISP=SHR                                    
//AG20F900 DD DSN=&&BP13F190,DISP=(MOD,PASS)                                    
//BP13F190 DD DSN=BP13.F190.AAREV,DISP=OLD                                      
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* BACKUP BP13.F190.AASUM FILE FOR 3 GENERATIONS                               
//*-----------------------------------------------------------------            
//STEP08    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=&&BP13F190,DISP=(OLD,PASS)                                   
//OUTPUT1   DD DSN=BP13.F190.AASUM,DISP=SHR                                     
//SYSIN     DD  *                                                               
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
//*-----------------------------------------------------------------            
//* ACCUM AMORTISE OF SA TO GL FILE                                             
//*-----------------------------------------------------------------            
//STEP09    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F190.AASUM.AMORT,DISP=SHR                               
//OUTPUT1   DD DSN=BP13.F190.AASUM,DISP=MOD                                     
//SYSIN     DD  *                                                               
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
//*-----------------------------------------------------------------            
//* BACKUP BP13.F190.AAREV FILE FOR 3 GENERATIONS                               
//*-----------------------------------------------------------------            
//STEP10    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F190.AASUM,DISP=SHR                                     
//OUTPUT1   DD DSN=BP13.F190.AASUM.BACKUP(+1),DISP=(NEW,CATLG),                 
//          SPACE=(CYL,(2,1)),                                                  
//          DCB=(BP13.GDG,BLKSIZE=23400,LRECL=120,RECFM=FB)                     
//SYSIN     DD  *                                                               
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP11    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F190.AAREV,DISP=SHR                                     
//OUTPUT1   DD DSN=BP13.F190.AAREV.BACKUP(+1),DISP=(NEW,CATLG),                 
//          SPACE=(CYL,(2,1)),                                                  
//          DCB=(BP13.GDG,BLKSIZE=23400,LRECL=120,RECFM=FB)                     
//SYSIN     DD  *                                                               
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT GL TRANS BY ACCOUNT CODE (DBSS TOP STAMP FEE)                          
//*-----------------------------------------------------------------            
//STEP13   EXEC SORT,COND=(0,NE),CYL=20                                         
//SORTIN   DD DSN=BP13.F180.DBSS.STAMP,DISP=SHR                                 
//SORTOUT  DD DSN=&&F180STMP,DISP=(,PASS,DELETE),                               
//            UNIT=SYSDA,SPACE=(CYL,(20,5),RLSE),                               
//            DCB=(BLKSIZE=23400,LRECL=120,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD   *                                                               
     SORT FIELDS=(58,40,A),FORMAT=CH                                            
//*-----------------------------------------------------------------            
//* SUM THE GL TRAN RECORD TO GL SYSTEM                                         
//*-----------------------------------------------------------------            
//STEP14   EXEC PGM=BP13C109,COND=(0,NE)                                        
//BP13F180 DD DSN=&&F180STMP,DISP=(OLD,PASS)                                    
//AG20F900 DD DSN=BP13.F190.AASUM.STAMP,DISP=OLD                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//*-----------------------------------------------------------------            
//* BACKUP LAST MTH GL FILE ON DBSS TOP FEE                                     
//*-----------------------------------------------------------------            
//STEP15    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F190.AASUM.STAMP,DISP=SHR                               
//OUTPUT1   DD DSN=BP13.F190.AASUM.STAMPBK,DISP=OLD                             
//SYSIN     DD  *                                                               
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
//*-----------------------------------------------------------------            
//* BACKUP GL FILE ON DBSS TOP FEE                                              
//*-----------------------------------------------------------------            
//STEP16    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.F180.DBSS.STAMP,DISP=SHR                                
//OUTPUT1   DD DSN=BP13.F180.DBSS.STAMPBK,DISP=OLD                              
//INPUT2    DD DSN=BP13.F128.STPFEE.ACCUM,DISP=SHR                              
//OUTPUT2   DD DSN=BP13.F128.STPFEE.MONTH,DISP=OLD                              
//SYSIN     DD  *                                                               
      REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                    
      REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                    
//*-------------------------------------------------------------------*         
//* EMPTY DBSS TOP STAMP FEE FILE                                               
//*-------------------------------------------------------------------*         
//STEP17   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DUMMY                                                             
//OUTPUT1  DD DSN=BP13.F180.DBSS.STAMP,DISP=OLD                                 
//OUTPUT2  DD DSN=BP13.F128.STPFEE.ACCUM,DISP=OLD                               
//SYSIN    DD *                                                                 
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                  
        REPRO INFILE(INPUT1)  OUTFILE(OUTPUT2)                                  
//*                                                                             
//*---------------------------------------------------------------------        
//* PRINT GL RECONCILATION REPORT FOR DBSS STAMP FEE POSTING                    
//*---------------------------------------------------------------------        
//STEP18   EXEC SAS,COND=(0,NE),OPTIONS='MACRO',REGION=4096K                    
//WORK     DD  UNIT=SYSDA,SPACE=(CYL,(60,20))                                   
//BP13F180 DD DSN=BP13.F190.AASUM.STAMP,DISP=SHR                                
//SY02F001 DD DSN=SY02.F001.DATE,DISP=SHR                                       
//BP13L124 DD SYSOUT=2,OUTPUT=(*.PRT02.FORMID),DEST=IOM2                        
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S124),DISP=SHR                             
//*-----------------------------------------------------------------            
//* BACKUP                                                                      
//*-----------------------------------------------------------------            
//STEP19    EXEC PGM=IDCAMS,COND=(0,NE)                                         
//SYSPRINT  DD SYSOUT=*                                                         
//INPUT1    DD DSN=BP13.FC10.ACCUM,DISP=SHR                                     
//OUTPUT1   DD DSN=BP13.FC10.ACCUM.MTHBKUP(+1),                                 
//          DISP=(NEW,CATLG),                                                   
//          SPACE=(CYL,(10,5)),                                                 
//          DCB=(BP13.GDG,BLKSIZE=23200,LRECL=800,RECFM=FB)                     
//INPUT2    DD DSN=NULLFILE,DISP=SHR                                            
//OUTPUT2   DD DSN=BP13.FC10.ACCUM,DISP=OLD                                     
//SYSIN     DD  *                                                               
     REPRO INFILE(INPUT1) OUTFILE(OUTPUT1)                                      
     REPRO INFILE(INPUT2) OUTFILE(OUTPUT2)                                      
/*                                                                              
//*-----------------------------------------------------------------            
//* BACKUP MND FILE                                                             
//*--------------------------------------------------------------------------   
//STEP20  EXEC   PGM=IEBGENER,COND=(0,NE)                               00000060
//SYSPRINT DD  SYSOUT=*                                                 00000070
//SYSUT1   DD  DSN=BP13.F40F.MNDOUT,DISP=SHR                            00000080
//SYSUT2   DD  DSN=BP13.F40F.MNDOUT.BKUP(+1),                           00000110
//             DISP=(NEW,CATLG),                                        00000120
//             UNIT=DISK,                                               00000130
//             SPACE=(CYL,(10,10)),                                     00000140
//             RECFM=FB,LRECL=1000,                                     00000150
//             BLKSIZE=0                                                00000160
//SYSIN    DD  DUMMY                                                    00000170
//*--------------------------------------------------------------------------   
//* SORT BP13K40I BY REGN NO                                          * 00032000
//*-------------------------------------------------------------------* 00033000
//STEP21  EXEC SORT,COND=(0,NE)                                         00034000
//SORTIN   DD DSN=BP13.K40I.PROPOSED.REV,DISP=SHR                       00035002
//SORTOUT  DD DSN=&&BP13F40I,DISP=(NEW,PASS),                           00036000
//         UNIT=(SYSDA),SPACE=(CYL,(80,50),RLSE),                       00037000
//         DCB=(BLKSIZE=0,LRECL=100,RECFM=FB)                           00038000
//SYSIN    DD *                                                         00039000
   SORT FIELDS=(1,8,A),FORMAT=CH                                        00039100
   INCLUDE COND=(1,1,CH,NE,C' ')                                        00039200
//*                                                                     00039300
//*******************************************************************   00450004
//*           JCL TO RUN THE BATCH PROGRAM BP13C40W                     00460004
//*******************************************************************   00470004
//STEP22   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K       00480004
//BP13F40I   DD DSN=&&BP13F40I,DISP=(OLD,PASS)                          00490004
//BP13K40I   DD DSN=BP13.K40I.PROPOSED.REV,DISP=SHR                     00500004
//BP13K40C   DD DSN=BP13.K40C.SALEORD.RSV,DISP=SHR                      00510004
//BP13K410   DD DSN=BP13.K410.ACCUMSO,DISP=SHR                          00520004
//BP13K640   DD DSN=BP13.K640.CA.ACTION,DISP=SHR                        00530004
//BP13K800   DD DSN=BP13.K800.APPLN,DISP=SHR                            00540004
//BP13K820   DD DSN=BP13.K820.OCCUP,DISP=SHR                            00550004
//BP13K893   DD DSN=BP13.K893.APPLN.HISTORY,DISP=SHR                    00560004
//BP13K895   DD DSN=BP13.K895.OCCUP.HISTORY,DISP=SHR                    00561008
//BM06K100   DD DSN=BM06.K100.BLOCK,DISP=SHR                            00570004
//BM06K110   DD DSN=BM06.K110.FLATINV,DISP=SHR                          00580004
//BM06K130   DD DSN=BM06.K130.BLOCK.PIDB,DISP=SHR                       00590004
//BM06K510   DD DSN=BM06.K510.ESTCDE,DISP=SHR                           00600004
//BP27K800   DD DSN=BP27.K800.HLAPPLN,DISP=SHR                          00601007
//BP27K250   DD DSN=BP27.K250.HLACA,DISP=SHR                            00602008
//BP27K251   DD DSN=BP27.K250.HLACA.CA2ND,DISP=SHR                      00603008
//BP13F40F   DD DSN=BP13.F40F.MNDOUT,DISP=SHR                           00610005
//SYSOUT     DD SYSOUT=*                                                00620004
//SYSTSPRT   DD SYSOUT=*                                                00630004
//SYSPRINT   DD SYSOUT=*                                                00640004
//SYSDBG     DD SYSOUT=*                                                00650004
//SYSDBOUT   DD SYSOUT=*                                                00660004
//SYSTSIN    DD *                                                       00670004
  DSN SYSTEM(DSN)                                                       00680004
  RUN PROGRAM(BP13C40W) PLAN(BP13PCC) -                                 00690004
      LIB('BP13.BATCH.LOADCOB')                                         00700004
  END                                                                   00710004
/*                                                                      00720004
//*                                                                     00730004
