//BP13A720 JOB (BP13P),'BP13A720',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071                                                         
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//**********************************************************************        
//* FOR RESERVE LIST CASES                                                      
//* PREPARE FILE BP13F558/BP13F500 FOR HOUSEHOLD CHECK/10-YR CHECK              
//**********************************************************************        
//* BP130624 LSB 19990118- NEW JOB                                              
//* BP130652     19990827- EXPAND F500,520 RECL 300 TO 500                      
//* BP132293 SK  20030210- READ BP13K703 FOR BP13C705                           
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP01   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.F825.ACCMOCCP,DISP=SHR                                  
//SORTOUT  DD  DSN=&&BP13F820,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(150,15),RLSE),                            
//             DCB=(RECFM=FB,LRECL=400,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,17,A),FORMAT=CH                                                
  INCLUDE COND=(131,1,CH,EQ,C'Y')                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTPUT LESSEE-CHECK = 'Y'                                                   
//*---------------------------------------------------------------------        
//STEP02   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD  DSN=BP13.K700.RESERVE,DISP=SHR,                                  
//         AMP=('BUFND=23')                                                     
//SORTOUT  DD  DSN=&&BP13F700,DISP=(NEW,PASS),                                  
//             UNIT=SYSDA,SPACE=(CYL,(240,15),RLSE),                            
//             DCB=(RECFM=FB,LRECL=500,BLKSIZE=0)                               
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
/*                                                                              
//*---------------------------------------------------------------------        
//* OUTREC BP13F558 FROM BP13K820 SOC OCCUPIER FILE TO DETERMINE HHTY           
//* INCLUDE LESSEE-CHECK = 'Y' CASE FROM SOC-OCCUP FILE                         
//* INCLUDE APPLN1, APPLN2, APPLN3, APPLN4, OCCUPIER TAG AS "Y"                 
//*---------------------------------------------------------------------        
//STEP03   EXEC  PGM=BP13C577,COND=(0,NE)                                       
//BP13F500 DD  DSN=&&BP13F700,DISP=(OLD,PASS)                                   
//BP13F820 DD  DSN=&&BP13F820,DISP=(OLD,PASS)                                   
//BP13F558 DD  DSN=BP13.F558.UPGOCCP,DISP=OLD                                   
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSOUT   DD  SYSOUT=*                                                         
//*                                                                             
//*---------------------------------------------------------------------        
//* COMPUTE DATE-BALLOT                                                         
//*---------------------------------------------------------------------        
//STEP04  EXEC PGM=BP13C705                                                     
//BP13F500  DD DSN=&&BP13F700,DISP=(OLD,PASS)                                   
//BP13F520  DD DSN=BP13.F500.SEQUENCE,DISP=OLD                                  
//BP13K703  DD DSN=BP13.K703.SOCDATE,DISP=SHR                                   
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*---------------------------------------------------------------------        
