//BP13Q901  JOB (BP13P),'BP13Q901',CLASS=I,MSGCLASS=N,                          
//    MSGLEVEL=(1,1),NOTIFY=CSD0071                                             
//JOBLIB DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                     
//******************************************************************            
//* FOR EC TOP AFTER 6 MONTHS, MATCH EC APPLICANTS WITH RDB                     
//* IF FOUND, PRINT REPORTS TO HAD                                              
//******************************************************************            
//* BP130816 LSB  000506  NEW JCL                                               
//* BP131046 LSB  011113  REPORT BP13S006, BP13S011, BP13C073                   
//* BP132699 GAN  050526  ENHANCE BP13C073 TO INCLUDE APPROVAL DATE             
//*                       AND EXPIRY DATE FROM BE04K600                         
//* BP132721 SSS  050713  CATER FOR ERMS                                        
//* BP135171 RJE  110214  TO CATER FOR DB2 UPGRADE                              
//* BP136892 LSB  031117  ADD OIC TO BP13L073                                   
//* BP138273 LSB  220420  DELETE HARDCOPY REPORT, S006, S011, S007              
//* BP138699 LSB  300721  SENT EMAIL INSTEAD OF EOS REPORT                      
//* BP139213 MRR5 300721  CHANGES TO REC LENGTH OF P13L073C AND P13L073D        
//*=================================================================            
//*-----------------------------------------------------------------            
//* SORT WITH DTE-TOP                                                           
//*-----------------------------------------------------------------            
//STEP01   EXEC SORT,CYL=30,COND=(0,NE)                                         
//SORTIN   DD DSN=BP13.K940.APLCTN.BO,DISP=SHR,                                 
//            AMP=('BUFND=23')                                                  
//SORTOUT  DD DSN=&&BP13F940,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,20),RLSE),                              
//            DCB=(BLKSIZE=0,LRECL=400,RECFM=FB)                                
//SYSIN    DD  *                                                                
  SORT FIELDS=(123,8,A),FORMAT=CH                                               
  INCLUDE COND=(17,8,CH,GT,C'00000000')                                         
//*-----------------------------------------------------------------            
//* OUTPUT REC IF EC TOP MORE THAN 6 MONTHS FOR RDB MACTHING                    
//*-----------------------------------------------------------------            
//STEP02   EXEC  PGM=BP13C072,COND=(0,NE)                                       
//BP13F940 DD DSN=&&BP13F940,DISP=(OLD,PASS)                                    
//BP13K943 DD DSN=BP13.K943.OCPR.BO,DISP=SHR,                                   
//            AMP=('BUFND=23')                                                  
//BP13F716 DD DSN=&&BP13F716,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,60),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//BP13L072 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY NRIC ORDER                                                          
//*-----------------------------------------------------------------            
//STEP03   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=&&BP13F716,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716NRIC,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(180,60),RLSE),                             
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(9,9,A),FORMAT=CH                                                 
//*-----------------------------------------------------------------            
//* EXTRACT RECORDS FROM RDB DATABASE BASED ON NRIC                             
//* DATA ARE SCH-ACC-NO/MOVE-IN-DATE/MOVE-OUT-DATE/DATE-PURCHASED               
//*-----------------------------------------------------------------            
//STEP04   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716NRIC,DISP=(OLD,PASS)                                    
//AB03K030 DD DSN=AB03.K030.SALEMAST,DISP=SHR,                                  
//            AMP=('BUFND=4','BUFNI=8')                                         
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//            AMP=('BUFND=4','BUFNI=8')                                         
//P13F716A DD DSN=&&F716RDB,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//BP13L749 DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q749) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*-----------------------------------------------------------------            
//* SORT BY SCH ACC NUMBER                                                      
//*-----------------------------------------------------------------            
//STEP05   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=&&F716RDB,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F716SCH,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(51,9,A),FORMAT=CH                                                
  INCLUDE COND=(51,9,CH,GE,C'700000000')                                        
//*-----------------------------------------------------------------            
//* RETRIEVE PIDB ADDRESS BASED ON RDB-SCH-ACC                                  
//*-----------------------------------------------------------------            
//STEP06   EXEC  PGM=IKJEFT01,COND=(0,NE)                                       
//BP13F716 DD DSN=&&F716SCH,DISP=(OLD,PASS)                                     
//P13F716A DD DSN=BP13.F716.M900Q748,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C074) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
/*                                                                              
//*-----------------------------------------------------------------            
//* REMOVE DUPLICATE                                                            
//*-----------------------------------------------------------------            
//STEP07   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=BP13.F716.M900Q748,DISP=OLD                                   
//SORTOUT  DD DSN=&&F716DUP,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(1,350,A),FORMAT=CH                                               
  SUM FIELDS=NONE                                                               
//*---------------------------------------------------------------------        
//STEP08   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716DUP,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F716IC1,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD  *                                                                
      SORT FIELDS=(9,9,A),FORMAT=CH                                             
//*---------------------------------------------------------------------        
//* EXTRACT MOBILITY RECORDS TO DETERMINE MOVE IN DATE                          
//*---------------------------------------------------------------------        
//STEP09   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE)                            
//BP13F716 DD DSN=&&F716IC1,DISP=(OLD,PASS)                                     
//BP13K060 DD DSN=BP13.K060.CODETAB,DISP=SHR,                                   
//         AMP=('BUFND=4','BUFNI=8')                                            
//P13F716A DD DSN=BP13.F716.Q900Q747,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSABOUT DD SYSOUT=*                                                          
//SYSTSIN DD *                                                                  
 DSN SYSTEM(DSN)                                                                
 RUN  PROGRAM(BP13Q747) PLAN(BP13PCC) -                                         
      LIB('BP13.BATCH.LOADCOB')                                                 
 END                                                                            
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT RDB REC BY REGN/NRIC/DTE-MOVE-IN (DESCENDING ORDER)                    
//*--------------------------------------------------------------------         
//STEP10 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=&&F716IC1,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F716M900,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,17,A,51,11,A,115,8,D),FORMAT=CH                               
/*                                                                              
//*--------------------------------------------------------------------         
//* SORT MOBILITY REC BY REGN/NRIC/DTE-MOVE-IN (DESCENDING ORDER)               
//*--------------------------------------------------------------------         
//STEP11 EXEC SORT,COND=(0,NE)                                                  
//SORTIN   DD DSN=BP13.F716.Q900Q747,DISP=SHR                                   
//SORTOUT  DD DSN=&&F716Q900,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN     DD  *                                                               
   SORT FIELDS=(1,17,A,51,11,A,115,8,D),FORMAT=CH                               
/*                                                                              
//*--------------------------------------------------------------------         
//* IF RDB REC FOUND TO HAVE MOVE-OUT-DATE, THEN DROP THE REC                   
//*--------------------------------------------------------------------         
//STEP12   EXEC PGM=BP13C937,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716M900,DISP=(OLD,PASS)                                    
//P13F716A DD DSN=&&F716Q900,DISP=(OLD,PASS)                                    
//BP13K940 DD DSN=BP13.K940.APLCTN.BO,DISP=SHR,                                 
//            AMP=('BUFND=23')                                                  
//BP13K943 DD DSN=BP13.K943.OCPR.BO,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13F716B DD DSN=&&F716EXIC,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*--------------------------------------------------------------------         
//* SORT BY REGN/NRIC ORDER                                                     
//*--------------------------------------------------------------------         
//STEP13   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=&&F716EXIC,DISP=(OLD,PASS)                                    
//SORTOUT  DD DSN=&&F716EX,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN     DD  *                                                               
   SUM FIELDS=NONE                                                              
   SORT FIELDS=(1,8,A,9,9,A),FORMAT=CH                                          
/*                                                                              
//*--------------------------------------------------------------------         
//* SEPARATE EC-OWNER OR EC-OCCUP                                               
//*--------------------------------------------------------------------         
//STEP15   EXEC PGM=BP13C936,COND=(0,NE)                                        
//BP13F716 DD DSN=&&F716EX,DISP=(OLD,PASS)                                      
//P13F716A DD DSN=&&F716OWN,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//P13F716B DD DSN=&&F716OCC,DISP=(,PASS),                                       
//            UNIT=SYSDA,SPACE=(CYL,(50,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSOUT   DD SYSOUT=*                                                          
//SYSTSPRT DD SYSOUT=*                                                          
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSTSIN  DD *                                                                 
//*-----------------------------------------------------------------            
//* SORT BY BO FOR ORDER-OWNER                                                  
//*-----------------------------------------------------------------            
//STEP016  EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=&&F716OWN,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F716BO,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(297,2,A,296,1,A,51,11,A),FORMAT=CH                               
  INCLUDE COND=(78,4,CH,GE,C'0006')                                             
//*-----------------------------------------------------------------            
//* PRINT REPORT ON EC TOP AFTER 6 MONTH, TO CHECK ON HDB LESSEE                
//* STILL FOUND IN RBD II FOR EC-OWNER                                          
//*-----------------------------------------------------------------            
//STEP17   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716BO,DISP=(OLD,PASS)                                      
//BP18K130 DD DSN=BP18.K130.ECUNIT,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP18K131 DD DSN=BP18.K130.ECUNIT.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP18K140 DD DSN=BP18.K140.BLOCK,DISP=SHR                                      
//BP18K141 DD DSN=BP18.K140.BLOCK.PATH1,DISP=SHR                                
//BP13K943 DD DSN=BP13.K943.OCPR.BO,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K940 DD DSN=BP13.K940.APLCTN.BO,DISP=SHR,                                 
//            AMP=('BUFND=8','BUFNI=4')                                         
//BE04K600 DD DSN=BE04.K600.TT,DISP=SHR,                                        
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13L073A DD DSN=&&P13L073A,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,2),RLSE),                                
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//P13L073B DD DSN=&&P13L073B,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,2),RLSE),                                
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//P13L073C DD DSN=&&P13L073C,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(8,2),RLSE),                                
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//P13L073D DD DSN=&&P13L073D,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(8,2),RLSE),                                
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRIN  DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C073) -                                                       
      PLAN(BP13PCC) -                                                           
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*-----------------------------------------------------------------            
//* SORT BY BO ORDER- OCCUPIER                                                  
//*-----------------------------------------------------------------            
//STEP19   EXEC PGM=SORT,COND=(0,NE)                                            
//SYSOUT   DD SYSOUT=*                                                          
//SORTIN   DD DSN=&&F716OCC,DISP=(OLD,PASS)                                     
//SORTOUT  DD DSN=&&F716OC,DISP=(,PASS),                                        
//            UNIT=SYSDA,SPACE=(CYL,(80,30),RLSE),                              
//            DCB=(BLKSIZE=27650,LRECL=350,RECFM=FB)                            
//SYSIN    DD  *                                                                
  SORT FIELDS=(297,2,A,296,1,A,51,11,A),FORMAT=CH                               
  INCLUDE COND=(78,4,CH,GE,C'0006')                                             
//*-----------------------------------------------------------------            
//* PRINT REPORT ON EC TOP AFTER 6 MONTH, TO CHECK ON HDB LESSEE                
//* STILL FOUND IN RBD II FOR EC-OCCUP                                          
//*-----------------------------------------------------------------            
//STEP20   EXEC PGM=IKJEFT01,DYNAMNBR=20,COND=(0,NE),REGION=4096K               
//BP13F716 DD DSN=&&F716OC,DISP=(OLD,PASS)                                      
//BP18K130 DD DSN=BP18.K130.ECUNIT,DISP=SHR,                                    
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP18K131 DD DSN=BP18.K130.ECUNIT.PATH1,DISP=SHR,                              
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP18K140 DD DSN=BP18.K140.BLOCK,DISP=SHR                                      
//BP18K141 DD DSN=BP18.K140.BLOCK.PATH1,DISP=SHR                                
//BP13K943 DD DSN=BP13.K943.OCPR.BO,DISP=SHR,                                   
//            AMP=('BUFND=8','BUFNI=4')                                         
//BP13K940 DD DSN=BP13.K940.APLCTN.BO,DISP=SHR,                                 
//            AMP=('BUFND=8','BUFNI=4')                                         
//BE04K600 DD DSN=BE04.K600.TT,DISP=SHR,                                        
//            AMP=('BUFND=8','BUFNI=4')                                         
//P13L073A DD DSN=&&P13L07AA,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,2),RLSE),                                
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//P13L073B DD DSN=&&P13L07BB,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,SPACE=(CYL,(8,2),RLSE),                                
//            DCB=(RECFM=FA,LRECL=133,BLKSIZE=133)                              
//P13L073C DD DSN=&&P13L07CC,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(8,2),RLSE),                                
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//P13L073D DD DSN=&&P13L07DD,DISP=(,PASS),                                      
//            UNIT=SYSDA,SPACE=(CYL,(8,2),RLSE),                                
//            DCB=(RECFM=FB,LRECL=300,BLKSIZE=0)                                
//SYSOUT   DD  SYSOUT=*                                                         
//SYSPRIN  DD  SYSOUT=*                                                         
//SYSABOUT DD  SYSOUT=*                                                         
//SYSTSPRT DD  SYSOUT=*                                                         
//SYSDBG   DD  SYSOUT=*                                                         
//SYSDBOUT DD  SYSOUT=*                                                         
//SYSTSIN  DD  *                                                                
  DSN SYSTEM(DSN)                                                               
  RUN PROGRAM(BP13C073) -                                                       
      PLAN(BP13PCC) -                                                           
      LIB('BP13.BATCH.LOADCOB')                                                 
  END                                                                           
//*--------------------------------------------------------------------         
//* BACKUP TO DATASET                                                           
//*--------------------------------------------------------------------         
//STEP21   EXEC PGM=IDCAMS                                                      
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=&&P13L073A,DISP=(OLD,PASS)                                    
//         DD DSN=&&P13L07AA,DISP=(OLD,PASS)                                    
//OUTPUT1  DD DSN=BP13.L073A.REPORT,DISP=OLD                                    
//*                                                                             
//INPUT2   DD DSN=&&P13L073B,DISP=(OLD,PASS)                                    
//         DD DSN=&&P13L07BB,DISP=(OLD,PASS)                                    
//OUTPUT2  DD DSN=BP13.L073B.REPORT,DISP=OLD                                    
//*                                                                             
//INPUT3   DD DSN=&&P13L073C,DISP=(OLD,PASS)                                    
//         DD DSN=&&P13L07CC,DISP=(OLD,PASS)                                    
//OUTPUT3  DD DSN=BP13.L073A.DETAIL,DISP=OLD                                    
//*                                                                             
//INPUT4   DD DSN=&&P13L073D,DISP=(OLD,PASS)                                    
//         DD DSN=&&P13L07DD,DISP=(OLD,PASS)                                    
//OUTPUT4  DD DSN=BP13.L073B.DETAIL,DISP=OLD                                    
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
   REPRO INFILE(INPUT4)  OUTFILE(OUTPUT4)                                       
//*-----------------------------------------------------------------            
//* SEND ALERT MAIL FOR P13L073A                                                
//*-----------------------------------------------------------------            
//STEP22A  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L073A,DISP=(OLD,PASS)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* SEND ALERT MAIL FOR P13L073B                                                
//*-----------------------------------------------------------------            
//STEP22B  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L073B,DISP=(OLD,PASS)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* SEND ALERT MAIL FOR P13L073C                                                
//*-----------------------------------------------------------------            
//STEP22C  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L073C,DISP=(OLD,PASS)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* SEND ALERT MAIL FOR P13L073D                                                
//*-----------------------------------------------------------------            
//STEP22D  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L073D,DISP=(OLD,PASS)                                    
//*                                                                             
//*-----------------------------------------------------------------            
//* SEND ALERT MAIL FOR P13L073AA                                               
//*-----------------------------------------------------------------            
//STEP23A  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L07AA,DISP=(OLD,PASS)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* SEND ALERT MAIL FOR P13L073BB                                               
//*-----------------------------------------------------------------            
//STEP23B  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L07BB,DISP=(OLD,PASS)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* SEND ALERT MAIL FOR P13L073CC                                               
//*-----------------------------------------------------------------            
//STEP23C  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L07CC,DISP=(OLD,PASS)                                    
//*                                                                             
//*-------------------------------------------------------------------*         
//* SEND ALERT MAIL FOR P13L073DD                                               
//*-----------------------------------------------------------------            
//STEP23D  EXEC SENDMAIL,COND=(4,LT)                                            
//INPUT    DD DSN=&&P13L07DD,DISP=(OLD,PASS)                                    
//*                                                                             
