//BP13APRO JOB (BP13P),'BP13APRO',CLASS=I,MSGCLASS=N,MSGLEVEL=(1,1),            
//       NOTIFY=CSD0071,TYPRUN=HOLD                                             
//JOBLIB   DD DSN=BP13.BATCH.LOADCOB,DISP=SHR                                   
//******************************************************************            
//*    --- MATURE NEW TOWN ----                                    *            
//*    PIGEONHOLING OF PRIORITY REQUEST - MTF/TCP/REN/RH           *            
//*                                                                *            
//*    NOT THE DIFFERENCE                                          *            
//*    - TENDER PROGRAM ONLY HAVE NEW FLAT SUPPLY                  *            
//*    - SORT OUT ONLY PRIORITY CASES FOR PIGEONHOLING             *            
//*    - AFTER PIGEONHOLING, ALLOW UNSUCC PRIORITY CASES TO        *            
//*      JOIN PUBLIC SCHEME IN TRAN, NHH, COHORT PIGEONHOLING      *            
//*    - PRINT SUMMARY RESULT ON PRIORITY CASES                    *            
//*                                                                *            
//*================================================================*            
//* CHG REF  BY  ON      DESCRIPTION                                            
//* -------- --- ------  -----------                                            
//* BP131064 CKK 011220  NEW JCL. TO PIGEONHOLE PRIORITY                        
//* BP132596 PGS 17092004 TO CHANGE ROOM-TYPE TO 3,4,5 INSTEAD 4,5,E            
//* BP133292 IL5 06032008 ADD BP13C525                                          
//* BP133913 IL5 25052010 REMOVE UNUSED REPORTS                                 
//* BP134413 IL5 13122011 BACKUP BP13K030                                       
//* BP134483 IL5 12042012 TO KEEP CASES SHORTLISTED UNDER PRIORITY              
//* BP134782 IL5 13022013 ADD PROGRAM BP13S569                                  
//* BP134861 EAA1 30042013 EXPAND BP13K010 TO 600                               
//* BP135392 SMR2 19062014 CATER FOR 3P FLAT TYPE                               
//* BP135708 SMR2 31032015 CHANGE CLASS=2 TO CLASS=J                            
//* BP136055 IL5  17122015 CATER FOR 2F FLAT TYPE                               
//* BP136107 SMR2 17022016 ACCEPT PARAMETER FROM JCL IN BP13C525                
//* BP138301 AM25 14052020 HARDCOPY REPORTS CONVERSION                          
//******************************************************************            
//* STEP    DESCRIPTION                                                         
//* ----    -----------                                                         
//* 00-01   LASER PRINTER JCL                                                   
//* 02 - 03 = BACKUP TENDER AND BALLOT FILE                                     
//* 04      = SORTING OUT REQUESTS FOR SEPARATE ROUND OF                        
//*                PIGEONHOLING, OUTPUT PRIORITY CASES ONLY                     
//* 05 - 06 = PRINT FLAT SUPPLY REPORT BF PIGEONHOLING                          
//* 07 - 08 = PROCESS PIGEONHOLING(BP13U534 PRIORITY ONLY)                      
//* 09 - 10 = PRINT FLAT SYPPLY REPORT AF PIGEONHOLING                          
//* 11      = MATCH RELEVANT REQUEST TO GET SUCC & UNSUCC                       
//*                BALLOT RESULT FOR PRINT REPORT                               
//* 12      = PRINT SUCC/UNSUCC REQUEST REPOR BP13L522                          
//* 13      = BACKUP TENDER FILE                                                
//*                                                                             
//******************************************************************            
//*      VERIFY FILES BEFORE JOB RUN >>>> FOR MCPS                              
//*-----------------------------------------------------------------            
//STEP0A   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=OLD                                   
//SYSPRINT DD SYSOUT=*                                                          
//SYSIN    DD *                                                                 
          VFY FILE(INPUT1)                                                      
          VFY FILE(INPUT2)                                                      
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP01   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER.PRIO,DISP=OLD                                
//INPUT2   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//OUTPUT2  DD DSN=BP13.F740.MATUREBA.CC4,DISP=OLD                               
//INPUT3   DD DSN=BP13.K030.BALFLAT,DISP=SHR                                    
//OUTPUT3  DD DSN=BP13.F030.BALFLAT.PRIO,DISP=OLD                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
   REPRO INFILE(INPUT2)  OUTFILE(OUTPUT2)                                       
   REPRO INFILE(INPUT3)  OUTFILE(OUTPUT3)                                       
//*---------------------------------------------------------------------        
//* SORT OUT THE PRIORITY REQUEST BY RANDOM NO                                  
//* F740.MATURERQ.PRIO CREATED IN BP13ACC4                                      
//*---------------------------------------------------------------------        
//STEP02  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.F740.MATUREBA.PRIO,DISP=SHR                               
//SORTOUT DD DSN=&&F740PRIO,DISP=(NEW,PASS),                                    
//        UNIT=SYSDA,                                                           
//        DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                               
//        SPACE=(CYL,(80,5),RLSE)                                               
//SYSIN   DD  *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
//*---------------------------------------------------------------------        
//* TO PROCESS THE PIGEON-HOLDING FOR PRIORITY CASES, THE PROGRAM WILL          
//* ONLY ALLOCATE THE PRIORITY SUPPLY QUOTA FOR ALL SCHEME                      
//*---------------------------------------------------------------------        
//STEP03   EXEC PGM=BP13U534,COND=(0,NE)                                        
//STEPLIB  DD DSN=BP13.BATCH.LOADCOB.BALLOT,DISP=SHR                            
//BP13K010 DD DSN=BP13.K010.TENDER,DISP=OLD                                     
//BP13F520 DD DSN=&&F740PRIO,DISP=(OLD,PASS)                                    
//BP13K520 DD DSN=BP13.K740.MATUREBA,DISP=OLD,                                  
//            AMP=('BUFND=23')                                                  
//BP13F525 DD DSN=BP13.F525.APPL,DISP=OLD                                       
//BP13L534 DD SYSOUT=8,DEST=IOM8                                                
//P13L534A DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3,4,5 FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP04   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFN,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3 ',OR,                                            
       4,2,CH,EQ,C'4 ',OR,4,2,CH,EQ,C'4P',OR,                                   
       4,2,CH,EQ,C'5 ',OR,4,2,CH,EQ,C'5P')                                      
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP05   EXEC PGM=BP13C524,COND=(0,NE)                                        
//BP13F010 DD DSN=&&K010AFN,DISP=(OLD,PASS)                                     
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L524 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 1,2,E FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                
//*---------------------------------------------------------------------        
//STEP06   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//SORTOUT  DD DSN=&&K010AFR,DISP=(,PASS),                                       
//         UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                               
//         DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                   
//SYSIN    DD  *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'1A',OR,                                            
       4,2,CH,EQ,C'2A',OR,                                                      
       4,2,CH,EQ,C'2F',OR,                                                      
       4,2,CH,EQ,C'1 ',OR,                                                      
       4,2,CH,EQ,C'2 ',OR,                                                      
       4,2,CH,EQ,C'SP',OR,                                                      
       4,2,CH,EQ,C'E ')                                                         
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP07   EXEC PGM=BP13C524,COND=(0,NE)                                        
//BP13F010 DD DSN=&&K010AFR,DISP=(OLD,DELETE)                                   
//BP13F713 DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                                
//BP13L524 DD SYSOUT=8,DEST=IOM8                                                
//SYSPRINT DD SYSOUT=*                                                          
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
/*                                                                              
//*---------------------------------------------------------------------        
//* SORT OUT 3P FLATS TO PRINT FLAT SUPPLY AFTER PIGEONHOLING                   
//*---------------------------------------------------------------------        
//STEP07A   EXEC SORT,COND=(0,NE)                                               
//SORTIN    DD DSN=BP13.K010.TENDER,DISP=SHR                                    
//SORTOUT   DD DSN=&&K0103PRM,DISP=(,PASS),                                     
//          UNIT=(SYSDA,1),SPACE=(CYL,(5,3),RLSE),                              
//          DCB=(RECFM=FB,LRECL=600,BLKSIZE=0)                                  
//SYSIN     DD *                                                                
   SORT FIELDS=(1,5,A),FORMAT=CH                                                
   INCLUDE COND=(4,2,CH,EQ,C'3P')                                               
//*---------------------------------------------------------------------        
//* PRINT TENDER PROGRAM SUMMARY REPORT AFTER  PIGEON-HOLING                    
//*---------------------------------------------------------------------        
//STEP07B   EXEC PGM=BP13C524,COND=(0,NE)                                       
//BP13F010  DD DSN=&&K0103PRM,DISP=(OLD,DELETE)                                 
//BP13F713  DD DSN=BP13.F713.PIGEON.PRIO,DISP=SHR                               
//BP13L524  DD SYSOUT=8,DEST=IOM8                                               
//SYSPRINT  DD SYSOUT=*                                                         
//SYSDBG    DD SYSOUT=*                                                         
//SYSDBOUT  DD SYSOUT=*                                                         
//SYSOUT    DD SYSOUT=*                                                         
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP08   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.K010.TENDER,DISP=SHR                                     
//OUTPUT1  DD DSN=BP13.F010.TENDER(+1),DISP=(NEW,CATLG),                        
//         SPACE=(TRK,(5,1)),                                                   
//         DCB=(BP13.GDG,BLKSIZE=0,LRECL=600,RECFM=FB)                          
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//*  ACCUM BP13F525 FOR AUDIT REPORT                                            
//*-----------------------------------------------------------------            
//STEP09   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F525.APPL,DISP=SHR                                       
//OUTPUT1  DD DSN=BP13.F525.APPL.ACCUM,DISP=OLD                                 
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* SORT DAILY APPLICATIONS BY REFERENCE NUMBER                                 
//*------------------------------------------------------------------           
//STEP10   EXEC SORT,COND=(0,NE)                                                
//SORTIN   DD DSN=BP13.K740.MATUREBA,DISP=SHR                                   
//SORTOUT  DD DSN=&&F740C525,DISP=(NEW,PASS),                                   
//            UNIT=SYSDA,                                                       
//            DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500),                           
//            SPACE=(CYL,(70,10),RLSE)                                          
//SYSIN    DD *                                                                 
   SORT FIELDS=(187,3,A,211,1,A,123,8,A),FORMAT=CH                              
//*------------------------------------------------------------------           
//* PRINT APPLICATION FORM FOR COUNTER AND MAIL CASES                           
//* 3 DIFFERENT LETTERS DEPENDING ON MCPS OPTION                                
//*------------------------------------------------------------------           
//STEP11   EXEC PGM=BP13C525,COND=(0,NE)                                        
//BP13F730 DD DSN=&&F740C525,DISP=(OLD,DELETE)                                  
//P13L525A DD SYSOUT=*                                                          
//P13L525B DD SYSOUT=8,DEST=IOM8                                                
//P13L525C DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD *                                                                 
AL4                                                                             
//SYSDBG   DD SYSOUT=*                                                          
//SYSDBOUT DD SYSOUT=*                                                          
//SYSOUT   DD SYSOUT=*                                                          
//*---------------------------------------------------------------------        
//* SORT OUT SUCCESSFUL PRIORITY APPLICATIONS                                   
//*---------------------------------------------------------------------        
//STEP12  EXEC SORT,COND=(0,NE)                                                 
//SORTIN  DD DSN=BP13.K740.MATUREBA,DISP=SHR                                    
//SORTOUT DD DSN=BP13.F740.MATUREBA.PRIO.SUCC,DISP=OLD                          
//SYSIN   DD  *                                                                 
    SORT FIELDS=(1,28,A),FORMAT=CH                                              
    INCLUDE COND=(226,2,CH,NE,C'  ',AND,                                        
                  245,1,CH,EQ,C' ',AND,                                         
                  373,1,CH,EQ,C' ')                                             
//*-----------------------------------------------------------------            
//*  REPRO VSAM FILE TO SEQUENTIAL FILES                                        
//*-----------------------------------------------------------------            
//STEP13   EXEC PGM=IDCAMS,COND=(0,NE)                                          
//SYSPRINT DD SYSOUT=*                                                          
//INPUT1   DD DSN=BP13.F740.MATUREBA.PRIO.SUCC,DISP=SHR                         
//OUTPUT1  DD DSN=BP13.F740.MATUREBA.PRIO.SUCC.BKUP(+1),                        
//         DISP=(NEW,CATLG),                                                    
//         SPACE=(CYL,(1,1),RLSE),                                              
//         DCB=(RECFM=FB,LRECL=500,BLKSIZE=27500)                               
//SYSIN    DD  *                                                                
   REPRO INFILE(INPUT1)  OUTFILE(OUTPUT1)                                       
//*-----------------------------------------------------------------            
//* PRINT REPORT FOR PPS & NON-PPS APPLICANTS                                   
//*-----------------------------------------------------------------            
//STEP14   EXEC SAS,OPTIONS='MACRO DQUOTE,TEXT82',COND=(0,NE)                   
//WORK     DD UNIT=SYSDA,SPACE=(CYL,(40,10))                                    
//BP13F740 DD DSN=BP13.F740.MATUREBA.PRIO.SUCC,DISP=SHR                         
//BP13L569 DD SYSOUT=8,DEST=IOM8                                                
//SYSIN    DD DSN=BP13.BATCH.SRC(BP13S569),DISP=SHR                             
